{
  "title": "Trump is good at viral moments but Ukraine is waiting for real, war-ending diplomacy",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-04-30/ukraine-russia-donald-trump-diplomacy-vatican-meeting-zelenskyy/105228574",
  "original_language": "en",
  "cleaned_sentences": [
    "analysis Trump is good at viral moments but Ukraine is waiting for real, war-ending diplomacy Welcome to the wild and wacky ride of global diplomacy under America's 47th president, in which Donald Trump's opinions on the leaders of Ukraine and Russia can change in a heartbeat.",
    "Days after Volodymyr Zelenskyy and Trump created an image for the ages with their tete-a-tete at the Vatican, Vladimir Putin has grabbed the headlines back with the announcement of a three-day ceasefire in Ukraine.",
    "It's not just any three days Putin is proposing his troops, and the North Koreans he's now finally admitted are helping out, lay down their weapons.",
    "The ceasefire from May 8 would coincide with victory celebrations to mark the end of World War II.",
    "President Xi Jinping of China and India's Narendra Modi are among the guests invited to a military parade in Moscow.",
    "The announcement has been met with cutting scepticism from Ukraine.",
    "Zelenskyy called for a full and unconditional ceasefire for at least 30 days, beginning immediately.",
    "\"For some reason, everyone is supposed to wait for May 8 and only then have a ceasefire to ensure calm for Putin during the parade,\" he said.",
    "\"We value people's lives and not parades.\"",
    "A 30-hour ceasefire announced by Russia over Easter, and cautiously agreed to by Ukraine, did not hold.",
    "Both sides accused one another of violating it and Russia has previously rejected a US proposal for a 30-day ceasefire.",
    "This latest offer looks like an attempt by Putin to get back in Trump's good books after the Vatican meeting between Trump and Zelenskyy.",
    "That meeting was yet another viral moment involving Trump and a world leader, but Zelenskyy and Putin are not yet at the negotiating table and the people of Ukraine urgently need more than a promise of three days of peace.",
    "From 'dictator' to hardworking man It was a striking piece of choreography, more like a scene in a minimalist play than a dialogue between two world leaders.",
    "The US and Ukrainian presidents sat directly across from one another in St Peter's Basilica on hastily procured chairs, their knees almost knocking.",
    "In the ornate surroundings on the sidelines of Pope Francis's funeral, Trump and Zelenskyy hunched towards one another, apparently locked in intense discussion.",
    "The imagery was all the more remarkable because it was their first encounter since the infamous Oval Office clash in late February, when the Ukrainian leader was dressed down by Trump and his Vice-President JD Vance.",
    "The US president, whose views can flip-flop depending on whom he last spoke to, emerged with nothing but praise for his Ukrainian counterpart, a man he had previously labelled a \"dictator\".",
    "Trump said it was \"a beautiful meeting\" and that Zelenskyy was \"working hard\" and \"wants to do something good for his country\".",
    "As for the Oval Office blow-up, Trump dismissed that as \"a little dispute\".",
    "The US president also took the opportunity to reprimand Putin, suggesting the Russian leader might not actually want the war to stop and could be \"just tapping me along\".",
    "It was the second startling public rebuke of the Russian president in a matter of days.",
    "\"Vladimir, STOP!,\" Mr Trump posted late last week after a Russian missile attack on Ukraine's capital, which killed at least 12 people.",
    "The Vatican rendezvous also got glowing reviews from the Ukrainian side, with Zelenskyy describing it as \"potentially historic\".",
    "But perhaps, the word doing the most work there is \"potentially\".",
    "A Crimean roadblock Despite his recent tough words for Vladimir Putin, the fact remains that Donald Trump has generally appeared to favour the Russian leader and has often echoed his talking points on the war.",
    "What's known of the deal the US is proposing, being negotiated by the ubiquitous envoy Steve Witkoff, suggests it would be deeply unpalatable to Ukraine.",
    "A major sticking point is the issue of Crimea, which Russia illegally annexed in 2014.",
    "The reported deal includes Washington accepting Russia's annexation of Crimea as well as recognising as Russian territory other areas in the east of Ukraine that have been occupied since the 2022 invasion began.",
    "Zelenskyy has signalled abandoning a claim to the southern peninsula is a red line, arguing that formally giving up the territory would breach the Ukrainian constitution.",
    "Yet, on his return home from the Vatican, Trump replied, \"I think so,\" when asked if he thought the Ukrainian president was ready to cede control of Crimea.",
    "That seems like a big assumption.",
    "Under the reported plan, Ukraine could continue to push for membership of the European Union but would have to relinquish its aspirations of becoming a NATO member.",
    "In return, Kyiv would \"be fully reconstructed and compensated financially\" and receive \"robust\" security guarantees, though it's unclear who would provide those and what form they would take.",
    "German Defence Minister Boris Pistorious has warned Ukraine not to agree to any territorial concessions included in the US proposals, saying it would be \"akin to capitulation\".",
    "It's hard to square Trump's apparent optimism with those obvious roadblocks.",
    "An impatient broker In recent days, the most tentative of signs have emerged that Ukraine and Russia could be willing to negotiate.",
    "\"We need to sort this out,\" Vladimir Putin told reporters last week.",
    "\"Maybe even bilaterally.\"",
    "In a BBC interview, Zelenskyy also suggested he'd be open to negotiations with a major caveat.",
    "\"A full and unconditional ceasefire opens up the possibility to discuss everything,\" the Ukrainian leader said.",
    "It's hard to know if the talk of talks represents a glimmer of hope or is just more tactical posturing.",
    "If at some point in the short to medium term Ukraine and Russia were to engage in high-level talks, that in itself would be a major achievement.",
    "Trump will take credit for any such development, even if he doesn't manage to stick with it that long.",
    "The US administration is obviously impatient, and this moment presents a test for the leader who famously claimed he'd end Russia's war in a day.",
    "Does he have the very real diplomacy — often the kind done behind closed doors — needed to broker a deal to end Russia's war in Ukraine, or is it all for show?",
    "He is very good at making viral moments on the global stage.",
    "The Zelenskyy meeting in the Oval Office and now the Vatican are the latest, but the world has watched him run this strategy in the past.",
    "He stepped across the demarcation line and into the DMZ to meet North Korean leader Kim Jong Un in 2019.",
    "He met Putin in Helsinki the year before.",
    "He faced off with European leaders, including former German chancellor Angela Merkel, in moments captured in iconic images.",
    "The US administration is amping up the pressure for a deal and has now repeatedly threatened to walk away if one can't be agreed.",
    "\"It needs to happen soon,\" US Secretary of State Marco Rubio told NBC on Sunday.",
    "\"We cannot continue to dedicate time and resources to this effort if it's not going to come to fruition.\"",
    "The power of 'potentially' As they locked eyes in St Peter's Basilica, Trump and Zelenskyy may have realised they had more in common than either might care to admit.",
    "Both stood out in their sartorial choices.",
    "Trump opted for a blue suit, Zelenskyy for a black variation of the military-style fatigues he's favoured since the war began.",
    "Both masterful communicators, they appeared to instinctively lean into the drama of their encounter and talk up its significance afterwards.",
    "In time it may become clear that while 15 minutes on the fringes of a pope's funeral created a powerful image, it didn't move the needle in attempts to bring about a resolution to the three-year-long conflict.",
    "We may later recognise that when Volodymyr Zelenskyy hailed the meeting as \"potentially historic\" he chose those words very carefully."
  ],
  "topics": {
    "Conflict": 0.9623622894287109,
    "Politics": 0.952599287033081,
    "Military": 0.9402490258216858,
    "Crime": 0.9400230050086975,
    "Diplomacy": 0.9315574765205383,
    "Culture": 0.923357367515564,
    "Environment": 0.915608286857605,
    "Economy": 0.9136728644371033,
    "Education": 0.9103332757949829,
    "Energy": 0.9088462591171265,
    "Transport": 0.9056479930877686,
    "Health": 0.9021666049957275,
    "Technology": 0.8934201002120972,
    "Elections": 0.8746773600578308
  },
  "sentiment": {
    "positive": 0.467,
    "negative": 0.533,
    "neutral": 0.0
  }
}