{
  "title": "Russia and Ukraine agree major prisoner of war-swap in first direct peace talks since 2022",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-17/russia-and-ukraine-agree-exchange-1-000-prisoners/105304128",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine agree to major prisoner of war swap In short: The first direct peace talks between Russia and Ukraine in more than three years ended after less than two hours in Istanbul.",
    "Ukrainian Defence Minister Rustem Umerov said the two sides agreed to exchange 1,000 prisoners of war.",
    "Volodymyr Zelenskyy says Kyiv's top priority is \"a full, unconditional and honest ceasefire\" and that Ukraine regards Russia's demands as unacceptable.",
    "Russia and Ukraine have agreed to exchange 1,000 prisoners of war during the first direct peace talks between the two sides since 2022.",
    "Ukrainian Defence Minister Rustem Umerov, who led Kyiv's delegation at the talks, on Friday, local time, said the date for the exchange would not be made public.",
    "Turkish Foreign Minister Hakan Fidan, who chaired the meeting, said the two sides agreed in principle to meet again for negotiations aimed at reaching a ceasefire.",
    "Ukraine has said the next step should be a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin.",
    "After the talks concluded, Mr Zelenskyy confirmed on X that he had spoken to US President Donald Trump and Ukraine's European allies on the phone.",
    "He called for tougher sanctions on Russia should it reject a US-backed proposal for a 30-day ceasefire.",
    "\"Ukraine is ready to take the fastest possible steps to bring real peace, and it is important that the world holds a strong stance,\"he said.",
    "\"Our position — if the Russians reject a full and unconditional ceasefire and an end to killings, tough sanctions must follow.",
    "Pressure on Russia must be maintained until Russia is ready to end the war.\"",
    "Meanwhile, Russia said it was satisfied with the talks and was ready to keep talking.",
    "Vladimir Medinsky, the head of Russia's delegation, said the prisoner exchange was one of the largest such swaps since the beginning of the conflict.",
    "\"In general, we are satisfied with the result and are ready to continue contacts.",
    "In the coming days, there will be a massive thousand-for-thousand prisoner exchange,\" Mr Medinsky said.",
    "\"The Ukrainian side requested direct talks between the leaders of the states.",
    "We have taken note of this request,\"he added.",
    "\"We have agreed that each side will present its vision of a possible future ceasefire and spell it out in detail.",
    "After such a vision has been presented, we believe it would be appropriate, as also agreed, to continue our negotiations.\"",
    "Ukraine and its allies accuse Mr Putin of stalling, saying he is not serious about wanting peace.",
    "Russia said it wanted to end the war by diplomatic means and was ready to discuss a ceasefire.",
    "But it has raised a list of questions and concerns, saying Ukraine could use a pause to rest its forces, mobilise extra troops and acquire more Western weapons.",
    "Kyiv wants the West to impose tighter sanctions unless Moscow accepts a proposal from the White House for a 30-day ceasefire.",
    "Russia's demands were \"detached from reality and go far beyond anything that was previously discussed,\" a source in the Ukrainian delegation told Reuters.",
    "The source, speaking on condition of anonymity, said Moscow had issued ultimatums for Ukraine to withdraw from parts of its own territory in order to obtain a ceasefire \"and other non-starters and non-constructive conditions\".",
    "Mr Trump and US Secretary of State Marco Rubio have said further progress is unlikely to happen unless Mr Putin agrees to face-to-face talks with the US president.",
    "'Two paths' Both sides are under pressure from Mr Trump to end Europe's deadliest conflict since World War II.",
    "Mr Fidan said the two sides would also share in writing their conditions for a ceasefire.",
    "At the negotiations in Istanbul, delegates were seated opposite each other, with the Russians in suits and half of the Ukrainians wearing camouflage military fatigues.",
    "\"There are two paths ahead of us: One road will take us on a process that will lead to peace, while the other will lead to more destruction and death,\" Mr Fidan said.",
    "\"The sides will decide on their own, with their own will, which path they choose,\"Mr Fidan said.",
    "It was Mr Putin who proposed the direct talks in Türkiye, but he spurned a challenge from Mr Zelenskyy to meet him there in person, instead sending a team of mid-level officials.",
    "Ukraine responded by naming negotiators of similar rank.",
    "Mr Rubio had said on the eve of the meeting that no major breakthrough was likely, based on the level of the negotiating teams.",
    "Russia said on Friday it had captured another village in its slow, grinding advance in eastern Ukraine.",
    "Minutes before the start of the Istanbul meeting, Ukrainian media reported an air alert and explosions in the city of Dnipro.",
    "Russia said it viewed the talks as a continuation of the negotiations that took place in the early weeks of the war in 2022, also in Istanbul.",
    "However, the terms under discussion at the time, when Ukraine was still reeling from Russia's initial invasion, would have been deeply disadvantageous to Kyiv.",
    "They included a demand by Moscow for large cuts to the size of Ukraine's military.",
    "With Russian forces now in control of close to a fifth of Ukraine, Mr Putin has held fast to his longstanding demands for Kyiv to cede territory, abandon its NATO membership ambitions and become a neutral country.",
    "Ukraine rejects these terms as tantamount to capitulation and is seeking guarantees of its future security from world powers, especially America."
  ],
  "topics": {
    "Politics": 0.9443251490592957,
    "Conflict": 0.9318217039108276,
    "Energy": 0.9301999807357788,
    "Environment": 0.926938533782959,
    "Diplomacy": 0.9194091558456421,
    "Economy": 0.9167443513870239,
    "Education": 0.915045976638794,
    "Culture": 0.9068931937217712,
    "Technology": 0.9046431183815002,
    "Military": 0.8917492628097534,
    "Transport": 0.8902830481529236,
    "Health": 0.8331063985824585,
    "Elections": 0.7650889158248901,
    "Crime": 0.7416571974754333
  },
  "sentiment": {
    "positive": 0.429,
    "negative": 0.571,
    "neutral": 0.0
  }
}