{
  "title": "Putin, Zelenskyy and Trump aren't going, so will the Russia-Ukraine talks amount to anything?",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-16/ukraine-peace-talks-fizzle-out-in-istanbul/105299844",
  "original_language": "en",
  "cleaned_sentences": [
    "analysis Putin, Zelenskyy and Trump aren't going, so will the Russia-Ukraine talks amount to anything?",
    "As the call to prayer rang out across Istanbul at sundown on Thursday afternoon, the meeting many around the world were waiting for hadn't happened.",
    "However, after a lot of \"I'll go, if he goes\" and \"we won't go, if they won't go,\" there now appears to be some certainty about those who will and won't go to the Russia-Ukraine peace talks, now expected on Friday, local time.",
    "Neither Russian President Vladimir Putin nor his Ukrainian counterpart Volodymyr Zelenskyy will attend.",
    "Instead, they are sending ministers, diplomats, spies, and defence officials.",
    "The question now, is will these talks amount to anything?",
    "The fact they are due to happen at all is significant, because these will be the first direct discussions between Russia and Ukraine in more than three years.",
    "The only previous meeting was also held in Istanbul, just two months after Moscow sent its armies charging into Ukraine.",
    "Last time, Kyiv accused the Kremlin delegation of demanding its surrender instead of seeking to negotiate.",
    "This time, the man who helped lead those discussions for the Russian side will head up its team again — presidential aide, Vladimir Medinsky.",
    "He will be joined by a deputy foreign minister, the director of Russian military intelligence, and other government officials.",
    "Ukraine believes the delegation is not senior enough to deliver the desired result — an immediate and unconditional, 30-day ceasefire.",
    "Mr Medinsky has said his team is prepared to resume the 2022 negotiations and discuss possible compromises.",
    "\"Our official delegation has been appointed by the president's order, and it has all the necessary jurisdictions and powers to negotiate,\" Mr Medinsky said.",
    "A 'decorative' line-up When Mr Putin suggested these talks earlier this week after threats of fresh western sanctions, Mr Zelenskyy challenged him to meet in Istanbul face-to-face.",
    "However, Mr Putin said he wouldn't be going, and that left Mr Zelenskyy with a choice to make — go anyway, or try to match like with like.",
    "He went for the latter approach.",
    "Ukraine's delegation will be led by its defence minister, Rustem Umerov, and include the deputy heads of its intelligence services, the deputy chief of military staff, and the deputy foreign minister.",
    "Mr Umerov is best known for negotiating prisoner exchanges and, like Russia's Mr Medinsky, was part of the delegation in the failed 2022 talks.",
    "Mr Zelenskyy said Mr Putin's decision not to attend in person, but to send what he called a \"decorative\" line-up, showed the Russian leader was not serious about ending the war.",
    "The reality is Mr Putin doesn't care what his Ukrainian counterpart thinks.",
    "For two main reasons.",
    "One, he doesn't like to be dictated to by anyone, let alone a leader he believes he is defeating in a war.",
    "And two, he doesn't recognise Mr Zelenskyy as a president.",
    "And he therefore doesn't believe he is worthy of negotiating with.",
    "As we waited outside Istanbul's Dolmabahce Palace with the world's media ahead of the proposed peace talks, we spoke to Russia 24 TV anchor Konstantin Churikov.",
    "\"He's not a president,\" Mr Churikov said of Mr Zelenskyy during our interview.",
    "\"He is for a long, long time in power without any elections, so that's a problem.",
    "\"I do not have any idea how President [Putin] can officially meet, as a president, a person who is not a president.",
    "So, it's ridiculous for us.\"",
    "Mr Zelenskyy's first five-year term of office was due to come to an end in May 2024, but Ukraine has been under martial law since Russia's full-scale invasion began, which means elections are suspended.",
    "Russia doesn't accept this.",
    "Call for fresh sanctions If a 30-day unconditional ceasefire can't be agreed to during Friday's talks, Mr Zelenskyy has said the West must act.",
    "\"Russia does not feel that it needs to end the war, which means there is not enough political, economic and other pressure on the Russian Federation,\" he said.",
    "\"And so we ask, if there is no ceasefire, if there are no serious decisions, if there are no bilateral meetings, we ask for appropriate sanctions that will be a stimulus for faster ending of the war.\"",
    "On Tuesday, both French President Emmanuel Macron and new German Chancellor Friedrich Merz spoke of fresh sanctions on Russia in the coming days if Moscow failed to agree to a pause in the fighting.",
    "They mentioned financial services, as well as oil and gas, as possible targets.",
    "Other European nations, such as the United Kingdom and Poland, are also threatening financial penalties, but Russia knows the quickest way to securing sanctions relief will likely be through the United States.",
    "The Kremlin is keen to build a solid relationship with the Trump administration, and has been working hard to improve ties.",
    "Loading...Speaking aboard Air Force One on the final day of his Middle East visit on Thursday, US President Donald Trump said he doesn't believe there will be a ceasefire between Russia and Ukraine yet.",
    "\"Nothing's going to happen until Putin and I get together, OK?\"",
    "\"I don't believe anything's going to happen, whether you like it or not, until he and I get together.\"",
    "The Turkish government is hoping the meeting it hosts between the two sides will be a step towards easing the deep hostility.",
    "But even one step forward is a big ask when both sides have such deep distrust."
  ],
  "topics": {
    "Diplomacy": 0.8235644102096558,
    "Conflict": 0.8102738261222839,
    "Politics": 0.7058466076850891,
    "Economy": 0.6975916028022766,
    "Culture": 0.6307482719421387,
    "Energy": 0.6253829002380371,
    "Transport": 0.6180787086486816,
    "Environment": 0.5503711104393005,
    "Education": 0.5374414324760437,
    "Technology": 0.5364542007446289,
    "Military": 0.501383900642395,
    "Elections": 0.46589261293411255,
    "Health": 0.43995702266693115,
    "Crime": 0.40718236565589905
  },
  "sentiment": {
    "positive": 0.273,
    "negative": 0.727,
    "neutral": 0.0
  }
}