{
  "title": "Joe Biden likens Donald Trump's Ukraine war diplomacy to 'appeasement' of Russia",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-07/biden-accuses-trump-of-appeasing-russia/105266354",
  "original_language": "en",
  "cleaned_sentences": [
    "Joe Biden likens Donald Trump's Ukraine war diplomacy to 'appeasement' of Russia In short: Joe Biden has accused Donald Trump of \"appeasing\" Russia by pressuring Ukraine to cede territory as part of ceasefire negotiations.",
    "The former US president spoke to the BBC in a wide-ranging interview, his first since leaving office.",
    "He warned of the post-war world order backsliding amid America's deteriorating relationship with its global allies under Mr Trump.",
    "Former United States president Joe Biden warns that fragmentation between the US and Europe under Donald Trump's leadership threatens to \"change the modern history of the world\" for the worse, in his first interview since leaving the White House.",
    "Speaking to the BBC's Nick Robinson in his home state of Delaware, Mr Biden lamented the Trump administration's foreign policy, its treatment of American allies — particularly the European Union — and approach to the Ukraine war.",
    "\"It's a grave concern,\" he said of a future world without NATO, warning such a scenario would be exploited by anti-Western powers China and Russia.",
    "\"It would change the modern history of the world, if that occurs.",
    "\"We are not the essential nation, but we're the only nation in a position to have the capacity to bring people together to lead the world.\"",
    "In the absence of the security alliance, Mr Biden argued, there would be no counterforce to Russia's invasion of Ukraine.",
    "\"Do you think Putin would have stopped at Ukraine?",
    "Do you think Putin would have stopped?\"",
    "\"I just don't understand how they [the present US government] fail to understand that there's strength in alliances.",
    "The cost there, it saves us money overall.\"",
    "Mr Biden's interview coincides with commemorations of the 80th anniversary of the end of World War II, known as VE Day, in Europe this week.",
    "He expressed concern about waning confidence in the \"certainty of America\" to deal with the world's challenges, saying the US's allies would soon \"begin to doubt whether we're going to stay where we've always been in the last 80 years\".",
    "\"European leaders and European countries, they're wondering, 'Well, what do I do now?",
    "What's the best route for me to take?",
    "Can I rely on the United States?",
    "Are they going to be there?'\"",
    "'Appeasing' Russia On Mr Trump's handling of Ukraine peace talks and his efforts to make Kyiv cede territory to Russia, Mr Biden said it amounted to \"modern-day appeasement\".",
    "\"[Vladimir] Putin can't stand the fact that the Russian dictatorship that he runs, that the Soviet Union, has collapsed.",
    "And anybody [who] thinks he's going to stop is just foolish,\" he said.",
    "\"I just don't understand how people think that if we allow a dictator, a thug, to decide he's going to take significant portions of land that aren't his, that that's going to satisfy him.\"",
    "As part of ceasefire negotiations, Moscow has repeatedly made demands for Kyiv to give up its claim to the Ukrainian territories Russia controls and officially recognise them as Russian.",
    "Crimea, the peninsula that Russia illegally annexed from Ukraine in 2014, has been a major sticking point, with the US proposing a peace framework that would require major territorial concessions from Ukraine and allow \"de jure\" American recognition of Russian control in Crimea.",
    "Ukraine has refused to recognise its occupied territories as Russian.",
    "Since Mr Trump and Mr Putin's phone call on February 12, analysis shows the US president's public comments have appeared to echo specific Russian talking points on the war.",
    "Asked if his own government's support for Ukraine's war effort had fallen short, Mr Biden said: \"We gave them everything they needed to provide for their independence and we were prepared to respond more aggressively if Putin moved again.\"",
    "Mr Biden also rebuked the televised meeting between Mr Trump and Ukrainian President Volodymyr Zelenskyy at the Oval Office in February that devolved into an explosive verbal spat.",
    "\"I found it beneath America, the way that took place,\" he said, while also taking aim at Mr Trump's desires to annex Greenland, Canada and the Panama Canal.",
    "\"What the hell is going on here?",
    "What president ever talks like that?",
    "That's not who we are.",
    "We're about freedom, democracy, opportunity.",
    "Not about confiscation.\"",
    "Mr Biden's interview comes just over 100 days into Mr Trump's second presidency, which has been marked by an extraordinary flurry of events, most notably his sweeping imposition of trade tariffs."
  ],
  "topics": {
    "Conflict": 0.9491966962814331,
    "Crime": 0.932066798210144,
    "Diplomacy": 0.9243353009223938,
    "Politics": 0.913679301738739,
    "Economy": 0.8792603611946106,
    "Transport": 0.8766862750053406,
    "Culture": 0.865086555480957,
    "Health": 0.8323239088058472,
    "Elections": 0.7929983139038086,
    "Environment": 0.7790225744247437,
    "Energy": 0.6657872796058655,
    "Military": 0.6004393100738525,
    "Technology": 0.5987884402275085,
    "Education": 0.3925614655017853
  },
  "sentiment": {
    "positive": 0.278,
    "negative": 0.722,
    "neutral": 0.0
  }
}