{
  "title": "Territorial concessions will be central to any Ukraine peace deal, and to Russia’s long-term plan",
  "published_date": null,
  "url": "https://theconversation.com/territorial-concessions-will-be-central-to-any-ukraine-peace-deal-and-to-russias-long-term-plan-256347",
  "original_language": "en",
  "cleaned_sentences": [
    "If the Ukrainian president, Volodymyr Zelensky, and his Russian counterpart, Vladimir Putin, meet in Istanbul on May 15, territory – and who controls it – will be high on their agenda.",
    "Putin offered to start direct talks between Russia and Ukraine at a press conference on May 11.",
    "Donald Trump pushed Zelensky to accept this offer in a social media post, saying that “Ukraine should agree to this, IMMEDIATELY.” The Ukrainian president, still buoyed by a meeting with the British, French, German and Polish leaders that called for an unconditional 30-day ceasefire, agreed shortly afterwards.",
    "Russia has said it wants to focus on the Istanbul communique of March 2022 and a subsequent draft agreement that was negotiated, but never adopted, by the two sides in April 2022.",
    "Get your news from actual experts, straight to your inbox.",
    "Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.",
    "These 2022 negotiations focused on Ukraine becoming a permanently neutral state and on which nations would provide security guarantees for any deal.",
    "They also relegated discussions over Crimea to separate negotiations with a ten-to-15-year timeframe.",
    "Russia uses the phrase “the current situation on the ground” as thinly disguised code for territorial questions that have become more contentious over the past three years.",
    "This relates to Russian gains on the battlefield and the illegal annexation of four Ukrainian regions in September 2022 (in addition to Crimea, which Russia also illegally annexed in 2014).",
    "Russia’s position, as articulated recently by the country’s foreign minister, Sergey Lavrov, is that “the international recognition of Crimea, Sevastopol, the DPR, the LPR, the Kherson and Zaporozhye regions as part of Russia is … imperative”.",
    "This is clearly a non-starter for Ukraine, as repeatedly stated by Zelensky.",
    "There could, however, be some flexibility on accepting that some parts of sovereign Ukrainian territory are under temporary Russian control.",
    "This has been suggested by both Trump’s Ukraine envoy, Keith Kellogg, and Kyiv’s mayor, Vitali Klitschko.",
    "Black Sea’s strategic value The territories that Russia currently occupies, and claims, in Ukraine have varying strategic, economic and symbolic value for Moscow and Kyiv.",
    "The areas with the greatest strategic value include Crimea and the territories on the shores of the Azov Sea, which provide Russia with a land corridor to Crimea.",
    "The international recognition of Crimea as part of Russia, as apparently suggested under the terms of an agreement hashed out by Putin and Trump’s envoy Steve Witkoff, could expand the areas of the Black Sea that Russia can claim to legally control.",
    "This could then be used by the Kremlin as a launchpad for renewed attacks on Ukraine and to threaten Nato’s eastern maritime flank in Romania and Bulgaria.",
    "Any permanent recognition of Russia’s control of these territories is, therefore, unacceptable to Ukraine and its European partners.",
    "Read more: Russia-China ties on full display on Victory Day – but all is not as well as Putin is making out Donetsk and Luhansk are of lower strategic value, compared with Crimea and the Kherson and Zaporizhzhia regions.",
    "However, they do have economic value because of the substantial resources located there.",
    "These include some of the mineral and other resources that were the subject of a separate deal which the US and Ukraine concluded on April 30.",
    "They also include Europe’s largest nuclear power plant in Zaporizhzhia and a large labour force among their estimated population of between 4.5 million to 5.5 million people who will be critical to Ukraine’s post-war reconstruction.",
    "Beyond the strategic and economic value of the illegally occupied territories, the symbolism that both sides attach to their control is the most significant obstacle to any deal, given how irreconcilable Moscow’s and Kyiv’s positions are.",
    "For both sides, control of these territories, or loss thereof, is what defines victory or defeat in the war.",
    "Putin may be able to claim that some territorial gains in Ukraine since the start of the full-scale invasion in February 2022 are a victory for Russia.",
    "But even for him any compromise that would see Russia give up territory that it has conquered – often at exceptionally high cost – would be a risky gamble for the stability of his regime.",
    "Anything less than the complete restoration of the country’s territorial integrity in its 1991 borders would imply recognition of defeat in the war for Ukraine.",
    "This would critically threaten the stability of the Zelensky government, whose political programme rests on exactly the premise of a return to the 1991 borders.",
    "Long-term consequences As a result, the Ukrainian leadership has become hostage to its own information strategy, which has placed the “return of all territories” at the top of the criteria for victory.",
    "This is a goal widely shared among Ukrainians, according to a poll conducted by the Razumkov Center in March 2025.",
    "But it will be hard to achieve.",
    "Read more: US-Ukraine minerals deal looks better for Kyiv than expected – but Trump is an unpredictable partner Apart from the potential domestic fall-out from any territorial compromises that Ukraine may be forced to make, there is another reason why the territorial question has become so intractable.",
    "Beyond any strategic, economic and symbolic value that the occupied Ukrainian territories hold from the Kremlin’s perspective, control over territory has always been an instrument for Russia to pursue its broader geopolitical agenda of exercising influence over its neighbours – from Moldova, to Georgia, Armenia and Ukraine.",
    "It is also important to remember that Russia’s territorial claims in Ukraine have gradually expanded since 2014.",
    "Until September 2022, when it annexed the other four regions, Russia laid claim to Crimea only.",
    "There is no guarantee that any territorial concession from Kyiv now would put a permanent end to Moscow’s territorial expansionism.",
    "It is therefore worrying that Trump envoy Witkoff, in an interview with the Breitbart news website, reiterated the US view that the two sides need to find compromises on who controls which territories.",
    "Russia’s aggression against Ukraine was not a war over territory as such, but was part of Moscow’s agenda to restore the sphere of influence that it lost at the end of the cold war.",
    "This agenda is far from finished.",
    "The strategy of both Moscow and Washington to focus on territorial consequences may lead to a ceasefire.",
    "But it will not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorsteps."
  ],
  "topics": {
    "Politics": 0.9133349061012268,
    "Diplomacy": 0.9061208963394165,
    "Conflict": 0.9043318629264832,
    "Economy": 0.9010078310966492,
    "Military": 0.8766568303108215,
    "Transport": 0.8310382962226868,
    "Culture": 0.822721004486084,
    "Technology": 0.8044741153717041,
    "Energy": 0.8008785843849182,
    "Environment": 0.7950564622879028,
    "Elections": 0.7511575222015381,
    "Crime": 0.7124373316764832,
    "Education": 0.693709671497345,
    "Health": 0.6889675259590149
  },
  "sentiment": {
    "positive": 0.429,
    "negative": 0.571,
    "neutral": 0.0
  }
}