{
  "title": "Russia looks to frame war as an inevitable part of life on Victory Day",
  "published_date": null,
  "url": "https://theconversation.com/russia-looks-to-frame-war-as-an-inevitable-part-of-life-on-victory-day-255751",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia celebrates the 80th anniversary of the Soviet victory in the second world war on May 9.",
    "But while the cameras will focus on the assembled ranks of elderly war survivors watching the military parade in Red Square, Moscow, the focus of senior officials is on Russia’s children and young people.",
    "Patriotism in Vladimir Putin’s Russia is built on exaggerated respect for key moments in the country’s history.",
    "These moments have been chosen to create a specific story about Russia.",
    "This is a story about Russia’s military might, the ability of its citizens to endure almost unimaginable suffering for the motherland, and the inevitability of victory over its enemies.",
    "Victory Day gives the Kremlin a chance to retell that story.",
    "It also allows the state to assure Russians that they, like their ancestors, will be victorious in the so-called “special military operation” in Ukraine.",
    "Moscow describes this war as the modern-day equivalent of the fight against Nazi Germany.",
    "With fewer witnesses to that historic victory still alive, the Kremlin’s ability to manipulate society by drawing on this important memory depends on the willingness of the next generation to embrace the state’s official history.",
    "And Russian political figures are worried that young people nowadays are disconnected from their heritage.",
    "A poll conducted in December 2022 by the Russian Public Opinion Research Centre found that 76% of Russians aged 14 to 24 believe they have a good understanding of the history of their country.",
    "But the results of an alternative poll from June 2023 show that 70% of Russia’s young people do not know enough about their nation’s history.",
    "Vladimir Medinsky, the chairman of the Interdepartmental Commission of Historical Education of Russia, reflected on the issue at a forum on how to interest young people in Russian history in 2023.",
    "He said: “What needs to be done to make our children interested in history?",
    "To make interesting historical performances, to make historical films.” Russia’s leaders seek to address this perceived disconnect through military patriotic education.",
    "This is a system of surrounding children and young people with state-approved messages about Russia’s historic military victories and the role of its armed forces in making their country respected – and feared – around the world.",
    "These messages are conveyed through textbooks and in lessons at school.",
    "But one of the challenges for the Russian state is finding ways of making this material attractive enough for young people to want to engage with it.",
    "Putin himself has indicated that he understands this challenge.",
    "At a meeting with the Russian non-profit society Znaniye (Knowledge) on April 30, the Russian president argued that “it is crucial to have both an opportunity and skills to communicate the truth about past years and decades: sincerely, compellingly and – if I may say so – in a way that truly resonates”.",
    "Patriotic youth groups are an important vehicle for delivering military patriotic education in fun and exciting ways.",
    "These groups organise activities including games and competitions, as well as more immersive activities such as role-playing and re-enactments.",
    "These activities are designed to create a deeper engagement with the events of the past.",
    "One group, Victory Volunteers, emphasises collecting personal accounts from war veterans to add to the historical record.",
    "It also actively brings young people and war veterans together so that the heroes of future wars can be inspired by real-life stories of wartime heroism.",
    "Listening to these first-hand testimonials is intended to enable young people to deepen their understanding of the experience of war, including its hardships and tragedies.",
    "Yunarmiya (Young Army) is probably Russia’s best-known military patriotic youth group.",
    "It works with young people to develop their appreciation of history.",
    "But its focus on dressing its members in uniforms and training them in practical military skills has captured the attention of the world’s media.",
    "These skills include military-style activities such as marching in formation, learning how to assemble and disassemble weapons, and how to fire them.",
    "The Russian state also supports military patriotic education through the presidential grants fund.",
    "Hundreds of charities, youth groups and local societies apply to the fund twice a year, with the winners reportedly chosen by Putin himself.",
    "Many of the successful applications involve activities to raise young people’s awareness of historical memory, especially the memory of war.",
    "In 2022, for example, the historical reconstruction club Volnitsa received funding to organise a memorial march “in the footsteps of the winners” to mark the 80th anniversary of the liberation of the Bogucharsky region of Russia (near the border with Ukraine) from Nazi occupation.",
    "The successful application emphasised the emotional intensity of the reenactment and its educational effects on young participants.",
    "Events like the 80th anniversary of Victory Day have a significance for the Kremlin that goes beyond the speeches, parades and pageantry of the day itself.",
    "They are part of an effort by the Russian state to shape the expectations and behaviour of the next generation of its citizens.",
    "By encouraging young people to feel a personal connection to Russia’s history of war, Moscow hopes to ensure that society will regard war as an inevitable part of life.",
    "The scale of this effort suggests that Putin and other senior officials anticipate the need for a society willing to make sacrifices so that Russia can achieve victories in future wars."
  ],
  "topics": {
    "Military": 0.9900702834129333,
    "Education": 0.9871425628662109,
    "Politics": 0.9846487045288086,
    "Environment": 0.9842662811279297,
    "Diplomacy": 0.9806200861930847,
    "Energy": 0.9624612927436829,
    "Culture": 0.9475758671760559,
    "Technology": 0.9419351816177368,
    "Health": 0.939512312412262,
    "Economy": 0.9368714094161987,
    "Transport": 0.9332965612411499,
    "Elections": 0.9242631793022156,
    "Conflict": 0.8990582227706909,
    "Crime": 0.6924542784690857
  },
  "sentiment": {
    "positive": 0.846,
    "negative": 0.154,
    "neutral": 0.0
  }
}