{
  "title": "US-Ukraine minerals deal looks better for Kyiv than expected - but Trump is an unpredictable partner",
  "published_date": null,
  "url": "https://theconversation.com/us-ukraine-minerals-deal-looks-better-for-kyiv-than-expected-but-trump-is-an-unpredictable-partner-255723",
  "original_language": "en",
  "cleaned_sentences": [
    "The United States and Ukraine have finally signed a long-awaited agreement on Ukraine’s postwar reconstruction – and, at first reading, the details appear more favourable for Kyiv than many observers expected.",
    "At the core of the “economic partnership agreement” is the exploitation of Ukraine’s mineral wealth.",
    "Ukraine will get access to US investment and technology, and the US will eventually get a share of the profits.",
    "The rest will finance the war-torn nation’s recovery if and when a peace agreement is signed with Russia.",
    "Several aspects of this deal stand out as positive for Ukraine.",
    "Unlike in previous drafts, the country retains ownership of its natural resources.",
    "All profits are to be invested in Ukraine for ten years after the agreement comes into force.",
    "Washington can also make its contribution in the form of new military aid, although it will be down to the US president to decide whether or not to do that.",
    "Earlier in the negotiations, a major sticking point was the demand from the US president, Donald Trump, that the agreement include compensation for past US aid to Ukraine, which he insisted amounted to US$350 billion (£260 billion).",
    "Many analysts estimate the figure is closer to US$120 billion.",
    "Before the deal was signed, Ukraine’s prime minister, Denys Shmyhal, said the deal would “not include assistance provided before its signing”.",
    "And the Ukrainian government announcement stated that the new agreement “focuses on further, not past US military assistance”.",
    "But when the US treasury secretary, Scott Bessent, spoke to journalists, he described the deal as “compensation” for “the funding and the weapons”.",
    "Sign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK.",
    "Every Thursday we’ll bring you expert analysis of the big stories in international relations.",
    "Whether Bessent’s statement represents political spin, or whether there is still distance between Washington and Kyiv on this critical point, remains to be seen.",
    "The formal text has not been released, and many details remain to be ironed out.",
    "Trump can be an erratic negotiator who is prone to sudden changes of direction.",
    "Indeed, the signing of this agreement is just the latest twist in a broader effort to bring the war in Ukraine to an end – one which probably still has many surprises ahead.",
    "Trump appears to be losing patience with what he views as Russia’s refusal to engage with the peace process.",
    "Signing the deal may have been intended as a warning to Moscow to get serious about ending the conflict.",
    "The new agreement reportedly states that the US and Ukraine share a “long-term strategic alignment”.",
    "That’s a far cry from Trump’s rhetoric only a few months ago, when he called Ukraine’s president, Vlodomyr Zelensky, a “dictator”“ and blamed Kyiv for starting the war with Russia.",
    "But given Trump’s changes of mood, this agreement is unlikely to be the final word on how he views the conflict.",
    "Despite talk of a long-term strategic alignment, one thing the deal doesn’t contain is any explicit security guarantees for Ukraine.",
    "But the White House argues – and other observers hope – that US investment in Ukraine will give the US an implicit stake in the country’s security.",
    "That might deter Russia from attacking Ukraine again, out of fear the US would act to protect its investment.",
    "However, once we move from the realm of politics and security to economics, several glaring flaws in this logic become apparent.",
    "They all come down to whether the mineral wealth at the heart of this agreement can be profitably exploited – and, indeed, whether it even exists.",
    "Is this a game-changing deal?",
    "The American humorist Mark Twain is said to have once defined a mine as \"a hole in the ground owned by a liar”.",
    "Assessing the precise scale of underground mineral deposits is notoriously difficult – and not every deposit can be extracted in a profitable fashion.",
    "In Ukraine, the exploratory work has simply not been done.",
    "Even the supposed size of the deposits, which are based on old Soviet surveys conducted in a superficial fashion, is not certain.",
    "Many of the minerals that supposedly lie under Ukraine’s surface are so called “rare earths”, which are critical to hi-tech supply chains.",
    "But they are also expensive and time-consuming to exploit, requiring a massive upfront investment which may eventually be lost.",
    "Even in successful cases, it generally takes over a decade to get production onstream.",
    "Today, there are few rare-earth projects under development anywhere in the world outside China – even in countries that are not current (and possibly future) war zones.",
    "Most of Ukraine’s supposed deposits lie in the east of the country in areas vulnerable to Russian attack, making investment risky.",
    "All of this makes economic partnership agreement of doubtful long-term significance for the broader peace process.",
    "The potential gains from it are too hypothetical to make much difference within a meaningful timescale.",
    "The deal is unlikely to generate much real economic incentive for the US to defend Ukraine, and so is unlikely to become a new source of military assistance for Kyiv.",
    "For the Russian president, Vladimir Putin, the deal doesn’t change a lot.",
    "While it might indeed be a signal that Trump is running out of patience with Russia, it does little to change the underlying realities of the conflict.",
    "We can’t rule out the possibility that Trump, as unpredictable as ever, might make a more meaningful commitment to Ukraine in the future, one that changes the course of the war.",
    "But – at first glance, certainly – this minerals deal is not it."
  ],
  "topics": {
    "Diplomacy": 0.8915538787841797,
    "Economy": 0.8511250615119934,
    "Energy": 0.8224533796310425,
    "Technology": 0.8031858205795288,
    "Transport": 0.7962000966072083,
    "Culture": 0.7886654138565063,
    "Health": 0.7699740529060364,
    "Environment": 0.7520222663879395,
    "Elections": 0.7440754771232605,
    "Education": 0.7364493012428284,
    "Conflict": 0.7271729111671448,
    "Politics": 0.7169017791748047,
    "Crime": 0.5303388237953186,
    "Military": 0.5094346404075623
  },
  "sentiment": {
    "positive": 0.326,
    "negative": 0.674,
    "neutral": 0.0
  }
}