{
  "title": "Putin dodges peace talks in Istanbul as Russia pushes for territorial concessions from Ukraine",
  "published_date": null,
  "url": "https://theconversation.com/putin-dodges-peace-talks-in-istanbul-as-russia-pushes-for-territorial-concessions-from-ukraine-256504",
  "original_language": "en",
  "cleaned_sentences": [
    "This article was first published in The Conversation UK’s World Affairs Briefing email newsletter.",
    "Sign up to receive weekly analysis of the latest developments in international relations, direct to your inbox.",
    "Demands by British, French, German and Polish leaders in Kyiv last weekend that Russia agree to a 30-day ceasefire in Ukraine or face possible “massive” sanctions went down in Moscow about as well as you’d expect.",
    "In an address from the Kremlin, Russian president Vladimir Putin lambasted European powers for talking to Russia “in a boorish manner and with the help of ultimatums”.",
    "He did, however, offer a counter-proposal: an invitation for Ukraine to take part in direct talks in the Turkish city of Istanbul.",
    "Putin called the talks “the first step towards a long-term, lasting peace”.",
    "Ukraine’s president, Volodymyr Zelensky, accepted the invitation and announced he would attend the talks in person.",
    "He challenged Putin to do the same.",
    "But on the eve of the talks it was announced that, no, Putin wouldn’t attend and a junior delegation would be sent in his place.",
    "Zelensky, who is in Turkey anyway for talks with the Turkish president, Recep Tayyip Erdoğan, has called the Russian envoy “phony” and accused Moscow of sending “stand-in props”.",
    "Putin’s no-show, alongside Russia’s refusal to agree to a ceasefire as a precursor to negotiations, probably says all you need to know about whether Moscow truly intends to bring the war to an end.",
    "But, regardless, the talks are the first to take place directly between the two warring parties since the early weeks of Russia’s full-scale invasion.",
    "Sign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK.",
    "Every Thursday we’ll bring you expert analysis of the big stories in international relations.",
    "The Russian delegation in Istanbul is being led by Vladimir Medinsky, a Putin aide who led the previous round of direct peace talks with Ukraine.",
    "This is evidence, as Stefan Wolff and Tetyana Malyarenko also point out, that Russia wants the talks to be based on the same framework as in 2022 – namely, forcing Ukraine to accept significant restrictions on its military and sovereignty.",
    "Wolff and Malyarenko, who are two regular contributors to our coverage of the war in Ukraine, explain that Russia’s territorial demands have become more contentious since the start of the war.",
    "Russia’s current position is that it sees international recognition of Crimea, Sevastopol, the Donetsk and Luhansk People’s Republics, and the Kherson and Zaporizhzhia regions as part of Russia as “imperative”.",
    "This is a non-starter for Ukraine.",
    "But Wolff and Malyarenko suggest there could be some flexibility on accepting that some parts of Ukrainian territory are under temporary Russian control in exchange for peace.",
    "The problem, they write, is that much of the territory Russia currently occupies, including Crimea and land on the shores of the Azov Sea, is of key strategic value for Russia.",
    "Donetsk and Luhansk, meanwhile, have substantial economic value because of the resources located there.",
    "In any case, there is no guarantee that territorial concessions from Kyiv now would put a permanent end to the war, write Wolff and Malyarenko.",
    "This is because it “does not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorstep”.",
    "Read more: Territorial concessions will be central to any Ukraine peace deal, and to Russia's long-term plan Lasting peace between India and Pakistan, two countries that regularly clash over control of the disputed Kashmir region, is proving equally tricky to find.",
    "Several rounds of military strikes, prompted by a terrorist attack in Indian-administered Kashmir in April that killed at least 31 people, have recently brought the nuclear powers closer to war than they have been in decades.",
    "The Trump administration initially expressed reluctance to get involved, saying it was “none of our business”.",
    "But as hostilities rapidly escalated, raising the prospect of nuclear war, US officials stepped in and talked down the two countries.",
    "A ceasefire was agreed that, for almost a week now, seems to have held.",
    "Alex Waterman and Sudhir Selvaraj, experts on peace studies at the University of Bradford, say the ceasefire represents an “incredibly precarious peace”.",
    "That ceasefires have been agreed – and respected – by the two parties before is cause for optimism, they write.",
    "But cross-border tensions have increased in recent years.",
    "Waterman and Selvaraj argue this has been part of a strategy used by Pakistan’s powerful army to deflect attention away from political and economic crises at home.",
    "Tensions remain high and may, at some point, spill over again.",
    "Some of the decisions taken by India after the recent terror attack, for instance, such as the suspension of a treaty governing water sharing of rivers in the Indus basin, could compel further support for militant groups in Kashmir.",
    "Despite a US offer to mediate talks between the two countries, deeper resolution looks a way off.",
    "Read more: India and Pakistan have agreed a precarious peace – but will it last?",
    "Donald Trump, meanwhile, is wrapping up his four-day tour of the Middle East.",
    "His visit has seen him sit down with the Saudi crown prince and the Qatari emir (as well as Syria’s leader, Ahmed al-Sharaa) to discuss bolstering economic and security ties.",
    "In that sense, the trip has been a resounding success.",
    "Trump signed a US$142 billion (£107 billion) arms deal with Saudi Arabia and agreements with Qatar that, according to the White House, will “generate an economic exchange worth at least US$1.2 trillion”.",
    "Adam Hanieh, a professor of political economy at the University of Exeter, explains that arrangements like these are part of a long history in which the Gulf monarchies have supported the architecture of US global power.",
    "In this piece, Hanieh explores how the vast amounts of income generated by the Gulf’s nationalised petroleum industries in the 20th century was invested into US financial markets.",
    "Gulf states, he writes, were essential contributors to the growth of the US as a global financial power.",
    "The US promised military protection in return, resulting in a web of American military bases across the region.",
    "As Trump’s lavish welcome in the Middle East shows, the relationship between the US and Gulf monarchies looks robust.",
    "But much has changed in the past two decades, says Hanieh, referring to China’s rise as a global manufacturing hub.",
    "The Gulf is a critical energy lifeline for Beijing, while China’s demand for oil, gas and petrochemicals will be a vital part of the Gulf’s economic future.",
    "Trump is no stranger to competition with China, as his first five months in office have shown.",
    "Tit-for-tat tariffs that the US and China imposed on each other quickly snowballed into heavy duties, as high as 145% on Chinese goods looking to enter the US.",
    "However, after weeks of signalling that tariff levels could reduce, US and Chinese officials announced this week that US tariffs on Chinese goods would drop to 30% for a period of 90 days, while Chinese tariffs on US products would drop back to 10%.",
    "Trade negotiations between the two countries will continue.",
    "We asked Chee Meng Tan, an assistant professor of business economics at the University of Nottingham, what the deal means for China.",
    "He says the tariff reduction has provided China with much-needed relief as it attempts to repair its ailing economy.",
    "But China will ultimately hope to bring US tariffs down to around 10%, in line with the rest of the world.",
    "And, as Tan explains, there is more China can do to persuade the Trump administration to cut tariffs further.",
    "Ensuring the flow of critical minerals to the US and assuring its support for US agriculture, an important political support base for Trump, will be key.",
    "China needs to engage with the US and lower US tariffs as much as possible.",
    "But it will want to look at other options, writes Tan, rather than relying on an unpredictable Trump.",
    "The next 90 days are a big deal for Beijing.",
    "Read more: China-US trade war: the next 90 days are a big deal for Beijing as it seeks long-term solutions Jonathan Este is on holiday.",
    "World Affairs Briefing from The Conversation UK is available as a weekly email newsletter.",
    "Click here to get updates directly in your inbox."
  ],
  "topics": {
    "Diplomacy": 0.9762653112411499,
    "Politics": 0.9652134776115417,
    "Conflict": 0.9600574374198914,
    "Education": 0.954862117767334,
    "Culture": 0.9543046355247498,
    "Health": 0.9443082809448242,
    "Crime": 0.9409184455871582,
    "Military": 0.9344565272331238,
    "Transport": 0.9329912066459656,
    "Economy": 0.930807888507843,
    "Energy": 0.9303862452507019,
    "Technology": 0.9242421388626099,
    "Environment": 0.9154776334762573,
    "Elections": 0.9065513610839844
  },
  "sentiment": {
    "positive": 0.46,
    "negative": 0.54,
    "neutral": 0.0
  }
}