{
  "title": "Russia is labelling Oscar Jenkins a ‘mercenary’, not a prisoner of war. What’s the difference - and why does this matter?",
  "published_date": null,
  "url": "https://theconversation.com/russia-is-labelling-oscar-jenkins-a-mercenary-not-a-prisoner-of-war-whats-the-difference-and-why-does-this-matter-256996",
  "original_language": "en",
  "cleaned_sentences": [
    "Oscar Jenkins, a 33-year-old former teacher from Melbourne, was one of many foreigners who responded to Ukrainian President Volodymyr Zelensky’s call in 2022 for volunteers to join Ukraine’s armed forces to help repel Russia’s invasion.",
    "In early 2024, Jenkins joined Ukraine’s International Legion of Territorial Defence, which has attracted some 20,000 fighters from 50 countries since the war began.",
    "He had no previous military experience, but this wasn’t a requirement to join.",
    "In December, Jenkins was captured by Russian forces in Russian-occupied eastern Ukraine and accused of serving as a “mercenary” in Ukraine’s 66th Mechanised Brigade’s 402nd Rifle Battalion.",
    "He was tried in a Russian court and sentenced on May 16 to 13 years imprisonment in a maximum-security penal colony.",
    "When a foreigner volunteers to fight in a war, their legal status under international law can be complicated.",
    "Are they a soldier with the full authorisation of one of the warring parties to engage in hostilities?",
    "Or are they an illegal mercenary?",
    "And what happens if they are captured?",
    "Why legal status matters The answers to these questions have very real importance to the thousands of foreigners who have joined Ukraine’s International Legion since 2022.",
    "Russian authorities have classified all of Ukraine’s foreigner fighters as “mercenaries”.",
    "They’ve used this label to deny foreign fighters the status of “prisoner of war” (POW), with the requisite protections that come along with that under international humanitarian law.",
    "While foreigners are permitted under international law to enlist in the armed forces of a state for political or moral reasons, mercenaries have historically been outlawed due to their sole motivation being financial gain.",
    "International humanitarian law (the rules that govern war) define mercenaries as individuals who are not nationals or residents of a state engaged in war and are recruited to fight outside that state’s official armed forces.",
    "They are motivated solely by private gain (like money or promises of reward), often well in excess of what the traditional armed forces are paid.",
    "Mercenaries are essentially professional soldiers who sell their services to a state without any real ties to that country.",
    "Once a fighter is classified as a “mercenary”, they lose all the legal protections that are traditionally afforded lawful combatants.",
    "This includes prisoner of war status if they are captured and immunity from prosecution for fighting in a conflict.",
    "Prisoners of war are also entitled to humane treatment and access to food and medical care.",
    "And they cannot be subjected to sham trials or torture.",
    "According to my research, many of the foreign nationals who joined the International Legion were motivated by a desire to defend Ukraine against Russia’s aggression.",
    "They were sworn into Ukraine’s armed forces and paid the same as a Ukrainian soldier of equal rank.",
    "Once enlisted in the armed forces, they were immediately exempt from “mercenary” status, irrespective of their motivation for joining.",
    "As such, these foreign fighters should be entitled to the full range of protections guaranteed to members of Ukraine’s armed forces under the Geneva Conventions.",
    "Labelling lawful foreign members of the Ukrainian armed forces as “mercenaries”, and denying them their protections, is an abuse of international law.",
    "How can Australia protect its nationals?",
    "If an Australian enlists in Ukraine’s armed forces and is captured by Russian forces, there is a limited toolkit the Australian government can use to help him or her.",
    "However, it is not powerless.",
    "Through its embassy in Moscow, Australia can request access to detainees to assess their welfare while in prison.",
    "Russia can, however, decline this access.",
    "Details of a detainee’s capture may also be withheld.",
    "Australia can also apply diplomatic pressure to ensure humane treatment of prisoners and their full POW rights.",
    "This can be done by working with international bodies, such as the UN Working Group on Arbitrary Detention or organisations like the International Committee for the Red Cross (ICRC), which can request access to detainees.",
    "It appears the government is already doing some of these things.",
    "According to Foreign Minister Penny Wong, the government has been working with Ukraine and the ICRC to advocate for Jenkins’ welfare and release, and providing consular support to Jenkins’ family.",
    "Australia also has an obligation to warn its citizens they will likely face severe consequences if they travel to Ukraine to fight and are captured by Russian forces, given Russia’s misuse of the “mercenary” label.",
    "Through back-channel negotiations, Australia could also push Ukraine or its allies to include Australians being held by Russia in future prisoner swaps.",
    "In January of this year, Ukraine and Russia carried out such an exchange of 470 prisoners from both nations.",
    "And in talks last week in Turkey, both sides agreed to release another 1,000 prisoners on each side.",
    "Such exchanges have involved foreign fighters in the past.",
    "In 2022, 10 foreign citizens were included in a prisoner swap, including five Britons, two Americans, a Croatian, a Swede and a Moroccan.",
    "Several of them had been convicted of being mercenaries and sentenced to death after a Russian sham trial.",
    "There is no guarantee Jenkins would qualify for such an exchange, however, if Russia continues to classify him as a mercenary."
  ],
  "topics": {
    "Diplomacy": 0.8888241052627563,
    "Conflict": 0.8148472905158997,
    "Politics": 0.756733238697052,
    "Culture": 0.7319218516349792,
    "Economy": 0.7271166443824768,
    "Energy": 0.7179274559020996,
    "Transport": 0.6588850617408752,
    "Environment": 0.6529395580291748,
    "Technology": 0.6510194540023804,
    "Education": 0.644450843334198,
    "Military": 0.6318037509918213,
    "Elections": 0.569136917591095,
    "Health": 0.5489047765731812,
    "Crime": 0.48726025223731995
  },
  "sentiment": {
    "positive": 0.302,
    "negative": 0.698,
    "neutral": 0.0
  }
}