{
  "title": "Russia-China ties on full display on Victory Day - but all is not as well as Putin is making out",
  "published_date": null,
  "url": "https://theconversation.com/russia-china-ties-on-full-display-on-victory-day-but-all-is-not-as-well-as-putin-is-making-out-256385",
  "original_language": "en",
  "cleaned_sentences": [
    "Chinese troops participating in Russia’s Victory Day parade in Red Square, Moscow, on May 9 is a clear indication that President Xi Jinping is fully committed to his “no-limits” partnership with his Russian counterpart, Vladimir Putin.",
    "Xi’s own attendance of the parade, which came as part of a state visit to Russia, underlines that China is not only supporting Russia.",
    "It signified that Beijing wants this support to be understood clearly in Kyiv, Washington and European capitals.",
    "Travelling to Moscow and having his troops goose-step down Red Square was not a last-minute decision by Xi.",
    "Nor was the multitude of agreements signed by the two leaders and their joint declaration anything but part of a well established pattern of deepening relations between Russia and China.",
    "This trend has accelerated since Russia launched its full-scale invasion of Ukraine in February 2022.",
    "But the breadth and depth of China’s commitment to Russia at this particular moment is undoubtedly related to the broader upheaval in the international order that has been worsened since Donald Trump’s return to the White House.",
    "Get your news from actual experts, straight to your inbox.",
    "Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.",
    "The Trump administration, possibly spooked by market wobbles, has taken steps to restore stability.",
    "China and the US have agreed a deal to slash the import tariffs they have imposed on each other.",
    "But uncertainty remains – above all about how the complex relationships in the triangle of Washington, Beijing and Moscow will work out and where this will leave the rest of the world.",
    "Read more: Trump, Xi and Putin: a dysfunctional love triangle with stakes of global significance On May 8, in the wake of Xi and Putin’s meetings in Moscow, Russia and China released a joint statement.",
    "It stressed the intention of the two leaders to “enhance the coordination of their approaches and to deepen the practical cooperation on maintaining and strengthening global strategic stability, as well as to jointly address common challenges and threats in this sphere”.",
    "They reiterated this determination in their press statements afterwards.",
    "Putin emphasised that he and Xi “personally control all aspects of [the] Russia-China partnership and do all we can to expand the cooperation on bilateral issues and the international agenda alike”.",
    "A Chinese read-out from the talks was similarly clear on the alignment between the countries.",
    "Xi reportedly said that “in the face of unilateralist countercurrents, bullying and acts of power politics, China is working with Russia to shoulder the special responsibilities of major countries and permanent members of the UN Security Council”.",
    "This unequivocal display of how close Moscow and Beijing are – as well as Putin and Xi personally – is important for both nations.",
    "For Russia, it remains important to demonstrate that western attempts at international isolation have not succeeded.",
    "For China, the very public consolidation of ties with Russia is above all a signal to the US.",
    "China is keen to stress that Trump’s efforts to engineer a split between Moscow and Beijing, which the American president described as necessary to “un-unite” the two nations during an interview with US talk show host Tucker Carlson in November 2024, have largely failed.",
    "However, beyond the glossy surface of the celebrations in Moscow, all is not as well for Russia as Putin is trying to make out.",
    "For all the public displays of friendship between Xi and Putin, the relationship between the two countries remains highly asymmetrical.",
    "Russia would not be able to continue to wage its war against Ukraine without Chinese support.",
    "Trade between Russia and China is critical to propping up the Russian war economy, reaching a record high of nearly US$250 billion (£190 billion) in 2024.",
    "Their trade has increased by more than 60% since 2021, yet it is only marginally up since 2023.",
    "China’s diplomatic clout is also helpful for Russia.",
    "If Beijing had taken an unequivocal stance opposing Moscow’s aggression, fewer leaders in the developing world would have sided with Putin.",
    "In this case, Russia would probably have lost organisations like the Shanghai Cooperation Organisation and the Brics group of emerging economies as platforms to further its broader agenda of restoring its erstwhile status as a great power.",
    "In that agenda, Putin has been moderately successful.",
    "But with South Africa and India’s leaders absent from Russia’s Victory Day commemorations, the list of attendees was shorter than at the Brics summit in Kazan, Russia, in October 2024.",
    "A doubled-edged sword Notably absent from the celebrations in Moscow was high-level representation from North Korea and Iran.",
    "These are two key allies of Russia with whom Moscow signed strategic partnership agreements in June 2024 and January 2025, respectively.",
    "Tehran simply sent its ambassador to Moscow to attend.",
    "However, it may have compensated Putin in a different and materially more significant way.",
    "According to reports, Iran is readying a delivery of launchers to enable Russia to use the short-range ballistic missiles already delivered last year.",
    "This would further add to Russia’s reliance on Iranian hardware in Ukraine, which has so far been most visible in the use of Iranian-made Shahed drones.",
    "North Korea dispatched a military delegation led by three-star general Kim Yong-bok.",
    "Kim is widely considered the commander of North Korean forces fighting alongside Russian troops in the Kursk region of western Russia, where Ukrainian forces seized territory in August 2024 as a possible bargaining chip in future negotiations with Russia.",
    "Putin officially acknowledged the participation of North Korean troops in this operation in a statement on April 28.",
    "This acknowledgment came two days after he had announced the defeat of Ukrainian forces there in a highly choreographed and televised meeting with his chief of general staff, Valery Gerasimov.",
    "The demonstration of Russia’s close relationships with its three core allies – China, Iran and North Korea – is a double-edged sword.",
    "On the one hand, it clearly indicates that Putin is far from isolated on the international stage.",
    "But it also signals that Russia has become a lot more dependent on these relationships than would befit Putin’s dreams of restoring Russia’s great-power status.",
    "Neither can be much comfort to Ukraine and its allies, unfortunately."
  ],
  "topics": {
    "Culture": 0.9102221131324768,
    "Politics": 0.9065567851066589,
    "Diplomacy": 0.8955649733543396,
    "Economy": 0.8930627107620239,
    "Technology": 0.8841480612754822,
    "Energy": 0.867764949798584,
    "Transport": 0.8547804951667786,
    "Military": 0.8456935882568359,
    "Environment": 0.8324155211448669,
    "Conflict": 0.8232462406158447,
    "Crime": 0.7478693127632141,
    "Elections": 0.7306342720985413,
    "Education": 0.7243847846984863,
    "Health": 0.6432303786277771
  },
  "sentiment": {
    "positive": 0.63,
    "negative": 0.37,
    "neutral": 0.0
  }
}