{
  "title": "Russia declares temporary Ukraine ceasefire to mark 80th anniversary of the end of World War II",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-04-28/russia-declares-temporary-ceasefire-putin-says/105226744",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia declares temporary Ukraine ceasefire to mark 80th anniversary of the end of World War II In short: Russia has announced a three-day ceasefire in Ukraine to mark the 80th anniversary of the end of World War II in Europe.",
    "Ukraine and its European allies say they do not believe this, while pushing back against US proposals they see as skewed towards Russia.",
    "The 72-hour ceasefire would run for three days either side of May 9, when Vladimir Putin will be hosting international leaders including Chinese President Xi Jinping.",
    "Russia has announced a three-day ceasefire in Ukraine to mark the 80th anniversary of the end of World War II in Europe.",
    "The Kremlin said the 72-hour ceasefire would run for three days either side of May 9, when Vladimir Putin will be hosting international leaders including Chinese President Xi Jinping to celebrate victory by the Soviet Union and its allies over Nazi Germany.",
    "\"All military actions are suspended for this period.",
    "Russia believes that the Ukrainian side should follow this example,\" it said in a statement.",
    "\"In the event of violations by the Ukrainian side, Russia's armed forces will give an adequate and effective response.\"",
    "Ukrainian Foreign Minister Andrii Sybiha, in response, said: \"If Russia truly wants peace, it must cease fire immediately.",
    "Why wait until May 8th?\"",
    "A ceasefire should be \"real, not just for a parade,\" he posted on X.",
    "This is the second ceasefire announcement Mr Putin has made in quick succession, following a 30-hour Easter ceasefire that each side accused the other of violating countless times.",
    "Against a background of increasing impatience from the United States, both moves appeared aimed by the Kremlin leader at signalling to US President Donald Trump that Russia is still interested in peace.",
    "Ukraine and its European allies say they do not believe this, while pushing back against US proposals they see as skewed towards Russia.",
    "The latest announcement came after Mr Trump criticised Mr Putin for a deadly Russian attack on Kyiv last week and voiced concern at the weekend that the Russian president was \"just tapping me along\".",
    "Washington has repeatedly threatened to abandon its peace efforts unless there is real progress.",
    "Mr Trump wants to see a permanent ceasefire to ending Russia's war in Ukraine, White House press secretary Karoline Leavitt said on Monday.",
    "Ms Leavitt told reporters that Trump was increasingly frustrated with Mr Putin and Ukrainian President Volodymyr Zelenskyy, and both needed to come to the negotiating table to end the war.",
    "She noted that Mr Putin had offered a temporary ceasefire on Monday, but reiterated that Mr Trump had made it clear that he was seeking a permanent ceasefire.",
    "Up until now, Mr Putin had refused to accept a complete unconditional ceasefire, linking it to a halt in Western arms supplies to Kyiv and Ukraine's mobilisation effort.",
    "Just before the ceasefire announcement, Ukraine and Russia targeted each other with long-range strikes.",
    "The Russian Defence Ministry said its forces downed 119 Ukrainian drones overnight, most of them over Russia's border region.",
    "In Ukraine, air raid sirens rang out across the country on Monday morning, local time.",
    "There were no immediate reports of casualties or damage.",
    "Trump's doubts over Putin Mr Trump said he harbours doubts about Mr Putin's sincerity in pursuing a deal, as Russian forces have continued to strike civilian areas of Ukraine with cruise and ballistic missiles while the talks have proceeded.",
    "But on Friday, the US president described a brokered settlement on the war as \"close.\"",
    "Trump meets Zelenskyy at pope's funeral, then blasts Putin on social mediaWestern European officials have accused the Kremlin of dragging its feet on peace talks so that Russian forces, which are bigger than Ukraine's and have battlefield momentum, can capture more Ukrainian land.",
    "Russian Foreign Minister Sergey Lavrov discussed the war in a phone call with Mr Rubio on Sunday, the Russian Foreign Ministry said.",
    "The two diplomats focused on \"consolidating the emerging prerequisites for starting negotiations,\" the statement said, without offering further details.",
    "Russia has effectively rejected a US proposal for an immediate and full 30-day halt in the fighting by imposing far-reaching conditions.",
    "Ukraine has accepted it, Mr Zelenskyy has said.",
    "A French diplomatic official said at the weekend that Mr Trump, Mr Zelenskyy and French President Emmanuel Macron agreed \"to pursue in the coming days the work of convergence\" to obtain \"a solid ceasefire.\"",
    "The diplomat said a truce is a \"prior condition for a peace negotiation that respects the interest of Ukraine and the Europeans.\"",
    "The official was not authorised to be publicly named in accordance with French presidential policy.",
    "Ukraine unwilling to give up land Ukraine, meanwhile, has pushed back at the possibility of surrendering land to Russia in return for peace, which Washington has indicated could be necessary.",
    "A key point of leverage for Ukraine could be a deal with Washington that grants access to Ukraine's critical minerals wealth.",
    "Ukraine and the US have made progress on a mineral agreement, with both sides agreeing that American aid provided so far to Kyiv will not be taken into account under the terms of the deal, Ukrainian Prime Minister Denys Shmyhal said Sunday.",
    "\"We have good progress,\" he said after talks with US Treasury Under Secretary Scott Bessent in Washington.",
    "\"The main thing is that we clearly defined our red lines: The agreement must comply with Ukraine's Constitution, legislation, and European commitments, and must be ratified by Parliament,\" Shmyhal said.",
    "The US and Europe have been Kyiv's biggest backers."
  ],
  "topics": {
    "Diplomacy": 0.9234943389892578,
    "Military": 0.9098556041717529,
    "Politics": 0.9062203764915466,
    "Conflict": 0.8905865550041199,
    "Energy": 0.880950391292572,
    "Environment": 0.8606579899787903,
    "Technology": 0.8502276539802551,
    "Culture": 0.8328583240509033,
    "Economy": 0.8262132406234741,
    "Transport": 0.8234046101570129,
    "Health": 0.8190704584121704,
    "Education": 0.8017526865005493,
    "Elections": 0.770953893661499,
    "Crime": 0.5896047949790955
  },
  "sentiment": {
    "positive": 0.275,
    "negative": 0.725,
    "neutral": 0.0
  }
}