{
  "title": "Samsung and Xiaomi remove AdGuard VPN from Russian app stores - here’s what we know so far",
  "published_date": null,
  "url": "https://www.techradar.com/vpn/vpn-privacy-security/adguard-vpn-disappears-from-russias-samsung-galaxy-app-store-heres-what-we-know-so-far",
  "original_language": "en",
  "cleaned_sentences": [
    "Samsung and Xiaomi remove AdGuard VPN from Russian app stores – here’s what we know so far AdGuard remains available on the Google Play Store in Russia - Samsung and Xiaomi have removed the AdGuard VPN app from their official app stores in Russia at the government's request - Apple already killed AdGuard VPN in 2024, alongside at least 60 VPN apps - Over 100 VPNs are currently unavailable in the Apple App Store, with 50 also unavailable in the Google Play Store UPDATE: AdGuard confirmed to TechRadar that Xiaomi also removed its VPN app from its Russian App Store at Roskomnadzor's request on May 16, 2025, after publication.",
    "We edit the article to reflect this.",
    "Yet another VPN service has disappeared from official app stores in Russia.",
    "This time, Samsung has removed the AdGuard VPN app from its Galaxy App Store in the country at the Roskomnadzor's demand.",
    "A day after, on May 16, 2025, the tech giant Xiaomi also did the same, killing the provider's VPN application from its Russian app store after receiving a removal order from the country's censoring body.",
    "This comes as part of the Kremlin's actions against VPNs that have seen over 100 apps disappear from the Russian Apple App Store, including some of the best VPN services on the market.",
    "Despite Google seemingly resisting most of these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia.",
    "AdGuard VPN, however, hasn't been affected yet.",
    "\"A regrettable development\" \"Our app has indeed been removed from the Samsung Store in Russia – a regrettable development, in our view,\" AdGuard CPO, Denis Vyazovoy, told TechRadar.",
    "The VPN service has received a synthetic email from Samsung (see image below) to inform that its \"application information has been modified.\"",
    "\"Russia was excluded from the sales country lists according to Russian government's request.",
    "This app is banned by Russian government,\" reads the email.",
    "Xiaomi has sent a similar communication to the provider (see image below), noting that \"Distribution of VPN applications in Russia is not allowed.",
    "Therefore, we have to remove your application from Russia.\"",
    "AdGuard VPN was already among the virtual private network (VPN) services affected by the big purge from Russia's Apple App Store last year.",
    "Unavailable apps also include some of TechRadar's favorites, such as NordVPN, ExpressVPN, and Proton VPN, but also the popular Russian service Amnezia VPN.",
    "The provider confirmed to TechRadar, though, that its app is still available in Russia's Google Play Store at the time of writing.",
    "It's also worth noting that these removals only affect Russia-based users.",
    "The AdGuard VPN app is still available across all official app stores outside Russia.",
    "Samsung's email to AdGuard Xiaomi's email to AdGuard \"We see this as part of a broader trend of restricting access to tools that help people protect their privacy and maintain access to an open internet,\" Vyazovoy told TechRadar.",
    "The Kremlin's actions against VPNs have intensified since a law enforced in March 2024 criminalized the spread of information about ways to circumvent internet restrictions.",
    "This is likely the legal basis upon which the Russian censor body is issuing these demands to Big Tech firms.",
    "Yet, experts have long called on these companies to uphold Russian citizens' human rights by refraining from cooperating with these demands and restoring censored VPN apps.",
    "Vyazovoy confirmed to TechRadar that the service continues to operate through other channels and the provider is actively looking for ways to remain accessible to all users.",
    "If you are using a Galaxy or Xiaomi smartphone, I recommend downloading the AdGuard VPN app from the Google Play Store, where the service is still available at the time of writing.",
    "The provider also suggests downloading it directly from their official website to be sure to get the latest and safest version.",
    "We want to know what you think about the world of VPNs.",
    "Whether you're a novice or a VPN pro, we want to hear your thoughts.",
    "Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete!",
    "To take part, click the link below: You might also like Chiara is a multimedia journalist committed to covering stories to help promote the rights and denounce the abuses of the digital side of life – wherever cybersecurity, markets, and politics tangle up.",
    "She believes an open, uncensored, and private internet is a basic human need and wants to use her knowledge of VPNs to help readers take back control.",
    "She writes news, interviews, and analysis on data privacy, online censorship, digital rights, tech policies, and security software, with a special focus on VPNs, for TechRadar and TechRadar Pro.",
    "Got a story, tip-off, or something tech-interesting to say?",
    "Reach out to chiara.castro@futurenet.com You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name."
  ],
  "topics": {
    "Conflict": 0.9532166719436646,
    "Energy": 0.9472002983093262,
    "Education": 0.9419794082641602,
    "Environment": 0.9410443305969238,
    "Politics": 0.937608003616333,
    "Culture": 0.9358018040657043,
    "Diplomacy": 0.9339030981063843,
    "Technology": 0.9314096570014954,
    "Economy": 0.9287699460983276,
    "Transport": 0.9166359901428223,
    "Crime": 0.9128681421279907,
    "Health": 0.9120209813117981,
    "Elections": 0.8938626646995544,
    "Military": 0.8303431868553162
  },
  "sentiment": {
    "positive": 0.206,
    "negative": 0.794,
    "neutral": 0.0
  }
}