{
  "title": "\"A clear escalation in Russia’s crackdown on digital privacy tools\" - experts warn against recent VPN disappearances in Russia",
  "published_date": null,
  "url": "https://www.techradar.com/vpn/vpn-privacy-security/a-clear-escalation-in-russias-crackdown-on-digital-privacy-tools-experts-warn-against-recent-vpn-disappearances-in-russia",
  "original_language": "en",
  "cleaned_sentences": [
    "\"A clear escalation in Russia’s crackdown on digital privacy tools\" – experts warn against recent VPN disappearances in Russia The VPN Guild is calling for international advocacy to hold tech platforms accountable The VPN purge from Russian official app stores continues, with smaller providers becoming the new target after Apple and Google.",
    "Between May 15 and 16, 2025, Samsung and Xiaomi both removed the AdGuard VPN application at the Roskomnadzor's demand.",
    "At least one more VPN provider, HideMyName VPN, has also been removed from the Huawei Store in Russia and China – a Russian VPN digital rights group, VPN Guild, confirmed to TechRadar.",
    "\"The removal of VPN apps from app stores marks a clear escalation in Russia’s crackdown on digital privacy tools,\" said VPN Guild Chair Alexey Kozliuk.",
    "Not an isolated incident The recent events, Kozliuk explains, aren't isolated incidents, but part of a broader, ongoing campaign to block Russian citizens' access to uncensored information and control internet use.",
    "In October 2023, for example, HideMyName filed the first-ever lawsuit against the Kremlin's infamous censorship body regulator Roskomnadzor.",
    "In January 2024, authorities deemed the VPN provider to be a \"foreign agent.\"",
    "In March 2024, the government then passed a new law to criminalize the spread of information about ways to circumvent internet restrictions.",
    "This is likely the legal basis upon which the Russian censor body began issuing these removal demands to tech firms.",
    "From July 2024 onwards, Apple has removed at least 60 VPN apps, including AdGuard VPN, and a popular Russian service, Amnezia VPN, alongside some of the best VPN services on the market.",
    "This brought the total toll to almost 100 VPN apps unavailable in Russia's App Store.",
    "While Google seems mostly resistant to these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia.",
    "Now, authorities' targets have also expanded towards smaller app store providers.",
    "We want to know what you think about the world of VPNs.",
    "Whether you're a novice or a VPN pro, we want to hear your thoughts.",
    "Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete!",
    "To take part, click the link below: \"We’re seeing a coordinated squeeze across platforms, limiting users’ ability to bypass restrictions,\" said Kozliuk.",
    "\"What’s especially concerning is the growing role of global tech companies in enforcing local censorship, whether under direct state pressure or as preemptive compliance.\"",
    "GreatFire’s Campaign and Advocacy Director, Benjamin Ismail, also shared the same concerns.",
    "Through the organization's project AppCensorship, Ismail and the team have been busy monitoring a staggering increase in these VPN removals across both Apple and Google's official app stores.",
    "While it's the first time Ismail has heard of such an incident involving Samsung's Galaxy App Store, he told TechRadar that a way smaller provider (F-Droid) was also hit by a similar request in 2024.",
    "According to Ismail, this may mean that Roskomnadzor has understood that it can try its luck to put pressure on tech vendors.",
    "\"Smaller providers may struggle more to resist these demands as the prospect of becoming fully unavailable in Russia might be an issue for these platforms,\" he added.",
    "This is exactly why experts have long argued that Big Tech giants, which have the means and resources, should uphold their users' human rights and challenge the Kremlin's censorship requests.",
    "Commenting on this point, Kozliuk from the VPN Guild said: \"This underscores the urgent need to give users more control and make them less reliant on centralized platforms and app ecosystems, as well as the need for stronger international advocacy to hold tech platforms accountable.",
    "\"As political tensions rise, especially around elections or protests, these crackdowns will likely intensify – and VPNs will remain a critical line of defense for digital freedom.\"",
    "You might also like Chiara is a multimedia journalist committed to covering stories to help promote the rights and denounce the abuses of the digital side of life – wherever cybersecurity, markets, and politics tangle up.",
    "She believes an open, uncensored, and private internet is a basic human need and wants to use her knowledge of VPNs to help readers take back control.",
    "She writes news, interviews, and analysis on data privacy, online censorship, digital rights, tech policies, and security software, with a special focus on VPNs, for TechRadar and TechRadar Pro.",
    "Got a story, tip-off, or something tech-interesting to say?",
    "Reach out to chiara.castro@futurenet.com You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name."
  ],
  "topics": {
    "Conflict": 0.9686795473098755,
    "Diplomacy": 0.9636132717132568,
    "Politics": 0.9623357653617859,
    "Technology": 0.9577446579933167,
    "Elections": 0.9550963044166565,
    "Environment": 0.951531171798706,
    "Energy": 0.9502961039543152,
    "Culture": 0.9470734000205994,
    "Health": 0.9387186169624329,
    "Economy": 0.9369320273399353,
    "Transport": 0.9349526762962341,
    "Crime": 0.9263517260551453,
    "Education": 0.8927553296089172,
    "Military": 0.7368728518486023
  },
  "sentiment": {
    "positive": 0.29,
    "negative": 0.71,
    "neutral": 0.0
  }
}