{
  "title": "Bulgarian spies nabbed for feeding information to Russia facing jail time in the UK",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-03/bulgarian-spy-ring-russia-kremlin-caught-uk-face-sentencing/105211652",
  "original_language": "en",
  "cleaned_sentences": [
    "Bulgarian spies nabbed for feeding information to Russia facing jail time in the UK It was as though it came straight from a spy novel.",
    "There was a beautician, a love triangle and a mixed-martial-arts fighter.",
    "The operations were run out of a dilapidated guesthouse in a British seaside town.",
    "Children's toys, car keys, water bottles and even a pair of glasses were used to hide covert surveillance devices.",
    "There were fake identities purporting to be those of accredited journalists, UN ambassadors, law enforcement officers and health workers.",
    "Some of the uniforms sourced to help the spies get into buildings undetected included those for paramedics and couriers from DHL, Uber, Deliveroo and Pizza Express.",
    "But this isn't a gripping espionage thriller.",
    "This is a story of a sophisticated spy ring, which was working on behalf of the Russian government.",
    "The ringleader and his minions For two-and-a-half years until they were caught in February 2023, a group of six Bulgarians spied on prominent individuals and gathered evidence of key locations that were of interest to the Kremlin.",
    "Their base was a 33-room former hotel in the resort town of Great Yarmouth, in Norfolk.",
    "Orlin Roussev was the ringleader.",
    "Roussev reported to an Austrian-born Russian spymaster named Jan Marsalek, who is wanted in Germany and Austria for fraud and embezzlement.",
    "He acted as an intermediary for Russian intelligence.",
    "Marsalek gave instructions to Roussev, whose job was to wrangle his five operatives: Bizer Dzhambazov, Ivan Stoyanov, Katrin Ivanova, Vanya Gaberova and Tihomir Ivanchev.",
    "Using the messaging app Telegram, the group discussed plans, with codenames taken straight from Hollywood.",
    "On Roussev's phone police found messages in which he went by the codename \"Jackie Chan\", while Dzhambazov used \"Mad Max\" and \"Jean-Claude Van Damme\" as pseudonyms.",
    "They referred to their subordinate spies as \"the Minions\", named for the sidekicks to the lead character villain Gru in the film Despicable Me.",
    "GRU is also the name of the Russian defence ministry's military intelligence service — one of the country's main spy agencies.",
    "The spy ring was hired to conduct espionage on targets across the UK and Europe.",
    "Roussev pleaded guilty to spying on behalf of Russia before the trial of three of his co-accused, which was held earlier this year.",
    "Katrin Ivanova, Vanya Gaberova and Tihomir Ivanchev, the \"Minions\", were all found guilty in March.",
    "They are due to be sentenced in coming weeks.",
    "Dzhambazov was Roussev's right-hand man.",
    "He was in a relationship with fellow spy and \"Minion\", Ivanova.",
    "They lived together in a house in north-west London.",
    "Another \"Minion\", Gaberova, who worked as a beautician, was also in a relationship with Dzhambazov.",
    "Ivanchev, the third \"Minion\", was also previously in a relationship with Gaberova.",
    "All have pleaded guilty to conspiracy to spy — Ivanova was also found guilty of possessing fake ID's.",
    "The fifth comrade, Stoyanov, a mixed martial arts fighter, has pleaded guilty to spying.",
    "A new kind of Russian spy When Roussev's base was raided, police found what they have described as an \"Aladdin's cave\" of espionage paraphernalia.",
    "Among the treasure trove of devices seized were 221 mobile phones, more than 250 hard drives, close to 500 SIM cards and hundreds of other items used for recording, surveillance and hacking.",
    "More than 90 bank cards were also found, along with 75 passports in 55 different names.",
    "They were used to help the spies with their work of following people, reconnaissance around important buildings and feeding detailed information back to Marsalek, who passed it onto Moscow.",
    "Paid handsomely for their work, the group carried out six key operations the UK's Crown Prosecution Service (CPS) used to build its case.",
    "Its investigation was based on extensive communications between ring members on Telegram, with a UK court hearing detectives trawled through more than 200,000 messages.",
    "There was also evidence of financial transactions and travel, and hundreds of spy devices, many of which were found in the hotel Roussev used as the ring's headquarters.",
    "\"Sifting through thousands of messages, and then matching this up with physical travel, financial statements and surveillance reports and footage, meant detectives were able to build up a compelling picture of the group's activity, as well as identify those involved and their roles within the group,\" the Metropolitan Police Service said.",
    "During the court proceedings, the prosecution proved that by conspiring to obtain information that was of use to a foreign adversary, the agents were working against the safety and interests of the UK.",
    "\"It was clear that the activity was for the benefit of Russia, not just from the choice of targets but also from the nature of the Telegram messages that were exchanged between members of the group,\" the UK Crown Prosecution Service said.",
    "Investigative journalist and Russian security expert Andrei Soldatov said this operation was an example of how Moscow changed its military intelligence operations in 2014 following its annexation of Crimea.",
    "\"What we've seen ever since is a reliance on proxies, on criminals, on people who do not have diplomatic cover, and they can still be quite effective,\" he said.",
    "\"Russian military intelligence has become much more aggressive, much more adventurous, and the people they are recruiting now for operations are not spies in a traditional sense of the word.",
    "\"It's not about people who are trying to collect information secretly infiltrating Western society.",
    "\"It's about assassinations, it's about sabotage operations.\"",
    "Honey-trap and kidnapping plots The head of the CPS Special Crime and Counter Terrorism division, Frank Ferguson, described the espionage operation as \"high-level\" with \"significant\" financial reward for those involved.",
    "He said the spy ring's targeting of those who had fled persecution in Russia undermined the message that the UK was a safe place.",
    "Two of their main targets were investigative journalists Christo Grozev and Roman Dobrokhotov — both of whom have reported stories critical of Moscow.",
    "Bulgarian national Grozev uncovered Russian links to the 2018 Salisbury poisoning attacks and as a result was placed on a wanted list by the Russian Interior Ministry.",
    "The spy ring followed Grozev around Europe, and spied on him in multiple countries including Austria, Montenegro and Spain.",
    "They provided Russia with information about his accommodation, his car and his contacts, according to the CPS.",
    "The group also considered a potential \"honey trap\" plot using Gaberova to target him.",
    "Dobrokhotov, a Russian journalist who lives in the UK working as editor in-chief of investigative outlet The Insider, was also tracked around Europe.",
    "On one flight from Budapest to Berlin, Ivanova sat next to him.",
    "Messages revealed the group had discussed kidnapping Dobrokhotov, but decided it was too risky.",
    "From late 2022 until February 2023, they spied on a US military base in the German city of Stuttgart.",
    "It is understood to be a location where Ukrainian soldiers were being trained to use surface-to-air weapons.",
    "The plan was to secure key intelligence on those at the base so the information could then be used to locate members of the Ukrainian military when they returned to the battlefield.",
    "The operation was conducted from a car, which had been fitted out with surveillance equipment, that was later found near the military base.",
    "\"Surveillance images and videos of the base were recovered from devices along with general descriptions of security at the base,\" the CPS said.",
    "Agents of chaos Some of the other operations simply sought to cause chaos.",
    "For example, they sprayed the Kazakhstan Embassy in London with fake pig blood, so they could then create a phoney opposition group and demonstrate outside.",
    "They would then feed bogus intelligence about the group back to Kazakh security services, via their Russian connections.",
    "\"The aim of the operation was to increase the standing of their Russian clients in the eyes of the Kazakhs, for the benefit of Russia,\" the CPS said.",
    "Mr Soldatov said these kinds of plots didn't require \"extremely competent or professional operatives.\"",
    "\"What is enough is just to show that you are capable of something,\" he said.",
    "He said the group didn't need to \"kill a lot of people\" to achieve their objective, they just had to show intent and that it would have an impact.",
    "\"In this case, on the UK and European countries, because now they understand that we need to pay more for protection and for security,\" he said.",
    "\"So, in a way, even an unsuccessful operation raises a cost of protection and security, which is exactly the objective of such operations.",
    "\"The other objective has been always, at least since 2016, to show that Russian capabilities are still there, that they are still capable of doing things in Europe and in the United States and again, for that, you don't need to be extremely successful.\"",
    "Although Russian intelligence took a new direction in 2014, it was the expulsion of more than 700 Russian diplomats and spies after Moscow's invasion of Ukraine eight years later, that would lead to the real shift.",
    "Most of the agents are recruited online through messaging apps like Telegram.",
    "\"It's not only about Russian military intelligence, it's also other agencies like the SVR, which is a Russian Foreign Intelligence Agency, or the FSB, which is supposed to only be acting inside the country but it's getting more and more aggressive abroad\", Mr Soldatov said.",
    "Even though the Bulgarian spy ring was scuppered, Russia is still likely to consider its work a success.",
    "Moscow didn't have to sacrifice any nationals to gather the intelligence it did, and their operations sent a chilling message to Russian citizens critical of the Kremlin hiding out in the UK."
  ],
  "topics": {
    "Technology": 0.9931089878082275,
    "Conflict": 0.992038369178772,
    "Energy": 0.99195396900177,
    "Health": 0.9915351271629333,
    "Economy": 0.9906238913536072,
    "Culture": 0.9901896715164185,
    "Transport": 0.9899896383285522,
    "Crime": 0.9878650307655334,
    "Diplomacy": 0.9870655536651611,
    "Environment": 0.9860351085662842,
    "Education": 0.9730007648468018,
    "Military": 0.9707377552986145,
    "Politics": 0.9672383666038513,
    "Elections": 0.9528487324714661
  },
  "sentiment": {
    "positive": 0.351,
    "negative": 0.649,
    "neutral": 0.0
  }
}