{
  "title": "Australian feared killed while fighting Russia in Ukraine",
  "published_date": null,
  "url": "https://7news.com.au/news/australian-feared-killed-while-fighting-russia-in-ukraine-c-18691706",
  "original_language": "en",
  "cleaned_sentences": [
    "The family of a young Australian feared killed while fighting in Ukraine against Russia hold hope he will be found alive.",
    "There are grave concerns for Caleb List, 25, who is missing in the country’s eastern Kharkiv region.",
    "WATCH THE VIDEO ABOVE: Australian man feared dead in war-torn Ukraine.",
    "Know the news with the 7NEWS app: Download today List had volunteered with Ukraine’s foreign legion, and military sources believe he may have been killed by artillery fire near the city of Izyum in April, the ABC reports.",
    "His remains have not been recovered and his death has not been confirmed.",
    "“There’s a number of scenarios so while there’s still those possibilities we’ll hold out hope that he’ll come home to us and we’ll be able to get him home and keep him home,” List’s uncle Michael Connolly told 7NEWS.",
    "He added: “I know Caleb and I know he’s a fairly clever young lad.",
    "If he (had a chance to get) out of that situation, well and truly, he would have gotten out of it.” 7NEWS.com.au understands the Department of Foreign Affairs and Trade (DFAT) is providing consular assistance to the fighter’s family, but it has declined to comment on specific cases.",
    "“(DFAT) is aware of people attempting to travel to fight in the war and a small number of Australians reported as missing or deceased in Ukraine,” a department spokesperson said.",
    "The Australian government has again warned citizens not to travel to the region.",
    "“We all condemn Russia’s illegal and immoral invasion but it is not for Australians to travel to Ukraine to fight,” Foreign Minister Penny Wong said.",
    "Speaking in Perth on Wednesday, Prime Minister Anthony Albanese described the reports surrounding List as “deeply troubling”.",
    "“My heart goes out to the family and loved ones of the gentleman concerned,” he said.",
    "“There is a travel warning in place for a reason.",
    "Australians should not be travelling to Ukraine.",
    "“It is dangerous and people should follow that advice.” List, a former labourer from Queensland, travelled to Ukraine three years ago to fight against Russia’s invasion.",
    "In a 2024 interview with German broadcaster Deutsche Welle, List said he “wanted to push myself to the extreme”.",
    "“I’ve basically done that and now I just do this because it’s the only thing I’m really good at,” he said.",
    "In 2023, he told the SBS his parents were “quite proud of me” and “happy that I’m happy”.",
    "“You can die anywhere.",
    "It’s less likely in Gladstone … but I could also breathe enough coal dust to get black lung,” he said.",
    "“At the end of the day I’m just a mercenary and I’m just a soldier of fortune.",
    "“I’m just looking for an experience and enjoyment and something to get me through life, because in Australia I didn’t really have much going for me.” He said he had been interested in the army but that he had been rejected by Australia’s Defence Force.",
    "“He was always wanting to be in the military so his wanting to be a soldier probably outweighed his desire for anything else,” his uncle said.",
    "List was most recently in Australia about six months ago and was described as “the Caleb that we always knew”.",
    "“He wasn’t affected by the warzone... well if he was he kept it to himself,” Connolly said.",
    "List’s family were worried about his safety in Ukraine but knew he “wanted to make a difference and he wanted to help” “I would like people not to judge him harshly because he didn’t go over (to Ukraine) with an agenda,” Connolly said.",
    "‘Extremely dangerous’ It comes after confirmation Australian Nick Parson died while working for a landmine clearing charity, also in Izyum.",
    "It is not known exactly what happened, but he was working with UK-based charity Prevail Together as a bomb disposal expert at the time.",
    "Parsons was among three people critically injured, including Prevail’s British co-founder, Chris Garrett, who died from his injuries.",
    "Albanese this week offered his “deepest condolences and sympathies” to the Australian’s family.",
    "“I can confirm he wasn’t a participant in the conflict.",
    "He was volunteering with a humanitarian organisation and so I do want to remind Australians that Ukraine is a do-not-travel zone,” Albanese said.",
    "“The situation is extremely dangerous and we continue to strongly advise all Australians not to travel to Ukraine under any circumstances.” Queenslander Jed William Danahay was killed by Russian forces in Izyum in 2022 while working as a combat medic helping injured frontline troops.",
    "Meanwhile, Ukraine leader Volodymyr Zelenskyy insists he will attend a meeting with Russia if Vladimir Putin is there.",
    "Zelenskyy said he wants to negotiate an unconditional 30-day ceasefire as the first step towards ending the war.",
    "The Kremlin has yet to confirm if Putin will take part in the talks expected to take place in Istanbul on Thursday."
  ],
  "topics": {
    "Conflict": 0.9563631415367126,
    "Economy": 0.9475051760673523,
    "Culture": 0.9422361850738525,
    "Military": 0.9415513873100281,
    "Crime": 0.9366858601570129,
    "Energy": 0.9328626990318298,
    "Diplomacy": 0.9321198463439941,
    "Health": 0.9257490038871765,
    "Politics": 0.9103763103485107,
    "Environment": 0.9014406204223633,
    "Elections": 0.9013856649398804,
    "Transport": 0.8958120942115784,
    "Technology": 0.8601489663124084,
    "Education": 0.7939093112945557
  },
  "sentiment": {
    "positive": 0.351,
    "negative": 0.649,
    "neutral": 0.0
  }
}