{
  "title": "Could Australia learn about prepardness from Finland, the prepper nation of the Nordics?",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-14/could-finland-prepper-mindset-be-a-role-model-for-australia/105245186",
  "original_language": "en",
  "cleaned_sentences": [
    "Could Australia learn about preparedness from Finland, the prepper nation of the Nordics?",
    "Cheerful and alert don't seem like characteristics that go hand in hand.",
    "But in Finland, they do.",
    "Often ranked as one of the happiest places in the world, the country is also known by another title, as the \"prepper nation of the Nordics\".",
    "During the Cold War era, Finland built up stockpiles of medical and military equipment as well as fuel and food — and never stopped.",
    "This level of planning served the country well in 2020 when Finland's Nordic counterparts, and many other nations, were grappling with supply shortages during the COVID-19 pandemic.",
    "With personal protective equipment in high demand, the Finnish government dipped into its massive stockpile and, despite a temporary setback with out-of-date PPE, kept calm and carried on.",
    "Locals say preparedness is in Finland's DNA, a necessary skill to have in a country that shares a border with Russia.",
    "But experts credit the nation's preparedness and self-reliance to a few key factors: collective responsibility; conscription and national defence courses; and massive stockpiles.",
    "So could Australia learn something from Finland's preparedness?",
    "And would it help us better prepare for a shifting global climate?",
    "Living next door to Russia Towards the end of last year, Finland joined its Scandinavian neighbours (Sweden, Denmark and Norway) in better preparing its citizens for confronting a global security environment that has become more unpredictable.",
    "US President Donald Trump's shift to an America-first position, the war in Ukraine and the Middle East, the rapid expansion of artificial intelligence and hybrid threats have changed the world as we know it.",
    "Under this shadow, the Nordic nation published a consolidated online version of its crisis preparedness in November, with the aim of ensuring the entire population knew what to do in case of an \"incident\".",
    "The umbrella term covers short-term events such as long power cuts and water outages to longer-term crises, including pandemics or military conflicts.",
    "Europeans have been given similar guidance in recent months.",
    "Russia isn't referenced in the online version but its invasion of Ukraine in 2022 likely played a hand in the update.",
    "Finland was once seen as a Cold War-era meeting point between East and West, but it has turned more westward in recent decades as Moscow has flexed its military might.",
    "The pivot prompted Finland to join the European Union in 1995, adopt the Euro in 1999 and, more recently, sign onto the NATO alliance.",
    "\"The entire modern history of independent Finland was shaped by wartime experience [with Russia],\" Professor Rory Medcalf, head of the national security college at the Australian National University, tells ABC Radio National's Rear Vision.",
    "Finland became part of the Russian empire in 1809 and declared independence a century later in 1917, not long after the Bolsheviks overthrew the Russian royal family, the Romanovs, to form the Soviet Union.",
    "In 1939, the Soviet Union invaded its neighbour, triggering a brutal conflict, known as the Winter War of 1939-1940, that helped shape Finland's preparedness and security mindset, Professor Medcalf says.",
    "The much \"smaller Finnish military fought the Soviets effectively to a standstill\", he adds, without much material support from the rest of the world.",
    "Finland ceded some of its territory when the two nations signed a treaty in 1940, but citizens left the battlefield with greater confidence in the country's ability to defend itself.",
    "\"In lots of ways, the Winter War brought the country together.",
    "This experience of a common existential threat galvanised the society to fight together,\" says Christian Fjäder, managing director of Geostrategic Intelligence Group in Finland.",
    "Everyone has a role to play in defence The Finns had to walk a delicate tightrope to maintain their independence after World War II.",
    "Finland was forced to sign a treaty which, in practice, gave the Soviets the right to control part of their foreign policy and became the basis for \"Finlandisation\".",
    "Until the end of the Cold War, political leaders simultaneously appeased their neighbour while marshalling every part of Finnish society for their security, just as they had during the Winter War.",
    "They called the latter policy \"total defence\".",
    "\"'Total defence' was effectively Finland building the ability for very powerful territorial defence against the Soviet Union if, as they feared, the model of compromise would break down and the Soviets would invade,\" Professor Medcalf says.",
    "Total defence involved a combination of state power and civilian resources.",
    "Security was therefore seen as a shared responsibility involving all parts of society — from government and the private sector to smaller organisations and individual citizens.",
    "Everyone had a role to play.",
    "In the early 2000s, Finland's approach to total defence evolved into a new doctrine: \"comprehensive security\".",
    "Professor Medcalf says this was because the former relied \"very heavily on traditional military defence against a foreign aggressor at the border\".",
    "Comprehensive security, on the other hand, still incorporated a \"whole of society attitude that everyone is involved in security\", former Finland president Sauli Niinistö says, but it looks at threats beyond military ones.",
    "\"We [now] have a lot of different challenges and threats, from viruses to the consequences of climate change.",
    "And the fact is that whatever the threat is, the answer is quite similar: [We] have to guarantee that people have food, water, energy, security, and that logistics are working.",
    "And that makes it a very collective thing,\" he says.",
    "\"It's important to understand that we are not living in silos, that we have to be able to cooperate.\"",
    "Professor Medcalf, who has researched and written about Finland's preparedness, describes comprehensive security as a \"virtuous circle\" where citizens recognise they must contribute to national security and resilience to enable society to continue functioning as it should.",
    "\"Importantly, it [is] about building quite a strong political consensus across what is actually a very lively multi-party democracy,\" he adds.",
    "Conscription and national defence courses for the 'elite' A key aspect of Finland's approach to cooperation is universal male conscription.",
    "All Finnish men above 18 are obligated to participate in national defence and depending on the training, service lasts 165, 255 or 347 days.",
    "Women have the option to apply for military service on a voluntary basis.",
    "While mandatory service is still in place in some European countries, Finland is something of an outlier when it comes to this position and its \"extraordinary level of preparedness,\" Professor Medcalf says.",
    "\"When most of the rest of the world and certainly most of Europe began to celebrate the peace dividend [at the end of the Cold War] and effectively rapidly disarm, Finland maintained [total defence],\" he says.",
    "Mr Niinistö explains that this attitude was again shaped by local history and a \"Finnish mindset\".",
    "\"I could describe my own attitude at the time I made my conscription — and it still is — it's a question of honour in a way, not an obligation, but a question of honour.",
    "You have to serve your country,\" he says.",
    "A series of national defence courses designed specifically for corporate and civic leaders is another example of Finland's comprehensive efforts to prepare for future emergencies.",
    "The three-and-a-half week residential course teaches citizens about national security, potential threats and the role of the government in a disaster.",
    "It is run by the Finnish Defence Force and has become an \"important and popular aspect of comprehensive defence in Finland,\" says Elisabeth Braw, a senior fellow with the Atlantic Council and author of Globalisation: The Return of a Divided World and the upcoming Undersea War.",
    "\"It's set up for rising members of any organisation in the country.",
    "So you may be between 30 and 50 when you take this course and being selected for it is incredibly prestigious,\" she says.",
    "\"So what you have is an elite within Finnish society, from academia all the way to government agencies, the private sector and so forth, who understand national security … as a result of attending this course.",
    "\"[Those who participate] obviously form contacts and friendships with leaders from all these other sectors, which again, helps the country … it's a brilliant idea.\"",
    "Finns say the benefit of national defence service and special courses is that it creates security awareness beyond the military.",
    "Those who have done the courses can be \"switched on\" in the event of an emergency, despite having spent most of their careers in the private sector.",
    "The subtle art of stockpiling Stockpiling essential goods, whether that be as a business or an individual, is another tool in Finland's toolbox of preparedness.",
    "Households are expected to have enough water, food and medicine for at least 72 hours, while businesses are required to maintain even larger stockpiles of essential items.",
    "Importers or manufacturers of medicines in Finland are obligated to maintain stock that is roughly equivalent to 3-10 months of normal consumption for the emergency supply.",
    "Meanwhile, stockpiles of important fuels equal about five months' average consumption to provide \"additional time if there's a disruption\", Dr Fjäder says.",
    "\"Stockpiling is a big element in the Finnish resilience systems,\" he says.",
    "The national stockpile has been built up over years and, along with pharmaceuticals and fuel, it includes grains, production parts and critical chemicals.",
    "It is overseen by Finland's government-funded National Emergency Supply Agency (NESA), which is responsible for ensuring that stockpiles are available and activated in a crisis.",
    "Could this model work outside of Finland?",
    "Mr Niinistö was asked by the European Union to report on how Finland's approach to security might work across the continent.",
    "He says one of the key takeaways from this model is that being proactive means you have to \"develop your capabilities\".",
    "\"I think that we in Europe have been living since World War II, or at least after the Cold War ended, in a world where we have thought that security [is] self-evident, it's [taken] for granted, you don't have to care about that.",
    "But now things have changed and we have to learn to be proactive,\" he says.",
    "As for whether Finland's level of preparedness could be adopted in Australia, Professor Medcalf says he doesn't think the way forward is a \"wholesale copying of the template or transferring of all the elements of the Finnish model\".",
    "But he says there are some elements that \"can and should be looked at\" given the range of potential risks on the horizon.",
    "\"For example, if there were to be a war elsewhere in our region that we were not deeply involved in, but which effectively broke the maritime supply lines to Australia, suddenly flows of energy and imports and exports [would all stop],\" he says.",
    "\"Imagine what this country would be like if we ran out of fuel, which we could easily do within about two weeks in a crisis.",
    "So it's worth, I think, looking at a model like Finland and [asking], well, what can we pick and choose?\"",
    "Part of that process will likely involve identifying points of difference between Australian and European attitudes, particularly on issues like mandatory service.",
    "\"[In the European democracies] that either have national service or have had it or are bringing it back, [conscription] is seen very differently in those countries.",
    "It is very much about homeland defence, and in many cases, it's about non-military civil defence,\" Professor Medcalf says.",
    "\"Anyone who is called up for conscription has the option of choosing a civilian role, whether it's in, for example, hospitals or other areas of social service.",
    "\"That seems to be a healthy starting point for a conversation in Australia about what is obviously an intensely sensitive subject.\"",
    "Professor Medcalf says preparedness ultimately comes down to people because they are \"the one capability that we really cannot substitute\".",
    "\"In a way, the strength of a nation's robustness and security is the quality of its people and their willingness to contribute,\" he says.",
    "\"It doesn't matter how powerful a submarine fleet or an air force we may or may not have one day, if you have a population that effectively says, 'we're not interested in risk and responsibility to protect the things that we enjoy [as] part of this society', then you've effectively surrendered all of that other capability.\""
  ],
  "topics": {
    "Diplomacy": 0.9913595914840698,
    "Politics": 0.9889134764671326,
    "Environment": 0.9878471493721008,
    "Culture": 0.9864779114723206,
    "Military": 0.9837131500244141,
    "Conflict": 0.9832130074501038,
    "Health": 0.9818195104598999,
    "Transport": 0.9754849076271057,
    "Energy": 0.9726495146751404,
    "Economy": 0.962924599647522,
    "Elections": 0.96091228723526,
    "Technology": 0.9560003876686096,
    "Crime": 0.9422217011451721,
    "Education": 0.8580614328384399
  },
  "sentiment": {
    "positive": 0.671,
    "negative": 0.329,
    "neutral": 0.0
  }
}