{
  "title": "Europe looks to Australia in the face of an aggressive Russia and Trump 2.0",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-20/europe-russia-putin-australia-alliance/105311082",
  "original_language": "en",
  "cleaned_sentences": [
    "Europe looks to Australia in the face of an aggressive Russia and Trump 2.0 In short Australia is mulling over a proposal from the EU to strengthen ties in the wake of an unpredictable Trump administration and expansionist Russia.",
    "Some experts have expressed concern about any potential defence pacts that may arise, arguing relationships with Asian neighbours are a bigger priority.",
    "What's next European and Asian allies will be watching developments closely with Russia Ukraine peace talks ongoing.",
    "A proposal to strengthen ties between the European Union and Australia in the face of increasing global instability could prove to be a major boost for both allies.",
    "However some experts have cautioned against Canberra signing a potential defence pact with Brussels amid warnings it would not be in our national interest.",
    "During talks in Rome on Sunday, European Commission President Ursula von der Leyen proposed developing stronger defence and strategic ties with Australia, a move cautiously welcomed by Prime Minister Anthony Albanese.",
    "Australian Strategic Policy Institute senior analyst Malcolm Davis said it was clear Europe was looking to broaden its influence with allies further afield, particularly given uncertainty with an expansionist Russia.",
    "While the proposal was in the early stages, Dr Davis said any new alliance could ultimately help diversify Australia's defence capabilities amid concerns around the future of the AUKUS deal.",
    "\"I think this is clearly a development that needs to be seen against a context of growing uncertainty about the US role under Trump 2.0,\" Dr Davis said.",
    "\"Europe clearly recognises that the US under Trump isn't necessarily committed to ensuring its security, be it under NATO Article 5, or more broadly.",
    "\"So it's moving to be more self-reliant — and that means spending considerably more on defence and moving more rapidly to build up capability in anticipation of a looming threat from an aggressive Russia that could move beyond Ukraine within the next five years, especially if Trump does a deal with Putin at the expense of Ukraine, and by extension, Europe.\"",
    "'Europe needs us more than we need them' But while a strategic pact with Europe appeared to be a beneficial move for Australia, any defence pacts which tied the two was simply not in our national interests, according to one analyst.",
    "Canberra should instead focus on maintaining and growing relationships in the Asia Pacific region, according to Alexander Korolev, a Senior Lecturer in Politics and International Relations in the School of Social Science at the University of NSW.",
    "Loading...Dr Korolev told the ABC that Europe had more to gain out of this proposal than Australia did, especially on a defence level.",
    "\"Since Trump took office he has unilaterally collapsed a unified front against Russia,\" Dr Korolev said.",
    "\"Europe is marginalised and without support from the US, it cannot make an impact on Ukraine.",
    "It is quite clear the geopolitical weight of the EU in Ukraine/Russia relations has diminished.\"",
    "Dr Korolev said Australia's interests should be more focused on the Asia Pacific — somewhere Europe was keen to expand.",
    "\"It's great to cooperate and establish strong connections [between Australia and Europe], it makes sense — the US has shown it is not a reliable ally,\" he said.",
    "\"But [extending this] to any defence pact is foolish.",
    "Dumping resources in an area not relevant to Australia's national interests is not a wise move.",
    "Europe needs Australia more because of what Washington is doing.\"",
    "Dr Davis said strengthening ties with Europe would help Australia to diversify defence supply chains and explore new sources of military capabilities.",
    "This would also be in Australia's interest with an unpredictable Trump yet to fully reveal his strategy in the Asia Pacific.",
    "\"There's obvious defence industry and capability opportunities here, where Australia could participate in some European projects, and thus diversify our capability supply chains, which I think is a good move at this point,\" he said.",
    "Vance, and the speech that sparked Europe into defence Europe's move to develop stronger defence and strategic ties with wider allies wasn't necessarily sparked by an ambitious and aggressive Vladimir Putin and his desire to expand Russia's borders.",
    "Rather, a trigger for the EU's accelerated program lay in the US Vice President JD Vance.",
    "Dr Léa Vuong, a senior lecturer and current Chair of French and Francophone Studies at the University of Sydney, said Mr Vance's speech to the EU in February shocked Europe and made it realise that it could no longer rely on the US to guarantee most of its defence.",
    "\"At the time, Emmanuel Macron called for an emergency meeting to discuss European security,\" Dr Vuong said.",
    "\"At a public ceremony on 8 May, Macron warned of the return of 'the spectre of war' and called for a 'stronger Europe'.",
    "\"Europe is moving forward to position itself as a region that can defend itself and it wants to align with countries and regions that stand for similar democratic and liberal values in a fast-changing world.\"",
    "Dr Vuong said strengthening the relationship between France and Australia was a step forward after Australia ditched it's submarine deal with France.",
    "According to Dr Davis, European nations will continue to have strong interests in our region.",
    "\"France has Indo-Pacific territories in the Southwest Pacific, so it sees itself as a Pacific and European power,\" he said.",
    "\"The UK too has Indo-Pacific interests more related to strategic and security relationships and commitments — for example, through AUKUS, and also as a member of UN Command on the Korean Peninsula.\"",
    "Other European states would also recognise economic interests, and according to Dr Davis are trying to manage an assertive China which is seeking to reshape European policy to suit Beijing.",
    "'Not such a small world' John Blaxland, Professor of International Security & Intelligence Studies, Strategic and Defence Studies Centre, at the Australian National University said it was important to remember while Europe was further away than Asia was, the world remained very interconnected.",
    "The ties and relationship with Europe remained strong as did Australia's relationships with the Asia Pacific but Prof Blaxland said it didn't have to be one or the other.",
    "\"The French has enormous interests in the Pacific, the UK does through the Five Powers [defence arrangements], the Germans have massive interests in Asia,\" he said.",
    "\"A strategic partnership makes sense, it mutually benefits Australia to strengthen those ties — the game has changed.\"",
    "The point of any such partnership or alliance would not to be dragged into a war alongside Europe but would be to prevent one, whether it was in Asia or elsewhere, through exchanging notes and conducting joint military exercises.",
    "Prof Blaxland said Australia had a lot to gain from mutual collaboration and was closer to its European allies than we thought."
  ],
  "topics": {
    "Diplomacy": 0.9750760197639465,
    "Politics": 0.9747672080993652,
    "Military": 0.9647004008293152,
    "Energy": 0.9631060361862183,
    "Economy": 0.9622431993484497,
    "Culture": 0.961357593536377,
    "Conflict": 0.9609237313270569,
    "Education": 0.9565358757972717,
    "Technology": 0.9562674164772034,
    "Environment": 0.9561927318572998,
    "Health": 0.9533165693283081,
    "Elections": 0.9518367648124695,
    "Transport": 0.9460408091545105,
    "Crime": 0.914661169052124
  },
  "sentiment": {
    "positive": 0.524,
    "negative": 0.476,
    "neutral": 0.0
  }
}