{
  "title": "Russia’s invasion united different parts of Ukraine against a common enemy - 3 years on, that unanimity still holds",
  "published_date": null,
  "url": "https://theconversation.com/russias-invasion-united-different-parts-of-ukraine-against-a-common-enemy-3-years-on-that-unanimity-still-holds-255092",
  "original_language": "en",
  "cleaned_sentences": [
    "When Russia invaded Ukraine in the spring of 2022, President Vladimir Putin incorrectly assumed it would be a swift takeover.",
    "In fact, three years on, negotiators from both countries are tentatively exploring the idea of a negotiated way out of a largely stalemated conflict.",
    "So what did the Kremlin’s initial assessment get wrong?",
    "Aside from underestimating the vulnerabilities of Russia’s military, analysts have suggested that Moscow also miscalculated the support Russia would receive from Ukrainians in the country’s east who have close ethnic ties to Russia.",
    "Our recently published study on Ukrainian sentiment toward Russia before and after the invasion backs up that assertion.",
    "It demonstrates that even those Ukrainians who had close ties to Russia based on ethnicity, language, religion or location dramatically changed allegiances immediately following the invasion.",
    "For example, just prior to the invasion of 2022, native Russian speakers in Ukraine’s east tended to blame the West for tensions with Russia.",
    "But immediately after the invasion, they blamed Moscow in roughly the same numbers as non-Russian-speaking Ukrainians.",
    "Moreover, this shift was not just a short-lived reaction.",
    "Three years after the invasion, we followed up on our survey and found that Ukrainians still blame Russia for tensions to a degree that was never so unanimous before 2022.",
    "A natural experiment Our study is part of a larger project exploring how effective Russian propaganda has been at influencing Russian-speaking adults in certain former Soviet states.",
    "Our inaugural survey was launched in the fall of 2020, while the question regarding tensions between Ukraine and Russia was first posed in February 2022, immediately prior to Russia’s invasion of Ukraine.",
    "Surveys were completed by over 1,000 Russian-speaking people in Ukraine − excluding Crimea and the breakaway Donbas region for security reasons − and in Belarus.",
    "While the spring surveys in Ukraine were conducted in person, the others were done by telephone due to the political situation in each country.",
    "Belarus was chosen because it shares a similar historical, linguistic and ethnic background to Ukraine, but the two nations have diverged in their geopolitical paths.",
    "Shortly after the fall of the Soviet Union in 1991, Belarus, like Ukraine, forged ahead in attempting to build democratic systems.",
    "But after Belarusian President Alexander Lukashenko came to power in 1994, the country become an authoritarian state with a high dependence on Russia for political and economic support.",
    "In broad terms, Ukraine has had an opposite trajectory.",
    "Relations between Ukraine and Russia fluctuated over the initial years of independence.",
    "But since the Maidan revolution of November 2013 to February 2014, a staunch pro-Western leadership has emerged.",
    "Still, certain segments of the population in Ukraine continued to hold affinities toward Russia – most notably, the Russian-speaking older generation in the country’s east.",
    "Our surveys provide a kind of natural experiment looking at the impact of a Russian invasion on previous pro-Russian public sentiment.",
    "Ukraine serves as the “treatment” group and Belarus as a “quasi-control” group, with the distinguishing factor being a Russian invasion.",
    "The questions we asked: “Who do you think is responsible for the worsening tensions between Russia and Ukraine?” and “In general, how do Russian policies affect your country?” Converging blame We found that in Ukraine, but not in Belarus, geopolitical views were sharply unified by the experience of the invasion.",
    "On one level, this is not surprising – after all, the people of a country being invaded would be expected to hold some degree of resentment to the invading army.",
    "But what we found most interesting is that this effect in Ukraine massively overrode the split among various identities before the invasion.",
    "This was most prominent in people’s perceptions of who was to blame for rising tensions.",
    "Prior to the invasion, 69.7% of respondents in Ukraine overall blamed Russia for the tensions between the two countries, with 30.3% blaming NATO, Ukraine or the U.S. By August 2022, 97.3% of respondents in Ukraine blamed Russia for the tensions, with only 2.7% blaming NATO, Ukraine or the U.S. By comparison, in the neighboring country of Belarus, 15.5% of respondents blamed Russia for the tensions prior to the invasion, and only 21.9% of respondents blamed Russia for the tensions after the invasion.",
    "This near unanimity in Ukraine masks the massive shifts you see when broken down for demographic differences.",
    "For example, blame varied widely across regions of Ukraine before the invasion but converged after the invasion.",
    "Prior to the invasion, only 36.0% of respondents in the east of Ukraine and 51.4% of respondents in the south of Ukraine blamed Russia for the tensions.",
    "After the invasion, over 96% of respondents in both regions blamed Russia.",
    "A similar effect can be seen across other demographic differences.",
    "Only 30.6% of Catholics in Ukraine blamed Russia for the tensions prior to the invasion, while 83.0% blamed Russia later on.",
    "What were once stratified opinions before the invasion became uniform afterward.",
    "To check that this trend was not just an immediate post-invasion blip, we conducted the surveys again in September 2024 and February 2025.",
    "The overall proportion of Ukrainians who blamed Russia for the tensions remained high, with 85.7% and 84.5%, respectively.",
    "And again, these results held across the various demographic breakdowns.",
    "In February 2025, the most recent survey, 77.2% of respondents in the east of Ukraine and 83.0% of respondents in the south blamed Russia.",
    "Catholics across Ukraine continued to blame Russia, with 90.7% in September 2024 and 90.6% in February 2025.",
    "Overall, there has been a small drop in the percentages of those blaming Russia – with war fatigue a possible reason.",
    "Consequences for peace Our findings suggest that in times of collective threat, divisions within a society tend to fade as people come together to face a common enemy.",
    "And that could have huge consequences now, as various parties, including the U.S., look at peace proposals to end the Russia-Ukraine war.",
    "Among the options being explored is a scenario in which the current front lines are frozen.",
    "This would entail recognizing the Russian-occupied territory of Crimea and the separatist regions of Donetsk and Luhansk as part of Russia.",
    "But it would also effectively relinquish Ukraine’s southeastern provinces of Kherson and Zaporizhzhia to Russia.",
    "While our surveys cannot speak to how this will go down among the people of Crimea, Donetsk and Luhansk, the study did include Kherson and Zaporizhzhia.",
    "And our findings show that the sense of Ukrainian identity strengthened even among Russian-speaking people in those areas."
  ],
  "topics": {
    "Energy": 0.7226505875587463,
    "Culture": 0.6813030242919922,
    "Diplomacy": 0.677685558795929,
    "Transport": 0.6770980954170227,
    "Economy": 0.6212113499641418,
    "Conflict": 0.6118732690811157,
    "Politics": 0.578723132610321,
    "Elections": 0.5603129267692566,
    "Military": 0.5209493637084961,
    "Health": 0.515872061252594,
    "Environment": 0.5129649043083191,
    "Education": 0.47861936688423157,
    "Technology": 0.3369828164577484,
    "Crime": 0.325452595949173
  },
  "sentiment": {
    "positive": 0.354,
    "negative": 0.646,
    "neutral": 0.0
  }
}