{
  "title": "How a common enemy is pushing Afghanistan's Taliban closer to Russia",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-16/russia-offers-support-to-the-taliban-to-fight-afghan-isis/105271142",
  "original_language": "en",
  "cleaned_sentences": [
    "How a common enemy is pushing Afghanistan's Taliban closer to Russia Russia's involvement in Afghanistan stretches as far back as the 19th century.",
    "Sitting at the crossroads of Central and South Asia, Afghanistan was (and is) considered strategically important and served as a buffer between the empires of Tsarist Russia and British India — both at their heights.",
    "The Russian empire initiated contact with Kabul in 1837 and after later becoming the Soviet Union, was the first country to establish formal diplomatic relations with it in 1919.",
    "Sixty years later, the same Soviets invaded Afghanistan in a watershed event that set off a decade-long war and spawned a resistance movement that grew into what is the modern-day Taliban.",
    "Most nations remain distanced with the group, which retook control of Afghanistan in 2021, but Vladimir Putin's Russia wants to work more closely with it.",
    "That largely relates to counter-terrorism efforts against Afghanistan-based Islamic State (ISIS), but it also comes amid a battle for hegemony in Central Asia, where China sees an opportunity amid Russia's ongoing invasion of Ukraine.",
    "Diplomatic defrost Moscow has been one of a handful of global players who have sought to grow their ties with Afghanistan since the chaotic 2021 withdrawal of US-armed troops from Kabul swept the Taliban back to power.",
    "Last month, Russia's top court formally removed the Taliban from its list of terrorist organisations and lifted a ban on the group put in place in 2003.",
    "Russia's presidential envoy to Afghanistan Zamir Kabulov said earlier this month the suspension of that ban \"finally removes all obstacles to full cooperation between our countries in various fields\", but insisted that the cooperation between Moscow and Kabul \"continues de facto\".",
    "No country, nor the UN, has officially recognised the Afghan government under Taliban rule post-August 2021 over the group's human rights record, but many have maintained engagements through both official and informal channels.",
    "Russia has an embassy and a consulate-general in Afghanistan, and has offered to accredit an Afghan ambassador in Moscow.",
    "Dozens of countries have diplomatic missions in Afghanistan, while the Taliban itself has control of at least 39 Afghan embassies all over the world.",
    "In its latest show of support for the de facto administration, Russia has indicated it will provide \"specialised\" help for the Taliban to fight ISIS's Afghan branch, Islamic State Khorasan (ISIS-K), a group seen as having been \"fixated on Russia\" and vocally anti-Putin in recent years.",
    "Moscow's willingness to play a proactive role in Afghanistan's security affairs at a time when it is faced with all-round constraints on the Ukraine war front is due to a heightened threat of violent extremism at home, according to analysts.",
    "Quelling ISIS-K Mr Kabulov, said earlier this month that the Kremlin would undertake concerted efforts with Taliban authorities to combat what it saw as a \"common enemy\" in ISIS-K. \"We see and appreciate the efforts that the Taliban are making in the fight against the Afghan wing of ISIS, which professes the ultra-radical ideology of 'global jihad'\", he told Russian state-run agency RIA.",
    "\"We will provide all possible assistance to the authorities of this country (Afghanistan) through specialised structures.\"",
    "ISIS-K has claimed responsibility for two terrorist attacks on Russia in the past three years: In September 2022 against the Russian embassy in Kabul and in March last year against the Crocus City Hall outside Moscow.",
    "Last year's mass shooting saw more than 130 people killed in what was the deadliest terror attack in Europe in 20 years.",
    "ISIS has previously claimed responsibility for attacks it did not commit but US intelligence and other evidence also pointed to the organisation as responsible.",
    "Four months after that incident, Mr Putin said the \"Taliban are certainly our allies in the fight against terrorism\", notwithstanding its illegitimate status.",
    "ISIS-K emerged as a breakaway faction of the Pakistani Taliban in 2015 and has been linked to numerous deadly attacks across Asia and Europe.",
    "Today it has an established presence across Afghanistan but is a sworn enemy of the Afghan Taliban.",
    "The group has also had its grievances with Russia for years.",
    "\"ISIS-K accuses the Kremlin of having Muslim blood on its hands, referencing Moscow's interventions in Afghanistan, Chechnya and Syria,\" counterterrorism analyst Colin P. Clarke said after the Crocus City Hall attack last year.",
    "Islamic State, and its precursor groups, have been linked to several attacks against Russia since the early 2000s.",
    "ISIS as a whole has grown in strength since 2019, although ISIS-K's attacks in its core areas of operation in Afghanistan have decreased in the face of pressure from the Taliban after it returned to power in 2021.",
    "According to the Global Terrorism Index's most recent report, ISIS and its affiliates remained the world's deadliest terrorist group in 2023.",
    "The report also found Russia continued to be the country most affected by terrorism in the Russia and Eurasia region and 35th worldwide.",
    "'Political signalling' Countering the security threats emanating from Afghan soil, particularly from ISIS-K, is Russia's main motivation to provide assistance to the Taliban, said Aleksei Zakharov, a fellow with the Observer Research Foundation's (ORF) Strategic Studies Programme.",
    "\"When it comes to Afghanistan, ISIS-K is seen by Russia as a primary threat.",
    "This has been Moscow's long-standing position since the mid-2010s, which actually led Russia to align itself more closely with the Taliban, even before they took over Kabul in 2021,\" he said.",
    "So far nothing suggests that assistance will eventuate into any form of bilateral defence agreements between the two nations.",
    "Even if it were to, a Russia-Taliban military pact alone would likely fail to stabilise Afghanistan's security situation without external actors becoming involved, Mr Zakharov said.",
    "\"It is more of a symbolic political statement showing Russia's intention to deepen ties with the Taliban government and exchange information on the security front,\" he said.",
    "\"The broader idea is to get a grip on terrorist activities in Afghanistan and neighbouring Central Asian states.",
    "This will be difficult to achieve, given the Taliban's poor track record on fighting terrorism, while radical ideas are flowing into Central Asia not only from Afghanistan, but also from the Middle East.\"",
    "\"Russia's activity in statements about its assistance to the Taliban may actually be part of the political signalling, inviting foreign partners for cooperation and coordination on the situation in Afghanistan.\"",
    "Economic interests Counter-terrorism is one of many areas of expanding cooperation between Russia and the Taliban.",
    "Following the group's terror delisting in April, the Kremlin said it aims to strengthen trade, business and investment relations with Kabul, leveraging Afghanistan's strategic position for energy and infrastructure projects.",
    "Energy trade forms a key part of those economic ties.",
    "Russia remains the world's second-largest exporter of crude oil, but sanctions imposed by the US and Europe post the 2022 invasion of Ukraine have led it to search for new trade routes and markets in Asia.",
    "Moscow aims for improved trade mobility through its International North-South Transport Corridor (INSTC), a proposed railway route connecting Russia to the Indian Ocean via Iran, but the project is not fully complete.",
    "In the meantime, Russia has said it wants to use Afghanistan as a transit hub for exporting fossil fuels to the booming markets of India and Pakistan through a gas pipeline, as well as other goods through rail routes.",
    "The INSTC currently does not have a southward transport route from Russia.",
    "Opening up a trans-Afghan pathway in the Pakistani direction has been seen as beneficial for Russia amid instability in the Middle East and the involvement of Iran, an important link in the supply chain between India and Russia.",
    "\"In an ideal scenario, Russia's strengthened ties with Kabul could be beneficial for the wider region,\" Mr Zakharov said.",
    "\"The transport corridors that are expected to run through Afghan territory could boost trade between Central and South Asia and provide some of the landlocked countries with access to the Indian Ocean,\" he said.",
    "\"However, any investment into Afghanistan depends on the security situation and stability, which are far from being normal.\"",
    "Mineral development and gas pipeline projects have been floated as possible joint economic ventures to be discussed at a Russia-Afghan business forum later this month in the Russian city of Kazan.",
    "The China factor Central Asia, comprised of five former Soviet Republics (and informally Afghanistan), has long been considered as under Russia's sphere of influence, but the Ukraine war has diverted much of its focus away from it.",
    "That distraction has proved opportune for China to expand its \"political clout\", a shift Russia would want to resist, wrote Dr Dawood Azmi for the Caspian Policy Center.",
    "\"While Russia seeks to maintain influence in its traditional sphere of influence, Moscow's entanglement in the Ukrainian quagmire is making it harder for Moscow to dedicate the same amount of resources and attention to this region,\" he said.",
    "Dr Azmi said a Central Asian landscape under diminished Russian reach could see China \"fill the vacuum, mainly due to its geographical proximity and huge economic potential\".",
    "\"As part of its efforts to better secure its geo-political and geo-economic interests, Xi (Jinping)-led Chinese policies in the Central Asia republics … are now also focused on enhancing military cooperation and countering the influence of major powers competing with China for a greater role in the region.\"",
    "That view was backed by a peer-reviewed paper in the Texas National Security Review, which noted indications Moscow was \"perceived as unreliable\" by its Central Asian partners — Kazakhstan, Kyrgyzstan, Uzbekistan, Tajikistan and Turkmenistan — post the Ukraine war, but that even before the 2022 invasion, a cultural distancing from Russia had started taking place.",
    "\"In this situation, China is poised to supplant Russia as the dominant power and security provider in the region,\" it said.",
    "Beijing's increased involvement in Central Asia since 2022 is evident on many fronts: Chinese President Xi Jinping met with all five Central Asian leaders at the China-Central Asia Summit in May 2023, committing support for their sovereignty and territorial integrity; China's trade with the region increased considerably in 2022-2024 and it overtook Russia as the largest trading partner for every Central Asian country but Turkmenistan; direct Chinese investment in the region exceeded Russia's by mid-2023, reaching $US63.9 billion ($99.4 billion) compared to the latter's $US23.9 billion.",
    "For Taliban-ruled Afghanistan, which by and large remains a global pariah, there is equal reliance on China and Russia to help \"break its international diplomatic isolation\" and attract aid and investment, Dr Azmi said.",
    "\"Given their centuries-old political, economic, and cultural links, a degree of mutual understanding exists between the Central Asian republics and Russia compared to China.",
    "\"The question is, whether China, if given the choice, would be a better deal for Central Asia than Russia in the long run?\""
  ],
  "topics": {
    "Diplomacy": 0.9750580787658691,
    "Conflict": 0.9605892300605774,
    "Politics": 0.9601982831954956,
    "Energy": 0.9542570114135742,
    "Culture": 0.9476732015609741,
    "Environment": 0.9438543915748596,
    "Transport": 0.9400829076766968,
    "Economy": 0.9370181560516357,
    "Technology": 0.9263846278190613,
    "Education": 0.9148391485214233,
    "Elections": 0.9144873023033142,
    "Crime": 0.9021618366241455,
    "Health": 0.8861731886863708,
    "Military": 0.8468624353408813
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}