{
  "title": "European leaders say Donald Trump agreed to sanction Russia unless ceasefire agreed",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224",
  "original_language": "en",
  "cleaned_sentences": [
    "European leaders say Donald Trump agreed to sanction Russia unless ceasefire agreed In short: Ukraine and European leaders have agreed to an unconditional 30-day ceasefire from May 12 with the backing of US President Donald Trump.",
    "The leaders threatened Russian President Vladimir Putin with new \"massive\" sanctions if he failed to comply.",
    "The leaders called for a 30-day ceasefire to start on Monday and asked Russia to engage in \"talks on a just and lasting peace.\"",
    "Ukraine and European leaders have agreed to an unconditional 30-day ceasefire from May 12 with the backing of US President Donald Trump, threatening Vladimir Putin with new \"massive\" sanctions if he failed to comply.",
    "The announcement was made by the leaders of Britain, France, Germany, Poland and Ukraine after a meeting in Kyiv, during which they held a phone call with Mr Trump.",
    "\"All of us here together with the US are calling Putin out,\" British Prime Minister Keir Starmer said.",
    "\"If he is serious about peace, then he has a chance to show it.\"",
    "Soon after the European leaders' announcement, the Kremlin appeared to pour scorn on it.",
    "\"We hear many contradictory statements from Europe.",
    "They are generally confrontational in nature rather than aimed at trying to revive our relations.",
    "Nothing more,\" Kremlin spokesman Dmitry Peskov said, according to Russian news agency Interfax.",
    "The group of European leaders arrived in Kyiv on Saturday in a joint show of support, and the group spoke with US President Donald Trump on the phone, the Ukraine foreign minister said.",
    "Ukrainian President Volodymyr Zelenskyy and the visiting head of states Mr Starmer, Emmanuel Macron, Friedrich Merz and Donald Tusk discussed their peace efforts with Mr Trump.",
    "\"We reiterate our backing for President Trump's calls for a peace deal and call on Russia to stop obstructing efforts to secure an enduring peace,\" the leaders said in a joint statement.",
    "\"Alongside the US, we call on Russia to agree a full and unconditional 30-day ceasefire to create the space for talks on a just and lasting peace.\"",
    "Australian Prime Minister Anthony Albanese said Australia would \"continue to stand with Ukraine\".",
    "In a statement on X, Ukrainian Minister for Foreign Affairs Andrii Sybiha said the phone call was \"productive\" and Ukraine and all its allies were ready for a 30-day ceasefire.",
    "In March, the United States proposed an immediate, limited 30-day truce which Ukraine accepted, but the Kremlin has held out for terms more to its liking.",
    "First time these leaders travelled together to Ukraine The leaders of France, Germany, Poland and the United Kingdom arrived together at the train station in Kyiv.",
    "They met President Zelenskyy shortly after to join a ceremony at Kyiv's Independence Square marking the 80th anniversary of the end of World War II.",
    "At a makeshift flag memorial for fallen Ukrainian soldiers and civilians slain since Russia's invasion, the leaders lit candles and paid tribute.",
    "The visit marked the first time the leaders of the four countries have travelled together to Ukraine, while Friedrich Merz is making his first visit to Ukraine as Germany's new chancellor.",
    "\"What's happening with Poland, Germany and Great Britain is a historic moment for European defense and toward a greater independence for our security,\" French President Emmanuel Macron said.",
    "\"Obviously for Ukraine, but for all of us.",
    "It's a Europe that sees itself as a power.\"",
    "Their visit came on the last day of a unilateral three-day ceasefire declared by Moscow, to coincide with its own celebrations marking the defeat of Nazi Germany.",
    "Mr Sybiha on Thursday called that truce a \"farce,\" accusing Russian forces of violating it over 700 times less than a day after it formally came into effect.",
    "Both sides also said attacks on their troops had continued on Thursday."
  ],
  "topics": {
    "Economy": 0.9382655024528503,
    "Politics": 0.8943091630935669,
    "Environment": 0.8883047103881836,
    "Health": 0.8554899096488953,
    "Conflict": 0.836233377456665,
    "Military": 0.8223392963409424,
    "Diplomacy": 0.7957465052604675,
    "Culture": 0.7605316042900085,
    "Energy": 0.6897094249725342,
    "Technology": 0.6729527711868286,
    "Transport": 0.5734561681747437,
    "Elections": 0.5436845421791077,
    "Education": 0.3973061442375183,
    "Crime": 0.239580437541008
  },
  "sentiment": {
    "positive": 0.607,
    "negative": 0.393,
    "neutral": 0.0
  }
}