{
  "title": "Keep calm and carry on buying: how Ukrainian consumers are hitting back at Russia",
  "published_date": null,
  "url": "https://theconversation.com/keep-calm-and-carry-on-buying-how-ukrainian-consumers-are-hitting-back-at-russia-256000",
  "original_language": "en",
  "cleaned_sentences": [
    "Political conflicts and global tensions always affect people on the ground and across borders.",
    "Unable to influence events such as the ongoing war against Ukraine or proposed sweeping US tariffs, people turn to whatever resources are available for defending their livelihoods, institutions and communities.",
    "This explains the recent surge of boycotts and “buycotts” where consumers swerve a brand or actively support it for political reasons.",
    "For example, shoppers across the world are replacing US goods with local alternatives to protect national pride and economies.",
    "In the early days of Russia’s 2022 full-scale invasion of Ukraine, shoppers were making similar public commitments to boycott Russian products.",
    "But there are many other ways in which brands and consumers responded to the start of the invasion in 2014.",
    "Global and local reactions from brands included donations, divestment, the creation of new products or product names and advertising and social media content linked to the invasion.",
    "In turn, consumer responses to these brand initiatives are a form of civic action.",
    "In a study we undertook (along with our colleagues Carlo Mari, Verónica Martín Ruiz and Lizette Vorster), we analysed how marketing professionals and ordinary consumers create and interpret products and brands explicitly or implicitly acknowledging the war in Ukraine.",
    "To do this, we conducted in-depth interviews with marketing managers and consumers and analyses of brand and product imagery.",
    "Our findings highlight three ways that marketing resources and consumer responses support psycho-social and cultural resilience in war-affected communities.",
    "Using satire to ease symbolic threat Humour and satire have long been used for addressing pressing societal issues, and many brands in Ukraine have embraced them in response to the invasion.",
    "For example, mayonnaise brand Ukrop Style, marketed by Ukrainian firm Olkom, leant on satire to boost consumer morale.",
    "The term “Ukrop” (meaning “dill” in Ukrainian) has been used by Russia as a slur against Ukrainians since the beginning of the war.",
    "Several “ukrop”-themed products and services then sprang up to reclaim the word and its imagery.",
    "It was used in new product names and packaging, as Olkom did.",
    "Several participants in our study discussed engagement with brands like this to mobilise the public spirit of defiance.",
    "For them, the use of humour helped lessen the insult directed at their nation.",
    "National symbols for societal cohesion When people perceive that their society and way of life is under threat, they often turn to cultural symbols.",
    "These can help to assert connections with others.",
    "Several brands have incorporated symbolic references to Ukraine in their communication messages, with national flags and designs depicting vyshyvanka embroidery (which is specific to traditional Ukrainian shirts).",
    "A Samsung advert using vyshyvanka, traditional Ukrainian garments and the phrase “Evolution is beautiful” evokes Ukraine’s 2014 Revolution of Dignity and the shared Ukrainian identity built on dignity, freedom and togetherness.",
    "Promoting the origin of products Between 2014 and 2022, Ukraine and Russia continued to trade in consumer goods.",
    "During this time, several major retail chains in Ukraine used flags to mark the origin of products.",
    "These marketing signals kept consumers informed, but potentially also supported boycotts and buycotts.",
    "Since 2022, Ukraine’s trade in consumer goods with Russia has ceased.",
    "But the labelling of Ukraine-made goods has grown.",
    "The Ukrainian ministry of economy has launched a “Made in Ukraine” trademark, encouraging people to support local manufacturers.",
    "Even when brand boycotts are no longer needed – as is the case with Ukraine and Russia, since the two countries no longer trade – consumers still use their collective power to support their local economy.",
    "The response of consumers Participants in our study shared the view that brand activism and marketing related to political shocks can offer people an outlet for a civic response.",
    "It also opens up conversations about the distressing events affecting them and their country.",
    "Some described these marketing activities as grassroot initiatives by fellow citizens – owners and managers of brands engaging in activism.",
    "Others stressed that their willingness to support brand activism is dependent on whether they perceive it as sincere or mere profit-seeking.",
    "Few interviewees separated private consumption from political views and actions.",
    "Brand activism and marketing related to conflict and political shocks could well be a trend that will grow in scale and scope.",
    "After all, consumption remains one domain where people have collective power.",
    "Boy/buycotting movements responding to the US tariffs are gaining momentum, while the #buyforukraine and #shopukrainian initiatives have stood the test of time.",
    "Brands and governments may be tempted to leverage this social sentiment, but here our research tells a cautionary tale.",
    "The consumers we interviewed were savvy in their assessment of the sincerity of brand activism.",
    "And they held different views about its appropriateness as a form of civic action.",
    "Brand activism merely seeking to encourage sales may backfire, evoking consumer cynicism rather than support.",
    "For example, brands like Unilever and Pepsi were criticised for appearing to be insincere in their announced suspension of sales and production in Russia.",
    "At the same time, brand activism increasingly requires careful, nuanced consideration.",
    "More widely, consumers are not united on whether companies should take positions on political and social issues.",
    "Whether brand activism proves to be this century’s “Keep Calm and Carry On” remains to be seen."
  ],
  "topics": {
    "Politics": 0.9065559506416321,
    "Conflict": 0.9028478860855103,
    "Culture": 0.9028151631355286,
    "Diplomacy": 0.8498656749725342,
    "Energy": 0.8260267376899719,
    "Economy": 0.8188804984092712,
    "Transport": 0.7650237083435059,
    "Environment": 0.7625285387039185,
    "Health": 0.7543949484825134,
    "Crime": 0.7218214869499207,
    "Elections": 0.7173826694488525,
    "Technology": 0.6821171641349792,
    "Military": 0.6423218846321106,
    "Education": 0.6295750141143799
  },
  "sentiment": {
    "positive": 0.622,
    "negative": 0.378,
    "neutral": 0.0
  }
}