{
  "title": "Anthony Albanese tells Volodymyr Zelenskyy Australia doing 'whatever we can' to pressure on Russia",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-19/albanese-meets-zelenskyy-and-the-pope-in-rome/105308062",
  "original_language": "en",
  "cleaned_sentences": [
    "Anthony Albanese tells Volodymyr Zelenskyy Australia doing 'whatever we can' to pressure Russia In short: Anthony Albanese has assured Ukrainian President Volodymyr Zelenskyy that Australia is doing \"whatever we can\" to place pressure on Russia.",
    "The prime minister held talks with Mr Zelenskyy and European Commission President Ursula von der Leyen in the wake of Pope Leo XIV's inaugural mass in Vatican City.",
    "Mr Albanese also met briefly with the pope, telling him that his late mother would be \"looking down from heaven with the biggest smile she's ever had\".",
    "Anthony Albanese has assured Volodymyr Zelenskyy that Abrams tanks are now \"on the way\" to the war-torn country to help it push back Russia's invasion, after meeting Ukraine's president in Rome.",
    "The prime minister has also responded cautiously to a push from the European Union to deepen defence cooperation, after European Commission President Ursula von der Leyen proposed a new security partnership with Australia.",
    "Mr Albanese held talks with both European political heavyweights in the wake of Pope Leo XIV's inaugural mass in Vatican City on Sunday morning — an event which drew dozens of leaders and top officials from across the globe.",
    "Mr Albanese also met briefly with the pope after the mass, telling the new pontiff that his late mother would be \"looking down from heaven with the biggest smile she's ever had\", watching him attending the mass as prime minister.",
    "Mr Albanese's talks with Mr Zelenskyy focused on how Australia could help maximise pressure on Russia in the wake of stalled peace talks in Türkiye last week.",
    "Australia has provided about $1.5 billion in support to Ukraine, but the ABC revealed last month the fleet of retired Abrams tanks pledged to Ukraine last year remained stuck in Australia.",
    "But Mr Albanese told Mr Zelenskyy at the opening of the meeting that the tanks were now \"on their way\".",
    "However, he declined to provide any details to journalists after the meeting, suggesting that would undermine Ukraine's war effort.",
    "Mr Zelenskyy responded by thanking Mr Albanese for the \"news\" about the tanks, and praised Australia's contribution to helping Ukraine resist Russian aggression.",
    "Loading...Australia has already sanctioned some 1,400 Russian individuals and entities, but the Ukrainian president suggested he would like to see even more action from the federal government.",
    "\"Together we can really move this situation closer to peace, with pressure on Russia,\"Zelenskyy said.",
    "\"And we're very thankful for sanctions.",
    "I want to raise with you also this topic, which is very important: Put more pressure, more sanctions on Russia.\"",
    "The prime minister signalled he was open to that, saying Australia would \"continue to look at whatever we can do to place pressure on Russia\".",
    "The two men also discussed Australian Oscar Jenkins, who was sentenced to 13 years in a high-security Russian jail after being captured fighting for Ukraine in December last year.",
    "Mr Albanese said Australia continued to \"seek his freedom and his return to Australia and we thank you for the assistance in that\", suggesting Ukraine might be open to trying to secure his release through a broader prisoner swap with Russia down the track.",
    "EU sees Australia as 'strategic partner' Russia's invasion of Ukraine also featured in the prime minister's talks with Ms von der Leyen.",
    "The European Commission chief opened the meeting by saying that the EU saw Australia not just as a \"trading partner\" but as a \"strategic partner\" as well.",
    "She also suggested that the sharp deterioration of the global strategic environment should compel Australia and the EU to develop stronger defence and strategic ties.",
    "\"We would very much like to broaden this strategic partnership,\" she told Mr Albanese.",
    "\"For example, we have signed security and defence agreements with South Korea and with Japan [and] soon with the UK.",
    "\"We would be very pleased if we could develop such a security and defence partnership too, just to broaden the strategic partnership in many topics that we have in common.\"",
    "The agreements set a broad framework to bolster security cooperation across a range of fields.",
    "For example, the security partnership between the EU and Japan commits both sides to \"concrete cooperation in maritime security, space, cybersecurity, hybrid threats including foreign information manipulation and interference\".",
    "But the prime minister responded cautiously, saying that while Australia was \"certainly interested\" in the idea, it was at the \"very early stages\" at this point.",
    "\"I wouldn't over-read what [the] Ursula von der Leyen statements were,\" he said.",
    "\"It was a suggestion by the president that the relationship was based upon not just economic relations, but based upon our values.\"",
    "The prime minister also told reporters that he met privately with members of his Italian family in Rome yesterday, after they travelled from Italy's Puglia region to see him, including his half-brother and his wife and daughter.",
    "\"That was a great privilege,\" Mr Albanese said \"They came up to Rome and it was very nice to spend a short period of time with them.",
    "\"They are very proud that someone who shares their name [is prime minister] … It was a really nice moment for them.\""
  ],
  "topics": {
    "Politics": 0.9764479398727417,
    "Culture": 0.964920163154602,
    "Diplomacy": 0.962186872959137,
    "Elections": 0.9548490643501282,
    "Economy": 0.9439650774002075,
    "Energy": 0.9430344104766846,
    "Conflict": 0.9427902698516846,
    "Environment": 0.942082405090332,
    "Technology": 0.9401267170906067,
    "Transport": 0.9352465271949768,
    "Health": 0.9234508275985718,
    "Education": 0.9227538108825684,
    "Military": 0.9103062152862549,
    "Crime": 0.8686937093734741
  },
  "sentiment": {
    "positive": 0.758,
    "negative": 0.242,
    "neutral": 0.0
  }
}