{
  "title": "Zelenskyy calls for Russia to agree to 'lasting' ceasefire before peace talks",
  "published_date": null,
  "url": "https://www.abc.net.au/news/2025-05-11/putin-proposes-direct-peace-talks-with-ukraine/105279076",
  "original_language": "en",
  "cleaned_sentences": [
    "Zelenskyy calls for Russia to agree to 'lasting' ceasefire before peace talks In short: Russian President Vladimir Putin has proposed peace talks with Ukraine during a visit to Istanbul on May 15.",
    "Ukrainian President Volodymyr Zelenskyy welcomed Mr Putin's proposal for direct talks, but said his team was expecting Moscow to agree to a \"lasting\" ceasefire starting May 12.",
    "Mr Putin said he would \"not rule out\" that Russia and Ukraine may \"be able to agree new ceasefires, a new truce\".",
    "Russian President Vladimir Putin has proposed direct peace talks with Ukraine to \"eliminate the root causes of the conflict\" after Ukraine proposed a 30-day ceasefire with the backing of NATO powers.",
    "Ukraine's president Volodymyr Zelenskyy has welcomed Mr Putin's proposal, but called for Moscow to agree to a \"lasting\" ceasefire, starting May 12, before talks take place.",
    "Russia invaded Ukraine in February 2022, sparking a conflict that has since seen about half a million casualties, according to estimates by US officials, and led to the displacement of an estimated 3.7 million people.",
    "Mr Putin said he would propose peace talks during a visit to Istanbul on May 15.",
    "\"It was not Russia that broke off negotiations in 2022.",
    "Nevertheless, we are proposing that Kyiv resume direct negotiations without any preconditions,\" Mr Putin said, referring to failed talks shortly after the Russian invasion of 2022.",
    "\"We offer the Kyiv authorities to resume negotiations already on Thursday, in Istanbul.",
    "\"Our proposal, as they say, is on the table, the decision is now up to the Ukrainian authorities and their curators, who are guided, it seems, by their personal political ambitions, and not by the interests of their peoples.\"",
    "Zelenskyy welcomes calls for talks In a post on X, Ukrainian President Volodymyr Zelenskyy said it was a \"positive sign\" that Russia had \"finally begun to consider ending the war\".",
    "\"The entire world has been waiting for this for a very long time.",
    "And the very first step in truly ending any war is a ceasefire,\" he said.",
    "\"There is no point in continuing the killing even for a single day.\"",
    "However, he said he expected Moscow to agree to a \"lasting\" ceasefire, starting on Monday.",
    "\"We expect Russia to confirm a ceasefire — full, lasting, and reliable — starting tomorrow, May 12th, and Ukraine is ready to meet,\"he said.",
    "Mr Zelenskyy's chief of staff Andriy Yermak said on Telegram there first had to a ceasefire, \"then everything else\".",
    "\"Russia should not disguise its desire to continue the war with vague statements,\" he said.",
    "Mr Putin's peace talks proposal came mere hours after European powers threw their support behind Ukraine's proposal for a 30-day ceasefire, with the support of the United States.",
    "US President Donald Trump said Mr Putin would face \"massive\" sanctions if he did not accept the proposal within days.",
    "\"All of us here together with the US are calling Putin out,\" British Prime Minister Keir Starmer said.",
    "Russia dismissed the call for a ceasefire and the threat of sanctions.",
    "Hours after Mr Putin spoke, Ukraine's air force warned of a drone attack on the capital, Kyiv.",
    "The city's mayor said air defence units were trying to repel a Russian air attack, and Reuters witnesses heard blasts from what sounded like air defence units in operation.",
    "'Eliminate the root causes of the conflict' The Russian leader said he would speak to Turkish President Recep Tayyip Erdoğan on Sunday to discuss the details.",
    "Mr Putin said he would \"not rule out\" that Russia and Ukraine may \"be able to agree new ceasefires, a new truce\".",
    "\"We are committed to serious negotiations with Ukraine.",
    "Their purpose is to eliminate the root causes of the conflict, to establish a long-term, lasting peace for the historical perspective.\"",
    "In a 2021 essay pre-dating the full-scale invasion of Ukraine, the Russian president made the case for incorporating Ukraine into Russia.",
    "The 5,000-word document claimed that Russians and Ukrainians were \"one people\", and blamed poor ties between the two countries on foreign plots."
  ],
  "topics": {
    "Conflict": 0.7802429795265198,
    "Politics": 0.7504855394363403,
    "Culture": 0.6653559803962708,
    "Technology": 0.6295201182365417,
    "Diplomacy": 0.6053301095962524,
    "Economy": 0.5625019669532776,
    "Environment": 0.5482069253921509,
    "Military": 0.5244014859199524,
    "Health": 0.4505378007888794,
    "Energy": 0.43762609362602234,
    "Transport": 0.3978704810142517,
    "Elections": 0.38709723949432373,
    "Education": 0.33187341690063477,
    "Crime": 0.24871793389320374
  },
  "sentiment": {
    "positive": 0.387,
    "negative": 0.613,
    "neutral": 0.0
  }
}