{
  "title": "Documento forte motivou Rússia a criar 'fabricar espiões' no Brasil",
  "published_date": null,
  "url": "https://noticias.uol.com.br/internacional/ultimas-noticias/2025/05/23/documento-forte-motivou-russia-a-criar-fabricar-espioes-no-brasil.htm",
  "original_language": "pt",
  "cleaned_sentences": [
    "Brazil's strong passport motivated Russia to have spy factory; understand Read News Summary The American newspaper \"The New York Times\" revealed in an investigative report that Russian spies have been using Brazil as a base for years.",
    "The organization was able to obtain true birth certificates to facilitate the movement of its agents in the country.",
    "All this effort had one goal: to get documents - including passport - Brazilians.",
    "But, after all, what is the strength of this document in the global scenario?",
    "What is the importance of the Brazilian passport?",
    "To date, at least nine Russian agents have been identified using false Brazilian identities.",
    "The Federal Police investigation has already extended to at least eight countries and was supported by intelligence services in the United States, Israel, the Netherlands, Uruguay and other nations.",
    "The purpose of the infiltrates was not to spy on Brazil, but to acquire Brazilian nationality to obtain documents from the country.",
    "Different rankings place the Brazilian passport in various positions regarding its influence and power.",
    "According to Canadian consultancy Arton Capital, which specializes in financial services and citizenship, Brazil occupies 43rd position in a general ranking, but is classified in 11th place in terms of influence, as it ties with other countries in various criteria.",
    "The Brazilian passport is considered the most powerful in Latin America.",
    "According to this analysis, Brazilians can enter 109 countries without the need for a visa.",
    "In total, the document is accepted in 166 countries: of these, 51 require visa on arrival and another 6 call for electronic travel authorization.",
    "32 countries require a previously obtained view - as in the United States, which require visa for Brazilian tourists.",
    "On average, the Brazilian passport offers access to 83% of the world without the need for additional bureaucratic procedures.",
    "Henley Passport Index positions the passport of Brazil in 17th place in the world.",
    "This ranking is based on data from the International Air Transport Association (IATA), considered the largest and most reliable source of information on international travel.",
    "According to Henley's survey, Brazilians currently have access to 173 countries without visa requirement.",
    "Among the countries of South America, two neighbors stand out right in front of Brazil: Chile, in 15th place, and Argentina, in 16th.",
    "Investigation began after CIA warning In April 2022, about two months after Russia invaded Ukraine, CIA (US intelligence) sent a warning to Brazil.",
    "In the message, he said that a Russian military intelligence agent had applied for an internship at the Hague court in the Netherlands.",
    "In the same period, the court began to investigate Russia's war crimes in Ukraine.",
    "Russian agent had Brazilian documents.",
    "Victor Muller Ferreira was actually Sergey Cherkasov.",
    "He was barred by the immigration of the Netherlands and was on the way back to Sao Paulo.",
    "With no cool basis to arrest Cherkasov, the PF began to monitor it.",
    "Until the police got a warrant to arrest the Russian for the use of false documents.",
    "Cherkasov denied accusations of espionage in testimony.",
    "According to the newspaper, he was annoyed by the questions, besides having all the authentic Brazilian documents, such as passport, voter title and reservist certificate.",
    "Analysis of the birth certificate made history collapse.",
    "The PF found that the woman registered as the mother of Victor Muller Ferreira had died.",
    "Her family, however, confirmed that she had no children.",
    "Already the father, never existed.",
    "Of the spies involved, only Cherkasov remains arrested.",
    "He was sentenced to 15 years in prison for falsification of documents, a penalty later reduced to five.",
    "In an apparent maneuver to repatriate him, the Russian government claimed that he was a sought after drug trafficker and asked his extradition to court, but was not released by Brazil.",
    "With information from December 2024 and January 2024.",
    "See also Leave your comment The author of the message, not UOL, is responsible for the comment.",
    "Read the rules of use of UOL."
  ],
  "topics": {
    "Crime": 0.7575851082801819,
    "Conflict": 0.6810745000839233,
    "Politics": 0.6678232550621033,
    "Transport": 0.6460667848587036,
    "Technology": 0.578009307384491,
    "Culture": 0.5403227806091309,
    "Health": 0.5196883082389832,
    "Military": 0.5189793705940247,
    "Environment": 0.5040535926818848,
    "Elections": 0.5002229809761047,
    "Economy": 0.49946773052215576,
    "Diplomacy": 0.4928494393825531,
    "Energy": 0.43005284667015076,
    "Education": 0.38341212272644043
  },
  "sentiment": {
    "positive": 0.436,
    "negative": 0.564,
    "neutral": 0.0
  }
}