{
  "title": "Rússia e Ucrânia libertam os primeiros 390 prisioneiros no início da maior troca da guerra",
  "published_date": null,
  "url": "https://www.brasil247.com/mundo/russia-e-ucrania-libertam-os-primeiros-390-prisioneiros-no-inicio-da-maior-troca-da-guerra",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia and Ukraine release the first 390 prisoners at the beginning of the largest war exchange The announcement was confirmed by authorities from both countries and publicly highlighted by the Trump government 247 - In one of the biggest prisoners exchange agreements since the beginning of the war, Russia and Ukraine released on Thursday (23) a total of 390 prisoners of war, in a negotiation mediated by third parties.",
    "The announcement was confirmed by authorities from both countries and publicly highlighted by US President Donald Trump, who claimed to have assisted the negotiations.",
    "According to Reuters, Ukraine was able to repact 210 soldiers and civilians, including Mariupol defenders and fighters who had been in captivity for months.",
    "On the Russian side, 180 military personnel were returned.",
    "The Government of the United Arab Emirates acted as a mediator in the process.",
    "Ukrainian President Volodymyr Zelensky thanked the negotiation team and reaffirmed the commitment to bring all the prisoners back.",
    "\"Each life saves is a victory,\" he said on his social networks.",
    "Already the Ministry of Defense of Russia classified the agreement as a \"act of goodwill\".",
    "Donald Trump, who recently became involved in conflict -related diplomatic efforts, said in a post on his social Truth platform that the exchange was \"a great step towards peace\" and praised the participation of the United Arab Emirates.",
    "Despite the advance in humanitarian negotiations, the front line fighting follows intense, without immediate prospects for a ceasefire.",
    "Context Russia launched the “Special Military Operation” in Ukraine in February 2022.",
    "Russian authorities claim that the offensive aims to protect the Russian population submitted to genocide by the Kiev regime.",
    "Moscow declares that it is necessary to remove military forces and neo -Nazi elements from Ukraine to achieve these goals.",
    "Ukraine authorities deny associations with Nazism, stating that the country's politics is completely free of fascists.",
    "Kiev argues that the Russian invasion is a war of aggression and imperialist expansion.",
    "Russia attached four partially occupied Ukrainian regions in October 2022.",
    "In August 2024, Ukraine invaded Russian territory and began a limited occupation.",
    "Several countries, especially NATO (North Atlantic Treaty Alliance), provided military and financial assistance to Ukraine and implemented sanctions against Russia.",
    "Iran and North Korea assisted at different levels the Armed Forces of the Russian government.",
    "The government of President Luiz Inacio Lula da Silva presented, together with China in May 2024, a proposal for negotiations with the objective of promoting a diplomatic solution of the Ukrainian crisis (with Reuters).",
    "❗ If you have any positions to add to this article or some correction to do, contact redacao@brasil247.com.br.",
    "✅ Receive news from Brazil 247 and TV 247 on the 247 telegram and 247 channel on WhatsApp.",
    "Subscribe to 247, support by pix, subscribe to TV 247, Cortes 247 and watch:"
  ],
  "topics": {
    "Conflict": 0.9587641358375549,
    "Politics": 0.9480496644973755,
    "Technology": 0.8694926500320435,
    "Health": 0.8622017502784729,
    "Military": 0.8335656523704529,
    "Transport": 0.831950843334198,
    "Culture": 0.8125235438346863,
    "Economy": 0.8072054982185364,
    "Environment": 0.7333509922027588,
    "Energy": 0.7231125235557556,
    "Education": 0.6942884922027588,
    "Crime": 0.6909776329994202,
    "Diplomacy": 0.65028977394104,
    "Elections": 0.47223135828971863
  },
  "sentiment": {
    "positive": 0.565,
    "negative": 0.435,
    "neutral": 0.0
  }
}