{
  "title": "Rússia destrói sistema antimísseis norte-americano Patriot na Ucrânia",
  "published_date": null,
  "url": "https://www.brasil247.com/mundo/russia-destroi-sistema-antimisseis-norte-americano-patriot-na-ucrania",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia destroys US Antimissile System Patriot in Ukraine The US Patriot System, widely used by NATO, is considered one of the pillars of air defenses provided to the Ukrainian government through the West 247-The Armed Forces of Russia reached a Tactical Iskander-Mis, a position of the US Antimissile System Patriot in the Dneproperovsk region of Ukraine, according to the Russian Ministry of Defense in a statement published by TASS, on Wednesday (22).",
    "According to the statement, the attack occurred near the Ordzhonikidze settlement in eastern Ukraine.",
    "\"The crew of the Iskander-M tactical missile system performed an attack on the position of the Patriot anti-aircraft system near the Ordzhonikidze settlement in the DneProperovsk region,\" the folder said.",
    "According to the official note, the attack resulted in the complete destruction of crucial components of the US Air Defense System in Ukraine.",
    "\"As a result of the attack with missiles, the AN/MPQ-65 counterattack radar station, the combat control cabin and two Patriot missile launchers have been destroyed,\" says the Russian Ministry of Defense.",
    "The Patriot system, developed by the United States and widely used by NATO, is considered one of the pillars of air defenses provided to the Ukrainian government throughout the West.",
    "The destruction of its components on Ukrainian soil represents a relevant setback for Kiev forces, which depend on western technology to contain aviation advances and Russian missiles.",
    "The attack with the Iskander-M missile, a short-range and high precision ballistic system, reinforces the ability of the Russian forces to reach strategic targets with depth efficiently in the Ukrainian territory.",
    "Ukrainian authorities have not yet officially commented on the episode until the moment of publication of this matter.",
    "With this new attack, Russia signals that it maintains full capacity for identification and neutralization of strategic targets, even those protected by cutting -edge systems such as Patriot.",
    "The episode could influence the upcoming military decisions of Washington and NATO regarding the sending of high -tech weapons to Ukraine.",
    "❗ If you have any positions to add to this article or some correction to do, contact redacao@brasil247.com.br.",
    "✅ Receive news from Brazil 247 and TV 247 on the 247 telegram and 247 channel on WhatsApp.",
    "Subscribe to 247, support by pix, subscribe to TV 247, Cortes 247 and watch:"
  ],
  "topics": {
    "Conflict": 0.9199464917182922,
    "Culture": 0.8618408441543579,
    "Technology": 0.8392308354377747,
    "Military": 0.8077260851860046,
    "Politics": 0.7979291081428528,
    "Environment": 0.6941564083099365,
    "Economy": 0.6721394658088684,
    "Diplomacy": 0.6650172472000122,
    "Transport": 0.6498140096664429,
    "Health": 0.6319659948348999,
    "Education": 0.5592783689498901,
    "Energy": 0.5258668065071106,
    "Elections": 0.48146331310272217,
    "Crime": 0.47409191727638245
  },
  "sentiment": {
    "positive": 0.214,
    "negative": 0.786,
    "neutral": 0.0
  }
}