{
  "title": "Rússia usou Brasil para 'fabricar' espiões, revela jornal",
  "published_date": null,
  "url": "https://olhardigital.com.br/2025/05/22/seguranca/russia-usou-brasil-para-fabricar-espioes-revela-jornal/",
  "original_language": "pt",
  "cleaned_sentences": [
    "It looks like a script for some movie or spy series.",
    "Russia used Brazil as a starting point for its best spies, the New York Times has revealed this week.",
    "The agents created their personas here over the years.",
    "Then they left for missions in other countries.",
    "In practice, Brazil became a kind of Russian spy factory.",
    "But Federal Police agents have discovered a standard that allowed to identify the “illegal” (name given to the elite of Russian intelligence officers).",
    "This was possible after three years of investigation, called East Operation.",
    "Objective of the operation of Russia was not to spy on Brazil, but to make its spies Brazilian This is definitely not the first Russian spy operation discovered in the world.",
    "But it is at least one peculiar.",
    "This is because her goal was not to spy on Brazil.",
    "It was to make his Brazilian agents (Russians).",
    "In April 2022, the Federal Police received a message from the US Central Intelligence Agency (CIA).",
    "The warning was: a Russian military intelligence agent had applied to an internship at the International Criminal Court in the Netherlands.",
    "“Ok, where Brazil comes in this story?” You probably thought now.",
    "Well, the candidate traveled with a Brazilian passport.",
    "And it was barred by the Dutch immigration while trying to take a flight to Sao Paulo (SP).",
    "In the document, the boy's name was Victor Muller Ferreira.",
    "But, according to Cia, his real name was Sergey Cherkasov.",
    "He managed to travel and stayed in a hotel in the state capital.",
    "Eventually, police officers managed to arrest him.",
    "Not by espionage, but use of false documents.",
    "During the interrogation, Cherkasov insisted to be Brazilian.",
    "And presented documents to support his claim.",
    "Passport, voter title, certificate of completion of the compulsory military service.",
    "The story of Cherkasov and the \"factory\" of Russia spies in Brazil began to collapse when police found his birth certificate.",
    "The document was authentic, but Brazilian agents confirmed that Victor Muller Ferreira had never existed.",
    "Then police started hunting \"ghosts.\"",
    "That is, people with legitimate certificates, but without history in Brazil.",
    "Other ‘Brazilian’ Russian spies The Federal Police identified at least nine Russian agents with Brazilian identities, according to documents and interviews collected by the newspaper.",
    "After erasing the tracks of their Russian past, these spies opened companies, made friends and even lived novels in Brazil.",
    "One opened a jewelry store, for example.",
    "Thus they cultivated the facets of their new identities.",
    "Here, the mission was just to set up credible identities.",
    "Then the \"real work\" started.",
    "Protected by authentic Brazilian personas, they went to the United States, Europe, the Middle East.",
    "Abroad, the mission was to spy on.",
    "Read more: - Ia is the hope of UFO hunters in the USA - The 10 best spy/spy movies available to watch online - Spy application: what it is and how to know if your phone is being monitored The Federal Police investigation has reached at least eight countries, with the support of US intelligence services, Israel, the Netherlands, Uruguay and other Western allies.",
    "Operation “dismantled a group of highly trained and difficult to replace agents,” the newspaper said.",
    "At least two Russian agents were arrested.",
    "Others returned to Russia.",
    "\"With the identities exposed, it is unlikely to return to act abroad,\" says the newspaper report."
  ],
  "topics": {
    "Politics": 0.602484405040741,
    "Culture": 0.5810800790786743,
    "Crime": 0.5744157433509827,
    "Conflict": 0.5666899085044861,
    "Economy": 0.5622730851173401,
    "Military": 0.5435796976089478,
    "Diplomacy": 0.5349503755569458,
    "Technology": 0.47551509737968445,
    "Energy": 0.4653699994087219,
    "Elections": 0.46432775259017944,
    "Environment": 0.4496987760066986,
    "Transport": 0.44855913519859314,
    "Education": 0.41171014308929443,
    "Health": 0.34289202094078064
  },
  "sentiment": {
    "positive": 0.317,
    "negative": 0.683,
    "neutral": 0.0
  }
}