{
  "title": "Saiba quem eram os espiões russos no Brasil",
  "published_date": null,
  "url": "https://valor.globo.com/mundo/noticia/2025/05/21/saiba-quem-eram-os-espioes-russos-no-brasil.ghtml",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia, who is led by President Vladimir Putin, sent spies to Brazil to make them Brazilians through national identities and then sent them to the United States, Europe and the Middle East, where they would take action, according to a report published on Wednesday by the newspaper \"The New York Times\".",
    "In Brazil, spies opened companies, made friends, lived novels, and hid the tracks of the Russian past.",
    "The Federal Police, through the investigation called “Operation East”, discovered at least nine Russian spies with Brazilian identity, some of which were revealed by \"The New York Times.\"",
    "Know who they are: Sergey Cherkasov Cherkasov lived in Brazil under the name of “Victor Muller Ferreira”.",
    "He traveled with a Brazilian passport and, with this false identity, concluded a postgraduate degree at Johns Hopkins University in the United States.",
    "According to the NYT, when Cherkasov was barred by the Dutch immigration, he had a blue passport identical to any Brazilian.",
    "In addition, according to the operation of the PF, he had a voter title and a certificate of completion of compulsory military service.",
    "All documents were authentic.",
    "Cherkasov used the identity of someone who never existed.",
    "Although the document pointed out that \"Victor\" was the son of a real Brazilian mother, it was discovered that she never had children, according to \"NYT\".",
    "SHMYREV ARTEM With the identity of a citizen named Gerhard Daniel Campos Wittich, born in Rio de Janeiro in 1986, Shmyrev lived in Brazil with an excellent Portuguese, saying that he attributed the accent to past childhood in Austria.",
    "Shmyrev created a company called “3D Rio”, whose headquarters was on the 16th floor of a building in downtown Rio.",
    "According to \"NYT\", Shmyrev used to make unexpected trips to Europe and Asia, always aware of competition movements.",
    "I used to play by saying that it did “industrial espionage”.",
    "Sometimes he even sent an employee to intern in a rival company and bring strategic information.",
    "At the time of the facts, Shmyrev also had a Russian spy wife named Irina Shmyreva.",
    "With her, he exchanged messages saying that he felt frustrated with the spy's life, stating that: \"It's been two years since I'm not where I should be.\"",
    "Shmyrev lived in the Botafogo neighborhood of Rio de Janeiro, and told a friend that he would take a trip over a month to Malaysia.",
    "A few days after their departure, the Federal Police discovered their identity.",
    "However, it was late: Shmyrev never returned to Brazil.",
    "Aleksandr Utekhin A jeweler businessman with a store in Brasilia, Utekhin had his fake identity with the name of Eric Lopes.",
    "According to the investigators, his store in the federal capital that today houses an insurer served as a facade to reinforce its Brazilian credentials.",
    "Utekhin did not speak Portuguese as good as Shmyrev's and, with the identity of Eric Lopes, presented himself as a “specialist in precious stones”.",
    "Utekhin also escaped the Federal Police.",
    "Other names The report of \"The New York Times\" also cites Vladimir Aleksandrovich Danilov and Yekaterina Leonidovna Danilova, who used the names of Manuel Francisco Steinbruck Pereira and Adriana Carolina Costa Silva Pereira.",
    "Both moved to Portugal in 2018 and then disappeared.",
    "Another group of spies was formed by Roman Olegovich Koval, Irina Alekseyevna Antonova and Olga Igorevna Tyutereva, who lived in Uruguay with a Brazilian birth certificate.",
    "These last two were passed by Federico Luiz Gonzalez Rodriguez and Maria Isabel Moresco Garcia, who presented himself as a model.",
    "In addition, according to NYT in 2022, Norwegian police arrested Mikhail Mukushin, who worked as a researcher at the University of Tromsø, in the far north of Norway.",
    "He was also passing by a Brazilian citizen.",
    "According to the report, after Russia invaded Ukraine in February 2022, there was a global reaction against Russian spies - including in Brazil, which historically maintained a good relationship with Russia.",
    "*Intern under the supervision of Diogo Max"
  ],
  "topics": {
    "Energy": 0.8520312309265137,
    "Health": 0.7806482315063477,
    "Culture": 0.7800195217132568,
    "Politics": 0.7786924839019775,
    "Economy": 0.7750545144081116,
    "Transport": 0.7558492422103882,
    "Diplomacy": 0.737349271774292,
    "Conflict": 0.7364780902862549,
    "Environment": 0.704464852809906,
    "Technology": 0.6831827759742737,
    "Crime": 0.52163165807724,
    "Education": 0.5159755349159241,
    "Military": 0.5039252042770386,
    "Elections": 0.4619578719139099
  },
  "sentiment": {
    "positive": 0.344,
    "negative": 0.656,
    "neutral": 0.0
  }
}