{
  "title": "Rússia intensifica criação de zona de segurança na fronteira com a Ucrânia",
  "published_date": null,
  "url": "https://www.brasil247.com/mundo/russia-intensifica-criacao-de-zona-de-seguranca-na-fronteira-com-a-ucrania",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia intensifies creation of safety zone on the border with Ukraine Putin orders military actions to protect Russian regions from Ukrainian attacks 247 - Russian President Vladimir Putin has announced that Russia's Armed Forces are working on creating a \"security zone\" along the Ukraine border.",
    "The measure aims to prevent threats to national security and protect the Russian regions of border from Ukrainian attacks.",
    "During a meeting with high government members, Putin stated that \"it was decided to create the necessary security zone along the border.",
    "Our armed forces are actively resolving this task now.",
    "The enemy's shooting positions are being suppressed, work is underway.\"",
    "The decision occurs after a Ukrainian attack in the city of LGOV, in the Kursk region, which left at least 12 wounded civilians, including two children.",
    "According to Kursk's interim governor, Aleksandr Khinshtein, the attack targeted an area near the Kursk-rylsk highway at the city entrance.",
    "Media reports indicated that the attack involved at least three projectiles fired by a US -supplied Himars multiple rocket launcher.",
    "In the last two days, Kiev has led a massive attack of even deeper long -range drones in Russia.",
    "According to the Russian Ministry of Defense, a total of 485 Ukrainian -wing drones have been slaughtered across the country in the last 48 hours.",
    "At least 63 of the drones were intercepted in the Moscow region, while the largest number was arrested on the Orel region, the ministry said.",
    "The idea of ​​creating a \"safety zone\" in Ukraine -controlled territory along the border was initially proposed by Putin in March last year.",
    "At the time, the president stated that Moscow could be \"forced\" to create such zone to protect civilians in the border regions of long -range Ukrainian attacks.",
    "Russian troops would create a \"security zone that would be quite difficult for the opponent to overcome with his weapons, especially of foreign origin,\" if and \"when we consider it appropriate,\" Putin said at the time.",
    "The creation of this security zone aims to prevent threats to national security and protect the Russian regions of border from Ukrainian attacks.",
    "Putin emphasized that Russian forces are bombarding Ukrainian positions responsible for these attacks, accusing Kiev of using \"terrorist\" methods directed at civil infrastructure.",
    "The safety zone will include deminating and eliminating non -detonated projectiles.",
    "The initiative coincides with Putin's recent proposal to US President Donald Trump to establish a peace memo.",
    "However, Kremlin said there are still no direct meetings scheduled between Russia and Ukraine.",
    "Putin expressed a willingness to work on a \"memo\" for a possible peace treaty, but rejected a 30-day ceasefire unless Ukraine interrupts the mobilization and sending western weapons.",
    "Meanwhile, the Ukrainian border city of Bilopillya in the Sumy region faces incessant Russian bombings.",
    "Mayor Yuri Zarko expressed deep skepticism about the effectiveness of peaceful peace negotiations in Istanbul, especially after a Russian attack on a bus that killed nine civilians.",
    "Most of the population has evacuated the city, and the essential services were interrupted due to the constant bombing.",
    "Residents of the entire Sumy region describe life under persistent air attacks, drone attacks and increased psychological stress.",
    "❗ If you have any positions to add to this article or some correction to do, contact redacao@brasil247.com.br.",
    "✅ Receive news from Brazil 247 and TV 247 on the 247 telegram and 247 channel on WhatsApp.",
    "Subscribe to 247, support by pix, subscribe to TV 247, Cortes 247 and watch:"
  ],
  "topics": {
    "Conflict": 0.9074026346206665,
    "Culture": 0.8909575343132019,
    "Politics": 0.8813343644142151,
    "Technology": 0.8779999613761902,
    "Military": 0.8693826198577881,
    "Health": 0.8371787071228027,
    "Transport": 0.8323822617530823,
    "Environment": 0.8116891980171204,
    "Economy": 0.8110703229904175,
    "Diplomacy": 0.7860416769981384,
    "Energy": 0.7613470554351807,
    "Education": 0.7246752977371216,
    "Crime": 0.7016948461532593,
    "Elections": 0.6913889050483704
  },
  "sentiment": {
    "positive": 0.259,
    "negative": 0.741,
    "neutral": 0.0
  }
}