{
  "title": "Lula levou ao menos 130 pessoas em viagem à Rússia e à China",
  "published_date": null,
  "url": "https://www.poder360.com.br/poder-governo/lula-levou-ao-menos-130-pessoas-em-viagem-a-russia-e-a-china/",
  "original_language": "pt",
  "cleaned_sentences": [
    "Lula took at least 130 people traveling to Russia and China Secom, Casa Civil and Itamaraty led a delegation composed of 11 ministers, 3 congressmen and 59 advisors President Luiz Inacio Lula da Silva (PT) took at least 130 people during the trip to Russia and China.",
    "Among those who joined the entourage of the petista are ministers of state, their advisors, entrepreneurs and security guards.",
    "The ministries or organs that most took people to the international trip were the presidency of the Republic (26) - a majority composed by Secom (Secretariat of Communication) and the Security Office) - the Civil House (20) and the Itamaraty Palace (12).",
    "Power360 analyzed names made available at the DOU (Official Gazette), in the travel panel - administered by the Ministry of Management and Innovation in Public Services - and the Transparency Portal.",
    "The full and official list was not disclosed by the Planalto Palace, so the amount of names may be higher.",
    "Read in detail the list of entourage that went with Lula to Russia and China (to open in another tab, click here): Regarding daily rates and spending on airline tickets, data is still very preliminary.",
    "Of the 130 people analyzed, only 28 had spending on daily released and, on average, about R $ 8,500 per person.",
    "Part of Lula's entourage embarked before the others to organize the preparations for the presidential trip.",
    "This is the case of the first lady, Janja da Silva, who traveled before her husband at the invitation of Russian President Vladimir Putin.",
    "Others who traveled before the main entourage were members of technique and support teams, especially the MRE (Foreign Relations Diplomats, which anticipate the preparations for the presidential state visit.",
    "Balance of Signed Agreements The federal government concluded the bilateral trip to Beijing with the signature of 36 agreements with China.",
    "The themes encompass partnerships on topics such as energy, sustainability, agribusiness, finance and technology.",
    "According to President Lula, after the 4th China-Celac Forum (Latin American and Caribbean Community), the visit to Asia had a “satisfactory” result in relation to the number of bilateral advances and signed cooperation agreements.",
    "Watch (59s): Janja Episode Despite signed agreements and advances in the relationship between Brazil and China, the episode involving a first lady's speech stole the spotlight from the federal government's trip to Asia.",
    "Janja would have taken the word during a private meeting of Lula and his ministers with China President Xi Jinping.",
    "He talked about the possible damage of the Tiktok social network- ranked by the Chinese company bytedance- and as supposedly benefited far-right influencers.",
    "In an interview after the case, Lula defended the woman and was annoyed to question who had “leaked” the information to the press, as only her closest ministers were at the meeting.",
    "The petista himself would have requested a Janja assistance on the subject, according to Foreign Minister Mauro Vieira.",
    "Communication vehicles stated that the first lady's speech would have generated embarrassment and had broken the protocol of the meeting.",
    "On Monday (19.MAI), Janja said he spoke to the Chinese leader thinking about the protection of children and adolescents and that, despite the criticism, he will not \"shut up\" his \"voice\" whenever he has an opportunity to deal with the subject."
  ],
  "topics": {
    "Politics": 0.4334234297275543,
    "Conflict": 0.43064311146736145,
    "Diplomacy": 0.31426283717155457,
    "Culture": 0.2788518965244293,
    "Economy": 0.26457831263542175,
    "Energy": 0.17501026391983032,
    "Transport": 0.17200516164302826,
    "Technology": 0.14240054786205292,
    "Military": 0.1191655620932579,
    "Health": 0.1105017140507698,
    "Crime": 0.08608702570199966,
    "Environment": 0.07895243912935257,
    "Education": 0.05776983126997948,
    "Elections": 0.049927130341529846
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}