{
  "title": "Rússia questiona eventuais negociações sobre a Ucrânia no Vaticano",
  "published_date": null,
  "url": "https://noticias.uol.com.br/ultimas-noticias/afp/2025/05/23/russia-questiona-eventuais-negociacoes-sobre-a-ucrania-no-vaticano.htm",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia questions eventual negotiations about Ukraine in the Vatican Russian Foreign Minister Sergey Lavrov expressed doubts on Friday (23) about a possible negotiation with Ukraine in the Vatican, after United States, Italy and Pope Leo XIV expressed the hope that the city-state will receive the talks.",
    "\"It would not be very elegant for Orthodox countries to discuss in Catholic territory topics related to eliminating the fundamental causes (of conflict),\" Lavrov said.",
    "\"For the Vatican himself would not be very comfortable, in the current circumstances, to receive delegations from orthodox countries,\" he added.",
    "Kremlin spokesman Dmitri Peskov said shortly after, \"so far, no decision or agreement was made about the next location of the negotiations.\"",
    "Representatives of Kiev and Moscow participated in Turkey last week of the first direct conversations since 2022, the year when the large -scale Russian offensive began against Ukraine.",
    "The meeting had a strong symbolic range, but did not lead to the announcement of a ceasefire, nor to any important advance.",
    "Since then, many sources have speculated about the possibility of a second round of discussions, which has not been confirmed.",
    "According to Wall Street Journal (WSJ), US President Donald Trump told European leaders on May 19 that the next dialogues between Russians and Ukrainians would take place in the Vatican.",
    "The Italian Prime Minister Giorgia Meloni said on Tuesday that Pope Leo XIV confirmed that he was willing to receive negotiations on Ukraine in the Vatican.",
    "On Thursday, AFP questioned Ukrainian presidency spokesman Serguii Nikiforov on the subject, but he refused to comment.",
    "Ukrainian President Volodimir Zelensky said on Monday that Kiev \"examined all possibilities\" about the place of a new bilateral meeting with the Russians, including \"Turkey, Vatican, Switzerland.\"",
    "The Russian offensive in Ukraine caused a shake in the relations between the Holy See and the Russian Orthodox Patriarch Cyril, which vehemently supports the campaign and Russian President Vladimir Putin.",
    "BUR/JS/JVB/AN/FP © AGENCE FRANCE-PRESSE See also Leave your comment The author of the message, not UOL, is responsible for the comment.",
    "Read the rules of use of UOL."
  ],
  "topics": {
    "Conflict": 0.9589746594429016,
    "Diplomacy": 0.852091908454895,
    "Politics": 0.8225060701370239,
    "Technology": 0.7496739029884338,
    "Culture": 0.7327079772949219,
    "Transport": 0.6744226217269897,
    "Economy": 0.6650073528289795,
    "Health": 0.6536495685577393,
    "Elections": 0.6206666827201843,
    "Environment": 0.602590024471283,
    "Energy": 0.5697748064994812,
    "Education": 0.566425621509552,
    "Military": 0.5566542148590088,
    "Crime": 0.3992239236831665
  },
  "sentiment": {
    "positive": 0.214,
    "negative": 0.786,
    "neutral": 0.0
  }
}