{
  "title": "Rússia e Ucrânia fazem maior troca de prisioneiros",
  "published_date": null,
  "url": "https://www1.folha.uol.com.br/mundo/2025/05/russia-e-ucrania-fazem-maior-troca-de-prisioneiros-da-guerra.shtml",
  "original_language": "pt",
  "cleaned_sentences": [
    "The one that should be the biggest exchange of prisoners of war between Russia and Ukraine, in conflict since Moscow invaded the neighbor more than three years ago, began on Friday (23).",
    "In the first stage, according to the Russians, 270 soldiers and 120 civilians on each side were exchanged.",
    "According to Ukrainian President Volodimir Zelenski, the exchanges should go until Sunday (25).",
    "After that, said Russian chancellor Serguei Lavrov, Moscow should officially deliver his terms to negotiate a memorandum that allows at least a ceasefire in the conflict The exchange was initially announced on social networks by US President Donald Trump, who has been trying to mediate a truce and peace negotiations among rivals.",
    "Soon after, military on both sides confirmed that the process was underway.",
    "In recent days, both sides have submitted to opponents lists with a thousand names of detainees, and the number is expected to be reached at the end of the process.",
    "So far, the 63 exchanges that occurred were at the dozens house, sometimes hundreds of prisoners, always brokered by parts such as Turkey or the United Arab Emirates.",
    "The direct negotiation stems from the contacts pressed by Trump, which changed the American policy of total support to Kiev in favor of a tense approximation with Vladimir Putin.",
    "In a hesitant, Russians and Ukrainians met again for the first time since 2022 last week in Istanbul.",
    "There are other ongoing diplomatic fronts.",
    "Before publishing information about the terms of negotiation, Lavrov, had said on Friday that he considers inelegant that the second round of negotiations between Moscow and Kiev occurs in the Vatican.",
    "\"It would be a bit inelegant for orthodox countries to discuss in Catholic soil issues related to the elimination of the causes of conflict,\" said the dean of world diplomacy, in office since 2004, at an event in Moscow.",
    "The suggestion of the use of the Holy See as the headquarters of negotiations was made by Trump after conversation with Putin on Monday (19).",
    "Pope Leo 14, who since the beginning of his pontificate has been requested by the end of hostilities, did not comment, but his willingness was confirmed by the Italian Prime Minister Giorgia Meloni.",
    "Both Russians and Ukrainian are mostly orthodox Christians, the eastern branch of faith with different rites and doctrine from those of Catholics, separated since the so -called great schism of 1054.",
    "In recent years, the church in Ukraine has broken with Russia for political reasons, and Kiev banned the Russian denomination due to the alignment of Moscow's patriarchy to Krelin.",
    "Last week's meeting was in Türkiye, headquarters, next to Belarus, the failed conversations three years ago.",
    "Although without results, it kept the channel open.",
    "Trump, with his usual voluntarism, announced that the conversations would \"start immediately\" after the call with Putin.",
    "It was not quite so, but Lavrov confirmed that \"on the Russian side, negotiations are advanced\" for the elaboration of a memorandum dealing with what his boss calls the causes of war: among other things, Ukraine's threat of Integrating Otan, the Western Military Alliance, and the status of the Ukrainian Russóphone populations.",
    "The chancellor even said again on Friday, that any agreement or eventual ceasefire undergoes an agreement in which laws that he finds harmful to ethnic Russian populations in Ukraine is overthrown.",
    "Obviously, he does not refer to the territories already under the power of Moscow in the east and southern, which Putin wants to see recognized in a recognized way by the international community, as well as the inhabitants of Crimea, who attached in 2014 after the overthrow of the Pro-Mosci government in Kiev.",
    "While diplomacy works, in a phase known as agreement engineering, in which the reality of the end of the conflict is imposed, but both sides need to build exits to seem winners, the war itself follows.",
    "Ukraine performed another night of drone attacks against the Russians, with 112 devices knocked down by Putin forces, which do not disclose total numbers, such as rivals.",
    "It was the most intense week on this front in the war, with 1,458 Ukrainian robot planes being slaughtered, according to the Ministry of Defense in Moscow.",
    "With few victims, the damage was more limited to headaches: airports in the country, including the capital, were closed several times, causing delays in waterfall and canceled flights, for example.",
    "In the opposite hand, Russia launched 12 missile attacks and drones throughout the week, and won villages in the regions of Sumi and Kharkiv in the north of the country, nominally outside the war objectives declared by Putin.",
    "In addition, it follows an advance in Donetsk in the east, which can put the last Ukrainian positions in the area in danger."
  ],
  "topics": {
    "Culture": 0.5570099353790283,
    "Military": 0.5103341341018677,
    "Diplomacy": 0.46660304069519043,
    "Conflict": 0.43433019518852234,
    "Politics": 0.41388261318206787,
    "Economy": 0.3185570538043976,
    "Technology": 0.27422189712524414,
    "Energy": 0.2184886336326599,
    "Environment": 0.19694484770298004,
    "Health": 0.1687517613172531,
    "Transport": 0.15606312453746796,
    "Crime": 0.1434250921010971,
    "Education": 0.09658820927143097,
    "Elections": 0.0803798958659172
  },
  "sentiment": {
    "positive": 0.286,
    "negative": 0.714,
    "neutral": 0.0
  }
}