{
  "title": "Trump anuncia grande troca de prisioneiros entre Ucrânia e Rússia",
  "published_date": null,
  "url": "https://jornaldebrasilia.com.br/noticias/mundo/trump-anuncia-grande-troca-de-prisioneiros-entre-ucrania-e-russia/",
  "original_language": "pt",
  "cleaned_sentences": [
    "United States President Donald Trump announced on Friday (23) a “great” exchange of prisoners between Ukraine and Russia, with congratulations to both countries and the question about whether the measure could lead to “something big”, a possible reference to negotiations between belligerents.",
    "After more than three years of war since Russia has invaded Ukraine, thousands of prisoners remain detained in both countries, but the exact number is unknown.",
    "“A great exchange of prisoners has just been completed between Russia and Ukraine,” Trump wrote on his social truth platform.",
    "“Congratulations to both sides for this negotiation.",
    "This can lead to something big ?",
    "?”, added the US president.",
    "Neither Moscow nor Kiev immediately confirmed the information.",
    "A high -ranking source accompanying the issue told AFP, however, that \"the change itself has not happened yet\" and that \"the process is underway.\"",
    "This type of exchange, very delicate among countries at war, is often kept confidential until it is completed, which can take hours.",
    "Last week during negotiations in Türkiye, Russia and Ukraine agreed to exchange 1,000 prisoners on each side.",
    "The meeting represented the first direct conversation between the belligerents since 2022.",
    "\"We have the confirmation that nearly 10,000 people are in captivity in Russia,\" Ukrainian commissioner for missing persons, Artur Dobroserdov said in April.",
    "Russia releases little information about the fate of Ukrainians held in captivity and each exchange is marked by surprises, a high -ranking Ukrainian employee who called for anonymity told AFP.",
    "\"In almost every change there are people about whom no one knew anything,\" he said.",
    "\"Sometimes they return people who were in the missing lists or who were considered dead.\"",
    "The issue of prisoners of war is one of the few fields in which Kiev and Moscow have occasionally been able to reach agreements since the beginning of the Russian invasion, which resulted in limited exchanges regularly.",
    "It is also an especially painful theme in countries, where thousands of families expect distressed news from their missing loved ones.",
    "- Ukraine and Russia exchange accusations about violations of the Geneva Convention on the treatment reserved for prisoners of war.",
    "Russia often organizes judgments against Ukrainian prisoners, which is contrary to international law.",
    "There are also cases of torture and various hostages - military and civilians - died during the arrest.",
    "The Amnesty International NGO denounced “systematic torture and the deprivation of medical care” to Ukrainian prisoners in Russia in a report published in March.",
    "Several former Ukrainian prisoners told AFP that they were tortured during their captivity.",
    "Russia recently returned the body of Ukrainian journalist Viktoria Roshchina, who died in captivity.",
    "According to a journalistic investigation, she was tortured and some body organs were missing.",
    "During the election campaign, Trump insisted that he could end the fighting.",
    "Several weeks ago, the US President tries to get a ceasefire among belligerents, while threatening to abandon the process if he does not observe advances.",
    "In the battle area, the attacks continue.",
    "Russia reported on Friday that it overthrew 112 Ukrainian drones at night, devices that aimed at particular to the Moscow region and disturbed the third consecutive day the operations of various airports.",
    "After negotiations in Istanbul, the possibility of a second meeting is the subject of intense speculation, although the meeting has not been formally confirmed.",
    "Moscow indicated that any continuity of Kiev's talks can only happen after the exchange of prisoners, provided for in a format of 1,000 Russians for 1,000 Ukrainians.",
    "According to Ukrainian President Volodimir Zelensky, Kiev “examines all possibilities” about the place of a new bilateral meeting with the Russians.",
    "Pope Leo XIV, the United States and Italy announced the possibility of a meeting at the Vatican.",
    "But Russian diplomacy chief Sergey Lavrov seemed to close the door to the possibility on Friday.",
    "He stated that it would not be very elegant for orthodox countries to discuss in Catholic territory topics related to eliminating deep causes ”(of conflict) in Ukraine © AGENCE FRANCE-PRESSE"
  ],
  "topics": {
    "Conflict": 0.9341767430305481,
    "Military": 0.8948628902435303,
    "Health": 0.8666571378707886,
    "Culture": 0.857229471206665,
    "Economy": 0.8502476811408997,
    "Diplomacy": 0.8389121890068054,
    "Politics": 0.8320624828338623,
    "Technology": 0.7324385643005371,
    "Crime": 0.7289382219314575,
    "Transport": 0.70394366979599,
    "Environment": 0.636226236820221,
    "Energy": 0.5739540457725525,
    "Elections": 0.5611656308174133,
    "Education": 0.4802558422088623
  },
  "sentiment": {
    "positive": 0.294,
    "negative": 0.706,
    "neutral": 0.0
  }
}