{
  "title": "Rússia e outros países diminuem restrições à carne de frango brasileira por gripe aviária",
  "published_date": null,
  "url": "https://www.brasil247.com/agro/russia-e-outros-paises-diminuem-restricoes-a-carne-de-frango-brasileira-por-gripe-aviaria",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia and other countries decrease restrictions on Brazilian chicken meat by avian flu Despite the suspension of the embargo by some nations, the decision to interrupt exports remains in force for 34 countries, besides the European Union 247-The Ministry of Agriculture, Livestock and Supply (MAPA) updated on Thursday (21/5) the list of countries that imposed restrictions on the importation of Brazilian chicken meat, due to the first record of avian flu in a commercial farm located in Rio Grande do Sul, which took place on Thursday (15).",
    "The measure directly affected product exports, with a significant impact on international trade.",
    "The information is from Metropolis.",
    "According to the map's update, Russia, Belarus, Armenia, and Kyirguistan have decided to remove the suspension that previously involved all over Brazil, and now the restrictions are limited only to the state of Rio Grande do Sul.",
    "However, the decision to interrupt exports remains in force to 34 countries, in addition to members of the European Union.",
    "Among the countries that maintain the suspension, we highlight China, the largest importer of Brazilian chicken meat.",
    "The Brazilian government folder reported that, in total, Brazil exports chicken to about 160 countries, and that the map goes on dialogue with the international health authorities, providing necessary technical information in a transparent and agile manner.",
    "\"The actions adopted aim to ensure sanitary security and the safe resumption of exports as soon as possible,\" the ministry said in a statement.",
    "Export restrictions were adopted in two ways: national suspension at national level and regional blocks, as the case may be.",
    "Nevertheless, the Brazilian government clarified that there is no risk in the consumption of chicken meat and eggs.",
    "The measure was taken with the objective of avoiding the spread of avian flu to farms from other countries, preserving public health and food safety.",
    "Brazil is still the world's largest exporter of chicken meat, and the country's health authorities are committed to quickly resolving the situation, seeking to minimize economic and commercial impacts for the sector.",
    "❗ If you have any positions to add to this article or some correction to do, contact redacao@brasil247.com.br.",
    "✅ Receive news from Brazil 247 and TV 247 on the 247 telegram and 247 channel on WhatsApp.",
    "Subscribe to 247, support by pix, subscribe to TV 247, Cortes 247 and watch:"
  ],
  "topics": {
    "Economy": 0.880289614200592,
    "Health": 0.861309826374054,
    "Culture": 0.8458586931228638,
    "Environment": 0.7706030011177063,
    "Politics": 0.767543375492096,
    "Technology": 0.7663583159446716,
    "Transport": 0.7178917527198792,
    "Conflict": 0.6244136691093445,
    "Military": 0.6210026741027832,
    "Diplomacy": 0.615182638168335,
    "Education": 0.5929152965545654,
    "Energy": 0.5852981209754944,
    "Elections": 0.5558107495307922,
    "Crime": 0.355585515499115
  },
  "sentiment": {
    "positive": 0.533,
    "negative": 0.467,
    "neutral": 0.0
  }
}