{
  "title": "Rússia diz não ter informações sobre 'fábrica de espiões' no Brasil",
  "published_date": null,
  "url": "https://noticias.uol.com.br/internacional/ultimas-noticias/2025/05/22/russia-recusa-a-comentar-fabrica-de-espioes.htm",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia says he has no information about 'spy factory' in Brazil Read News Summary Russia said it could not comment on the New York Times report that the country used Brazil to prepare a series of spies that would work in the elite of its intelligence programs.",
    "What happened \"We saw these reports,\" said Russian government spokesman Dmitry Peskov.",
    "\"We cannot comment on them at all.",
    "We from the [presidential] administration do not have this information,\" concluded Peskov in a statement today.",
    "The New York Times published a report about what would be a \"spy factory\" Russians in Brazil.",
    "According to yesterday's text, agents came to the country, \"erased\" their Russian past and created roots.",
    "According to the newspaper, they opened companies, made friends and built family as part of the creation of a new identity.",
    "They lived a life above any suspicion until they were ready to take larger flights.",
    "Objective was not to spy on Brazil, but \"to become Brazilian\".",
    "When they were ready, they went to countries in Europe, the US or Middle East, \"where they finally came into action,\" the newspaper wrote.",
    "Espionage practice comes from the time of the Soviet Union.",
    "Russian President Vladimir Putin himself has already said he had supervised a spy when he served as an official of the USSR Intelligence Agency (KGB) at the end of the Cold War.",
    "They are special people.",
    "(...) Leave one's life behind, abandon loved ones, the family, the country, for many and many years, to dedicate life to the service of the homeland, is not something anyone can do.",
    "Only the chosen ones can do this, I say without any exaggeration.",
    "Putin in an interview in 2017 Brazilian Federal Police agents have investigated Russian spies since the beginning of the war in Ukraine in 2022.",
    "The NYT report says that PF searched millions of identity records in search of standards.",
    "To date, at least nine Russian agents have been identified with fake Brazilian identity.",
    "The investigation has already reached at least eight countries and had the support of US intelligence services, Israel, the Netherlands, Uruguay and other locations.",
    "Investigation began after CIA warning In April 2022, about two months after Russia invaded Ukraine, CIA (US intelligence) sent a warning to Brazil.",
    "In the message, he said that a Russian military intelligence agent had applied for an internship at the Hague court in the Netherlands.",
    "In the same period, the court began to investigate Russia's war crimes in Ukraine.",
    "Russian agent had Brazilian documents.",
    "Victor Muller Ferreira was actually Sergey Cherkasov.",
    "He was barred by the immigration of the Netherlands and was on the way back to Sao Paulo.",
    "With no cool basis to arrest Cherkasov, the PF began to monitor it.",
    "Until the police got a warrant to arrest the Russian for the use of false documents.",
    "Cherkasov denied accusations of espionage in testimony.",
    "According to the newspaper, he was annoyed by the questions, besides having all the authentic Brazilian documents, such as passport, voter title and reservist certificate.",
    "Analysis of the birth certificate made history collapse.",
    "The PF found that the woman registered as the mother of Victor Muller Ferreira had died.",
    "Her family, however, confirmed that she had no children.",
    "Already the father, never existed.",
    "Of the spies involved, only Cherkasov remains arrested.",
    "He was sentenced to 15 years in prison for falsification of documents, a penalty later reduced to five.",
    "In an apparent maneuver to repatriate him, the Russian government claimed that he was a sought after drug trafficker and asked his extradition to court, but was not released by Brazil.",
    "Why did Russia use Brazil?",
    "Brazilian passport is strong.",
    "With the document, it is possible to travel to many countries without visa.",
    "Miscigenation of the Brazilian population was also a decisive factor for choice.",
    "People with European characteristics go unnoticed among Brazilians.",
    "Another important point is the vulnerability of civil records and corruption.",
    "The New York Times explains that people born in rural areas do not need medical proof to get birth certificate and the presence of witnesses is enough.",
    "(With Reuters) See also Leave your comment The author of the message, not UOL, is responsible for the comment.",
    "Read the rules of use of UOL."
  ],
  "topics": {
    "Conflict": 0.5380784869194031,
    "Environment": 0.5128464698791504,
    "Transport": 0.44759225845336914,
    "Economy": 0.44332918524742126,
    "Culture": 0.3980710208415985,
    "Technology": 0.39149925112724304,
    "Politics": 0.37927281856536865,
    "Military": 0.2977084517478943,
    "Energy": 0.2940991222858429,
    "Health": 0.2755442261695862,
    "Education": 0.264270544052124,
    "Diplomacy": 0.24610553681850433,
    "Elections": 0.20523162186145782,
    "Crime": 0.18743281066417694
  },
  "sentiment": {
    "positive": 0.311,
    "negative": 0.689,
    "neutral": 0.0
  }
}