{
  "title": "Rússia designa comandante do cerco de Mariupol como chefe das forças terrestres",
  "published_date": null,
  "url": "https://noticias.uol.com.br/ultimas-noticias/afp/2025/05/22/russia-designa-comandante-do-cerco-de-mariupol-como-chefe-das-forcas-terrestres.htm",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia designates commander of the siege of Mariupol as chief of land forces Andrei Mordvichev, one of the commanders of the devastating siege of the Ukrainian city of Mariupol in 2022, was appointed on Thursday as head of the Russian army land forces.",
    "\"Russian Defense Minister Andrei Belusov presented to the troops the commander of land forces, General Andrei Mordvichev,\" the Ministry of Defense announced on Telegram.",
    "Mordvichev, 49, is a career military man who directed the siege of the port city of Mariupol, in southern Ukraine, in the first weeks of the Russian offensive, which began in late February 2022.",
    "The operation left a balance of dead still unknown.",
    "According to Ukrainian security services, SBU, General Mordvichev was the one who \"gave the order to take Mariupol\" and who commanded the siege to the Azovstal factory, where the latest Ukrainian defenders were entrenched to surrender.",
    "In March 2022, Ukraine announced that it killed Mordvichev in a bombing.",
    "His predecessor in the position of commander of Russian land forces, Oleg Saliukov, was deprived last week.",
    "According to the Russian press, he reached the age limit of 70 years to hold the position.",
    "BUR/PT/JVB/ZM/FP © AGENCE FRANCE-PRESSE See also Leave your comment The author of the message, not UOL, is responsible for the comment.",
    "Read the rules of use of UOL."
  ],
  "topics": {
    "Conflict": 0.9089308381080627,
    "Military": 0.7889764904975891,
    "Politics": 0.7645828127861023,
    "Culture": 0.5979791283607483,
    "Diplomacy": 0.5845015048980713,
    "Energy": 0.579115092754364,
    "Technology": 0.5685200095176697,
    "Environment": 0.5540123581886292,
    "Economy": 0.5450678467750549,
    "Transport": 0.5266116857528687,
    "Crime": 0.5056535601615906,
    "Health": 0.37822893261909485,
    "Elections": 0.3736187815666199,
    "Education": 0.3639077842235565
  },
  "sentiment": {
    "positive": 0.3,
    "negative": 0.7,
    "neutral": 0.0
  }
}