{
  "title": "G7 vai 'maximizar a pressão' se a Rússia rejeitar um cessar-fogo na Ucrânia",
  "published_date": null,
  "url": "https://noticias.uol.com.br/ultimas-noticias/afp/2025/05/22/g7-vai-maximizar-a-pressao-se-a-russia-rejeitar-um-cessar-fogo-na-ucrania.htm",
  "original_language": "pt",
  "cleaned_sentences": [
    "G7 will maximize the pressure 'if Russia rejects a ceasefire in Ukraine The G7 finance ministers agreed on Thursday (22) in \"maximizing pressure\" over Russia, including the application of new sanctions, is moscow to resist seeking a ceasefire in Ukraine.",
    "\"If this ceasefire is not awake, we will continue to explore all possible options, including options to maximize pressure, such as a expansion of sanctions,\" a final statement said after the world's most advanced seven economies in Canada.",
    "Diplomatic efforts to end the conflict have intensified in recent weeks, and Russian and Ukrainian officials have kept their first conversations ahead in more than three years last week in Istanbul.",
    "However, Kremlin stated on Thursday that \"new peace dialogues have not yet been agreed with Ukraine,\" denial information that the two countries would soon negotiate at the Vatican.",
    "On Monday, US President Donald Trump spoke by telephone with his Russian counterpart Vladimir Putin, with the aim of ending the \"blood bath\", but neither his contact nor the dialogues in Istanbul resulted in the offer of concessions by Russia.",
    "The statement of the group of seven countries with the most advanced economies on the planet (Canada, France, Germany, Italy, Japan, the United Kingdom and the United States) stressed that any entity supporting Russia during the conflict will be excluded from Ukraine reconstruction contracts.",
    "\"We agreed to collaborate with Ukraine to ensure that no country or entity, nor any of the entities of countries that have funded or fueled the Russian war machine can benefit from the reconstruction of Ukraine,\" he said.",
    "BYS/SST/AD/MAR/IC/MVV © AGENCE FRANCE-PRESSE See also Leave your comment The author of the message, not UOL, is responsible for the comment.",
    "Read the rules of use of UOL."
  ],
  "topics": {
    "Conflict": 0.932902455329895,
    "Crime": 0.9006094336509705,
    "Diplomacy": 0.7773435115814209,
    "Politics": 0.7479298710823059,
    "Economy": 0.732997477054596,
    "Technology": 0.6730589866638184,
    "Transport": 0.665606677532196,
    "Culture": 0.6404017806053162,
    "Health": 0.6310175657272339,
    "Energy": 0.6034857034683228,
    "Military": 0.5819724202156067,
    "Environment": 0.5526224970817566,
    "Education": 0.5481435060501099,
    "Elections": 0.5416600704193115
  },
  "sentiment": {
    "positive": 0.333,
    "negative": 0.667,
    "neutral": 0.0
  }
}