{
  "title": "Ukrainian official says major prisoner swap with Russia is underway",
  "published_date": null,
  "url": "https://www.guelphtoday.com/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
  "original_language": "en",
  "cleaned_sentences": [
    "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
    "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
    "Russia's Defense Ministry said it received the same number from Ukraine.",
    "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
    "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
    "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
    "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
    "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
    "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
    "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
    "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
    "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
    "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
    "It was the first recorded attack on the port since March 11.",
    "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
    "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
    "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
    "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
    "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
    "“It is an unbelievable feeling.",
    "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
    "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
    "Some had trouble remembering names and details of their lives before their capture.",
    "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
    "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
    "“Maybe my dad will come tomorrow,” one small boy cried.",
    "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
    "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
    "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
    "?” — apparently referring to other diplomatic efforts to stop the fighting.",
    "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
    "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
    "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
    "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
    "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
    "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
    "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
    "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
    "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
    "The proposal had not been previously discussed, the official said.",
    "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
    "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
    "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
    "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
    "___ Arhirova reported from Kyiv, Ukraine.",
    "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
    "___ Follow AP’s coverage of the war in Ukraine at Samya Kullab And Hanna Arhirova, The Associated Press"
  ],
  "topics": {
    "Conflict": 0.8165311813354492,
    "Diplomacy": 0.744080126285553,
    "Military": 0.653235673904419,
    "Technology": 0.6332002878189087,
    "Transport": 0.6119868755340576,
    "Energy": 0.6055305600166321,
    "Environment": 0.6024681329727173,
    "Culture": 0.5906029343605042,
    "Crime": 0.5818784236907959,
    "Politics": 0.5622841119766235,
    "Health": 0.524529755115509,
    "Education": 0.5056665539741516,
    "Economy": 0.4711688458919525,
    "Elections": 0.3122178316116333
  },
  "sentiment": {
    "positive": 0.319,
    "negative": 0.681,
    "neutral": 0.0
  }
}