{
  "title": "Kremlin says none scheduled",
  "published_date": null,
  "url": "https://www.cp24.com/news/world/2025/05/22/no-new-direct-russia-ukraine-peace-talks-scheduled-kremlin-says/",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine have no direct peace talks scheduled, the Kremlin said Thursday, nearly a week after their first face-to-face session since shortly after Moscow’s invasion in 2022 and days after U.S. President Donald Trump said they would start ceasefire negotiations “immediately.” “There is no concrete agreement about the next meetings,” Kremlin spokesman Dmitry Peskov told reporters.",
    "“They are yet to be agreed upon.” During two hours of talks in Istanbul on May 16, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, in what would be their biggest such swap.",
    "Apart from that step, the meeting delivered no significant breakthrough.",
    "Several months of intensified U.S. and European pressure on the two sides to accept a ceasefire and negotiate a settlement have yielded little progress.",
    "Meanwhile, Russia is readying a summer offensive to capture more Ukrainian land, Ukrainian government and military analysts say.",
    "Putin’s proposals Russian President Vladimir Putin said earlier this week that Moscow would “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” Putin has effectively rejected a 30-day ceasefire proposal that Ukraine has accepted.",
    "He has linked the possibility to a halt in Ukraine’s mobilization effort and a freeze on Western arms shipments to Kyiv as part of a comprehensive settlement.",
    "European leaders have accused Putin of dragging his feet in peace efforts while he tries to press his bigger army’s battlefield initiative and capture more Ukrainian land.",
    "The major prisoner swap is a “quite laborious process” that “requires some time,” Peskov said.",
    "But he added: “The work is continuing at a quick pace, everybody is interested in doing it quickly.” Peskov told Russia’s Interfax news agency that Moscow had provided Kyiv with a list of prisoners it wants released.",
    "“We have not yet received a counter list from Kyiv.",
    "We are waiting,” he told Interfax.",
    "Ukrainian President Volodymyr Zelenskyy said Thursday that preparations are underway for the potential prisoner exchange, which he described as “perhaps the only real result” of the talks in Turkey.",
    "Peskov disputed a report Thursday in The Wall Street Journal that Trump told European leaders after his phone call with Putin on Monday that the Russian leader wasn’t interested in talks because he thinks that Moscow is winning.",
    "“We know what Trump told Putin, we don’t know what Trump told the Europeans.",
    "We know President Trump’s official statement,” Peskov said.",
    "“What we know contrasts with what was written in the article you mentioned.” Russian capital targeted by drones for the second night Apart from the continuing war of attrition along the roughly 1,000-kilometre (620-mile) front line, which has killed tens of thousands of troops on both sides, Russia and Ukraine have been firing dozens of long-range drones at each other’s territory almost daily.",
    "Russia’s Defense Ministry said it shot down 105 Ukrainian drones overnight, including 35 over the Moscow region.",
    "It was the second straight night that Kyiv’s forces have targeted the Russian capital.",
    "More than 160 flights were delayed at three of Moscow’s four main airports, the city’s transport prosecutor said, as officials grounded planes citing concerns for passenger safety.",
    "The attack prompted some regions to turn off mobile internet signals, including the Oryol region southwest of Moscow, which was targeted heavily Wednesday.",
    "The Defense Ministry claimed it downed 485 Ukrainian drones over several regions and the Black Sea between late Tuesday and early Thursday, including 63 over the Moscow region, in one of the biggest drone attacks.",
    "It was not possible to verify the numbers.",
    "Russia seeks a buffer zone on the border Meanwhile, the Ukrainian air force said Russia launched 128 drones overnight.",
    "Among the targets were Ukraine’s central Dnipropetrovsk region, damaging an industrial facility, power lines, and several private homes, regional Gov.",
    "Serhii Lysak said on Telegram.",
    "In Kyiv, debris from a Russian drone fell onto the grounds of a school in the capital’s Darnytskyi district, according to Tymur Tkachenko, head of the Kyiv City Military Administration.",
    "No injuries were reported.",
    "Ukrainian shelling in Russia’s Kursk region killed a 50-year-old man and injured two others, acting regional Gov.",
    "Alexander Khinshtein said Thursday.",
    "Putin visited the Kursk region on Tuesday for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month.",
    "Kyiv officials denied the claim.",
    "“Despite the liberation of our territory, the border region is still subject to enemy attacks,” Khinshtein warned residents on Telegram.",
    "“It is still dangerous to be there.” Putin has said Russian forces have orders to create a “security buffer zone” along the border.",
    "That would help prevent Ukraine from striking areas inside Russia with artillery, Putin told a government meeting, but he gave no details of where the proposed buffer zone would be or how far it would stretch.",
    "Putin said a year ago that a Russian offensive at the time aimed to create a buffer zone in Ukraine’s northeastern Kharkiv region.",
    "That could have helped protect Russia’s Belgorod border region, where frequent Ukrainian attacks have embarrassed the Kremlin."
  ],
  "topics": {
    "Diplomacy": 0.9569382071495056,
    "Conflict": 0.941657543182373,
    "Military": 0.9147412776947021,
    "Environment": 0.8959375023841858,
    "Transport": 0.8947396874427795,
    "Culture": 0.8940961956977844,
    "Energy": 0.8875598907470703,
    "Politics": 0.8773154616355896,
    "Technology": 0.8589146733283997,
    "Economy": 0.8554052710533142,
    "Education": 0.8498409986495972,
    "Health": 0.8227197527885437,
    "Crime": 0.7536819577217102,
    "Elections": 0.7152721881866455
  },
  "sentiment": {
    "positive": 0.189,
    "negative": 0.811,
    "neutral": 0.0
  }
}