{
  "title": "Putin visits Russia's Kursk region",
  "published_date": null,
  "url": "https://www.cp24.com/news/world/2025/05/21/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces/",
  "original_language": "en",
  "cleaned_sentences": [
    "President Vladimir Putin visited Russia’s Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
    "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
    "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of their biggest battlefield successes in the more than three-year war.",
    "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
    "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
    "Putin has effectively rejected recent U.S. and European proposals for a ceasefire.",
    "Russian Foreign Minister Sergey Lavrov on Wednesday accused Kyiv’s allies of seeking a truce “so that they can calmly arm Ukraine, so that Ukraine can strengthen its defensive positions.” North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, according to Ukraine, the U.S. and South Korea.",
    "Russia announced on April 26 that its forces had pushed out the Ukrainian army.",
    "Kyiv officials denied the claim.",
    "Ukraine says it stopped Russian attacks in Kursk The Ukrainian Army General Staff said Wednesday that its forces repelled 13 Russian assaults in Kursk.",
    "Its map of military activity showed Ukrainian troops holding a thin line of land hard against the border but still inside Russia.",
    "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict, even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment.",
    "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
    "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
    "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
    "Ukraine’s surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
    "Kyiv’s strategy aimed to show that Russia has weaknesses and that the war isn’t lost.",
    "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
    "The move was fraught with risk.",
    "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometre (620-mile) front line.",
    "The incursion didn’t significantly change the dynamics of the war.",
    "Putin told acting Kursk Gov.",
    "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn’t return to their homes.",
    "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
    "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
    "Putin last visited the Kursk region in March, when Ukrainian troops still controlled some parts of the area.",
    "He wore military fatigues -- a rarely seen sight for the Russian leader, who usually wears a suit -- and visited the area’s military headquarters where he was filmed with top generals.",
    "Russia and Ukraine continue deep strikes with drones Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
    "Flights were temporarily grounded twice at Moscow’s Domodedovo and Zhukosky airports, according to Russia’s Federal Air Transport Agency, or Rosaviatsiya, as officials reported Ukrainian drones being shot down in the area.",
    "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
    "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
    "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
    "The Ukrainian army said that its drones struck a semiconductor plant overnight in Russia’s Oryol region, about 150 kilometres (90 miles) northeast of Ukraine.",
    "According to the General Staff, 10 drones hit the Bolkhov Semiconductor Devices Plant, one of Russia’s key producers of microelectronics for the military-industrial complex.",
    "It wasn’t possible to independently verify the claim."
  ],
  "topics": {
    "Politics": 0.7191214561462402,
    "Conflict": 0.6720078587532043,
    "Diplomacy": 0.6590388417243958,
    "Culture": 0.5962921380996704,
    "Military": 0.5527228713035583,
    "Energy": 0.5445640087127686,
    "Economy": 0.5433193445205688,
    "Technology": 0.47368311882019043,
    "Environment": 0.423107385635376,
    "Elections": 0.39584851264953613,
    "Transport": 0.3799531161785126,
    "Education": 0.3563702404499054,
    "Crime": 0.3129744231700897,
    "Health": 0.296140193939209
  },
  "sentiment": {
    "positive": 0.314,
    "negative": 0.686,
    "neutral": 0.0
  }
}