{
  "title": "Colloqui tra Russia e Ucraina a Istanbul rinviati al pomeriggio",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1837956/colloqui-ucraina-russia-rinviati-istanbul-pomeriggio",
  "original_language": "it",
  "cleaned_sentences": [
    "Turkey postpon the meeting, while delegations discuss the fire and lasting peace of cease The direct interviews between Russia and Ukraine scheduled in Istanbul were postponed in the afternoon by decision of Turkey: the spokesperson for the Russian Foreign Ministry, Maria Zakharova, whose statements were reported by Russian printing agencies, including Tass, made it known.",
    "The spokesman recalled Putin's words according to which negotiations must aim \"to eliminate the background causes of the conflict and reach a durable peace in a historical perspective\".",
    "While Ukrainian officials mentioned by the Wall Street Journal say that the Ukrainian delegation will meet the Russian one only to discuss how to implement and monitor a 30 -day unconditional fire proposed by the Trump Administration.",
    "The spokesman for the Kremlin Dmitry Peskov said that the Russian negotiations were prepared during a meeting chaired last night by Vladimir Putin in which the members of the Moscow delegation took part, led by Vladimir Medinsky, the foreign and defense ministers, the head of the National Security Council, the Chief of Staff Valery Gerasimov, the directors of the internal intelligence services and for abroad and all the commanders of the military groups engaged in the conflict.",
    "The headquarters of the interviews, writes the Ria Novosti agency, will be the same as the negotiations of 2022: the Dolmabahce palace, in the offices of the Turkish presidential administration."
  ],
  "topics": {
    "Conflict": 0.9646221995353699,
    "Politics": 0.9478408694267273,
    "Diplomacy": 0.849635660648346,
    "Culture": 0.7264867424964905,
    "Military": 0.6732050776481628,
    "Technology": 0.5688209533691406,
    "Economy": 0.4260126054286957,
    "Health": 0.3721262216567993,
    "Environment": 0.320575088262558,
    "Crime": 0.29302409291267395,
    "Transport": 0.2588585317134857,
    "Education": 0.21153998374938965,
    "Energy": 0.20409969985485077,
    "Elections": 0.09870687872171402
  },
  "sentiment": {
    "positive": 0.2,
    "negative": 0.8,
    "neutral": 0.0
  }
}