{
  "title": "Zelensky in Turchia per negoziati di pace con la Russia",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1837821/presidente-putin-russia-turchia-zelensky-negoziati",
  "original_language": "it",
  "cleaned_sentences": [
    "Waiting for confirmations on Putin's participation, there is discussion of penalties and possible exchanges of prisoners Volodymyr Zelensky leaves for Turkey, hoping that Vladimir Putin accepts his request for a summit in presence.",
    "But it is said ready to \"any negotiation format\" to end the war, therefore also to negotiations at the lower level.",
    "Moreover, on the eve of the interviews, there is still no indication from the Kremlin that the president will guide the Moscow delegation.",
    "\"I don't know if he will come,\" Donald Trump also admitted, making it clear that he could go if there was the Russian leader: \"I know he would like you to be there, it's a chance,\" said the US president.",
    "The Ukrainian head of state has made it clear that Kiev will decide the \"next steps\" depending on those who will represent Russia to the interviews, which by Americans could extend two days.",
    "\"I think they will arrive excellent news today, maybe tomorrow and maybe Friday,\" said Trump from Doha.",
    "And his special correspondent Steve Witkoff has announced that he will go to Istanbul together with the secretary of state Marco Rubio on Friday.",
    "The ambassadors of the EU member countries have meanwhile gave the green light to 17/or package of sanctions against Russia.",
    "The measures, which must be approved on May 20 by the foreign ministers, target almost 200 ships of the so -called Russian 'shadow' fleet, which is considered used largely for oil exports.",
    "But according to the French Foreign Minister, Jean-Noël Barrot is not enough.",
    "United States and European states, he said, they must \"prepare to impose devastating sanctions\" to \"take Russia to the throat\" and force it to cease hostilities in Ukrainian.",
    "The relations between Moscow and Paris mark one of the lowest points of the last decades, with the president Emmanuel Macron who seems to aspire to the leaders of the willing countries in an anti-Russian key.",
    "During a long television interview on Tuesday evening, the Elysée tenant hypothesized, among other things, the deployment of French atomic heads in Poland, causing the Kremlin reaction.",
    "\"The proliferation of nuclear weapons in Europe will not favor safety, predictability and stability on the continent,\" commented Putin's spokesperson, Dmitry Peskov.",
    "A source of the Ukrainian embassy in Ankara confirmed to the Ansa that Zelensky's first commitment tomorrow in Türkiye will be a meeting with the president Recep Tayyip Erdogan in Ankara.",
    "In the event that Putin arrives in Istanbul, the Ukrainian and Turkish presidents will move from the capital to the city on the Bosphorus.",
    "Kiev did not let himself know who will make his delegation in case this does not happen.",
    "As for Russia, Peskov said that \"the instructions from the president\" have not yet arrived, and therefore it is not known who will be part of the Russian delegation.",
    "Voices and denials have chasing each other from yesterday.",
    "Today the authoritative newspaper Kommersant writes that he knew that the foreign minister Serghei Lavrov will not be present, who was given as a probable chief delegation 24 hours before.",
    "Leonid Slutesky, the president of the Duma International Affairs Commission who had participated in the latest negotiations directed with the Ukrainians in 2022, did not want to say if this time it will be among the negotiators, but has anticipated that among the topics under discussion there may be a total exchange of prisoners.",
    "The presidential councilor Yuri Ushakov, also indicated as a possible member of the Russian team, said that \"political issues and many technical issues\" will be on the table, and on this the composition of the Russian team will depend on this.",
    "Commenting on the opening of direct negotiations, China has meanwhile claimed to have supported \"the resolution of the crisis through dialogue and negotiation from the first day of the conflict\".",
    "Also from Beijing the Brazilian president Luiz Inacio Lula da Silva, who arrived in China after an interview in Moscow with the Russian leader in recent days, said he would try to talk to him to tell him: \"Hey, companion Putin, go to Istanbul and negotia, for the love of God\".",
    "For several hours there was talk of a possible new interview between the two during a stop in Lula in the Russian capital on the way back to Brazil.",
    "But the Brazilian president landed and then left without seeing Putin."
  ],
  "topics": {
    "Conflict": 0.9543030261993408,
    "Culture": 0.9444357752799988,
    "Politics": 0.9391763806343079,
    "Diplomacy": 0.9228015542030334,
    "Environment": 0.8745947480201721,
    "Health": 0.7889547944068909,
    "Crime": 0.784019410610199,
    "Economy": 0.7832880020141602,
    "Energy": 0.7432676553726196,
    "Technology": 0.7231677174568176,
    "Elections": 0.6771403551101685,
    "Transport": 0.6370619535446167,
    "Military": 0.4947918951511383,
    "Education": 0.49470189213752747
  },
  "sentiment": {
    "positive": 0.462,
    "negative": 0.538,
    "neutral": 0.0
  }
}