{
  "title": "Colloqui di pace tra Russia e Ucraina a Istanbul portano a uno scambio di prigionieri",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1838462/due-istanbul-incontro-zelensky-prigionieri-scambio-colloqui-russi-pace",
  "original_language": "it",
  "cleaned_sentences": [
    "Despite tensions, delegations discuss respite and a possible meeting between Putin and Zelensky Russians and Ukrainians, after three and a half years of war, found themselves face to face to try to bring their positions closer.",
    "This is the most relevant result from Istanbul, to the extent that this round of direct interviews even risked jumping after the mutual insults flew on the eve.",
    "As for the substance, the parties agreed a new exchange of a thousand prisoners and began to discuss a possible respite, but on this front the road remains uphill.",
    "Because if the delegation sent by the Kremlin said he was \"satisfied\" of the negotiations, leaving a glimpse of a Putin-Zelensky meeting open, Kiev has accused Moscow of \"irrelevable territorial requests\" as a condition for a ceased.",
    "At the Dolmabahce presidential palace, the Russian-Ukrainian direct interviews, the first since March 2022, were preceded by a series of preparatory meetings with the mediators, the Turkey hostess and the United States.",
    "The expectations were not high, especially after Vladimir Putin's flat rate and the consequent absence at the Volodymyr Zelensky table.",
    "So much so that Donald Trump, who had hoped for the meeting between two rival leaders in Türkiye until the last, renounced the idea of ​​flying to Istanbul at the beginning of the day to seal a face to face that would have been historic.",
    "Something in the city on the Bosphorus has however moved.",
    "The two delegations, led by the Ukrainian Defense Minister Rustem Umerov and the Russian presidential councilor Vladimir Medinsky, confronted each other for an hour and 40 minutes, flanked by the Turks.",
    "The agreement arrived on an exchange of prisoners \"one thousand per thousand\" in the \"next days\", the Russians said.",
    "\"An excellent result\", also according to the Ukrainians.",
    "Regarding the other priority of Kiev, that of the truce, there was a black smoke.",
    "Umerov explained that the parties \"exchanged\" ideas on \"some modes\" to reach the interruption of hostilities, while Medinsky has confirmed that now the two teams will have to \"present\" and \"describe their\" vision \"in detail.",
    "However, the feeling is that Moscow continues to take time: Ukrainian sources reported that the Russian delegates insisted on the withdrawal of Kiev's forces from \"most of the territory\" occupied.",
    "Smoking in the eyes for Zelensky's mediators, who managed the situation \"calmly\" and illustrated their positions, has been reported.",
    "Another key point for Ukrainians was to organize a meeting between the two heads of state as soon as possible, which would be the first from the beginning of the invasion.",
    "Urmerov in Istanbul reiterated that this meeting \"should be the next step\" on the path to peace.",
    "Kremlin negotiators made it known that they had \"taken note of this request\".",
    "The Turkish government, pulling the ranks of the negotiation, wanted to look at the glass half full.",
    "Also because, according to what was announced by the foreign minister Hakan Fidan, the two teams agreed \"in principle\" to meet again.",
    "A little further away from Istanbul, however, the western allies of Kiev have dampened the enthusiasm: \"The Russian position cannot be defined in any way constructive\", the leaders of the willing (Starmer, Macron, Tusk and Merz) reported by Tirana in a joint declaration after a meeting in which Zelensky also participated, with Trump on VideoCollemento.",
    "While for the EU Ursula von der Leyen she has returned to evoke penalties against Moscow, which would include the ban on access to the North Stream gas pipeline and a narrow on the banks.",
    "At this point the spotlights return to the White House, which the Kremlin continues to consider the only interlocutor.",
    "Trump, returning from his mission to the Middle East, insisted on \"wanting to meet Putin as soon as possible\", adding that in the meantime he could once again call the Tsar, to understand his real intentions.",
    "A summit between the two leaders is considered \"necessary\" by the Kremlin.",
    "But \"before\", observed Dmitry Peskov, \"adequate preparation is needed\"."
  ],
  "topics": {
    "Conflict": 0.9813752174377441,
    "Environment": 0.9721451997756958,
    "Politics": 0.9719124436378479,
    "Diplomacy": 0.9570783972740173,
    "Culture": 0.9495729804039001,
    "Health": 0.9325266480445862,
    "Economy": 0.9095043540000916,
    "Technology": 0.892572820186615,
    "Education": 0.8807942867279053,
    "Elections": 0.8694426417350769,
    "Energy": 0.8595288991928101,
    "Military": 0.8519436120986938,
    "Transport": 0.7708753943443298,
    "Crime": 0.7619322538375854
  },
  "sentiment": {
    "positive": 0.462,
    "negative": 0.538,
    "neutral": 0.0
  }
}