{
  "title": "Vertice di Istanbul tra Russia e Ucraina senza Putin e Trump",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1838142/trump-putin-zelensky-turchia-russia-istanbul-ucraina-vertice",
  "original_language": "it",
  "cleaned_sentences": [
    "Zelensky criticizes the Russian delegation while using and Türkiye median for a ceased the fire In the end Istanbul turns into the summit of the absent.",
    "After the great refusal of Russian President Vladimir Putin, in fact, the big names are parade.",
    "The Ukrainian Volodymyr Zelensky - already in Turkey for a meeting with the Turkish counterpart Recep Tayyip Erdogan - reacts to Moscow's decision to send the Falco Vladimir Medinsky choosing, as a counterpart, his Minister of Defense Rustam Umerov.",
    "\"Proof that Moscow is not serious, the Russians offer a low level delegation but, out of respect for President Trump and President Erdogan, we will be in Istanbul,\" said Zelensky.",
    "Who wants to show that he is willing to take \"the first steps towards the de-Escalation and the end of the war\".",
    "Trump, who had kept the suspense from the Middle East, in the end short size: \"Nothing will happen - he declares on board the Air Force One - until Putin and I will meet\".",
    "And the awaited direct interviews Moscow-Kiev, the first from the spring of 2022, will be entrusted tomorrow to their respective delegations.",
    "The showdown between Russia and Ukraine, on the day of the landing in Türkiye of the negotiating teams, was seasoned by a complex exchange of insults.",
    "After Zelensky has branded the arrival of Medinsky as \"a farce\", the spokesperson of the Russian foreign ministry Maria Zakharova defined the Ukrainian leader \"a clown, a bankrupt, a person with an unknown education\".",
    "Certainly there is that the Kremlin, displaced by Zelensky's move to transform Istanbul into a thousand summit and a negotiation, is now trying to build a smoke curtain around the potential flop, for the use and consumption of Trump and the so -called global South, where it is in constant search for consensus to show how Russia is not isolated, indeed.",
    "\"We are ready to discuss and resume the course of negotiations, we are ready for possible compromises,\" said Medinsky, who aims to spread a message of reasonableness.",
    "Keystone Erdogan and Zelensky in Ankara The United States and Türkiye will be the mediators in negotiations and the goal, for Kiev, remains the creation of a 30 -day unconditional \"ceased fire\".",
    "It is a game of mirrors.",
    "Europe sees the truce - France reiterated it at the NATO foreign ministerial meeting of Antalya - as a precondition to get to peace, Moscow wants to discuss \"everything for everything\" while the US sway, with Trump - the first proponent of the movement of the truce - apparently \"not disappointed\" by the composition of the Russian delegation (although he then admitted to \"not knowing anything\").",
    "In short, fluid trend to say the least.",
    "The secretary of state Marco Rubio, from Antalya, has resized the expectations.",
    "\"We will see what will happen in the next few days but we want to see progress: the president has been more than clear, the war must end and is open to any mechanism that leads to a just and lasting peace,\" he said.",
    "Of course, while every effort is concentrated on peace, the contrary signals should not be ignored.",
    "To launch the alarm is the CNN, citing two US officials.",
    "Russia, they warn, is gathering its forces on the front line for \"a possible new offensive\" aimed at conquering another Ukrainian territory.",
    "\"Putin will try to take the whole possible territory until the outskirts of Kiev,\" said one of the sources.",
    "It was so, the situation would start again.",
    "Europe now interrogates what to do - According to the British premier Keir Starmer \"what happened today is a further proof that Putin is temporarily\" - in order not to stay out of the game and continue to support Kiev.",
    "The line remains the one set in the Ukrainian capital within the framework of the mission of the leaders of Great Britain, France, Germany and Poland: punish fly with draconian sanctions if it escapes the negotiations."
  ],
  "topics": {
    "Conflict": 0.8975331783294678,
    "Politics": 0.8823655247688293,
    "Diplomacy": 0.855605959892273,
    "Culture": 0.8456746935844421,
    "Environment": 0.797528088092804,
    "Economy": 0.7563564777374268,
    "Military": 0.7232726812362671,
    "Education": 0.7160307765007019,
    "Energy": 0.6023058295249939,
    "Technology": 0.6006295680999756,
    "Transport": 0.5982959270477295,
    "Health": 0.5531518459320068,
    "Elections": 0.3049185574054718,
    "Crime": 0.23341093957424164
  },
  "sentiment": {
    "positive": 0.542,
    "negative": 0.458,
    "neutral": 0.0
  }
}