{
  "title": "Russia e Ucraina tornano a dialogare ma il futuro dei negoziati resta incerto",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1839397/putin-trump-europa-russia-futuro-negoziati-ucraina",
  "original_language": "it",
  "cleaned_sentences": [
    "Putin dictates the times while Trump and Europe show divergent approaches on the crisis As often happens, you can choose between the half -full or half -empty glass.",
    "Well that Russia and Ukraine, somehow, have returned to meet.",
    "The future of the negotiations is wrapped in uncertainty, there is no longer talk of the fire in a short time and hope for a truce in the near future is now really difficult.",
    "But above all, there is a clear feeling, if not the certainty, that Putin has once again gave the cards and dictating the game times.",
    "The temporizing tsar goes on its way, grants phrases that seem to be an opening towards dialogue, but the substance always remains the same as the unacceptable (from Kiev) Russian requests.",
    "Trump does not follow the threats of a few days ago of American penalties - including secondary ones, very feared by Moscow - and indeed he starts to say he believes that Putin really wants peace.",
    "Europe assists perplexed at Girotondo of statements and contacts but keeps the bar straight.",
    "The hat down: common foreign policy, among many different difficulties and positions, perhaps really begins to structure itself.",
    "This is the summary of the last few days between meetings, phone calls and contact culminated contact in the interview between the American and Russian president.",
    "An interview that is not easy to read.",
    "The two protagonists said they considered their positive and constructive phone call, but then everyone tells a different story.",
    "If you read the Russian and American statements well, several doubts arise.",
    "When Putin says that the Russian priority is to \"eliminate the deep causes of this crisis\" he all reports to the starting box as in a game of the goose where he is the one who pulls dice.",
    "Translated it means that the Russian requests are always those and do not change: recognition of the Russian crimea, total possession of the four provinces only in part conquered by the Russians, no guarantee of security for Kiev.",
    "And when Trump says that at some point the conditions for the truce will be negotiated by the two sides clearly evokes the possibility that America can take a step back.",
    "Having said that, it should be emphasized that the central point, in reality, is another: Putin and Trump go at different speeds.",
    "And also from this point of view, time plays in favor of Putin.",
    "Trump said he would solve the situation in 24 hours.",
    "Putin has come for three years of war and his delegation recalled, during the interviews of Istanbul, the \"Great North War\" fought between Russia and Sweden at the beginning of the 1700s for the control of the Baltic Sea.",
    "As if to say: we are not in a hurry, peace will be there when the conditions are the right ones for us.",
    "In this situation, Europe finally shows, despite the many different opinions and contrasts between the 27, to have a strong resilience capacity and to continue to \"keep\" its position alongside Kiev.",
    "Now Trump says that penalties against Moscow are not a good solution, while he had said exactly the opposite a few days ago.",
    "Well, Europe launches a new package of measures, the seventeenth, against Moscow.",
    "And London aligns, with new British penalties and with coordination with the European Union, which confirms the rapprochement between London and Brussels.",
    "From this point of view, the glass is half full."
  ],
  "topics": {
    "Conflict": 0.9266257286071777,
    "Politics": 0.8983930349349976,
    "Diplomacy": 0.8969396948814392,
    "Culture": 0.7742887735366821,
    "Crime": 0.7431992292404175,
    "Military": 0.573372483253479,
    "Health": 0.5575507879257202,
    "Economy": 0.5490950345993042,
    "Environment": 0.5086086988449097,
    "Transport": 0.4489291310310364,
    "Energy": 0.41810184717178345,
    "Technology": 0.3717610836029053,
    "Education": 0.24145157635211945,
    "Elections": 0.167465478181839
  },
  "sentiment": {
    "positive": 0.52,
    "negative": 0.48,
    "neutral": 0.0
  }
}