{
  "title": "Lavrov respinge i negoziati in Vaticano mentre la Svizzera si propone come alternativa",
  "published_date": null,
  "url": "https://www.laregione.ch/estero/estero/1840389/ucraina-negoziati-svizzera-lavrov-russia-scambio-prigionieri-alternativa-vaticano",
  "original_language": "it",
  "cleaned_sentences": [
    "Exchange of prisoners between Russia and Ukraine, but the Kremlin brakes on peace negotiations \"Not very realistic\": so the Russian Foreign Minister Serghei Lavrov liquidated the hypotheses on a continuation of the direct negotiations between Moscow and Kiev in the Vatican, while Ukraine makes it known that Switzerland has expressed \"their availability\" to host the interviews.",
    "Meanwhile, Russians and Ukrainians have started the greatest exchange of prisoners since the beginning of the conflict, one thousand per thousand.",
    "The only concrete result achieved in bilateral negotiations in Istanbul on May 16.",
    "Lavrov motivated the refusal to accept negotiations at the Holy See judging \"inelegant\" who in the heart of Catholicism find themselves discussing representatives of Orthodox countries, also on a question of religious nature which, according to the Russian foreign minister, is among the \"issues of principle\" that contribute to mutual hostility, in society where the confessional element assumes relevant political connotations.",
    "That is to say what Lavrov himself condemned as \"the path of destruction of the Ukrainian Orthodox Church\" close to the Patriarchate of Moscow, looked at by suspicion by the Ukrainian authorities as a possible fifth Russian column.",
    "Kiev focuses on Switzerland as an alternative venue.",
    "The Confederation \"confirmed its willingness to host future meetings aimed at reaching a peaceful solution\", wrote the head of the Ukrainian presidential office Andriy Yermak on Telegram, after an interview with the special correspondent of the Federal Council for the United States, Gabriel Lüchinger.",
    "The Federal Department of Foreign Affairs (DFAE) confirmed the telephone conversation between the Ambassador Lüchinger and Yermak to the Keystone-ATS agency.",
    "According to DFAE, Switzerland pursues a dialogue policy with all parties.",
    "It is ready to offer its good offices to support a real peace process between Russia and Ukraine.",
    "\"We continue to work,\" concluded the chief of Cabinet of Volodymyr Zelensky.",
    "But no confirmation arrives from the Kremlin: \"There is still no decision or an agreement on the next negotiation platform\" and \"This decision cannot be taken by a single party\" but \"requires the consent of both\", warned the spokesman Dmitry Peskov.",
    "Also on the timing of the Moscow negotiations pulls the brake.",
    "Lavrov has in fact pointed out that Russia will send Ukraine its conditions for a peace agreement only when \"the exchange of prisoners of war will be completed\".",
    "Then the draft of the document that the Russian part is currently finalizing \"will be made known\".",
    "The operations for the release of prisoners began today with the exchange of 270 soldiers and 120 civilians on the side.",
    "The remaining should be delivered in the next few days, the Russians said.",
    "Zelensky has confirmed that liberations will continue on the weekend.",
    "\"We are bringing our people home,\" the Ukrainian president wrote on Telegram.",
    "While from the White House Donald Trump applauded the implementation of the Istanbul agreement expressing its \"congratulations to both sides of this negotiation\".",
    "\"Could this lead to something big?\"",
    "Asks the US President.",
    "A comment far from both the optimism and the frustration shown in other moments, but in the most balanced hope that this first small step opens the difficult path of negotiations towards peace.",
    "On the ground, however, the Russian forces continued their slow advance, claiming the conquest of another village in the north-eastern Ukrainian region of Kharkiv.",
    "The one that, together with Sumy, could be targeted by the Russians for the creation of the \"security buffer area\" announced by President Vladimir Putin.",
    "Meanwhile, Russia continues to be target of the waves of the Ukrainian Kamikaze drone.",
    "Hundreds of pilot -free aircraft have been intercepted in the last three days by the anti -aircraft defenses on the territory of the Federation, of which over 90 on the Moscow region."
  ],
  "topics": {
    "Conflict": 0.9785088896751404,
    "Politics": 0.9500394463539124,
    "Diplomacy": 0.9249684810638428,
    "Culture": 0.8571081161499023,
    "Military": 0.7929695844650269,
    "Economy": 0.6650815606117249,
    "Technology": 0.5447123050689697,
    "Environment": 0.4976394772529602,
    "Energy": 0.46939244866371155,
    "Elections": 0.39058929681777954,
    "Health": 0.36907580494880676,
    "Transport": 0.31083059310913086,
    "Education": 0.2683909237384796,
    "Crime": 0.18582044541835785
  },
  "sentiment": {
    "positive": 0.63,
    "negative": 0.37,
    "neutral": 0.0
  }
}