{
  "title": "„Make Russia Great Again“",
  "published_date": null,
  "url": "https://www.merkur.de/politik/ukraine-krieg-medwedew-ukraine-russland-verluste-charkiw-taschassiw-jar-stadtteil-news-93171973.html",
  "original_language": "de",
  "cleaned_sentences": [
    "Putin-Scherge draws absurd history-and starts with a \"wheelchair\" saying on bidges Medvedev with absurd history: Ukraine war like the American Civil War.",
    "Russia fights against the \"Nazi\" government in Kyiv.",
    "Moscow - Dmitri Medvedev, a close confidante of Wladimir Putin, uses the \"Independence Day\", celebrated in the USA on July 4, to compete against the American government.",
    "He published a detailed statement on Telegram in which he equated the Russian attack war against Ukraine with the American civil war and the fight against slavery.",
    "Medvedev claims that the American civil war is a more important event for the average citizen outside the United States than the Americans' War of Independence against the Great Britain of imperialist.",
    "He points to the \"clearly visible\" dark parallels to the present and recommends seeing the new film by Alex Garland, \"Civil War\".",
    "Medvedev legitimizes Ukraine War: Fight against the \"Nazi\" regime in Kyiv Medvedev then draws a bizarre parallel between the American civil war of the 19th century and the war in Ukraine.",
    "He claims that Europe, especially France and England, would have wished for the victory of the slave owners at that time and that the “National Socialist” Ukraine would support today.",
    "The claim that Ukraine is dominated by right -wing radicals is a common propaganda of the Moscow government and has been refuted several times.",
    "As the SWR reports, among other things, the Russian Nazi narrative does not correspond to the reality of Ukrainian society in any way.",
    "Medwedew sharply criticizes US President Joe Biden: \"They demand that an old man who can hardly stand on his feet with a half-open mouth that will become new Roosevelt, and indicate that the future US president will most likely rule in a wheelchair for health reasons.\"",
    "Medvedev constantly refers to historical events and tries to reject them for Putin's purposes.",
    "In addition to Roosevelt, the War of Independence and the American Civil War, Medvedev also brings Lincoln, Churchill and allusions to the Second World War.",
    "A confusing mix of historical covers.",
    "At the end of his remarks, Medvedev sends a clear message: In the next US election, he seems to rely on Donald Trump.",
    "He modifies Trump's campaign slogan from 2016 and formulates: \"Make Russia Great Again\".",
    "Apparently the former president is also popular abroad.",
    "Putin's propaganda in the Ukraine War: Russia controls the information and suppresses the press Since the invasion of Ukraine, Putin's Nazi narrative in the state media has been picked up again and again.",
    "On the Russian television station Pervyj Canal and in the Russian news agencies Ria Novosti and Tass, the story is spread by an allegedly right-wing Nazi government in Kiev.",
    "The Russian autocrate tries to convince its population of the legitimate raid on the neighboring country, as the Italian “Institute for International Political Studies” states.",
    "In the fight against Putin, you should not only support Ukraine with military aid, but also look for ways that the Russian citizen can find out freely.",
    "\"The Russian state media have built a 'information fortress' around Putin's power system.",
    "And their importance for the resistance and survival of the regime should not be underestimated.\"",
    "The freedom of the press in Russia is generally severely restricted.",
    "On the ranking of the freedom of the press of the \"Reporters Without Borders\", Russia only ranks 162 out of 180."
  ],
  "topics": {
    "Health": 0.9932831525802612,
    "Elections": 0.9901142716407776,
    "Conflict": 0.9892153739929199,
    "Politics": 0.9846993088722229,
    "Culture": 0.9625087380409241,
    "Economy": 0.9619169235229492,
    "Crime": 0.955946147441864,
    "Education": 0.9530836343765259,
    "Diplomacy": 0.944282054901123,
    "Technology": 0.9418097734451294,
    "Environment": 0.9384523034095764,
    "Energy": 0.9348463416099548,
    "Military": 0.9275498390197754,
    "Transport": 0.7947419881820679
  },
  "sentiment": {
    "positive": 0.4,
    "negative": 0.6,
    "neutral": 0.0
  }
}