{
  "title": "Schelte für Sahra Wagenknecht: „Feige“, „faul“ und „Russia Today“",
  "published_date": null,
  "url": "https://www.ksta.de/politik/schelte-fuer-sahra-wagenknecht-feige-faul-und-russia-today-817893",
  "original_language": "de",
  "cleaned_sentences": [
    "Chancellor Olaf Scholz finds clear words for the BSW and the AfD.",
    "Meanwhile, the Greens speak of \"disregard\" of parliament.",
    "Chancellor's scolding and new allegations \"Feige\", \"Faul\" and \"Russia Today\"-Wagenknecht again ensures outrage Chancellor Olaf Scholz has sharply criticized the boycott of the Bundestag speech by the Ukrainian President Wolodymyr Selenskyj by the Sahra Wagenknecht (BSW) alliance and most AfD MPs.",
    "\"It was wrong, that was cowardly and this house was unworthy,\" said the SPD politician on Wednesday in his government declaration in parliament.",
    "All parliamentarians of the BSW and that of the AfD, except for four MPs, stayed away two weeks ago.",
    "\"We reject it to listen to a speaker in a camouflage suit,\" was the reason for the AfD parliamentary group tip.",
    "The BSW accused Selenskyj to contribute to a highly dangerous escalation spiral.",
    "Scolding from Federal Chancellor Olaf Scholz for Wagenknecht and AfD Scholz also rejected the conditions provided by Putin for a ceasefire in the Bundestag, which includes the waiver of Ukraine in the Crimea peninsula and large parts of Eastern Ukraine.",
    "\"Anyone who believes that (...) Ukraine would survive and that it becomes a permanent peace in Europe has to see a lot of Russia today,\" he said.",
    "\"Putin continues to rely on war and upgrade.",
    "Nobody can overlook about that.\"",
    "Everything about German Bundestag - Karl Lauterbach on Trump decision \"If this network is destroyed, the star of Harvard would sink\" -Graduate of the Elite University Cologne politician Lauterbach calculates Trump's Harvard plans - Criticism of authorities grows more than 6,000 deportations in the first quarter - Türkiye's most common destination - This will change in June new maternity protection regulation and more sustainable electronics - Thousands of likes on Instagram \"just fear\" - Heidi Reichinnek counters verbal attack with video - Discravations in the Bundestag AfD calls for more space in the Bundestag hall as the third strongest force - \"Families torn\" so many deportations from Germany were available in the first quarter Party founder Sahra Wagenknecht meanwhile attracted new trouble of the political competition on Wednesday.",
    "In an approximately two-minute speech, the BSW chairwoman attacked both the federal government and opposition leader Friedrich Merz (CDU) with sharp words and spoke of \"useful idiots of the arms industry\".",
    "Again Wagenknecht demanded a ceasefire in Ukraine.",
    "Sahra Wagenknecht: \"Why don't you support China?\"",
    "\"Why don't they support China and Brazil who are calling for exactly?\"",
    "Wagenknecht finally asked and attacked Selenskyj again for making a Russian troop deduction on the negotiating condition.",
    "China is one of the few international supporters of Kremlin chief Vladimir Putin.",
    "Wagenknecht did not go into the fact that Putin's “Peace Plan” would be equal to a surrender of Ukraine, as Chancellor Scholz had previously explained.",
    "Instead, she warned of a Europe \"in rubble and ashes\" before she crossed her speaking time and was choked up by Bundestag Vice President Wolfgang Kubicki (FDP).",
    "BSW Group ensures outrage: \"Disregarding Parliament\" After Wagenknecht's short appearance, there was finally a sharp criticism of the BSW boss, since the members of the party \"disappeared\" after the appearance of her party leader from the Bundestag, as the chairwoman of the Green Group, Britta Haßelmann, reported in the social network X.",
    "However, the BSW Group had previously submitted two applications to the government declaration-but there were no votes for these applications in the vote, i.e.",
    "none from the ranks of the BSW, criticized Haßelmann and spoke of \"disregarding parliament\".",
    "Her party colleague Helge Limburg also criticized the behavior of the BSW politicians: \"If you are even too lazy to be present in your own applications, you should leave it better,\" said the Greens MP at X.",
    "In the meantime, the sharp criticism of the behavior of the BSW group in the Bundestag also received approval from Cologne: Thomas Jäger, political professor at the University of Cologne, Haßelmann's accusations agreed.",
    "Parliaments are \"only a means to an end for the BSW,\" said Jäger, who is one of the sharpest critics of the Prorussian course of AfD and BSW."
  ],
  "topics": {
    "Culture": 0.928246259689331,
    "Politics": 0.9107679724693298,
    "Conflict": 0.9042669534683228,
    "Diplomacy": 0.8744682669639587,
    "Energy": 0.8622109889984131,
    "Economy": 0.8516090512275696,
    "Education": 0.7268140912055969,
    "Elections": 0.7122650742530823,
    "Environment": 0.6977218985557556,
    "Health": 0.6912801265716553,
    "Transport": 0.6825742125511169,
    "Crime": 0.6825026869773865,
    "Technology": 0.6521440744400024,
    "Military": 0.45572319626808167
  },
  "sentiment": {
    "positive": 0.192,
    "negative": 0.808,
    "neutral": 0.0
  }
}