{
  "title": "Russischer Soldat - \"Patriotismus verschwindet schnell, wenn man überleben will\"",
  "published_date": null,
  "url": "https://www.stern.de/politik/ausland/russischer-soldat----patriotismus-verschwindet-schnell--wenn-man-ueberleben-will--34681358.html",
  "original_language": "de",
  "cleaned_sentences": [
    "\"Russia No Context\" is a propaganda channel that essentially shows pictures and videos of Ukrainian successes and Russian deaths-always from the perspective of the simple soldier.",
    "Rat hordes that have made themselves comfortable in the Russian shelters or who showed their head injury.",
    "A new clip shows a Russian in his shelter.",
    "The soldier makes a quiet impression.",
    "He drinks an energy drink and looks more like a baker in his red T-shirt than an elite soldier.",
    "He describes the fate of newcomers, who come home at the first use as 200s-Soviet cipher for a favor.",
    "Russian soldier mourns the loss He wants to speak of the most painful experiences, he begins.",
    "\"The boys here were young, one only 19 years old.\"",
    "He didn't even know how he holds his assault rifle, loads and takes it apart.",
    "\"We gave him a protective vest, a helmet and a weapon.\"",
    "Then it went to the contact line.",
    "\"All four Newbies were lost.\"",
    "The grief of the Russian for the \"boys\" is laconic, calm, as if something hadn't happened at all.",
    "The soldier thus forms a strange contrast to the Ukrainian fighter Elena Ivanenko, \"Redschopf\", who shouted her grief and despair on her cell phone after the majority of her unity was rubbed in the fights for Robotyne.",
    "The mother country pays Russian soldiers well The Russian boys were there for the first time.",
    "The veterans asked why they came.",
    "The answer: because of the money!",
    "Putin's war machine is lubricated with money.",
    "The workers in the armaments industry receive top wages, even more for additional layers.",
    "And the voluntary military are lured with a mixture of patriotism and greed.",
    "Stylish videos always tell the same message: a young man with a boring profession leaves the stable or the cash register and goes to the military.",
    "Glossy recordings, admiring women, patriotic music, weapons, muscles and good money.",
    "This flair has now evaporated with the narrator.",
    "Here is your rifle, it goes to the bloodbath.",
    "Go and earn your money.\"",
    "Experience ensures survival Because the new ones had not served, had no operational experience, they had to die.",
    "\"When should you shoot, when better not?",
    "What do you do when drones appear?",
    "When do you get up, when do you get there?",
    "Lauter simple questions,\" explains the Russian.",
    "But it takes ages to understand that.",
    "You shouldn't allow yourself errors.",
    "\"First you have to get your things together, somehow survive.",
    "Then avoid a drone, a thrown grenade and, if you have done it, you have to fulfill your order.\"",
    "That is a special war here, he continues, unlike the Second World War, where you jumped out of the trench and shot the Germans.",
    "\"If you want to be a hero, you are here at the wrong address.",
    "Heroism disappears when you are in combat for the first time and see a body.\"",
    "And there are damn many corpses.",
    "No chance of survival for newbies And heroism?",
    "A couple will be heroes, he continues.",
    "But that's a long way.",
    "\"First you have to do a task.",
    "Kill a Ukrainian, meet a bradley, switch out of a drone, capture a Ukrainian.",
    "Conquered a shooting hole, a shelter and then you can specify.\"",
    "Before someone makes a stupid decision as he did it, you should think about it a hundred times.\"",
    "\"The worst thing is when you get caught.",
    "Better shoot yourself.\"",
    "\"It's more than fear, it's horror,\" he says in a strange serenity.",
    "The war may be \"necessary\", \"safe\", he continues.",
    "\"I advise you, it doesn't come.",
    "The skeptic is celebrated from the Ukrainian side, which is basically a misunderstanding.",
    "Strictly speaking, the Russian veteran says that everyone who only gets a short infantry training has no chance of surviving use on the front.",
    "No matter which side you are fighting."
  ],
  "topics": {
    "Conflict": 0.8850882649421692,
    "Military": 0.8282685875892639,
    "Energy": 0.8253672122955322,
    "Economy": 0.6930440664291382,
    "Environment": 0.6438063979148865,
    "Culture": 0.5662809014320374,
    "Health": 0.46621397137641907,
    "Politics": 0.40923625230789185,
    "Transport": 0.3282371759414673,
    "Technology": 0.308353066444397,
    "Crime": 0.22761107981204987,
    "Diplomacy": 0.17908960580825806,
    "Education": 0.08601155877113342,
    "Elections": 0.08138750493526459
  },
  "sentiment": {
    "positive": 0.264,
    "negative": 0.736,
    "neutral": 0.0
  }
}