{
  "title": "Israel-Politiker droht Russland im russischen Staats-TV",
  "published_date": null,
  "url": "https://www.merkur.de/politik/israelischer-spitzenpolitiker-droht-im-russischen-staatsfernsehen-russland-wird-den-preis-dafuer-bezahlen-92592893.html",
  "original_language": "de",
  "cleaned_sentences": [
    "\"Russia will pay for\" price \": Israel politician threatens in the Russian state TV with interference in the Ukraine War In an interview with Russia Today, an Israeli politician makes Russia serious allegations-and threatens with consequences for the Ukraine War.",
    "Moscow - An interview in the Russian state broadcaster Russia Today with a high Israeli politician has gone completely out of hand.",
    "The interlocutor Amir Weitmann, faction leader of the Israeli government party Likud, made Russia serious allegations of supporting the attack on Israel with hundreds of deaths.",
    "Finally, the politician threatens that \"Russia will pay\".",
    "The interview starts with heated: Right from the start, Weitmann generally refrains from credibility to the broadcaster.",
    "The hanging is a short and loud discussion about the explosion in a hospital in Gaza.",
    "The interviewer of Russia Today wants to talk about the alleged fire, but Weitmann interrupts him and accuses Russia of spreading propaganda.",
    "Weitmann names the fact that Israel should be responsible for the explosion as the “brazen lie”.",
    "Top politicians from Israel rages in Russia's state TV: \"Russia will pay\" \"I understand that they are paid by Russia and I understand that this is Russian propaganda here.",
    "But they have to be very careful,\" continued Weitmann.",
    "\"We will end this war.",
    "We will win because we are stronger.",
    "After that, Russia will pay the price.\"",
    "Obviously confused by the statement that Russia will pay the price, the interviewer replies: \"Russia will pay the price?\"",
    "Then Weitmann will divide.",
    "“Russia supports the enemies of Israel.",
    "Russia supports Nazis, who want to commit a genocide of us.",
    "And Russia will pay the price for that.",
    "Israel politician threatens Russia: \"Will make sure that Ukraine wins\" After Israel won the war against Hamas, Weitmann continued, \"Israel will not forget what Russia has done.\"",
    "In addition, he made it clear what consequences could look like.",
    "\"We will make sure that Ukraine wins.\"",
    "Russia must expect \"consequences\" The interviewer reacts to this: \"We can find that a passionate conflict is currently happening.\"",
    "- and from here Weitmann finally loses the version.",
    "\"My people are massacred,\" describes the anger -burned politician.",
    "\"My people are slaughtered, from their deputies.",
    "They have to understand that actions have consequences.",
    "And if someone supports the murder of Jews, these people pay for it.",
    "It is in Gaza, it is everywhere else.\"",
    "To what extent Russia supports Hamas cannot be verified independently.",
    "For his part, the Ukrainian secret service claims that the Kremlin has passed weapons on to Hamas.",
    "The proximity of Russia and Iran suggests that support from the Kremlin for the terrorists cannot be proven in a valid."
  ],
  "topics": {
    "Conflict": 0.9983052611351013,
    "Politics": 0.9849942326545715,
    "Culture": 0.9039413928985596,
    "Health": 0.8958154320716858,
    "Military": 0.8775067925453186,
    "Diplomacy": 0.8457105159759521,
    "Technology": 0.8180717825889587,
    "Economy": 0.81791090965271,
    "Crime": 0.7375856637954712,
    "Energy": 0.7351447939872742,
    "Environment": 0.7337418794631958,
    "Transport": 0.715387225151062,
    "Elections": 0.7151346802711487,
    "Education": 0.6939169764518738
  },
  "sentiment": {
    "positive": 0.355,
    "negative": 0.645,
    "neutral": 0.0
  }
}