{
  "title": "„Sind Sie von Russia Today?“ Habeck kontert Reporter wegen Nawalny",
  "published_date": null,
  "url": "https://www.merkur.de/politik/robert-habeck-bundespressekonferenz-wirtschaftsminister-alexej-nawalny-russia-today-putin-92846183.html",
  "original_language": "de",
  "cleaned_sentences": [
    "Habeck countered reporter with a clear Nawalny announcement Robert Habeck actually wanted to present the Federal Economic Report.",
    "But the Minister of Economics deviates from the script due to Nawalny's death.",
    "Berlin - The crime is still not cleared up.",
    "But the perpetrator is considered agreed.",
    "Hardly any politician or expert in Germany currently doubts that Russia's President Vladimir Putin is ultimately responsible for the death of Alexej Nawalny.",
    "The still unexplained death of the Kremlin critic continues to employ federal politics days after the report.",
    "So Robert Habeck (Greens) came up with the events related to Alexej Nawalny's death at the presentation of the Federal Economic Report at the Federal Press Conference.",
    "The Federal Minister of Economics offered the question of a journalist from the news portal afterdekeniten.de.",
    "The website generally stands for pro -Russian reporting, which defines itself as peace -oriented.",
    "Robert Habeck at the Federal Press Conference: \"You are from Russia Today, right?\"",
    "In an analysis of the 20th anniversary, the time of personnel connections of individual editors and guest authors of Nachdekstages and Russia Today Germany (RT DE) revealed.",
    "The portal called the time authors a \"propaganda medium that spreads the narrative of the Putin regime under the guise of peace orientation\".",
    "Denkenite was once founded by SPD members.",
    "In the meantime, the portal mainly maintains a close relationship with Sahra Wagenknecht and the representatives of their newly founded alliance.",
    "It is therefore hardly surprising that Robert Habeck first reacted with a counter question when asked.",
    "\"You are from Russia today, right?\"",
    "The Federal Minister of Economics wanted to know.",
    "Instead, the journalist denied and emphasized the connection of the founders of thought pages to SPD veteran like Willy Brandt.",
    "Habeck then briefly discussed the actual question of alleged investigations by the domestic secret service of employees of his ministry.",
    "In times of the Ukraine War, these are normal processes-because Putin is working on the destabilization of Germany and Europe.",
    "With the conquest of Awdijika on the battlefield, Russia achieved strategic success, while the remains of the late Nawalny have continued to disappear.",
    "Habeck talks about the death of Alexej Nawalny Then BAT Habeck was to be able to move temporarily from the topic of \"Federal Economic Report\".",
    "What followed was a clear announcement to Russia and its sympathizers within Germany.",
    "\"It is difficult to endure a few days after Nawalny has been murdered that Russia's rapporteur here in the country discredit liberal democracy,\" said the Federal Minister of Economics.",
    "Every question should be answered in the Federal Republic of Germany.",
    "But something is different if these questions come from people who had sympathy with a country, \"in which questions must not even be asked, but people who ask questions, are locked away or murdered,\" said Habeck, who finally clarified: \"Then a moral border is reached that is difficult to endure.\""
  ],
  "topics": {
    "Politics": 0.9815694689750671,
    "Crime": 0.9312687516212463,
    "Conflict": 0.9071244597434998,
    "Economy": 0.8324272036552429,
    "Culture": 0.7848231196403503,
    "Diplomacy": 0.7816045880317688,
    "Elections": 0.6260406374931335,
    "Energy": 0.5692938566207886,
    "Transport": 0.5347570180892944,
    "Technology": 0.5233270525932312,
    "Education": 0.5129656791687012,
    "Military": 0.49586936831474304,
    "Environment": 0.442166268825531,
    "Health": 0.4070417881011963
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}