{
  "title": "Despedido el periodista de Russia Today que incitó a ahogar o quemar a niños ucranianos",
  "published_date": null,
  "url": "https://www.abc.es/internacional/despedido-periodista-russia-today-ahogar-quemar-ninos-ucrania-nsv-20221024172609-nt.html",
  "original_language": "es",
  "cleaned_sentences": [
    "Dismissed the journalist of Russia Today who prompted to drown or burn Ukrainian children Anton Krasovsky has been harshly criticized by the director of her chain for her \"wild and disgusting\" words Putin turns Ukraine with missiles and drones: \"Living near an electric plant is high risk\" Follow all the news about war in Ukraine live The Russia Today (RT) television, censored in several European countries after the start of the invasion of Ukraine, has fired one of its presenters for having openly opted that \"having drowned or burned in cabins\" to Ukrainian children.",
    "This is Anton Krasovsky, who conducted an interview on October 20 to the Russian writer Serguéi Lukiánenko, who spoke at a time of the same about his first visit to Ukraine in the 80s, even in the time of the Soviet Union.",
    "Lukiánenko told how some Ukrainian children of the time complain about Russian domain and wanted their country to be free or under the mandate of a different state.",
    "At that time, presenter Anton Krasovsky poured the opinions for which he has been fired and that have been qualified as \"wild and disgusting\" by the director of RT, Margarita Simonián.",
    "«They have those shit houses in the Montes Cárpatos, so let's push those children to these houses and burn them Anton Krasovsky «They had to have been drowned.",
    "If they say that the Russians are invaders, you immediately throw them into a river with a strong current, ”Krasovsky began to say.",
    "MEANWHILE ON RUSSIA'S STATE-FUNDED RT, Director of Broadcasting Anton Krasovsky Suggests Drowning or Burning Ukrainian Children, Makes Hideous Comments About The Rapes By Russian Soldiers In Ukraine, Says Ukraine Should not exist and ukrainians Who res res.",
    "Russia Should Be Shot.",
    "pic.twitter.com/bgiabnok4v - Julia Davis (@juliadavisnews) October 23, 2022 \"In fact, they have those shit houses there, terrible, in the Montes Cárpatos, so we push those children to these houses and burn them,\" added the presenter, in a few words that have scandalized their own chain for their severity.",
    "Ukrainian grandmothers and the future of the country As you can see in the video that illustrates this news, Ukrainian children were not the only object of hatred by Krasovsky, who also states that \"Ukrainian grandmothers would give their savings for funeral in exchange for being raped by Russian soldiers\" and arises if Ukraine should continue to exist as a country.",
    "\"Yes, because I would not want to share country with them,\" replied the guest, Serguéi Lukiánenko, to which the presenter replied with his particular solution: \"Well, we fired them,\" he said.",
    "Ukraine asks RT to total censorship Ukrainian Foreign Minister Dmytro Kuleba, has urged all countries that have not yet censored RT to do so after what he considers a \"incitement to genocide\" by Krasovsky.",
    "The chain, on the other hand, in addition to fullying the presenter, has opened an in -depth investigation after the words.",
    "Krasovsky, on the other hand, has apologized through social networks with a \"usually pass, you are in the air and let yourself take,\" which has ended up turning on the masses against him through Twitter.",
    "This functionality is only for subscribers Subscribe"
  ],
  "topics": {
    "Conflict": 0.8883478045463562,
    "Energy": 0.8527419567108154,
    "Culture": 0.7573285698890686,
    "Military": 0.6558976769447327,
    "Politics": 0.6531246304512024,
    "Economy": 0.6337658762931824,
    "Technology": 0.62410968542099,
    "Health": 0.6128232479095459,
    "Diplomacy": 0.6032938957214355,
    "Transport": 0.5459833145141602,
    "Crime": 0.5238423347473145,
    "Environment": 0.5172212719917297,
    "Education": 0.3088226616382599,
    "Elections": 0.1854962855577469
  },
  "sentiment": {
    "positive": 0.267,
    "negative": 0.733,
    "neutral": 0.0
  }
}