{
  "title": "Rusia atacar칤a a Espa침a en caso de una Tercera Guerra Mundial? Esto es lo que dice la televisi칩n rusa",
  "published_date": null,
  "url": "https://www.abc.es/internacional/rusia-atacara-espana-tercera-guerra-mundial-dice-television-rusa-20241123161504-nt.html",
  "original_language": "es",
  "cleaned_sentences": [
    "Would Russia attack Spain in case of a third World War?",
    "This is what Russian television says Russia-1 state television simulated Kremlin's response against Europe that would unleash a third world war Putin orders the series production of the new hypersonic missile launched in Ukraine Shortly after Biden gave green light to Ukraine to attack with long -range missiles and Putin reacts hardening a doctrine that allows us to respond with nuclear weapons in case of dangering its sovereignty, the Ukrainian army did the same and premiered this new option.",
    "What has made more than one nervous, with voices that wonder if we are facing the possibility of an escalation of the conflict.",
    "Meanwhile, the Russian Security Vice President Dmitri Medvedev, said that \"Russia could retaliate with weapons of mass destruction against kyiv and the main NATO facilities if they perceive a threat.\"",
    "In the midst of this tension, the forecast made by Russian state television has been recovered by talking about what a Russian nuclear attack would be to Europe.",
    "A media niche that the journalist Xavier Col치s calls Putin's \"asylum\".",
    "Russia-1 television simulated the response against Europe that would unleash a third World War.",
    "A video of the month of July that networks have viralized this week.",
    "To this, it is necessary that the Kremlin spokesman Dmitry Peskov has also warned in an interview with the Indian news agency Ani, that the war that began against kyiv \"is lengthening\" and that \"has evolved in a direct conflict between Russia and NATO.\"",
    "游游쥑땩勇游섫릖 Russian state television showed the countries of Europe that will be attacked with nuclear weapons if the war intensifies: - 洧댵洧뎼洧돇洧뎻洧뎼 洧뎲洧돆洧돀洧洧뎺洧뎿洧뎼洧돆洧뉧롓 洧뎲洧돆洧돀洧洧뎺洧뎿洧뎼洧돆洧뉧롓 (@Dogdega) November 19, 2024 \"It is enough three missiles and the British civilization will collapse.\"",
    "pic.twitter.com/8tkwoqkfky The presenter affirms that \"it is not difficult to imagine the geography of the Russian response\" to the increase in the support of NATO in Ukraine.",
    "He points out that in a military response, \"all European capitals would be under threat.\"",
    "The simulation points to the use of Russian missiles from Kalinningrad, a Russian enclave in the Baltic Sea, located between Lithuania and Poland, as a launch point for attacks.",
    "What countries would be attacked?",
    "Would Spain be among them?",
    "The video points to the Baltic countries, Estonia, Latvia and Lithuania, such as the initial targets for their adhesion to NATO and their proximity to the Russian neighborhood.",
    "Likewise, other European capitals such as Berlin (Germany), Warsaw (Poland), Prague (Czech Republic), Vienna, (Austria), Bucharest (Romania) and Paris (France) for their military support for Ukraine would also be possible objectives.",
    "Including all US bases in European territory.",
    "According to the map, Spain along with Portugal or Italy would not be, a priori, among the threatened.",
    "\"Everything that is needed is three missiles and collapse civilization\" The presenter points out that from Russia \"special attention to Britain\" will be paid \", since it is his\" traditional enemy. \"",
    "And he states that \"it would suffice with three missiles\" to cause the collapse of the British infrastructure.",
    "It details how the missiles launched from the Kola Peninsula could impact cities such as London, Manchester and Birmingham.",
    "In addition to aiming Naval and Military Bases from Devonport, Sheerness, Chatham or Clyde, in Scotland.",
    "For experts it is another attempt to sow fear adding firewood to the fire in a moment of uncertainty.",
    "In a similar scenario, as he remembered in the summer courses of the Complutense Carlos Uma침a, a member of the ICAN (international campaign for the abolition of nuclear weapons), which won the Nobel Peace Prize in 2017, 춺of all existing nuclear heads, around 2,000 are in a maximum alert state.",
    "And in front of them there is no effective antimisile shield, so the only reaction to an attack would probably be a counterattack.",
    "In sum, for Uma침a a latent threat to which no one should be exposed.",
    "This functionality is only for subscribers Subscribe"
  ],
  "topics": {
    "Conflict": 0.9747076034545898,
    "Culture": 0.9610705971717834,
    "Energy": 0.9528570771217346,
    "Environment": 0.9513582587242126,
    "Diplomacy": 0.9456140398979187,
    "Crime": 0.928805410861969,
    "Politics": 0.9075496196746826,
    "Elections": 0.9050619602203369,
    "Transport": 0.9030818939208984,
    "Technology": 0.9021593332290649,
    "Health": 0.8966418504714966,
    "Military": 0.8503454923629761,
    "Economy": 0.8109958171844482,
    "Education": 0.7114437818527222
  },
  "sentiment": {
    "positive": 0.321,
    "negative": 0.679,
    "neutral": 0.0
  }
}