{
  "title": "Las polémicas de Inna Afinogenova, la propagandista de Putin reconvertida en musa de Pablo Iglesias",
  "published_date": null,
  "url": "https://www.abc.es/espana/polemicas-inna-afinogenova-desinformacion-pablo-iglesias-20230428191428-nt.html",
  "original_language": "es",
  "cleaned_sentences": [
    "The controversies of Inna Afinogenova, the Putin propagandist converted in Musa by Pablo Iglesias Old Deputy Director of Russia Today in Spanish, the journalist has just signed on the Red Channel despite being a proven prorousous diffuser.",
    "Inna Afinogenova, the queen of Russian propaganda The last signing of Pablo Iglesias for his media body, Channel Red, is a declaration of intent.",
    "The journalist Inna Afinogenova, defined in the 'Washington Post' as «Russia's greatest propagandist in Latin America, has joined his team under a halo of being a repentant of the Putin regime.",
    "In fact, her work as deputy director of Russia Today in Spanish, the Kremlin organ to spread her propaganda, ended up abruptly to the point that she was accused of \"gaining dollars to the CNN Miamiera.\"",
    "Afinogenova appeared in Spain, hired as a collaborator of Iglesias for his podcast in 'Public' and then for the Red Channel itself, which has just made the leap to television after 'Okupar' the hole that has left 7nn in Madrid.",
    "At the same time, RT was vetoed throughout the western world because it was an obvious channel of diffusion of prorruse bulos and she resigned.",
    "The order of factors in this case is not clear.",
    "«I am Inna Afinogenova, Russian journalist.",
    "After several years working for a public television in my country, I started a stage as an independent journalist, ”he announced on his YouTube channel, where he worked so far.",
    "Nothing is ever independent, neither in his years hired by Russia nor later.",
    "Afinogenova, the false repentant that bug Catalan independentism Afinogenova went from denying the Russian invasion of Ukraine (\"January will arrive, then February and March, will end 2022 and surely in the media they will continue to read that the invasion is imminent (...) an imminence that never arrives, does not do so for ignorance, but because they have it perfectly calculated,\" he said in 2021) to be publicly positioned against Putin.",
    "However, his resignation of RT was never believed.",
    "Max Golovánov, former producer of the channel, affirms that she falsified news knowing that it was so.",
    "It was not due to bad praxis, which also, but by bad faith.",
    "\"In my presence, INNA violated journalistic ethics, ordering to publish falsely false material, contributing to the Belicism and the propaganda of violence in Russia,\" said Golovánov in a manuscript letter to 'The Newspaper'.",
    "«In my presence, Inna violated journalistic ethics, ordering to publish falsely false material, contributing to the Belicism and the propaganda of violence in Russia » Max beating Former RT channel producer In this sense, he was never believed, neither in Spain.",
    "David Alandete, ABC correspondent in Washington, denounces that it was she who pointed out (in addition to other media) during the hard era of independence.",
    "Afinogenova served as a speaker to put tares in the most complex years with the sole objective of destabilizing Spain and, incidentally, to Europe.",
    "\"Maps with false awards in Europe to the new Catalan country, headlines on tanks in Barcelona, ​​false figures on injured in the 2017 illegal referendum ...\", recalls Alandete.",
    "All this and more did in his years in RT.",
    "She maintains that it is no longer that inna.",
    "Although Pablo Iglesias has rushed out in his defense, the precedents do not invite to think that he has changed a lot.",
    "Or worse: if you have done it, it is with dark intentions.",
    "\"My admiration for her and for her journalistic work is only comparable to the contempt that I feel towards that corporate mafia of Palmeros of power that today attack her with garbage,\" Churches attack.",
    "Inna left a salary that he will never charge here, left his country, his freedom was played and the one who lives in Russia was played every day.",
    "And he did it for ethical reasons, for being against war.",
    "And he joined us, knowing that they were going to crush him from both sides.",
    "Mi ... pic.twitter.com/oaac31ieid - Pablo Iglesias 🔻 (R) (@Pabloiglesias) April 27, 2023 Too westernist for some, too protrusing for others, stinking for both, Inna Afinogenova aims to be a friendly image in the Churches channel, which has its own agenda and has proposed to launch its truth above that established in traditional media.",
    "No one better than an expert in spreading misinformation to help you ... even though it is sorry.",
    "This functionality is only for subscribers Subscribe"
  ],
  "topics": {
    "Conflict": 0.9210607409477234,
    "Elections": 0.7877945303916931,
    "Diplomacy": 0.7660855054855347,
    "Culture": 0.7584380507469177,
    "Politics": 0.7499377131462097,
    "Energy": 0.7271730899810791,
    "Health": 0.7265833020210266,
    "Crime": 0.7259401082992554,
    "Transport": 0.6406046748161316,
    "Economy": 0.5879102349281311,
    "Technology": 0.5525853037834167,
    "Environment": 0.5447186231613159,
    "Military": 0.5057175159454346,
    "Education": 0.4217323362827301
  },
  "sentiment": {
    "positive": 0.3,
    "negative": 0.7,
    "neutral": 0.0
  }
}