{
  "title": "Rosa Belmonte: Chatarra",
  "published_date": null,
  "url": "https://www.abc.es/opinion/abci-rosa-belmonte-chatarra-202202282256_noticia.html",
  "original_language": "es",
  "cleaned_sentences": [
    "Scrap Apart from saying ‘Obvio’, like adolescents, Pablo Iglesias seems the same ‘Russia Today’ as Vicente Vallés Pablo Iglesias is shine to the scrap from his head.",
    "It seems bad that the European Union prohibits the emissions of ‘Russia Today’ and ‘Sputnik’.",
    "What do they report in favor of the Russian government?",
    "«Without a doubt, just like Mediaset and Atresmedia they inform ... favor of their owners.",
    "Will they manipulate in a war context?",
    "What does it mean to censor them?",
    "That press freedom is a hypocritical liberal speech ».",
    "Apart from saying ‘Obvio’, like adolescents, Churches seems the same as ‘Russia Today’ as Vicente Vallés.",
    "That has not compared those Russian media with TV3.",
    "He already warned: \"A certain media education is a democratic need.\"",
    "That is, education is that he tells us what political propaganda is and what does not.",
    "That equates the media of a country with freedom of the press and those of a dictatorship that has a thing called Roskomnazor, a federal body that monitors the media.",
    "As monster as Cthulhu.",
    "The organism that suppressed the video of ‘Nóvaya Gazeta’ published by Dmitri Muratov with the name of ‘No to the War’.",
    "As if Putin were Bambino and his ‘I don't give me war, war, war’.",
    "In the magnificent interview that this Sunday we read in ‘XL weekly’ with Svetlana Alexiévich and Herta Müller, they were asked if Putin was a dictator.",
    "«And what is it if not?",
    "The opponents are sent to jail or penitentiary fields.",
    "The Stalin field system continues to work in Russia.",
    "Moreover, it has just dissolved ‘memorial’ ... ».",
    "And Aleksévich: «After the collapse of the Soviet Union, people did not know how to fill democracy with life.",
    "We had shouted for her, but we had no idea how to be free.",
    "We had no political culture.",
    "With that void the oligarchs were found ... and enriched themselves.",
    "Suddenly, we were living in a world that we did not want, in a predatory capitalism in which a few are very rich and many are very poor ... ».",
    "As if we had not left the 70s and 80s in 1976, Juan Benet wanted people like Solzhenitsyn to continue in the ‘gulag’ when the Nobel Prize explained in what of Íñigo that ours was not dictatorship compared to the USSR.",
    "There are now zopencos demonstrating against NATO and Chomsky, the one that was missing, says that Russia is surrounded by offensive weapons from the United States.",
    "A poorly besieged Russia.",
    "He suggests that we imagine that in the Cold War the Warsaw Pact would have arrived in Mexico or Canada.",
    "That there would have been a violent response from the United States, we would end up, now I understand the Russian invasion.",
    "A scholar by Nicolás Gómez Dávila: the tragedy of the left is to diagnose the disease correctly, but aggravate it with its therapy.",
    "Perhaps it is more tragic living in a parallel world where you have to defend the bad.",
    "This functionality is only for subscribers Subscribe"
  ],
  "topics": {
    "Politics": 0.8918371200561523,
    "Education": 0.8904752135276794,
    "Conflict": 0.8095532059669495,
    "Culture": 0.7861354351043701,
    "Health": 0.6684600710868835,
    "Crime": 0.6611480116844177,
    "Technology": 0.6475345492362976,
    "Diplomacy": 0.637649655342102,
    "Environment": 0.6222031116485596,
    "Economy": 0.604369044303894,
    "Energy": 0.5796909332275391,
    "Military": 0.5596047043800354,
    "Transport": 0.5490689277648926,
    "Elections": 0.47610989212989807
  },
  "sentiment": {
    "positive": 0.242,
    "negative": 0.758,
    "neutral": 0.0
  }
}