{
  "title": "La Russie a lancé sa \" Tesla killer \" qui fait bien rire tout le monde",
  "published_date": null,
  "url": "https://www.journaldugeek.com/2023/12/24/la-russie-a-lance-sa-tesla-killer-qui-fait-bien-rire-tout-le-monde/",
  "original_language": "fr",
  "cleaned_sentences": [
    "Amber represents a hell of a bet for the Russian automotive industry, especially for the Kaliningrad Avtotator factory.",
    "Formerly car builder for BMW, Ford, Kia and Hyundai brands, the factory had to reorient itself following Western sanctions taken after the invasion of Ukraine.",
    "This pivot towards the production of electric vehicles is perceived as a strategic necessity, although the reactions of the Russian public (and the rest of the world) oscillate between horror and mockery.",
    "Many consider this change as a sign of persistent difficulties in the country's automotive industry.",
    "Please kill me Amber design, described as disproportionate and lines deemed ridiculous, particularly attracted attention.",
    "Many compare the vehicle to the cursed Multipla of Fiat with whom he shares a certain familiarity ...",
    "But despite these criticisms, the Moscow Polytechnic University insists that each component of the Amber, including the engine, the inverter and the batteries, is of Russian manufacture.",
    "An assertion that raises many questions, especially on the historic dependence of Russia to Chinese components for its automotive production ... 😆 😆 😆 😆 😆 😆 The #Russian Avtotor presented its first Electric Car, Amber.",
    "They Promise to Launch Mass Production by 2025, The Creators ensures that all components of this product are made in #russia.",
    "#Ukraine #putinisamasskiller #putinisAwariminal @Kardinal691 pic.twitter.com/c9ukal5eb2 - Putin's IBS (@kardinal691) December 18, 2023 Amber, whose mass production is scheduled for 2025, has the ambition to become the affordable electric car for Russian consumers.",
    "Polytechnique University has announced that batteries, potentially supplied by Rosatom, could be rented to reduce vehicle costs.",
    "However, skepticism remains about the capacity of the Russian industry to develop advanced technology in such a short time.",
    "Especially since it is deprived of Western technologies ...",
    "In addition to Amber, Avtotor has also announced the development of other vehicles: a quad, a roof -free van and a minibus, all under the Amber brand.",
    "An all -round diversification expected of firm foot by all bad languages: these new models may also transform themselves into the laughingstock of the web!",
    "The Russian automotive industry, struggling with international sanctions, must absolutely find the means of its emancipation and its autonomy if it wants to survive.",
    "Faced with the innumerable mockery that it is the subject of, both in Russia and in the rest of the world, the Amber project as it was presented seems to be stillborn.",
    "🟣 To not miss any news on the Geek newspaper, subscribe to Google News and on our WhatsApp.",
    "And if you love us, we have a newsletter every morning."
  ],
  "topics": {
    "Conflict": 0.931294322013855,
    "Technology": 0.897691011428833,
    "Energy": 0.8957819938659668,
    "Politics": 0.8739650249481201,
    "Culture": 0.8201805949211121,
    "Economy": 0.7874796986579895,
    "Transport": 0.713051438331604,
    "Environment": 0.6231521368026733,
    "Diplomacy": 0.5870347023010254,
    "Health": 0.5164076685905457,
    "Military": 0.5103346705436707,
    "Crime": 0.3786067068576813,
    "Education": 0.3570801317691803,
    "Elections": 0.3518918752670288
  },
  "sentiment": {
    "positive": 0.263,
    "negative": 0.737,
    "neutral": 0.0
  }
}