{
  "title": "Le correspondant de CNews à Moscou travaille aussi pour Russia Today, média financé par le Kremlin interdit en France",
  "published_date": null,
  "url": "https://www.ladepeche.fr/2024/03/27/le-correspondant-de-cnews-a-moscou-travaille-aussi-pour-russia-today-media-finance-par-le-kremlin-interdit-en-france-11853116.php",
  "original_language": "fr",
  "cleaned_sentences": [
    "The CNEWS correspondent in Moscow also works for Russia Today, media funded by the Kremlin prohibited in France The CNews channel is now working with journalist Igor Kurashenko in Russia, as a correspondent.",
    "But what the channel does not say is that it also collaborates with Russia Today, a media funded by the Kremlin.",
    "What question his independence.",
    "It was a duplex who put the chip in the ear of liberation journalists, who relayed information on Tuesday, March 26.",
    "Three days earlier, Igor Kurashenko, presented as the CNEWS correspondent in Moscow for the continuous news channel of the Bolloré group, answers questions from journalist Thierry Cabannes on set in Paris.",
    "But in the back of the Russian journalist, who studied in the university of letters from Limoges, as the national daily explains, we see the Russia Today logo appear, the letters RT in black on a green background.",
    "The media, funded by the Kremlin, has installed several antennas in different Western countries in the past, such as France.",
    "\\ UD83D \\ Udd34 Igor Kurashenko is the new CNEWS correspondent in Russia.",
    "He is also a journalist at Russia Today, the Russian state media.",
    "CNews did not follow up on this mixture of genres.",
    "Viewers are not warned.",
    "- Liberation (@libe) March 26, 2024 By @Checknewsfr: This French branch also used many journalists, including Frédéric Taddeï, a well -known figure in French audiovisual, who still officiated last December on ... CNews, and even today on Europe 1, which belongs to the same group of Vincent Bolloré.",
    "In an article by @Libe, we learn that the CNEWS correspondent in \\ UD83C \\ Uddf7 \\ UD83C \\ Uddfa is a \"journalist\" of RT.",
    "- The eye of the Kremlin (@Loeildukremlin_) March 26, 2024 At the beginning of 2024, RT presented it as asking the following question to Pierre Lévy, Ambassador \\ UD83C \\ UDDEB \\ UD83C \\ UDDF7 in Russia: \"What are French mercenaries in Ukraine?\"",
    "Pic.twitter.com/qeikztbo2n On the Tiktok of Russia TODAY Shortly after the Russian invasion in Ukraine in February 2022, France decided to ban Russia Today in the country.",
    "But Igor Kurashenko continues obviously to work for the Russian media from Moscow.",
    "In addition to his manifest presence in the premises of the media in the Russian capital, betrayed by this duplex on Saturday March 23, we see him appear on the French Tiktok account of Russia Today \"Rtenfrançais\".",
    "His LinkedIn account also includes several publications on behalf of RT.",
    "@Rentenfrancais Our reporter Igor Kourachenko is on site.",
    "Behind him, we can see the building of the Crocus City Hall, a third of which is in flames.",
    "♬ Original Sound - Rtenfrançais His duplicate is not specified during his interventions on CNews as a correspondent, underlines Liberation.",
    "Enough to pose clearly when the information he relays seem to be in line with Vladimir Putin's speech.",
    "After the attack at the Crocus City Hall last Friday, in particular, Igor Kurashenko did not hesitate to say, like the Kremlin, that the terrorists had not acted on behalf of the Islamic State, but well on the orders of Ukraine ..."
  ],
  "topics": {
    "Culture": 0.9433704614639282,
    "Conflict": 0.8392864465713501,
    "Technology": 0.8347131013870239,
    "Military": 0.7648083567619324,
    "Economy": 0.7273501753807068,
    "Environment": 0.7130972743034363,
    "Energy": 0.7017036080360413,
    "Crime": 0.6999272108078003,
    "Transport": 0.6834551095962524,
    "Education": 0.6629292964935303,
    "Politics": 0.6536688804626465,
    "Health": 0.6497486233711243,
    "Elections": 0.5749144554138184,
    "Diplomacy": 0.5447511672973633
  },
  "sentiment": {
    "positive": 0.478,
    "negative": 0.522,
    "neutral": 0.0
  }
}