{
  "title": "Le cofondateur de Yandex, Arkady Volozh, sera retiré de la liste des sanctions russes de l'UE, selon certaines sources",
  "published_date": null,
  "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/Le-cofondateur-de-Yandex-Arkady-Volozh-sera-retire-de-la-liste-des-sanctions-russes-de-l-UE-selo-45999160/",
  "original_language": "fr",
  "cleaned_sentences": [
    "EU countries have agreed to withdraw Arkady Volzh, co -founder of the Russian Internet giant Yandex, from their list of entities and people sanctioned in the War in Ukraine, three sources said to the file.",
    "Mr. Volozh is one of the three people who will be withdrawn from the list after March 15, when the sanctions regime will be renewed.",
    "The EU regime must be examined and renewed every six months.",
    "Mr. Volozh did not immediately respond to a comment request.",
    "In August of last year, Mr. Volozh described the war waged by Russia in Ukraine as \"barbarian\", after remained silent following the initial invasion of February 24, 2022.",
    "In addition, Mr. Volozh is about to cut links with the Russian activities of Yandex, after a consortium of investors agreed to buy the Russian assets of the Dutch holding company Yandex NV at the beginning of February.",
    "Volozh holds an economic participation of 8.5 % in Yandex NV through a family trust, but does not have voting rights in this company listed in Nasdaq.",
    "Two people who have told Reuters at the beginning of the month that the legal arguments against Volozh lessened, taking into account the total sale proposal.",
    "(Report by Julia Payne and Jan Strupczewski, additional information from Alexander Marrow and Anne Kauranen; drafting of Kirsten Donovan)"
  ],
  "topics": {
    "Conflict": 0.8482784628868103,
    "Economy": 0.7360870838165283,
    "Politics": 0.6276759505271912,
    "Technology": 0.5742039084434509,
    "Culture": 0.5594953894615173,
    "Environment": 0.3907065689563751,
    "Diplomacy": 0.35480165481567383,
    "Crime": 0.15997742116451263,
    "Transport": 0.15923336148262024,
    "Health": 0.14164969325065613,
    "Military": 0.13499967753887177,
    "Energy": 0.13224735856056213,
    "Elections": 0.10393307358026505,
    "Education": 0.0546407476067543
  },
  "sentiment": {
    "positive": 0.111,
    "negative": 0.889,
    "neutral": 0.0
  }
}