{
  "title": "En Russie, Vladimir Poutine a mis les propagandistes du Kremlin face à un dilemme inhabituel",
  "published_date": null,
  "url": "https://www.huffingtonpost.fr/international/video/en-russie-vladimir-poutine-a-mis-les-propagandistes-du-kremlin-face-a-un-dilemme_219834.html",
  "original_language": "fr",
  "cleaned_sentences": [
    "Russia - Since the start of the war in Ukraine, Russian state television invariably defends the cause of Vladimir Putin, with false information and virulent criticisms of the West.",
    "Until it seems to be Sunday, June 26, after the brief Mutinerie Army of the Wagner paramilitary group led by Evguéni Prigojine which shaken Russia this weekend.",
    "Two days ago on Sunday evening set with Vladimir Soloviev, one of the most famous shows broadcast on the Russia 1 state chain, the tone was much less unanimous and serene than usual, noted BFMTV this Tuesday, June 27.",
    "In this daily debate program where all experts and deputies are acquired at the cause of the Kremlin, Sunday was qualified in the introduction of \"terrifying\" by Vladimir Soloviev.",
    "The latter, followed by 1.3 million people on Telegram, is an ex-opponent of Vladimir Putin, which has become his chief propagandist.",
    "For example, he had benefited from 218 hours of antenna over the first three months of the conflict last year, TF1 Info recalls.",
    "\"Listen to what the president said by the voice of his spokesperson Dmitri Peskov:\" The heroes who made a mistake will not be prosecuted out of respect for everything they have accomplished \", but there is an expression that says\" thank you for yesterday, but report for today \",\" said Vladimir Soloviev, dressed in black as usual.",
    "\"A ball in the head is the only salvation for Evguéni Prigojine\" On the set, the deputy for Duma Andrey Gurulyov, even went so far as to criticize Putin's decisions: \"I am firmly convinced that in wartime, the traitors must be eliminated.",
    "Today, it doesn't matter who says, whatever the story he tells.",
    "A ball in the head is the only salvation for Evguéni Prigojine.",
    "»» A speech that detonates that of Vladimir Putin, who had simply stated the chief of Wagner to go into exile in Belarus with his recalcitrant men.",
    "A day later, BFMTV notes that Andrey Gurulyov completely changed his mind and tone, thanking the Russian president for his wisdom ... For his part, while Wagner's troops were walking towards Moscow, the editor -in -chief of the RT State Information Network, Margarita Simonian, had been curiously silent.",
    "Sunday in the show of Vladimir Soloviev, she explained that she then made at the same time a cruise on the Volga to film a cultural documentary on centuries -old Orthodox churches, ensuring that he then ignored everything that was striving at the highest level of the state.",
    "Pirouettes to defend Vladimir Putin She then showed great flexibility to defend Vladimir Putin's decision loudly to abandon the proceedings against the Wagner group.",
    "\"Legal standards are not the commandments of Christ or Moses' tablets,\" she said, as the Financial Times reports.",
    "\"They are written by people to protect the law and the stability of the country.",
    "In some exceptional critical cases, they disappear ”.",
    "For his part, journalist Dmitri Kisselev also tried to defend the Russian president, saying that Wagner's insurgency had proven that \"Russia has once again passed a maturity test\".",
    "\"Why was it possible to put an end to an attempt at an insurrection without bloodshed?",
    "Because the people had supreme confidence in the president, \"he said.",
    "For 24 hours this weekend, Wagner's men seized several military sites in Rostov's strategic city and traveled hundreds of kilometers towards Moscow before Evéni Prigojine ends his rebellion in exchange for immunity promised by the Kremlin for him and his men.",
    "This crisis represents the greatest challenge to which Vladimir Putin, who denounced a \"betrayal\", was confronted since his coming to power in late 1999.",
    "To see also on the HuffPost:"
  ],
  "topics": {
    "Politics": 0.5642329454421997,
    "Culture": 0.515229344367981,
    "Conflict": 0.5033061504364014,
    "Military": 0.3868669867515564,
    "Diplomacy": 0.2607698142528534,
    "Economy": 0.25621017813682556,
    "Technology": 0.21129314601421356,
    "Energy": 0.20515303313732147,
    "Crime": 0.19917869567871094,
    "Transport": 0.1770196110010147,
    "Health": 0.159568190574646,
    "Elections": 0.15763616561889648,
    "Education": 0.1565186083316803,
    "Environment": 0.11301523447036743
  },
  "sentiment": {
    "positive": 0.435,
    "negative": 0.565,
    "neutral": 0.0
  }
}