{
  "title": "Cheap sunflower oil from Russia, Ukraine rattles palm oil market -Le 11 octobre 2023 à 11:08",
  "published_date": null,
  "url": "https://www.zonebourse.com/cours/matiere-premiere/WTI-2355639/actualite/L-huile-de-tournesol-bon-marche-en-provenance-de-Russie-et-d-Ukraine-ebranle-le-marche-de-l-huile-45037513/",
  "original_language": "fr",
  "cleaned_sentences": [
    "An influx of cheap sunflower oil from Russia and Ukraine exerts downward pressure on the prices of palm oil, the two main producers taking advantage of the depreciation of their currency to seize a larger part of the edible oil market.",
    "Last year, the prices of palm oil soar after the invasion of Ukraine by Russia, which disrupted the supply of sunflower oil from the Black Sea region.",
    "Today, sunflower oil, which is generally very expensive, is cheaper than soybean oil and its price is negligible compared to that of palm oil, said Vipin Gupta, managing director of Glentech Group, a merchant based in Dubai.",
    "\"Aggressive sales of solar oil coming from the Black Sea region exert pressure on palm oil and other edible oils,\" he said.",
    "The gross sunflower oil is offered at 895 dollars per metric tonne, cost, insurance and freight (CIF) included, for India for October expeditions, compared to 850 dollars for gross palm oil, according to merchants.",
    "A year ago, sunflower oil benefited from a bonus of more than $ 400 per tonne compared to palm oil, compared to $ 45 today.",
    "Russia has raised a record amount of sunflower seeds, more than 17 million tonnes, and farmers are selling the seeds aggressively, said a large Russian edible oil refinement that has refused to be identified.",
    "Snaturation that has grown, exports of sunflower oil is expected to increase this year to 4.5 million tonnes, compared to 3.7 million tonnes last year, the refiner said.",
    "In terms of dollars, prices have dropped in the past three months, but Russian farmers still get decent income due to the depreciation of the ruble, he added.",
    "Russian currency lost more than 38 % compared to the US dollar this year.",
    "Ukraine, which had trouble sending sunflower oil after the withdrawal of Russia from the Black Sea Cereals Agreement, also sold sunflower seeds, said a Ukrainian exporter.",
    "\"The neighbors of Ukraine transform imported seeds and export oil,\" he said.",
    "The Ukrainian central bank devalued the Hryvnia 25 % compared to the US dollar in July 2022.",
    "The US Ministry of Agriculture (USDA) provides that Ukraine's sunflower seed harvest will reach 14 million tonnes, up compared to the 12.2 million tonnes of the previous year, but below the 17.5 million tonnes harvested during the 2021/22 season.",
    "The production of the European Union could increase from 9.2 million tonnes to 10.6 million tonnes, according to estimates by the USDA.",
    "Indonesia and Malaysia are at the top of palm oil exports, while Argentina, Brazil and the United States are the main sellers of soy oil.",
    "India, the largest importer of palm oil and solar oil, could import a record of 3.2 million tonnes of sunflower oil during the new marketing campaign starting on November 1, but its imports of palm oil could fall by 8 % to 9 million tonnes, said Nirav Desai, director of GGN Research, an edible trader and broker.",
    "Usually India imports around 200,000 tonnes of sunflower oil per month, but in recent months, it has bought more than 300,000 tonnes, he added.",
    "Unlike palm oil, the availability of sunflower oil is limited, and stocks should be exhausted during the December quarter due to aggressive sales, said a merchant based in Singapore in an international commercial house, adding that this could increase his bonus over $ 150 per tonne in January.",
    "The prices of palm oil have fallen this week at their lowest level for three and a half months, the stocks in Malaysia having reached their highest level for 11 months at the end of September.",
    "\"In the short term, Sunoil will exert pressure on palm oil, especially when stocks increase in producing countries,\" said the merchant."
  ],
  "topics": {
    "Economy": 0.8559442162513733,
    "Politics": 0.8112784624099731,
    "Energy": 0.7782767415046692,
    "Conflict": 0.7772412896156311,
    "Culture": 0.7434708476066589,
    "Diplomacy": 0.6647005081176758,
    "Health": 0.6415069699287415,
    "Environment": 0.6374077796936035,
    "Technology": 0.5772058367729187,
    "Transport": 0.5561947822570801,
    "Crime": 0.4119134545326233,
    "Elections": 0.40274477005004883,
    "Military": 0.40042269229888916,
    "Education": 0.38159364461898804
  },
  "sentiment": {
    "positive": 0.286,
    "negative": 0.714,
    "neutral": 0.0
  }
}