{
  "title": "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump",
  "published_date": null,
  "url": "https://news.sky.com/story/good-chance-of-russia-ukraine-peace-but-us-has-a-red-line-in-talks-says-donald-trump-13371047",
  "original_language": "en",
  "cleaned_sentences": [
    "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump The US president spoke to his Russian and Ukrainian counterparts on Monday as part of a bid to push Moscow and Kyiv towards agreeing a ceasefire.",
    "Tuesday 20 May 2025 03:06, UK Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.",
    "After a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\".",
    "It is unclear how these will differ from negotiations that already started in Turkey last Friday.",
    "Speaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is.",
    "There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\"",
    "The US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\"",
    "He said of the Russian president: \"I do believe he wants to end [the war].\"",
    "\"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added.",
    "The US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war.",
    "In a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\".",
    "Mr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree.",
    "\"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
    "Its potential is unlimited.\"",
    "Ukraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said.",
    "The Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added.",
    "He signed off his post with: \"Let the process begin!\"",
    "Mr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported.",
    "\"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said.",
    "Discussions are 'positive,' says Zelenskyy The US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders.",
    "At a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\".",
    "\"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued.",
    "\"I don't yet have an answer to that question.\"",
    "Kyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\".",
    "He continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland.",
    "We are currently considering these three venues, as all three countries - all three venues - are neutral.\"",
    "European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce.",
    "The Russian president has resisted that, insisting that conditions be met first.",
    "Be the first to get Breaking News Install the Sky News app for free The Trump-Putin call came as Russia has continued to target Ukraine with attacks.",
    "Moscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA.",
    "Read more: Russia bans Amnesty International Ukraine-Russia talks revealed stark reality - analysis Russia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region.",
    "RIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.",
    "Ukraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured.",
    "On Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
  ],
  "topics": {
    "Conflict": 0.9487153887748718,
    "Politics": 0.9253284931182861,
    "Economy": 0.9211602807044983,
    "Diplomacy": 0.9137534499168396,
    "Health": 0.8972492218017578,
    "Technology": 0.8688560724258423,
    "Military": 0.8554493188858032,
    "Energy": 0.851473331451416,
    "Environment": 0.8264498710632324,
    "Culture": 0.767469048500061,
    "Elections": 0.7637162208557129,
    "Transport": 0.7459409832954407,
    "Crime": 0.7384803891181946,
    "Education": 0.5920407176017761
  },
  "sentiment": {
    "positive": 0.412,
    "negative": 0.588,
    "neutral": 0.0
  }
}