{
  "title": "The USSR occupied eastern Europe, calling it ‘liberation’ - Russia is repeating the crime in Ukraine",
  "published_date": null,
  "url": "https://www.theguardian.com/commentisfree/2025/may/19/russia-illegal-occupation-eastern-europe-ukraine-post-soviet",
  "original_language": "en",
  "cleaned_sentences": [
    "We often hear that it is Russia’s inability or unwillingness to deal with the crimes of its past that has led to the restoration of tyranny and the military aggression that we see now.",
    "Such a narrative usually focuses only on internal Soviet deeds: forced collectivisation, the Great Terror of the 1930s, the Gulag system and so on.",
    "Some of these things were nominally recognised as crimes, but no attempt was made to hold the perpetrators to account.",
    "Russia’s perestroika democrats were generally opposed to transitional justice.",
    "However, the most politically sensitive Soviet crime is nearly always left out of the discussion.",
    "And Russia’s failure to address this particular crime is far more dangerous and affects the fate of many nations.",
    "That crime is the Soviet occupation of central and eastern Europe, which lasted for decades and resulted in many dead and arrested, the destruction of social and cultural life and the denial of freedom.",
    "The injustice was immense.",
    "Internal Soviet crimes, which went unpunished, were at least legally acknowledged and their victims commemorated.",
    "External aggression and occupation were not.",
    "Аnd even Russian dissidents and liberals never risked raising the issue.",
    "This is why, in relation to central and eastern Europe, there are two concepts of memory and history that normally cannot coexist, that clash with and contradict each other.",
    "They are totally opposed; they cannot be reconciled by diplomacy: Soviet liberation versus Soviet occupation.",
    "It was only when Soviet troops finally withdrew from eastern and central Europe 45 years after the end of the second world war that the true liberation came, when the Soviet Union collapsed and occupied nations found their way to independence.",
    "But it was easier to restore or establish statehood and independence than to achieve sovereignty of historical memory.",
    "The progressive image of the Soviet Union in its final days, the high hopes of the moment, shielded Moscow from serious criticism and accusations related to the occupation of eastern Europe.",
    "This restraint was the result of a surfeit of trust or, maybe, just cautionary pragmatism – the desire not to irritate Moscow and undermine its goodwill, not to burden the losers of the cold war too much.",
    "But the most important protection Moscow enjoyed was, of course, based on the status of having been victorious over nazism.",
    "Russia, as the self-proclaimed successor state to the USSR, has built its international political profile on the Soviet liberation myth, which provides moral capital and prescribes to the former occupied territories a debt of gratitude for their “liberation” from nazism.",
    "Yes, the Soviet losses were real.",
    "And yet it is truly tragic that these losses helped to subjugate nations longing for freedom, replacing one dictatorship with another.",
    "The Soviet soldier, memorialised in statues that still mark the landscape of Europe from Berlin to Sofia, was not a liberator.",
    "And no amount of bloodshed by the Soviets to defeat the Nazis can excuse the Soviets’ own role as occupiers.",
    "It is not accidental that the Soviets were reluctant to recognise even the existence of the Molotov-Ribbentrop pact.",
    "In modern Russia, to make any equivalence between the roles of the USSR and the Nazis is criminalised.",
    "In 1939 and 1940, the Soviet Union occupied Lithuania, Latvia and Estonia, and parts of Poland, Finland and Romania.",
    "For 22 months it was a faithful ally of Nazi Germany.",
    "This first wave of Soviet occupations can in no way be disguised as a “struggle against nazism”: it revealed the real intention of the Soviets.",
    "What then followed, was, in fact, a geographically extended reoccupation.",
    "This was a separate aim of the war, not necessarily connected to the one to defeat the Nazis.",
    "Unfortunately, understanding the Soviet occupation as a crime has not become an essential part of modern European history.",
    "It is geographically limited to the east, blurred, insufficiently represented; it forms part of the histories of individual nations but it does not form a powerful international narrative shared across the continent.",
    "Yet this understanding has a profound bearing on modern European life and is key to European security.",
    "Only when you fully grasp the cruelty and consequences of the Soviet occupation can you comprehend the concerns of Russia’s closest neighbours, their historically grounded fears and their need for safety.",
    "Eastern regions of Ukraine are now occupied by Russian troops.",
    "For the first time since 1989, large areas of the European continent, home to millions of people, are under the control of an invading state.",
    "But it seems that too many Europeans have already forgotten what occupation means.",
    "Russian citizenship is being forcibly imposed.",
    "In fact, this is a mass expulsion programme, because those who do not agree will be treated as foreigners and forced to leave.",
    "Russia is pursuing the same path as the USSR did, for example, in relation to the Baltic states, aiming to Russify the conquered region, rearrange its national composition and make it a part of its state.",
    "Property is being confiscated and redistributed.",
    "“Settlers” are brought in to form the backbone of the occupation regime.",
    "The politics of memory are reversed, monuments marking Soviet crimes disappear, streets are given back their Soviet names as a symbol of Russian domination.",
    "All this is part of an attack on national identity, an attempt to erase it.",
    "The Russian state security services use filtration techniques extensively, and anyone deemed politically unreliable can be imprisoned.",
    "Severe torture and sexualised violence are widespread.",
    "Ukrainian prisoners of war released from captivity report the same torture, abuse and deliberate malnutrition aimed at breaking them physically and mentally.",
    "Anyone who knows the history behind the iron curtain immediately recognises the pattern.",
    "All this was a grim reality for Poland and Lithuania, East Germany and Romania and others.",
    "Mass deportations, the brutal rule of the secret police, deprivation of property and civil rights … but it never became a real stigma for the USSR or, later, Russia.",
    "It never became something of which a nation is ashamed, something that demands justice and punishment, acknowledgment and atonement.",
    "And this is where we are now: the occupier is back.",
    "And the occupier wages war exactly like the Soviets did.",
    "Vladimir Putin’s army has a gruesome advantage over western armies, which have invested heavily in keeping their personnel out of harm’s way.",
    "It can sustain losses that would be absolutely unacceptable for any western country.",
    "But it is also technically advanced enough to counter western military technologies.",
    "Western science was the first to “dronise” warfare, to minimise the involvement of troops on the ground and use machines for new tasks.",
    "Putin’s army, while also using real drones, dronises human beings as well.",
    "It has turned soldiers into dispensable, single-use units.",
    "With Russia’s full-scale invasion we have entered the era of global moral climate change.",
    "Just as one earthquake can have repercussions all over the world, or a single volcanic eruption can pollute the skies above several continents, Russia’s aggression changes the political climate worldwide.",
    "This is another very real, but not yet fully recognised, outcome of the war.",
    "It is perhaps the most wide-ranging of all the outcomes.",
    "With thousands of troops sent into battle and killed by Ukrainians defending themselves, Putin doesn’t just get some pieces of Ukrainian territory – he erodes the political landscape worldwide, upsets alliances, exhausts the patience of voters in Nato countries and drags us down into the hell of moral relativism.",
    "What can be done about it?",
    "Western and south-western Europe, which never faced the reality of Soviet occupation, must now listen to the voices of those who experienced it first-hand.",
    "It is hard to say whether Russia will be held accountable for its crimes against Ukraine any time soon.",
    "But to build a future at all, a real future, it will be paramount to develop a cultural and historical concept countering Russia’s attempt to divide and rule.",
    "On the initiative of Václav Havel, Joachim Gauck and other prominent former dissidents, 23 August, the date of the signing of the Molotov-Ribbentrop pact, is the EU’s Day of Remembrance for Victims of Stalinism and Nazism, or Black Ribbon Day.",
    "Understanding of the significance of this day could and should be deepened to include a broader perspective on Russian imperialism, which was part of Soviet communist policy but has outlived it.",
    "We need to make this day the focus of a long-term and coordinated politics of remembrance, to strengthen existing institutions such as ENRS – the European Network Remembrance and Solidarity, which includes mostly eastern European countries.",
    "We must also build new ones, across continents, countering both leftwing and rightwing narratives that continue to make excuses for Russia.",
    "The USSR collapsed because its artificial unity was enforced by violence and oppression.",
    "The EU’s endurance depends on the persistence of its voluntary unity.",
    "But unity is not a given.",
    "It is a product of mutual knowledge and compassion, of many cultural bridges connecting people.",
    "It is time to start building.",
    "This article is adapted from the writer’s closing address at the Helsinki Debate on Europe, 18 May 2025.",
    "It is published in partnership with Voxeurop.",
    "- Sergei Lebedev is an exiled Russian novelist.",
    "Since 2018 he has lived in Potsdam, Germany.",
    "His latest novel is The Lady of the Mine (2025) - Do you have an opinion on the issues raised in this article?",
    "If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here."
  ],
  "topics": {
    "Politics": 0.9144256711006165,
    "Conflict": 0.9082332849502563,
    "Diplomacy": 0.8956815004348755,
    "Energy": 0.8470485806465149,
    "Environment": 0.8324077129364014,
    "Military": 0.827180802822113,
    "Crime": 0.8253223896026611,
    "Transport": 0.8169233798980713,
    "Elections": 0.8021823167800903,
    "Economy": 0.7871253490447998,
    "Culture": 0.7808840870857239,
    "Health": 0.7748821973800659,
    "Technology": 0.7712441682815552,
    "Education": 0.738362193107605
  },
  "sentiment": {
    "positive": 0.47,
    "negative": 0.53,
    "neutral": 0.0
  }
}