{
  "title": "Donald Trump is losing patience with Russia, says Finnish leader",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/18/donald-trump-is-losing-patience-with-russia-says-finnish-leader",
  "original_language": "en",
  "cleaned_sentences": [
    "Donald Trump is losing patience with Vladimir Putin, Finland’s president has said after a lengthy conversation with his US counterpart.",
    "Alexander Stubb said Trump and Putin, who are scheduled to speak by telephone on Monday, must not decide the fate of Ukraine over the head of its president, Volodymyr Zelenskyy.",
    "Stubb also said there was a chance, depending on how the phone call goes, that the US senators Lindsey Graham and Richard Blumenthal would introduce into Congress this week a sanctions package to make Russia’s finances untenable.",
    "Stubb has been in near daily contact with Graham, who describes the sanctions package as “bone-crushing”.",
    "At a security conference in Estonia, Stubb said: “If we were to pull it together, we could say that Zelenskyy is patient and President Trump is starting to be impatient, but in the right direction, that is, towards Russia.” Stubb said threatening sanctions and not implementing them would not cause a credibility problem as long as the west was making Putin react.",
    "It is widely expected that Graham, who discussed his sanctions package with European foreign ministers last week, will adapt the bill’s provisions so it is aimed at foreign firms that import Russian energy.",
    "Graham, a Trump loyalist, is portraying his sanctions as an adjunct to Trump’s tariffs policy and not an alternative.",
    "The initial package contained plans to impose 500% tariffs on the goods of any country trading in energy with Russia, a blunderbuss style of policy Trump has already reversed in his trade war.",
    "Stubb said any European contact with Putin would be through the E3 leadership of Britain, France and Germany.",
    "“At the top level we should not go solo,” he said.",
    "Stubb, one of the small group of European leaders with the ear of Trump, said he had been using his influence to persuade the president to revise his view of Russia’s economic and military strength.",
    "At the Lennart Meri security conference in Tallinn he disclosed that in his conversation with Trump on Saturday he had tried to explain that Russia was no longer a great power, “certainly not economically”.",
    "He added: “It is smaller than Italy, slightly larger than Spain [in terms of its economy].",
    "Militarily it wanted to deny the independent sovereignty and territorial integrity of Ukraine three years ago.",
    "It has advanced less than one percentage point this year, and its interest rate is over 20% and its reserves are out.",
    "“So it is not a country which can be seen as a big power any more.",
    "These are the kind of messages that you have to convey.",
    "It is not an easy game, but you just have to keep on engaging the American administration.",
    "“Trump’s worldview is not far from what we saw in the 19th-century concert of powers – a big power era sometimes of competition and sometimes cooperation.",
    "We have to convince the US administration that free trade and common rules are better than transactional deals, and we show we are serious about defence in Europe and that we are security providers and not security consumers.” Matthew Whitaker, the US ambassador to Nato, told the conference his country was Europe’s friend but warned of a smaller military presence in Europe.",
    "“President Trump just said: enough, this is going to happen and it’s going to happen now,” he said.",
    "“This is going to be orderly, but we are not going to have any more patience for foot-dragging in this situation.",
    "We just need to work through the practical consequences.” The postponement of a US troop withdrawal announcement until after a Nato summit next month will make capability planning more difficult.",
    "Radosław Sikorski, the Polish foreign minister, was one of many European leaders who accepted that the rebalancing of defence spending between Europe and the US was long overdue, adding he was grateful to Trump.",
    "He recalled what the Japanese admiral Isoroku Yamamoto said of the Americans after Pearl Harbor – “We have awoken a sleeping giant” – and said: “Putin has also woken the giant.",
    "He has yet no idea how costly this is going to be.",
    "Since President Trump came to power we [Nato] have already doubled our defence spending.",
    "We are at 2% [of GDP].",
    "“At the next Nato summit 3.5 % on hard defence will be the new target and 1.5% for civil and cyber defence.",
    "When we have done it, we will dwarf Russia.",
    "As Europe, without the US, we are spending two and half times more than Russia on a peace footing than Russia is spending on a war footing.",
    "All it takes is to spend the money better, on the basis of learning the lessons from Ukraine and then having the will to gel this into a fighting force.",
    "We should be grateful to the US for telling it like it is.” Stubb added that in his conversations with the US administration, no one had mentioned the US leaving Nato and it was in the interest of the US to have allies in the alliance.",
    "Alar Karis, the Estonian president, revealed he sat next to Trump for two hours at the pope’s funeral in Rome and was told: “Don’t worry, you are safe.” But diplomats warned the Nato summit could bring sharp disagreements over Russia strategy, with Europeans wanting to be clear that Russia posed a long-term threat, regardless of the settlement in Ukraine.",
    "It is not yet clear in what capacity Zelenskyy will attend the summit.",
    "His presence is important for leaders who do not want any peace settlement to rule out Ukrainian membership of Nato."
  ],
  "topics": {
    "Culture": 0.9419986605644226,
    "Politics": 0.9400145411491394,
    "Technology": 0.9242763519287109,
    "Military": 0.9190341234207153,
    "Diplomacy": 0.9103186130523682,
    "Transport": 0.9059951305389404,
    "Conflict": 0.90423184633255,
    "Energy": 0.8908478021621704,
    "Economy": 0.8895378708839417,
    "Environment": 0.8894813656806946,
    "Education": 0.8791258335113525,
    "Elections": 0.8743616342544556,
    "Health": 0.8559966683387756,
    "Crime": 0.6620403528213501
  },
  "sentiment": {
    "positive": 0.306,
    "negative": 0.694,
    "neutral": 0.0
  }
}