{
  "title": "Trump to speak with Putin today on ending Ukraine 'bloodbath' - after Russia carries out largest drone attack since start of war",
  "published_date": null,
  "url": "https://news.sky.com/story/trump-to-speak-with-putin-today-on-ending-ukraine-bloodbath-after-russia-carries-out-largest-drone-attack-since-start-of-war-13370767",
  "original_language": "en",
  "cleaned_sentences": [
    "Trump to speak with Putin today on ending Ukraine 'bloodbath' - after Russia carries out largest drone attack since start of war After a call with Vladimir Putin to discuss ending the war in Ukraine - set for around 3pm - the US president will speak with Volodymyr Zelenskyy and NATO members.",
    "Monday 19 May 2025 06:55, UK Donald Trump is set to speak with Vladimir Putin about a ceasefire with Ukraine today - after Russia launched its largest drone attack since the start of the war.",
    "Posting on Truth Social on Sunday, the US president said he would call his Russian counterpart on \"STOPPING THE 'BLOODBATH'\" and talk about trade at around 3pm UK time.",
    "Follow live: Ukraine war latest He added he would also speak with Ukrainian President Volodymyr Zelenskyy, and then with NATO members.",
    "\"HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END,\" Mr Trump said.",
    "\"GOD BLESS US ALL!!!\"",
    "Be the first to get Breaking News Install the Sky News app for free It comes after the Ukrainian military said a total of 273 exploding drones were reportedly fired across Kyiv and the Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning - the largest attack of its kind since 2022.",
    "In Kyiv, a 28-year-old woman was killed, and three people, including a four-year-old child, were injured, according to regional governor Mykola Kalashnyk.",
    "Meanwhile, Mr Zelenskyy met with vice president JD Vance and secretary of state Marco Rubio in Rome for talks on the sidelines of Pope Leo's inauguration.",
    "In a post on social media, the Ukrainian president said the meeting was \"good\" and \"reaffirmed that Ukraine is ready to be engaged in real diplomacy and underscored the importance of a full and unconditional ceasefire as soon as possible\".",
    "That followed Ukraine and Russia's first face-to-face talks in Istanbul, Turkey, on Friday, where both sides agreed to exchange 1,000 prisoners but failed to agree to a ceasefire.",
    "Also on Sunday, Sir Keir Starmer spoke to Mr Trump along with the leaders of France, Italy and Germany to discuss the upcoming call with Mr Putin.",
    "A Downing Street spokesperson said the group had \"discussed the need for an unconditional ceasefire and for President Putin to take peace talks seriously\".",
    "The spokesperson added: \"They also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks.\"",
    "Read more: Ukraine-Russia talks symbolically important - but revealed stark reality What happened the last time Putin and Zelenskyy met?",
    "It was the second time in three days that the prime minister and other European leaders had spoken to Mr Trump to discuss Russia."
  ],
  "topics": {
    "Diplomacy": 0.9632008075714111,
    "Conflict": 0.9142013788223267,
    "Politics": 0.884565532207489,
    "Health": 0.8675923347473145,
    "Culture": 0.8382260203361511,
    "Technology": 0.802929699420929,
    "Military": 0.7872001528739929,
    "Crime": 0.7817266583442688,
    "Energy": 0.724480926990509,
    "Economy": 0.6901823878288269,
    "Transport": 0.5965688824653625,
    "Environment": 0.4810463488101959,
    "Elections": 0.4421553313732147,
    "Education": 0.4320239722728729
  },
  "sentiment": {
    "positive": 0.75,
    "negative": 0.25,
    "neutral": 0.0
  }
}