{
  "title": "Russia-Ukraine war live: Putin visits Kursk region for first time since recapturing from Ukraine",
  "published_date": null,
  "url": "https://www.theguardian.com/world/live/2025/may/21/vladimir-putin-kursk-volodymyr-zelenskyy-ukraine-russia-ukraine-war-live",
  "original_language": "en",
  "cleaned_sentences": [
    "Putin visited Kursk region on Ukraine border, says Kremlin Russian president Vladimir Putin visited the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area, the Kremlin said on Wednesday.",
    "“Vladimir Putin made a working visit the previous day to the Kursk region,” where he met the interim governor and others, the Kremlin said in a statement, according to Agence France-Presse (AFP).",
    "Ukrainian troops seized control of parts of the Kursk region in August 2024, but were pushed out by Moscow’s forces, with help from North Korean soldiers, by the end of April.",
    "AFP report that images aired on the Rossia 24 channel showed a relaxed and smiling Putin sitting around a large table decked with tea and sweets, with people from the region.",
    "Putin also visited the local nuclear power plant and met city officials, the Kremlin said.",
    "The Russian president previously visited Kursk at the end of March.",
    "Meanwhile, Pope Leo XIV confirmed to Giorgia Meloni his willingness to host in the Vatican the next round of negotiations to try to end the war between Russia and Ukraine, the Italian prime minister said on Tuesday.",
    "“Finding in the Holy Father confirmation of the readiness to host the next talks between the parties in the Vatican, the prime minister expressed deep gratitude to Pope Leo XIV for his unceasing commitment to peace,” said a statement from Meloni.",
    "Pope Leo XIV, elected two weeks ago, said on 14 May that the Vatican could act as a mediator in global conflicts, without specifically mentioning Russia’s war against Ukraine.",
    "Here are some other key developments: Separately the Italian prime minister said she had talks with other European leaders and the Ukrainian president, Volodymyr Zelenskyy, over next steps.",
    "“It was agreed to maintain close coordination between the partners with a view to a new round of negotiations aimed at a ceasefire and a peace agreement in Ukraine.” Zelenskyy accused Russia of “trying to buy time” to continue the war, a day after the US president, Donald Trump, discussed the war with Putin.",
    "Their two-hour phone call failed to deliver any meaningful concessions from Moscow.",
    "The German defence minister, Boris Pistorius, also accused Vladimir Putin of “playing for time” and not really being interested in peace in Ukraine.",
    "In its regular assessment, the Institute for the Study of War (ISW) said on Tuesday: “Russia must explicitly acknowledge the legitimacy of the Ukrainian president, government, and constitution and Ukraine’s sovereignty in order to engage in meaningful, good-faith negotiations.” Putin must also agree to a ceasefire before negotiation of a final peace settlement.",
    "The ISW said Russia was trying to expand its list of demands when it should be preparing to make concessions.",
    "After the European Union on Tuesday adopted its 17th round of sanctions against Russia centred on the “shadow fleet” of oil tankers, human rights violations and hybrid threats, the European Commission president, Ursula von der Leyen, said a further, 18th package was already being prepared with further “hard-hitting” measures.",
    "The UK government has also announced 100 new sanctions on Russia across Russian military, energy, financial sectors and those conducting “Putin’s information war against Ukraine”.",
    "The US secretary of state, Marco Rubio, said he expected Russia within days to present broad outlines for a ceasefire with Ukraine that would let the US assess whether Moscow is serious.",
    "“At some point here fairly soon – maybe in a number of days, maybe this week hopefully – the Russian side is going to present the terms,” Rubio told a Senate hearing.",
    "A Russian strike on a military training site in northeastern Ukraine has killed six soldiers and wounded at least 10 others, the Ukrainian national guard said on Wednesday.",
    "Ukraine’s Sumy border region – from where Kyiv’s troops launched last year’s major cross-border offensive into Russia’s Kursk region – has come under intensifying attacks in recent months after Moscow recaptured its territory.",
    "Ukraine’s military said it has launched another investigation into the “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reported.",
    "The Ukrainian foreign minister, Andriy Sybiha, called on the G7 to reduce its price cap on Russian seaborne oil to $30 per barrel.",
    "The current cap is $60.",
    "Ukraine is attending G7 talks in Canada this week.",
    "This blog will be closing shortly but my colleague Jakub Krupawill be covering updates on Russia-Ukraine and the breaking news about the former Ukrainian presidential aide, Andriy Portnov, being shot and killed in Madrid, in the Europe blog: The Kremlin said on Wednesday that no decision had been made on a venue for Russia-Ukraine peace talks, responding to a question about whether they could be hosted by the Vatican, reports Reuters.",
    "US president Donald Trump said on Monday “it would be great” for Russia and Ukraine to hold ceasefire talks at the Vatican, saying it would add extra significance to the proceedings.",
    "Italian prime minister Giorgia Meloni said on Tuesday that Pope Leo XIV had confirmed to her that he was willing to host the next round of negotiations.",
    "An unidentified gunman or gunmen is reported to have killed former Ukrainian politician Andriy Portnov on Wednesday morning outside the gates of the American School in Madrid’s affluent neighbourhood of Pozuelo, according to Reuters, citing a source close to the investigation.",
    "Police received a call about the shooting of a Ukrainian citizen at 9.15am (07.15am GMT/8.15am BST) local time outside the elite American School of Madrid, located in Pozuelo de Alarcon, Madrid police told Reuters, without identifying the victim.",
    "Portnov was a senior aide to Ukraine’s former president, Viktor Yanukovich, who was ousted in the 2014 Euromaidan revolution.",
    "Since the Russian invasion of Ukraine in February 2022, there have been several crimes involving high-profile Russian and Ukrainians in Spain, which has significant expatriate populations from both countries.",
    "In November and December 2022, six letter bombs were sent to high profile targets around Spain, including to prime minister Pedro Sánchez, the Ukrainian embassy in Madrid, government offices, a European Union satellite company and the US embassy.",
    "A 76-year-old retired Spanish civil servant whose social media searches suggested sympathy for Russia was jailed for the offences.",
    "In February 2024, a Russian pilot who defected to Ukraine with his helicopter was found dead from multiple gunshot wounds in the parking garage of his apartment block near Alicante.",
    "Dutch and British wholesale gas prices rose to their highest in more than six weeks on Wednesday, supported by lower supply from Norway, competition for liquefied natural gas and worries about Ukraine peace talks and unrest in the Middle East, reports Reuters.",
    "The UK and Europe have announced major sanctions against Russia as it became clear that Monday’s call between Donald Trump and Vladimir Putin had failed to deliver any meaningful concessions from Moscow.",
    "The Ukrainian president, Volodymyr Zelenskyy, on Tuesday accused Russia of “trying to buy time in order to continue its war and occupation” as Putin declined to support the US-proposed 30-day unconditional ceasefire already agreed to by Ukraine.",
    "The UK said its sanctions would target dozens of entities “supporting Russia’s military machine, energy exports and information war, as well as financial institutions helping to fund Putin’s invasion of Ukraine”.",
    "“Putin has so far not put in place the full, unconditional ceasefire that President Trump has called for, and which President Zelenskyy endorsed over two months ago,” the Foreign Office said.",
    "Shortly afterwards the EU foreign policy chief, Kaja Kallas, said the EU had approved sanctions targeting Russia’s shadow fleet of about 200 vessels and that more sanctions were in the pipeline.",
    "“The longer Russia wages war, the tougher our response,” she said.",
    "Western countries imposed an embargo on Russia’s oil industry after the 2022 invasion of Ukraine and banned services for ships transporting Russian crude.",
    "In response, Moscow began relying on a so-called shadow fleet – tankers with murky ownership and often without proper insurance – to continue exports Zelenskyy on Tuesday welcomed the EU sanctions.",
    "“It is important to severely restrict the Russian tanker fleet, which serves to finance killings, as well as all schemes that Russia uses to build up its military industry,” he wrote on his social media channels.",
    "G7 finance ministers meet in Canada to discuss Ukraine-Russia Jakub Krupa Finance ministers of the world’s seven largest economies – G7 – are meeting in Banff, Alberta in Canada to discuss their ideas on Ukraine and concerns about disruptions resulting from Donald Trump’s unorthodox trade policy.",
    "Before the meeting, German finance minister Lars Klingbeil warned that trade disputes with the US should be resolved as soon as possible, as he stressed they were a burden on the economy and job security.",
    "Instead of this infighting, G7 should make it clear that it “will continue to stand firmly by Ukraine’s side” and oppose “the terrible destruction caused by Russian president Vladimir Putin’s war,” Klingbeil said.",
    "Ukraine will be represented there, with the country’s finance minister Sergii Marchenko in attendance.",
    "These comments come as Europe scramble to keep pressure on Russia with the latest round of sanctions.",
    "Here are a couple of images of the Russian president, Vladimir Putin, visiting the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area: Ukraine to ask EU to lead on Russia sanctions as US wavers Ukraine will ask the EU next week to consider big new steps to isolate Moscow, including seizing Russian assets and bringing in sanctions for some buyers of Russian oil, as US president Donald Trump has backed off from tightening sanctions, reports Reuters in an exclusive.",
    "A previously unreported Ukrainian white paper to be presented to the EU calls for the 27-member bloc to take a more aggressive and independent position on sanctions as uncertainty hangs over Washington’s future role.",
    "According to Reuters, among 40 pages of recommendations were calls to adopt legislation that would speed up the EU’s seizure of assets from sanctioned individuals, and send them to Ukraine.",
    "Those under sanctions could then seek compensation from Russia.",
    "The EU should consider a range of steps to make its sanctions apply more forcefully beyond its own territory, including targeting foreign companies that use its technology to help Russia, and “the introduction of secondary sanctions on purchasers of Russian oil”.",
    "Such secondary sanctions, which could hit big buyers such as India and China, would be a major step that Europe has so far been reluctant to take.",
    "Trump had publicly discussed this before taking the decision not to act for now, reports Reuters.",
    "The white paper also calls for the EU to consider using more majority-rules decision making over sanctions, to prevent individual member states from blocking measures that otherwise require unanimity.",
    "After speaking to Vladimir Putin on Monday, Trump opted not to impose fresh sanctions on Russia, dashing hopes of European leaders and Kyiv who had been lobbying him for weeks to ratchet up pressure on Moscow.",
    "Trump spoke to Ukrainian and European leaders after his call with Putin and told them he did not want to impose sanctions now and to give time for talks to take place, a person familiar with conversation told Reuters.",
    "The EU and the UK imposed additional sanctions against Russia on Tuesday anyway, saying they still hope Washington will join them.",
    "But Europeans are openly discussing ways they can maintain pressure on Moscow if Washington is no longer prepared to participate.",
    "Iran’s parliament approved a 20-year strategic partnership on Wednesday between Moscow and Tehran, state media reported.",
    "The agreement represents a deepening of bilateral ties including closer defence cooperation.",
    "Russian president Vladimir Putin and his Iranian counterpart Masoud Pezeshkian signed the strategic partnership document on 17 January.",
    "The Russian legislative branch approved the pact in April.",
    "While the agreement does not include a mutual defence clause, it says both countries will work together against common military threats, develop their military-technical cooperation, and take part in joint exercises, reports Reuters.",
    "Since the start of the war in Ukraine in 2022, Iran and Russia have deepened military ties, with western countries accusing Iran of providing missiles and drones for Russian attacks on Ukraine.",
    "Tehran denies providing weapons for Russian use in Ukraine.",
    "The strategic pact also includes several clauses aimed at boosting economic partnership, notably by strengthening direct interbank cooperation and promoting their national financial products.",
    "A free trade deal between Iran and the Russian-led Eurasian Economic Union went into effect last week, cutting down tariffs to boost trade between the two economies, which are both under heavy western sanctions.",
    "Russian strike on Ukrainian military training site kills six, says Kyiv A Russian strike on a military training site in north-eastern Ukraine has killed six soldiers and wounded at least 10 others, the Ukrainian national guard said on Wednesday, reports Agence France-Presse (AFP).",
    "Ukraine’s Sumy border region – from where Kyiv’s troops launched last year’s major cross-border offensive into Russia’s Kursk region – has come under intensifying attacks in recent months after Moscow recaptured its territory.",
    "“Six soldiers were killed and more than 10 wounded as a result of the attack, while they carried out exercises at a military shooting range,” Ukraine’s national guard said in a Facebook post, adding that an investigation has been opened into the incident.",
    "Russia’s defence ministry on Tuesday evening said it had launched a ballistic missile attack on the site.",
    "“During reconnaissance activities … a training camp” for Ukrainian special forces was “detected,” it said in a social media post.",
    "“Based on the received coordinates, an Iskander missile strike was launched,” it added.",
    "Russia also published footage showing the hit on what it said was a training camp in a wooded area.",
    "AFP report that aerial footage showed one strike, sparking a large fire and sending a plume of thick black smoke billowing into the air.",
    "“An internal investigation into the incident is under way.",
    "The commander of the military unit has been suspended, and the necessary information has been passed on to law enforcement agencies,” Ukraine’s national guard said.",
    "Putin visited Kursk region on Ukraine border, says Kremlin Russian president Vladimir Putin visited the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area, the Kremlin said on Wednesday.",
    "“Vladimir Putin made a working visit the previous day to the Kursk region,” where he met the interim governor and others, the Kremlin said in a statement, according to Agence France-Presse (AFP).",
    "Ukrainian troops seized control of parts of the Kursk region in August 2024, but were pushed out by Moscow’s forces, with help from North Korean soldiers, by the end of April.",
    "AFP report that images aired on the Rossia 24 channel showed a relaxed and smiling Putin sitting around a large table decked with tea and sweets, with people from the region.",
    "Putin also visited the local nuclear power plant and met city officials, the Kremlin said.",
    "The Russian president previously visited Kursk at the end of March.",
    "Meanwhile, Pope Leo XIV confirmed to Giorgia Meloni his willingness to host in the Vatican the next round of negotiations to try to end the war between Russia and Ukraine, the Italian prime minister said on Tuesday.",
    "“Finding in the Holy Father confirmation of the readiness to host the next talks between the parties in the Vatican, the prime minister expressed deep gratitude to Pope Leo XIV for his unceasing commitment to peace,” said a statement from Meloni.",
    "Pope Leo XIV, elected two weeks ago, said on 14 May that the Vatican could act as a mediator in global conflicts, without specifically mentioning Russia’s war against Ukraine.",
    "Here are some other key developments: Separately the Italian prime minister said she had talks with other European leaders and the Ukrainian president, Volodymyr Zelenskyy, over next steps.",
    "“It was agreed to maintain close coordination between the partners with a view to a new round of negotiations aimed at a ceasefire and a peace agreement in Ukraine.” Zelenskyy accused Russia of “trying to buy time” to continue the war, a day after the US president, Donald Trump, discussed the war with Putin.",
    "Their two-hour phone call failed to deliver any meaningful concessions from Moscow.",
    "The German defence minister, Boris Pistorius, also accused Vladimir Putin of “playing for time” and not really being interested in peace in Ukraine.",
    "In its regular assessment, the Institute for the Study of War (ISW) said on Tuesday: “Russia must explicitly acknowledge the legitimacy of the Ukrainian president, government, and constitution and Ukraine’s sovereignty in order to engage in meaningful, good-faith negotiations.” Putin must also agree to a ceasefire before negotiation of a final peace settlement.",
    "The ISW said Russia was trying to expand its list of demands when it should be preparing to make concessions.",
    "After the European Union on Tuesday adopted its 17th round of sanctions against Russia centred on the “shadow fleet” of oil tankers, human rights violations and hybrid threats, the European Commission president, Ursula von der Leyen, said a further, 18th package was already being prepared with further “hard-hitting” measures.",
    "The UK government has also announced 100 new sanctions on Russia across Russian military, energy, financial sectors and those conducting “Putin’s information war against Ukraine”.",
    "The US secretary of state, Marco Rubio, said he expected Russia within days to present broad outlines for a ceasefire with Ukraine that would let the US assess whether Moscow is serious.",
    "“At some point here fairly soon – maybe in a number of days, maybe this week hopefully – the Russian side is going to present the terms,” Rubio told a Senate hearing.",
    "A Russian strike on a military training site in northeastern Ukraine has killed six soldiers and wounded at least 10 others, the Ukrainian national guard said on Wednesday.",
    "Ukraine’s Sumy border region – from where Kyiv’s troops launched last year’s major cross-border offensive into Russia’s Kursk region – has come under intensifying attacks in recent months after Moscow recaptured its territory.",
    "Ukraine’s military said it has launched another investigation into the “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reported.",
    "The Ukrainian foreign minister, Andriy Sybiha, called on the G7 to reduce its price cap on Russian seaborne oil to $30 per barrel.",
    "The current cap is $60.",
    "Ukraine is attending G7 talks in Canada this week."
  ],
  "topics": {
    "Conflict": 0.9417631030082703,
    "Politics": 0.9347051978111267,
    "Military": 0.9225209951400757,
    "Culture": 0.9117292165756226,
    "Energy": 0.8892136216163635,
    "Diplomacy": 0.8873374462127686,
    "Economy": 0.8648265600204468,
    "Elections": 0.8566664457321167,
    "Transport": 0.8424789905548096,
    "Health": 0.8414145708084106,
    "Technology": 0.8385516405105591,
    "Crime": 0.8004329204559326,
    "Environment": 0.774792492389679,
    "Education": 0.7613354921340942
  },
  "sentiment": {
    "positive": 0.377,
    "negative": 0.623,
    "neutral": 0.0
  }
}