{
  "title": "Ukraine war briefing: More Russian drones than ever attack before Trump-Putin call",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/19/ukraine-war-briefing-more-russian-drones-than-ever-attack-before-trump-putin-call",
  "original_language": "en",
  "cleaned_sentences": [
    "- Ukraine on Sunday said Russia attacked with a record number of drones, targeting various regions, including that of the capital, Kyiv, where a woman was killed.",
    "A man was killed in the Kherson region, where a railway station and private houses and cars were hit.",
    "The Ukrainian air force said Russia launched “273 Shahed attack drones and various types of imitator drones”, of which 88 were destroyed and 128 more went astray “without negative consequences”.",
    "Ukraine’s intelligence service said it believed Moscow had intended to fire an intercontinental ballistic missile later on Sunday.",
    "There was no immediate response from Moscow to the accusation.",
    "- The Ukrainian deputy prime minister, Yulia Svyrydenko, said it was a “record” number of drones.",
    "“Russia has a clear goal – to continue killing civilians,” she said.",
    "The Russian military said it had intercepted 25 Ukrainian drones overnight into Sunday morning.",
    "Moscow also claimed it had captured Bahatyr, another village in eastern Ukraine’s Donetsk region, as it intensifies the war effort despite the Istanbul peace talks.",
    "- The leaders of Britain, France, Germany and Italy again pressed the need for sanctions against Russia in a call with Donald Trump before the US president’s telephone summit with Vladimir Putin of Russia, the British prime minister’s office said.",
    "Trump is to speak with Putin on Monday as part of his long-running effort to end the war set off by Russia’s 2022 invasion of Ukraine.",
    "“The leaders discussed the need for an unconditional ceasefire and for President Putin to take peace talks seriously,” said a spokesperson for Keir Starmer.",
    "They also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks.",
    "- Separately, Ukraine’s president, Volodymyr Zelenskyy, met the US vice-president, JD Vance, and secretary of state, Marco Rubio, on Sunday as part of preparations for the Trump-Putin call, Peter Beaumont reports.",
    "The encounter took place on the sidelines of Pope Leo’s inauguration on Sunday.",
    "It came two days after the first direct talks between Ukraine and Russia in over three years in Turkey.",
    "- After meeting with Vance, Zelenskyy said: “We discussed the talks in Istanbul, where the Russians sent a low-level delegation with no decision-making powers.",
    "We also touched on the need for sanctions against Russia, bilateral trade, defence cooperation, the situation on the battlefield and the future exchange of prisoners.” A senior official from Zelenskyy’s office said the Rome encounter went “better” than the Oval Office row three months ago when Vance publicly berated Zelensky as being “disrespectful” and not “thankful” enough.",
    "- Calls to step up and coordinate action against the unflagged Russian “shadow fleet” of oil tankers in the Baltic Sea were made at the weekend before the EU foreign ministers’ meeting on Monday, which is expected to impose sanctions on 180 ships, writes Patrick Wintour.",
    "On average three loaded shadow tankers a day pass through northern European waters, including the Danish straits and the Channel.",
    "The inclusion of more vessels would take the total number of ships under EU sanctions to 350.",
    "- The shadow fleet is estimated to be carrying as much as 85% of Russia’s oil exports and so funding roughly a third of its budget.",
    "The battle over the shadow fleet intensified last week when a Russian Sukhoi Su-35 jet breached Estonian airspace in what looked like a reprisal for a tanker named the Jaguar, likely to be carrying Russian oil, being escorted out of Estonian economic waters by the country’s navy after the crew resisted boarding for inspect.",
    "The Estonian navy believed the ship might pose a threat to nearby underwater cables.",
    "- More tanks from Australia are “on their way” to Ukraine, the Australian prime minister, Anthony Albanese, told Zelenskyy on the sidelines of the pope’s inauguration at the Vatican.",
    "“The Russian illegal aggression needs to be resisted and we stand with Ukraine very clearly and unequivocally, and we also have, of course, called for peace.” The Ukrainian president called for Australia to join in placing more sanctions on Russia.",
    "Australia’s ABC news in April reported that delivery of Australia’s retired M1A1 Abrams tanks to Ukraine had been delayed partly by US resistance to their transfer."
  ],
  "topics": {
    "Culture": 0.8920512795448303,
    "Conflict": 0.8681854009628296,
    "Transport": 0.8423759937286377,
    "Politics": 0.7961865663528442,
    "Diplomacy": 0.7894584536552429,
    "Technology": 0.7759162187576294,
    "Health": 0.7695980668067932,
    "Economy": 0.7605170607566833,
    "Energy": 0.7349104881286621,
    "Military": 0.7255805134773254,
    "Elections": 0.7055199146270752,
    "Crime": 0.6573755741119385,
    "Education": 0.5903725624084473,
    "Environment": 0.5601116418838501
  },
  "sentiment": {
    "positive": 0.333,
    "negative": 0.667,
    "neutral": 0.0
  }
}