{
  "title": "Trump to speak to Putin and Zelenskyy about Ukraine ceasefire - US politics live",
  "published_date": null,
  "url": "https://www.theguardian.com/us-news/live/2025/may/19/donald-trump-vladimir-putin-volodymyr-zelenskyy-ukraine-russia-us-politics-news-live",
  "original_language": "en",
  "cleaned_sentences": [
    "At least 50 migrants sent to El Salvador prison entered US legally, report finds At least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank.",
    "The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found.",
    "“The government calls them all ‘illegal aliens.’ But of the 90 cases where the method of crossing is known, 50 men report that they came legally to the United States, with advanced US government permission, at an official border crossing point,” Cato said in its report.",
    "This number aligns with broader trends among Venezuelan migrants, many of whom entered the country either as refugees or through a Biden-era parole program that granted two-year work permits to those with US-based sponsors.",
    "“The proportion isn’t what matters the most: the astounding absolute numbers are,” reads the report.",
    "“Dozens of legal immigrants were stripped of their status and imprisoned in El Salvador.” Cato’s analysis goes against the Trump administration’s justification for sending the men to El Salvador, saying that only undocumented immigrants were deported.",
    "The report says that 21 men were admitted after presenting themselves at a port of entry, 24 were granted parole, four were resettled as refugees, and one entered the US on a tourist visa.",
    "To date, the Trump administration has not released complete records for the more than 200 Venezuelans transferred to El Salvador.",
    "Cato’s review includes information for 174 men whose cases have some degree of public documentation.",
    "The Trump administration has accused many of the deported Venezuelan men of gang involvement, but in many cases, those claims appear to hinge largely on their tattoos.",
    "Many of the tattoos cited as evidence have no connection to gang activity.",
    "The markings reflect, in many cases, personal or cultural references.",
    "Cato uses the example of Andry José Hernández Romero, a makeup artist, who has crown tattoos on his arms that reference the Three Kings Day celebrations in his Venezuelan hometown.",
    "The time has come to end another day chronicling the second Trump administration.",
    "The blog will be closing now, but will revive on Tuesday morning.",
    "Here are a few of the day’s developments: Donald Trump said he didn’t think Pope Leo XIV’s involvement in Russia-Ukraine peace talks meant the US would play a smaller role.",
    "He liked the idea of holding negotiations at the Vatican.",
    "“I think it would be great to have it at the Vatican,” Trump said.",
    "“Maybe it would have some extra significance … I think it would be maybe helpful.",
    "There’s tremendous bitterness, anger, and I think maybe that could help with some of that anger.",
    "So having it in the Vatican would be – in Rome – would be a great, I think it’d be great idea.” At least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank.",
    "The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found.",
    "Senate Democratic leader Chuck Schumer introduced new legislation that would ban the US from using a foreign plane as Air Force One.",
    "Schumer is introducing the bill in an effort to prevent Trump from accepting a new $400m plane from Qatar.",
    "Trump signed the Take It Down Act into law, making it a federal crime to “knowingly publish” or threaten to publish intimate images without a person’s consent, including AI-created “deepfakes”.",
    "The bipartisan legislation – supported by first lady Melania Trump – passed the Senate in February and cleared the House last month.",
    "Vladimir Putin and Donald Trump have held a rare phone call, which the US leader described as “excellent”, but the Kremlin refused to agree to a ceasefire in the war with Ukraine, despite pressure from Washington and European allies.",
    "The Russian leader declined to support the US-proposed 30-day unconditional ceasefire, which Ukraine had already agreed to – and which Washington had framed as the call’s primary objective.",
    "Putin also suggested his country’s maximalist objectives in the war with Ukraine were unchanged.",
    "A federal judge in Washington ruled that the Trump administration illegally ousted leaders of the US Institute of Peace, calling the effort a “gross usurpation of power”.",
    "In her decision, US district judge Beryl Howell said Trump overstepped his power when his administration removed five board members without cause from the non-profit organization, which is funded by the Congress.",
    "The supreme court allowed the Trump administration to strip about 350,000 Venezuelans living in the US of a temporary protected status given under Joe Biden.",
    "The court granted the justice department’s request to lift San Francisco-based US district judge Edward Chen’s order that had halted homeland security secretary Kristi Noem’s decision to terminate the deportation protection conferred to Venezuelans under the temporary protected status, or TPS, program.",
    "Wendy McMahon, the president and CEO of CBS News, will step down from her position due to the company and her have differing views on the path forward.",
    "McMahon, president and CEO of Paramount Global-owned CBS News and Stations and CBS Media Ventures since 2023, said in a memo: “It’s become clear that the company and I do not agree on the path forward.",
    "It’s time for me to move on and for this organization to move forward with new leadership.” Her decision to step down comes during an ongoing legal battle between CBS and Trump after the president filed a lawsuit concerning an interview the show did with Kamala Harris during the presidential campaign.",
    "Lawyers for a Guatemalan man who says he was deported to Mexico despite his fears he would be persecuted there have asked a judge to order the Trump administration to immediately facilitate his return after immigration officials acknowledged making a mistake in his case.",
    "Joe Biden made his first public remarks this morning about his cancer diagnosis, an aggressive form of prostate cancer that has spread to his bones.",
    "The former president, 82, wrote on social media: “Cancer touches us all.",
    "Like so many of you, Jill and I have learned that we are strongest in the broken places.",
    "Thank you for lifting us up with love and support.” Biden and his family are reviewing treatment options.",
    "The cancer appears to be hormone sensitive, allowing for effective treatment, according to his office.",
    "JD Vance considered traveling to Israel tomorrow but opted not to due to the expansion of Israel’s military operation in Gaza.While the US vice-president cited “logistical” reasons for canceling the trip, a US official suggested to Axios that he actually canceled so as to avoid any suggestion that the White House endorsed Israel’s expanding ground operations in Gaza at a time when the US is pushing for a ceasefire and hostage deal.",
    "The Senate has confirmed Charles Kushner, the father of Donald Trump’s son-in-law Jared Kushner, to serve as ambassador to France.",
    "The real estate developer Charles Kushner was pardoned by Trump in December 2020 after pleading guilty years earlier to tax evasion and making illegal campaign donations.",
    "Prosecutors alleged that he hatched a scheme for revenge and intimidation after discovering his brother-in-law was cooperating with federal authorities in an investigation, hiring a prostitute and arranging to have the encounter recorded with a hidden camera and sent to his own sister, the man’s wife.",
    "Charles Kushner will head to France as the relationship between the two traditional allies, and between the US and the rest of Europe, has been strained over Trump’s trade policies and the US role in the Ukraine war.",
    "At his confirmation hearing earlier this month, Kushner said he would work closely with France to “bring greater balance to our important economic relationship” and also encourage France to “invest more in its defense capabilities, as well as lead the EU to align with the US vision of increased European commitments to security”.",
    "As key Israel allies threaten action over mounting Gaza catastrophe, Washington is largely unmoved.",
    "As Israel orders Palestinians to evacuate Khan Younis in advance of what it calls an “unprecedented attack” on Gaza, much of Washington remains largely unmoved, even as Canada and European countries threaten “concrete actions” if Israel does not scale back its offensive.",
    "Despite reports of growing pressure from the Trump administration to increase aid into Gaza, where widespread famine looms, the White House continues to publicly back Israel.",
    "National security council spokesperson James Hewitt told the Guardian in an email: “Hamas has rejected repeated ceasefire proposals, and therefore bears sole responsibility for this conflict,” maintaining the policy stance inherited from the previous Biden administration despite mounting evidence of humanitarian catastrophe.",
    "The Israeli military on Monday instructed residents of southern Gaza’s Khan Younis to “evacuate immediately” as it prepares to “destroy the capabilities of terrorist organizations” – signalling plans for intensified bombardment in a war that has already claimed more than 53,000 Palestinian lives, according to Gaza’s health ministry.",
    "Despite Israeli promises to “flatten” Gaza, opposition from Congress – and mainstream Democrats more broadly – has been largely muted.",
    "While the besieged territory faces what the World Health Organization (Who) calls “one of the world’s worst hunger crises”, more than three dozen members of Congress from both parties recently appeared in an American Israel Public Affairs Committee (Aipac) video in celebration of Israel’s 77th birthday.",
    "In New York, leading mayoral candidate Andrew Cuomo held up an Israeli flag in the city’s annual Israel Day Parade on Sunday.",
    "Read the full analysis by the Guardian’s Joseph Gedeon here: Richard Grenell, the Kennedy Center’s interim director appointed by Donald Trump, claimed that the Kennedy Center board found $26mi in phantom revenue through the 2024 and 2025 budgets.",
    "“It’s criminal,” Grenell said.",
    "“We’re going to refer this to the US attorney’s office here.” Grenell said that attorney general Pam Bondi, who also serves on the board of trustees for the Kennedy Center, already “heard the details”.",
    "“This is unacceptable in America, to have a fake revenue of $26m fraud on previous donors,” Grenell said.",
    "The former FBI director went for a walk on the beach with his wife when they stumbled on a message in the sand: 8647.",
    "According to James Comey, his wife wondered if it was an address.",
    "They stood over the seashells, trying to decipher meaning.",
    "His wife, according to Comey’s account, recalled her days as a server, and said 86 was the term used to remove an item from the menu.",
    "Comey chimed in that when he was a kid, “86” meant “to ditch a place”.",
    "“I said: ‘That’s really clever,’” Comey recounted in a Monday interview on MSNBC, describing the events that led him to post a photo of the seashells on Instagram, leading to a firestorm of accusations from Donald Trump allies that he was calling for violence against the 47th president of the United States.",
    "“I posted it on my Instagram account and thought nothing more of it, until I heard through her that people were saying it was some sort of a call for assassination, which is crazy.",
    "Even if I think it’s crazy, I don’t want to be associated with violence of any kind,” he said.",
    "Comey was hoping for a buzz around his forthcoming legal thriller, FDR Drive: A Crime Novel.",
    "Instead he got a call from the Secret Service.",
    "Comey, who was fired by Trump in his first term, appeared voluntarily at the Washington field office for an interview, after the US president insisted there was no innocent reading of the message.",
    "“He knew exactly what that meant.",
    "A child knows what that meant,” Trump said.",
    "“If you’re the FBI director and you don’t know what that meant, that meant assassination.",
    "And it says it loud and clear.” Comey appeared nonplussed by the investigation – “it’s not my first rodeo,” he said, noting his tempestuous relationship with Trump which Comey said deteriorated after he rebuffed Trump’s early attempts to secure a pledge of loyalty from the then-FBI director.",
    "The agency is now led by Kash Patel, whose abiding loyalty has raised urgent questions about the FBI’s independence.",
    "But Comey warned that the episode pointed to a more worrying trend by this administration: “The use of power to aim at individuals, eroding the rule of law.” His advice to others who may find themselves on the receiving end of Trump’s retribution?",
    "“The rule of law is still our saving grace,” Comey said.",
    "“We have a judiciary in this country that will support the truth.",
    "Take prudent steps, but don’t freak out.",
    "These people are not good enough for you to be freaked out about.",
    "Protect yourself, be measured about the effect the threat has on you, and know that you’re going to be OK.” Donald Trump is delivering a speech at the Kennedy Center board dinner about three months after he seized control of the entity and immediately terminated multiple people from the board of trustees, making himself the chair of a new board.",
    "On Monday, he took a moment to criticize the center’s layout.",
    "“The importance of the building is phenomenal,” he said.",
    "“I always thought they should have built a beautiful performing center, open air, facing out over the Potomac.",
    "They built these crazy rooms underneath.",
    "They built three tiny little stages, very expensive.",
    "Someday, maybe somebody will occupy one.” The Kennedy Center is the country’s national cultural center and is run through a public-private partnership.",
    "The center is known for hosting music, theater, dance, artwork and performance art, and has hosted acts ranging from Tina Turner to Led Zeppelin.",
    "Trump’s move to take control made performers cancel shows, donors question their support and audience members threaten to boycott.",
    "The new board is stocked with loyalists, including White House chief of staff Susie Wiles; attorney general Pam Bondi; Usha Vance, the wife of JD Vance; and Lee Greenwood, whose song God Bless the USA,” plays at Trump rallies as well as many official events, including during his trip to the Middle East last week.",
    "The Department of Homeland Security conducted its first charter flight for migrants who opted to “self-deport” to their home countries, flying 64 Colombians and Hondurans home.",
    "The department paid them a $1,000 stipend each.",
    "“This was a voluntary charter flight, not an ICE enforcement operation,” DHS said in a press release, referring to US Immigration and Customs Enforcement.",
    "Earlier this month, the Trump administration announced it would begin offering travel assistance and a stipend for those registering to self-deport through the CBP Home App.",
    "That is a version of the app devised in the Biden administration called CBPOne that gave people approaching the US-Mexico border without official arrangements a strictly limited channel to request asylum in the US and enter legally when issued an appointment.",
    "Donald Trump shut that down upon inauguration, as vowed, stranding many, and later changed its name and function so that CBP Home is a tool to exit the US, not enter.",
    "In Colombia, 26 people arrived to their families and representatives of the Colombian Ministry of Foreign Affairs, and Migration Colombia, according to officials.",
    "In Honduras, 38 people were received by government officials and family members.",
    "Columbia University student Mohsen Mahdawi, who was detained by federal immigration authorities last month over his pro-Palestinian activism, crossed the graduation stage on Monday.",
    "Several students cheered for Mahdawi as he walked across the stage.",
    "He blew a kiss and bowed, one video showed.",
    "Mahdawi was arrested by Ice in Colchester, Vermont, while attending a naturalization interview.",
    "He was detained and ordered deported by the Trump administration on 14 April despite not being charged with a crime.",
    "He is one of several international students who have been detained in recent months for their advocacy on behalf of Palestinians.",
    "The Trump administration is attempting to deport them using an obscure statute that gives the secretary of state the right to revoke the legal status of people in the country deemed a threat to foreign policy.",
    "Donald Trump said on Monday that he was surprised the public wasn’t notified sooner about former president Joe Biden’s prostate cancer diagnosis.",
    "“I think it’s very sad,” the US president said.",
    "“I’m surprised that it wasn’t notified a long time ago.",
    "Because to get to stage nine, it’s a long time.” Biden disclosed on Sunday he was diagnosed with prostate cancer with metastasis to the bone, and he and his family are reviewing treatment options.",
    "Trump then said he just had his physical and said he was “proud to announce I aced” the cognitive tests, saying: “I got them all right.” “I think, frankly, anybody running for president should, you know, take a cognitive test,” he said.",
    "Trump endorses Ukraine-Russia peace talks taking place at Vatican Donald Trump said he didn’t think Pope Leo XIV’s involvement in Russia-Ukraine peace talks meant the US would play a smaller role.",
    "He liked the idea of holding negotiations at the Vatican.",
    "“I think it would be great to have it at the Vatican,” Trump said.",
    "“Maybe it would have some extra significance … I think it would be maybe helpful.",
    "There’s tremendous bitterness, anger, and I think maybe that could help with some of that anger.",
    "So having it in the Vatican would be – in Rome – would be a great, I think it’d be great idea.” Trump said he asked Russian president Vladimir Putin to meet with him.",
    "“I said: ‘When are we going to end this bloodshed, this bloodbath.",
    "It’s a bloodbath.’ And I do believe he wants to end it.” At least 50 migrants sent to El Salvador prison entered US legally, report finds At least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank.",
    "The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found.",
    "“The government calls them all ‘illegal aliens.’ But of the 90 cases where the method of crossing is known, 50 men report that they came legally to the United States, with advanced US government permission, at an official border crossing point,” Cato said in its report.",
    "This number aligns with broader trends among Venezuelan migrants, many of whom entered the country either as refugees or through a Biden-era parole program that granted two-year work permits to those with US-based sponsors.",
    "“The proportion isn’t what matters the most: the astounding absolute numbers are,” reads the report.",
    "“Dozens of legal immigrants were stripped of their status and imprisoned in El Salvador.” Cato’s analysis goes against the Trump administration’s justification for sending the men to El Salvador, saying that only undocumented immigrants were deported.",
    "The report says that 21 men were admitted after presenting themselves at a port of entry, 24 were granted parole, four were resettled as refugees, and one entered the US on a tourist visa.",
    "To date, the Trump administration has not released complete records for the more than 200 Venezuelans transferred to El Salvador.",
    "Cato’s review includes information for 174 men whose cases have some degree of public documentation.",
    "The Trump administration has accused many of the deported Venezuelan men of gang involvement, but in many cases, those claims appear to hinge largely on their tattoos.",
    "Many of the tattoos cited as evidence have no connection to gang activity.",
    "The markings reflect, in many cases, personal or cultural references.",
    "Cato uses the example of Andry José Hernández Romero, a makeup artist, who has crown tattoos on his arms that reference the Three Kings Day celebrations in his Venezuelan hometown.",
    "The Department of Justice has launched an investigation into a recent security breach at Coinbase Global, the world’s largest cryptocurrency exchange, Bloomberg reports.",
    "Coinbase itself is not the subject of the justice department’s investigation, which is focused on the people behind the attack.",
    "“We have notified and are working with the DOJ and other US and international law enforcement agencies and welcome law enforcement’s pursuit of criminal charges against these bad actors,” Paul Grewal, chief legal officer at Coinbase, told Reuters.",
    "Last week, Coinbase disclosed that on 11 May it received an email from an unidentified threat actor claiming to have information on certain customer accounts and internal documents.",
    "The company estimates potential losses from the incident to range between $180m and $400m.",
    "While the attackers stole some data including names, addresses and emails, they did not get access to login credentials or passwords.",
    "It will, however, reimburse the customers who were tricked into sending funds to the attackers.",
    "An anonymous source told the AP that President Donald Trump is slated to visit House Republicans during their weekly conference meeting on Tuesday as he looks to build momentum for his tax cut and immigration bill.",
    "The legislation Republicans are hoping to pass this summer faces a critical test in the House this week with Speaker Mike Johnson seeking a vote before Memorial Day, even though GOP lawmakers still have some differences on the bill.",
    "Johnson is working to hold his narrow House majority together to pass the president’s top domestic priority of extending the tax breaks while pumping in money for border security and deportations.",
    "Speaking in the White House Rose Garden on Monday, Trump said: “We just spent two and a half hours talking to Vladimir Putin and I think some progress has been made.",
    "It’s a terrible situation going on over there.",
    "Five thousand young people every single week are being killed so hopefully we did something.",
    "“We also spoke to the heads of most of the European nations and we’re trying to get that whole thing wrapped up.",
    "What a shame that it ever started in the first place.” The president was about to sign a bill that addresses the rise of “revenge porn” and deepfake images and was joined by first lady Melania Trump, who has campaigned on the issue.",
    "Trump quipped: “Putin just said, they respect your wife a lot.",
    "I said, what about me?",
    "They like Melania better.",
    "That wasn’t good; I don’t know if that was good.",
    "I’m OK.” Minnesota governor, Tim Walz, compared federal immigration enforcement under Donald Trump with Nazi-era police tactics during a commencement address over the weekend.",
    "Walz, who was the Democratic vice-presidential nominee last fall, added: “They’re in unmarked vans, wearing masks, being shipped off to foreign torture dungeons, no chance to mount a defense, not even a chance to kiss a loved one goodbye, just grabbed up by masked agents, shoved into those vans, and disappeared.” Walz’s remarks referred to the Trump administration’s expedited deportations of migrants and pro-Palestinian student activists on college campuses, largely carried out by Immigration and Customs Enforcement agents.",
    "Since Trump took office, several videos have surfaced online showing officers conducting ambush-style arrests."
  ],
  "topics": {
    "Politics": 0.7238926887512207,
    "Diplomacy": 0.7149456739425659,
    "Conflict": 0.7018373608589172,
    "Transport": 0.6834481358528137,
    "Economy": 0.6538270115852356,
    "Culture": 0.6382350921630859,
    "Energy": 0.5894728899002075,
    "Environment": 0.570329487323761,
    "Technology": 0.5415242910385132,
    "Health": 0.512588381767273,
    "Crime": 0.4838351309299469,
    "Education": 0.44952085614204407,
    "Elections": 0.44098326563835144,
    "Military": 0.4366038143634796
  },
  "sentiment": {
    "positive": 0.392,
    "negative": 0.608,
    "neutral": 0.0
  }
}