{
  "title": "Zelenskyy urges more pressure on Russia after no ceasefire agreed in Trump-Putin call - Ukraine war live",
  "published_date": null,
  "url": "https://www.theguardian.com/world/live/2025/may/20/russia-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-war-news-live-updates",
  "original_language": "en",
  "cleaned_sentences": [
    "Zelenskyy says Russia is 'trying to buy time' to 'continue war' President Volodymyr Zelenskyy accused Russia of “trying to buy time” to “continue war”.",
    "“It is obvious that Russia is trying to buy time in order to continue its war and occupation,” Zelenskyy said in a post on social media on Tuesday, Agence France-Presse reports.",
    "Meanwhile, Reuters reported that Zelenskyy said Ukraine had no doubt the war must end at the negotiating table, but there must be clear and realistic proposals on the table, and called for more international sanctions pressure on Russia.",
    "He said he had spoken to Finnish President Alexander Stubb and that he would speak to more allies later on Tuesday.",
    "This blog is now closing.",
    "Here are a few of the day’s developments: President Volodymyr Zelenskyy accused Russia of “trying to buy time” to “continue war”, a day after US President Donald Trump discussed the war with Russian President Vladimir Putin in a two-hour phone call.",
    "The European Union has adopted new sanctions against Russia over the war in Ukraine, focusing on Moscow’s “shadow fleet” of oil tankers, human rights violations and hybrid threats, the EU’s foreign policy chief Kaja Kallas said.",
    "The UK government has announced 100 new sanctions on Russia across Russian military, energy, financial sectors and those conducting “Putin’s information war against Ukraine”.",
    "Kaja Kallas called for the United States to take “strong action” against Russia if Moscow does not agree to a ceasefire in Ukraine.",
    "European Commission President Ursula von der Leyen said that even though Europe has just adopted its 17th package of sanctions on Russia, an 18th package is being prepared with further “hard-hitting” measures, Reuters reports.",
    "Russian foreign ministry spokeswoman Maria Zakharova said on Tuesday that Ukraine needs to decide whether or not it will cooperate in discussing a memorandum ahead of a future peace accord that Moscow has proposed, Reuters reports.",
    "Ukrainian foreign minister Andriy Sybiha has called on the Group of Seven advanced economies to reduce its price cap on Russian seaborne oil to $30 per barrel.",
    "The current G7 price cap is $60 per barrel.",
    "Germany is still counting on the US to pile more pressure on Russia for an immediate ceasefire in its war on Ukraine, Berlin said.“We have repeatedly made it clear that we expect one thing from Russia - an immediate ceasefire without preconditions,” German foreign minister Johann Wadephul said.",
    "German defence minister Boris Pistorius has accused President Vladimir Putin of not really being interested in peace in Ukraine, saying the Russian leader was only “playing for time” in talks with the United States.",
    "Russia has accused Nato of carrying out what it called aggressive actions in the Baltic Sea that impeded the freedom of shipping after Estonia tried and failed to seize a tanker.",
    "At least one civilian has been killed and 13 injured in Russian attacks across Ukrainian regions over the past day, regional authorities reported.",
    "Russia has lost 975,800 troops in Ukraine since the beginning of its full-scale invasion on 24 February 2022, the General Staff of Ukraine’s Armed Forces reported on 20 May.",
    "This number includes 1,030 Russian casualties over the past day.",
    "Ukraine’s military said it has launched another investigation into the “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reports.",
    "China said it backs “direct dialogue” between Russia and Ukraine, after US President Donald Trump announced the two would “immediately” start peace talks after he spoke with Vladimir Putin.",
    "Volodymyr Zelenskyy has posted on X thanking Ursula von der Leyen and “the entire EU” for the 17th sanctions package, calling it a “step in the right direction”.",
    "Zelenskyy added: It is important to impose tough restrictions on Russia’s tanker fleet, which serves to finance killings, as well as on all the schemes Russia uses to build up its military industry.",
    "The more pressure there is on Russia, the more incentives Moscow will have to move toward genuine peace.",
    "Ursula and I also discussed preparations for the EU’s 18th sanctions package.",
    "Russian oil, energy trade infrastructure, banks, and financial schemes — these are the areas that hurt Russia the most, and therefore contribute the most to peace.",
    "I thank everyone who advocates for tougher sanctions and makes strong decisions.",
    "We also discussed in detail yesterday’s conversation with President Trump and our joint diplomatic work with partners.",
    "Europe must be on board, and we are coordinating every step as closely as possible.",
    "EU's von der Leyen: further 'hard-hitting' sanctions on Russia being prepared European Commission President Ursula von der Leyen said that even though Europe has just adopted its 17th package of sanctions on Russia, an 18th package is being prepared with further “hard-hitting” measures, Reuters reports.",
    "After a phone call with President Volodymyr Zelenskyy, she posted on X: It’s time to intensify the pressure on Russia to bring about the ceasefire.",
    "Ukraine’s military said it has launched another investigation into the scandal-hit “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reports.",
    "The unit - officially Ukraine’s 155th Mechanised Brigade - was supposed to be a flagship fighting force for Ukraine’s army, announced by French President Emmanuel Macron as a symbol of tight cooperation between Kyiv and Paris.",
    "But it has been plagued by scandals, including reports of equipment shortages, low morale and soldiers abandoning the unit en masse while undergoing training in France.",
    "A spokesperson for Ukraine’s land forces confirmed on Tuesday to AFP that a fresh investigation had been launched into the unit, but declined to elaborate further.",
    "Russia accuses Nato of 'aggressive actions' in Baltic Sea after Estonia tries to seize tanker Russia has accused Nato of carrying out what it called aggressive actions in the Baltic Sea that impeded the freedom of shipping after Estonia tried and failed to seize a tanker.",
    "Estonia said on Thursday last week that Moscow had briefly sent a fighter jet into Nato airspace over the Baltic Sea during an attempt to stop a Russian-bound oil tanker thought to be part of a “shadow fleet” defying Western sanctions on Moscow.",
    "Reuters reports that when asked about the matter at her weekly news briefing, foreign ministry spokeswoman Maria Zakharova said Moscow was closely monitoring events in the Baltic and would react to what she called illegal actions by Nato vessels if they caused risks.",
    "Three German-Russian dual citizens have gone on trial in Munich accused of spying on behalf of the Kremlin and planning attacks on critical military infrastructure and industry.",
    "The alleged spies are said to have found codewords for military goods and gathered confidential information about an oil refinery in Bavaria and a US military training area near the town of Grafenwöhr in the east of the state.",
    "The men are also said to have made plans to carry out bomb attacks on buildings and infrastructure used to support Ukraine.",
    "The suspected ringleader, identified only as Dieter S in line with German privacy rules, is accused of coordinating a plot with the specific aim of undermining Germany’s support for Ukraine through acts of sabotage.",
    "He is on trial alongside Alexander J and Alex D, who are suspected of having supported his actions working at the behest of a foreign intelligence service.",
    "The trio were arrested in April 2024 by Bavarian police close to the town of Bayreuth.",
    "Ukrainian foreign minister Andriy Sybiha has called on the Group of Seven advanced economies to reduce its price cap on Russian seaborne oil to $30 per barrel.",
    "The current G7 price cap is $60 per barrel.",
    "“The oil price cap, from our point of view, our position, (the) reasonable price cap (is) 30 dollars,” Sybiha, who was speaking in English, told reporters in Brussels, Reuters reports.",
    "Germany is still counting on the US to pile more pressure on Russia for an immediate ceasefire in its war on Ukraine, Berlin said on Tuesday.",
    "“We have repeatedly made it clear that we expect one thing from Russia - an immediate ceasefire without preconditions,” German foreign minister Johann Wadephul said on the sidelines of a meeting with his EU counterparts in Brussels.",
    "“It is sobering to see that Russia has not taken this step, and we will have to react.",
    "We also expect our US allies not to tolerate this.” He added that there was a lot of readiness both in the European Union and in the United States to consider more sanctions on Moscow, but did not give any details regarding what additional sanctions might look like, Reuters reports.",
    "Here’s a little more detail from Reuters on Zakharova’s comments.",
    "Putin, after a call with President Donald Trump, has previously said Moscow was ready to work with Ukraine on a memorandum about a future peace accord, and that efforts to end the war in Ukraine were on the right track.",
    "Putin said discussions would include the principles of a settlement and the timing and definitions of a possible ceasefire – including its timeframe.",
    "On Tuesday, Zakharova tells reporters she hopes Ukraine takes what she calls a constructive position in relation to possible talks for the sake of its own “self-preservation”.",
    "She adds: Now, accordingly, the ball is in Kyiv’s court.",
    "On newly announced European Union sanctions, Zakharova says Russia will never bow to ultimatums from anyone, claiming it’s clear Europe wanted to rearm Ukraine to continue the war.",
    "Russian foreign ministry spokeswoman Maria Zakharova says Ukraine needs to decide whether or not it will cooperate in discussing a memorandum ahead of a future peace accord Moscow has proposed, Reuters reports.",
    "In her weekly briefing, Zakharova claims Ukraine’s European allies have sought, but failed, to prevent the resumption of direct dialogue with Russia.",
    "Referring to the latest EU sanctions announcement, Zakharova says Russia “never responds to ultimatums”.",
    "UK and Europe target Russia with major sanctions after Putin-Trump call Peter Beaumont The UK and Europe have announced major sanctions against Russia as it became clear that Monday’s call between Donald Trump and Vladimir Putin had failed to deliver any meaningful concessions from Moscow.",
    "The Ukrainian president, Volodymyr Zelenskyy, accused Russia of “trying to buy time in order to continue its war and occupation”.",
    "The UK said its sanctions would target dozens of entities “supporting Russia’s military machine, energy exports and information war, as well as financial institutions helping to fund Putin’s invasion of Ukraine”.",
    "“Putin has so far not put in place the full, unconditional ceasefire that President Trump has called for, and which President Zelenskyy endorsed over two months ago,” the Foreign Office said.",
    "Shortly afterwards the EU foreign policy chief, Kaja Kallas, said the EU had approved sanctions targeting Russia’s shadow fleet of about 200 vessels and that more sanctions were in the pipeline."
  ],
  "topics": {
    "Diplomacy": 0.9686918258666992,
    "Politics": 0.9675917625427246,
    "Conflict": 0.9579963684082031,
    "Culture": 0.9565597176551819,
    "Energy": 0.955866277217865,
    "Economy": 0.9511089324951172,
    "Elections": 0.9435439705848694,
    "Education": 0.9424951672554016,
    "Environment": 0.9392465949058533,
    "Health": 0.9358640909194946,
    "Military": 0.9309447407722473,
    "Technology": 0.928399384021759,
    "Crime": 0.9244812726974487,
    "Transport": 0.9155116677284241
  },
  "sentiment": {
    "positive": 0.277,
    "negative": 0.723,
    "neutral": 0.0
  }
}