{
  "title": "Germany boosts Nato’s eastern flank amid threat from Russia - Europe live",
  "published_date": null,
  "url": "https://www.theguardian.com/world/live/2025/may/22/europe-news-latest-germany-russia-ukraine-nato",
  "original_language": "en",
  "cleaned_sentences": [
    "Germany boosts Nato’s eastern flank with new Baltic brigade amid threat from Russia – Europe live Friedrich Merz visits Lithuania to mark the official formation of Germany’s first permanent overseas military unit since the second world war.",
    "This blog is now closed, you can read our report here 'We must do everything to defend ourselves,' Merz says inaugurating new German brigade in Lithuania And let’s go back to Vilnius, Lithuania, for an update on that military ceremony attended by German chancellor Friedrich Merz, hosted by Lithuanian president Gitanas Nausėda (11:31).",
    "Associated Press reported that Merz, the first chancellor to have served in the Bundeswehr himself, declared that “the security of our Baltic allies is also our security” as worries about Russian aggression persist.",
    "“We must do everything to defend ourselves – so that we never have to,” Merz said at a ceremony marking the establishment of a German brigade to be deployed there, adding members knew the seriousness of the situation and their responsibilities.",
    "… and on that note, it’s a wrap from me, Jakub Krupa, for today.",
    "The German chancellor has visited Lithuania to mark Berlin’s first permanent foreign troop deployment since the second world war, as he called on allies to dramatically expand their efforts to bolster European defences against a hostile Russia (11:31, 11:41, 11:53) The new heavy combat unit, the 45th tank brigade, will be comprised of 4,800 German soldiers and 200 civilian staff.",
    "It was announced in response to Russia’s full-scale invasion of Ukraine in 2022 and is scheduled to reach full operational capacity by 2027 (16:29).",
    "“We must do everything to defend ourselves – so that we never have to,” Merz said at a ceremony marking the establishment of a German brigade to be deployed there, adding members knew the seriousness of the situation and their responsibilities (14:39).",
    "New peace talks with Ukraine had “yet to be agreed”, the Kremlin said, disputing reports the two nations would soon hold negotiations at the Vatican (16:42).",
    "Polish presidential candidate Karol Nawrocki said that any discussion on Ukraine’s fast-tracked and “unconditional” accession to Nato was “pointless” and would put the alliance in direct conflict with Russia, as he agreed to a 90-minute YouTube interview with the libertarian far-right candidate Sławomir Mentzen who came third in the first round of the vote last weekend (12:45, 13:07, 13:27, 13:36, 14:09).",
    "Serbia needs to implement “real reforms”, including on tackling corruption, to ensure its bid for EU membership moves forward, the bloc’s foreign policy chief Kaja Kallas said (16:02).",
    "President EmmanuelMacron said he told his Chinese counterpart Xi Jinping that companies from both countries “must enjoy fair competition” (14:34).",
    "And that’s all from me, Jakub Krupa, for today.",
    "If you have any tips, comments or suggestions, email me at jakub.krupa@theguardian.com.",
    "I am also on Bluesky at @jakubkrupa.bsky.social and on X at @jakubkrupa.",
    "It is not clear how many people remain in the areas now occupied by the Russians.",
    "In some cases, whole towns have been reduced to rubble in the course of the war, and many Ukrainians fled to safety either in Ukrainian-held territory or in other countries.",
    "Peace talks on Ukraine 'yet to be agreed,' Kremlin says New peace talks with Ukraine had “yet to be agreed”, the Kremlin said, disputing reports the two nations would soon hold negotiations at the Vatican, AFP reported.",
    "The comments come after diplomatic efforts to end the conflict have stepped up a gear in recent weeks, with Russian and Ukrainian officials holding their first face-to-face talks in more than three years last week in Istanbul.",
    "The Wall Street Journal reported that follow-up talks between the two sides were expected to take place at the Vatican, starting mid-June, but Kremlin spokesperson Dmitry Peskov denied this.",
    "“There have been no agreements on this matter,” Peskov told reporters.",
    "AFP said he also denied Finnish president Alexander Stubb’s suggestion that “technical talks” could take place at the Vatican as early as next week.",
    "'Unprecedented' foreign troop deployment shows Germany's commitment to eastern flank Deborah Cole The German chancellor has visited Lithuania to mark Berlin’s first permanent foreign troop deployment since the second world war, as he called on allies to dramatically expand their efforts to bolster European defences against a hostile Russia.",
    "As a crowd waved Lithuanian, German and Ukrainian flags, Friedrich Merz and his defence minister, Boris Pistorius, attended a ceremony launching the official formation of an armoured brigade aimed at protecting Nato’s eastern flank.",
    "The new heavy combat unit, the 45th tank brigade, will be comprised of 4,800 German soldiers and 200 civilian staff.",
    "It was announced in response to Russia’s full-scale invasion of Ukraine in 2022 and is scheduled to reach full operational capacity by 2027.",
    "Merz said: “Together with our partners, we are determined to defend the alliance territory against any aggression.",
    "The security of our Baltic allies is also our security.” The deployment, unprecedented for the Bundeswehr, is aimed at shoring up the defence of Lithuania and fellow Baltic republics Estonia and Latvia, former Soviet states that have become Nato and EU members and which fear a Russian attack.",
    "At a news conference in Vilnius with Lithuania’s president, Gitanas Nausėda, Merz said “Russia’s aggressive revisionism” seeking to redraw the European map created grave security risks for the entire continent, not just Ukraine.",
    "Merz, the first chancellor to have himself served in the Bundeswehr, said: “We stand firmly by Ukraine but we also stand together as Europeans as a whole and we play, whenever possible, as a team with the US.” The commitment to Baltic security has posed several challenges for Germany, including finding enough personnel willing to serve there.",
    "In January, the Bundestag passed legislation to make the prospect more attractive, including more flexible working hours and increased allowances and overtime pay.",
    "Serbia needs 'real reforms' to stay on EU accession path, bloc's foreign policy chief says Serbia needs to implement “real reforms”, including on tackling corruption, to ensure its bid for EU membership moves forward, the bloc’s foreign policy chief Kaja Kallas said on Thursday.",
    "Kallas was in Belgrade for meetings with political leaders, including President Aleksandar Vucić, who is balancing closer EU ties with traditional links to Russia.",
    "At the start of a wider Balkans tour, she called for “actions... to prove and support” Serbia’s strategic ambitions to join the EU, AFP reported.",
    "“It is reforms that will allow Serbia to progress on its EU path,” she told a news conference.",
    "Kallas’s visit comes after months of wide-spread student protests triggered by the collapse of the concrete canopy at Novi Sad railway station, which killed 16 people.",
    "Many blamed rampant corruption for the disaster at the station, which Vučić had inaugurated in 2022 after renovations.",
    "Italy's constitutional court rules in favour of same-sex mums Italy’s highest court ruled it was unconstitutional not to legally recognise non-biological mothers on the birth certificates of children born to same-sex couples through IVF, AFP reported.",
    "The finding was hailed “historic” by opposition parties in Italy, which is governed by self-declared “Christian mother” Giorgia Meloni.",
    "The far-right leader has railed against the “LGBT lobby” and says she defends traditional family values in the Catholic majority country, AFP said.",
    "The Constitutional Court in Rome “ruled as discriminatory the failure to recognise both mothers”, a decision which “effectively becomes law”, lawyer Michele Giarratano told the agency.",
    "Civil unions became legal in Italy in 2016 but the law on parental rights for same-sex couples has been unclear.",
    "AFP explained that in 2023, Meloni’s interior minister ordered town halls to stop transcribing certificates of children born abroad through surrogacy.",
    "In response, prosecutors across Italy began contesting birth certificates of children born abroad or in Italy to same-sex parents – whether through surrogacy or not.",
    "The Constitutional Court ruled on Thursday that refusing to recognise women who assume parental responsibility for the child their partner carries “does not guarantee the best interests of the minor” and violates several articles in the constitution, the agency reported.",
    "'We must do everything to defend ourselves,' Merz says inaugurating new German brigade in Lithuania And let’s go back to Vilnius, Lithuania, for an update on that military ceremony attended by German chancellor Friedrich Merz, hosted by Lithuanian president Gitanas Nausėda (11:31).",
    "Associated Press reported that Merz, the first chancellor to have served in the Bundeswehr himself, declared that “the security of our Baltic allies is also our security” as worries about Russian aggression persist.",
    "“We must do everything to defend ourselves – so that we never have to,” Merz said at a ceremony marking the establishment of a German brigade to be deployed there, adding members knew the seriousness of the situation and their responsibilities.",
    "France's Macron tells China's Xi companies 'must enjoy fair competition' President EmmanuelMacron said Thursday he told his Chinese counterpart Xi Jinping that companies from both countries “must enjoy fair competition,” AFP reported.",
    "“Chinese investment is welcome in France.",
    "But our companies must enjoy fair competition in both countries,” Macron wrote on X following talks with Xi.",
    "“We agreed to move forward as quickly as possible on the issue of cognac, which is essential for our producers.” Macron, who spoke to Xi ahead of his trip to Southeast Asia starting on Sunday, said he reaffirmed that Chinese investments were welcome in France but that companies must enjoy equitable conditions in the two countries, AFP reported.",
    "In the last ten minutes, they got into the weeds of an apartment scandal that rocked Nawrocki’s campaign with questions over the circumstances in which he bought an apartment from an elderly man, and suggestions that he failed to meet his obligations to provide care as part of the transaction.",
    "He repeatedly denies all allegations.",
    "In his closing statement, Nawrocki says the run off will be “the most important election since 1989,” and I think that will be a sentiment shared by both sides of the campaign.",
    "But 90 minutes on, that’s it.",
    "Let’s leave it then and check on other news across Europe.",
    "If you’re wondering why we are carrying these comments at length: backed by the populist-right Law and Justice party which ran Poland 2015 to 2023, Nawrocki is almost 50/50 to be Poland’s next president, which would have substantial consequences for the EU and Nato (as per earlier comments on Ukraine).",
    "And he has just signed the eight-point manifesto proposed by Mentzen (12:45), as he hopes to win over his supporters and consolidate the right-wing electorate, which accounted for about 52% of votes in the first round.",
    "Nawrocki criticises EU's federal push as 'threat to sovereignty' Asked about the EU, Nawrocki strongly criticises plans for a more federal EU including any proposals to “build European army,” as he says that this push to “centralise” the EU is “a threat to our sovereignty.” He goes on a longer broadside there directly criticising the European Commission president Ursula von der Leyen for her track record as German defence minister, and even ticks off Belgium for its colonial past with King Leopold II saying the country is not in a position to teach him about “tolerance and openness.” “I can’t imagine that in 20 years we would become EU citizens of Polish origin,” he says, adding “these tendencies are very dangerous for Poland.” He makes claims about German problems with migration, and quips that “instead of migrant integration services, I propose illegal migrant removal centres.” Polish presidential hopeful Nawrocki opposes Ukraine's accession to Nato Nawrocki says that any discussion on Ukraine’s fast-tracked and “unconditional” accession to Nato is “pointless” and would put the alliance in direct conflict with Russia.",
    "He says he remains opposed to it, even if he wants Ukraine to be “part of the western civilisation,” but caveats that by a long-term perspective of “decades” and “in an ideal world.” Comparing himself to the incumbent conservative president, Andrzej Duda, he says: “I am more critical towards Ukraine.” To give you a taster of what to expect from Karol Nawrocki, who could be the next Polish president after June 1, the pair begins by agreeing on extended criticism of the EU’s New Green Deal, rejection of any migration from Muslim-majority countries to Poland, and their shared opposition to extended animal rights and Covid closures in 2020 and 2021.",
    "Nawrocki also directly commits he would not send any Polish troops to Ukraine.",
    "He slightly hesitates when asked if he would resist that even if directly asked to do by US president Donald Trump, but ultimately sticks to the original line.",
    "Mentzen clearly wants to push Nawrocki, endorsed by the populist-right Law and Justice party, to criticise the last government of this party – and succeeds, at least to a certain extent.",
    "Nawrocki occassionally adds some caveats – for example, saying that it’s much easier to criticise lockdowns with hindsight or when discussing proposals for ad valorem taxation on properties – but goes above and beyond to find similarities with Mentzen as he is determined to court this right-wing electorate.",
    "And don’t just take my word for how potentially significant this Mentzen broadcast is for the Polish presidential race: it’s carried live by all major news broadcasters, with more than 200,000 people also watching it live on YouTube.",
    "They are starting their chat now.",
    "I will bring you the key updates here.",
    "Next up, I will take you to Poland, where libertarian far-right candidate Sławomir Mentzen is about to host one of the remaining two candidates on his YouTube channel as he decides who, if anyone, to endorse before the run-off on 1 June.",
    "Mentzen, who came third in the first round of the presidential election last weekend with 14.81% of the vote, will speak to the conservative candidate Karol Nawrocki, endorsed by the populist-right Law and Justice party, at the top of the hour.",
    "Later this week, he will also host the winner of the first round vote, the centrist Warsaw mayor Rafał Trzaskowski.",
    "Ahead of the two conversations, Mentzen had listed eight demands to both presidential candidates.",
    "He wants them to promise to block any laws proposing to raise taxes, reduce use of cash, or expand content moderation laws.",
    "He also wants his rivals to commit to not sending any Polish troops to Ukraine and to blocking Ukraine’s accession to Nato.",
    "On EU, he wants them to pledge they wouldn’t “transfer any competences of Polish authorities to EU bodies” nor sign any new treaties “weakening Poland’s role.” Mentzen’s potential endorsement could play a significant role in the second round as all polls suggest that literally every vote could count given we expect the run-off to be extremely close.",
    "It could also help the voters of the fourth candidate, far-right leader Grzegorz Braun, to make their minds up, as they share some of his views.",
    "On paper, Nawrocki appears to be ideologically much closer to Mentzen than Trzaskowski, but there are lots of variables at play here, so let’s see how these meetings go.",
    "If you want to read up on Mentzen’s rapid rise in this year’s electoral campaign into the role of a kingpresidentmaker, here’s my recent report from Warsaw.",
    "European Parliament backs prohibitive tariffs on fertilisers from Russia, Belarus The European Parliament voted to impose prohibitive tariffs on fertilisers and certain farm produce from Russia and its ally Belarus to prevent a potential threat to EU food security and limit Russian funds for its war against Ukraine, Reuters reported.",
    "Tariffs for certain nitrogen-based fertilisers will rise over three years from 6.5% to an amount equivalent to about 100%, a level that would effectively halt trade.",
    "For the farm produce, an additional 50% duty will apply, Reuters explained.",
    "The hikes are expected to take effect on 1 July.",
    "The agency noted that more than 70% of EU fertiliser consumption in 2023 was of the nitrogen-based product targeted, and Russia accounted for 25% of EU imports, worth about 1.3 billion euros ($1.5 billion).",
    "France steps up security at Jewish-linked sites after Washington shooting France’s interior minister on Thursday told police to “step up surveillance at sites linked to the Jewish community” after a gunman shot and killed two Israeli embassy employees in Washington, AFP reported.",
    "The security measures must be “visible and dissuasive,” Bruno Retailleau said in a message seen by AFP.",
    "A number of European leaders condemned the attack, including Friedrich Merz, who told a press conference in Vilnius, Lithuania that one of the two Israeli embassy staff killed in Washington DC late Wednesday was possibly a German citizen."
  ],
  "topics": {
    "Politics": 0.9556036591529846,
    "Military": 0.9420164227485657,
    "Conflict": 0.9355992078781128,
    "Environment": 0.9318395256996155,
    "Culture": 0.9272066950798035,
    "Technology": 0.9218286871910095,
    "Diplomacy": 0.9185613989830017,
    "Energy": 0.9109328389167786,
    "Economy": 0.9071553349494934,
    "Transport": 0.8679574131965637,
    "Education": 0.8260496258735657,
    "Health": 0.818312406539917,
    "Elections": 0.8034408092498779,
    "Crime": 0.7301401495933533
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}