{
  "title": "Ukraine and Russia exchange 800 PoWs in largest prisoner swap of war so far",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/23/ukraine-russia-largest-pow-exchange",
  "original_language": "en",
  "cleaned_sentences": [
    "Ukraine and Russia have begun the largest prisoner exchange of the three-year war, with almost 800 captives returned on both sides in a process expected to last several days.",
    "Confirming the first phase of the exchange had taken place, the Ukrainian president, Volodymyr Zelenskyy, said Ukraine had returned 390 people to Russia and that the process would continue with further groups on Saturday and Sunday.",
    "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
    "“The agreement on the release of 1,000 of our people from Russian captivity was almost the only real result of the [direct talks between Russian and Ukraine a week ago in] Turkey,” he added elsewhere on social media.",
    "Images from the arrival of returned Ukrainian PoWs, released by Zelenskyy’s office showed shaven-headed former prisoners being greeted by their families.",
    "The released Russians were taken to Belarus for medical treatment, the Russian defence ministry said.",
    "The exchange, which is also the biggest swap of Ukrainian civilians at one time, didn’t appear to herald any imminent halt in fighting.",
    "Ukrainian media outlet Espreso TV published a video of the wife of a prisoner crying tears of joy, wrapped in a flag on Kyiv’s Independence Square.",
    "She said she had been waiting for her husband’s release since 2022 and had just received the call from Ukrainian authorities confirming his release.",
    "“We waited, hoped and fought,” said the woman, whose name was given as Victoria.",
    "The exchange is part of the “1,000 for 1,000” deal thrashed out during otherwise inconclusive peace talks in Istanbul a week ago.",
    "The first stage of the swap took place at the border with Belarus in northern Ukraine, according to the Ukrainian official who spoke on condition of anonymity.",
    "Earlier, Ukrainian authorities told reporters to assemble at a location in the northern Chernihiv region in anticipation that some freed prisoners could be brought there.",
    "Confirming the exchange had taken place, Russia’s defence ministry said it had completed the first phase which it said saw the return of 270 military personnel and 120 civilians it claimed had been captured during Ukraine’s long incursion into the Kursk region of Russia.",
    "The status of those being exchanged could not immediately be confirmed.",
    "At a medical facility where the released Ukrainians were due to be taken, relatives waited to see whether their loved ones would be part of the swap.",
    "Svitlana Kuskova, 49, held a sign with a photo of her husband, Oleksandr Kuskov, missing for the past year.",
    "Kuskov was a military driver who was later transferred to the infantry, and his wife has searched through Russian military channels, hoping to catch a glimpse of him or some sign he is still alive.",
    "“It’s extremely hard to go to sleep every night not knowing what happened to him,” she said.",
    "Olessia Dyadushkin, 37, held a photo of her 40-year-old husband, Valentin, missing since July 2024.",
    "Although she had no information about him, she has held onto hope because there was no confirmation that he was killed.",
    "Her four-year-old daughter often asks where her father is, and she tells her he’s at work and very busy, Dyadushkin said, wiping away tears.",
    "Russia and Ukraine have swapped hundreds of captured soldiers, but the Kremlin has been reluctant to free non-combatants.",
    "In April, the Guardian and its reporting partners published the Viktoriia project, an investigation into the abduction and systematic torture of what Ukraine believes could be as many as 16,000 of its civilians.",
    "In many cases they do not have access to lawyers and their families have not been informed of their whereabouts.",
    "Among them was the Ukrainian investigative reporter Viktoriia Roshchyna, who died in a Russian jail last year after setting out to report on the enforced disappearances.",
    "While the exchange had been expected to start as early as Friday, speculation increased after the US president, Donald Trump, said – incorrectly at the time of his writing – that Russia and Ukraine had already completed the large exchange of prisoners, an assertion quickly denied by Ukrainian officials who said the swap was ongoing.",
    "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
    "He said it would “go into effect shortly”, although it was not clear what that meant.",
    "“This could lead to something big??",
    "?” Trump added in his post, apparently referring to international diplomatic efforts to stop the fighting.",
    "After the 16 May talks, the Turkish foreign minister, Hakan Fidan, called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
    "However, on Friday, Russia’s foreign minister, Sergei Lavrov, rejected the idea of holding future peace talks with Ukraine at the Vatican, dismissing a proposal made earlier this week by Trump.",
    "Speaking at an ultra-nationalist conference in Moscow, Lavrov argued that the Vatican would be an inappropriate venue, saying it would be “not quite comfortable” for two Orthodox nations to meet in a Catholic venue.",
    "He repeated some of Russia’s widely debunked justifications for launching the war, claiming that talks in the Vatican were not appropriate because one of the war’s root causes was Ukraine’s alleged oppression of Orthodox believers.",
    "“One of the root causes is the course towards elimination of the Ukrainian Orthodox church,” Lavrov said.",
    "“I believe the Vatican would not be quite comfortable to host delegations from two Orthodox countries under such circumstances.” In a string of hawkish remarks, Lavrov also signalled that Moscow remains committed to regime change in Ukraine, questioning Zelenskyy’s legitimacy and referring to the elected Ukrainian government as a “junta”.",
    "Lavrov said Moscow would not allow Russian-speakers in Ukraine to remain under the rule of Zelenskyy, adding that the simplest way to settle the conflict would be for the international community to demand that Ukraine cancel laws discriminating against Russian-speakers.",
    "The foreign minister also questioned Zelenskyy’s legitimacy to sign any peace agreement, adding that new elections would be the most “appropriate” way to determine who is entitled to represent Ukraine in future negotiations.",
    "At least 8,000 Ukrainian soldiers are being held captive by Russia, Iryna Vereshchuk, the presidential office deputy head, said on 1 May, citing data from Ukraine’s Coordination Headquarters for the Treatment of PoWs.",
    "Hundreds of thousands of soldiers on both sides are believed to have been wounded or killed in Europe’s deadliest war since the second world war, although neither side publishes accurate casualty figures.",
    "Tens of thousands of Ukrainian civilians have also died as Russian forces have besieged and bombarded Ukraine’s cities.",
    "Agencies contributed to this report"
  ],
  "topics": {
    "Conflict": 0.8951212763786316,
    "Energy": 0.8906586170196533,
    "Diplomacy": 0.880465567111969,
    "Politics": 0.8697189688682556,
    "Culture": 0.8646785020828247,
    "Environment": 0.8594198822975159,
    "Transport": 0.8475949168205261,
    "Technology": 0.8391898274421692,
    "Economy": 0.828478217124939,
    "Elections": 0.7904890179634094,
    "Education": 0.7877593040466309,
    "Health": 0.7492381930351257,
    "Military": 0.7282050848007202,
    "Crime": 0.7259618043899536
  },
  "sentiment": {
    "positive": 0.186,
    "negative": 0.814,
    "neutral": 0.0
  }
}