{
  "title": "What new Stalin statue says about Vladimir Putin's Russia regime",
  "published_date": null,
  "url": "https://news.sky.com/story/what-new-stalin-statue-says-about-vladimir-putins-russia-regime-13372954",
  "original_language": "en",
  "cleaned_sentences": [
    "What new Stalin statue says about Vladimir Putin's Russia regime At the central Taganskaya station, a new statue has been unveiled.",
    "It is of one of Russia's most well-known and controversial leaders, Joseph Stalin, a man who killed millions.",
    "Some have welcomed the monument, while others have criticised it.",
    "Friday 23 May 2025 04:36, UK The Moscow metro is a sight to behold.",
    "The gilded interiors of its cavernous stations have the opulence of a baroque palace.",
    "But amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin.",
    "The Soviet dictator was responsible for the deaths of millions of innocent people, in purges, famines and his infamous gulag labour camps.",
    "But there's no mention of that on the new sculpture at the central Taganskaya station.",
    "Instead, he's depicted as a leader who was loved by his people - a crowd of adoring workers and their children are reaching out towards him in adoration.",
    "It was described as a \"gift\" to passengers by the capital's metro system to mark its 90th anniversary.",
    "Behind a crowd of selfie-snapping passengers Some Muscovites have accepted it with open arms.",
    "At Stalin's feet, there is a pile of red carnations, and in front swarms a rolling crowd of selfie-snapping passengers.",
    "\"History of art, culture, significance, beauty.\"",
    "For Denis, it's \"the right decision\".",
    "\"This is the history of our state,\" he says.",
    "But as well as flowers, there is fury at what appears to be Russia's latest attempt to rehabilitate the tyrant.",
    "\"What were they thinking?!\"",
    "asks Svetlana, incredulous.",
    "\"How many died under his leadership?",
    "And suddenly he appears here, this bloodsucker.",
    "How is this possible?!\"",
    "\"We should remember and honour some of his deeds,\" believes Oleg.",
    "\"But to put him like this is disrespectful.",
    "He did a lot of bad things for the Soviet people.\"",
    "Stalin's creeping return under Putin The sculpture is a replica of one that first appeared in 1950, three years before Stalin's death, in honour of his role in the Soviet Union's defeat of Nazi Germany in the Second World War.",
    "It was removed in the 1960s during the period of de-Stalinisation, which sought to destroy his cult of personality.",
    "But under Vladimir Putin's rule, the dictator has been gradually reappearing.",
    "It's mostly been on a small scale, in towns well outside the capital.",
    "A statue so prominent and so central is a first.",
    "Read more: Former Ukrainian politician shot dead Kremlin 'gleeful' after Trump's call to Putin Ukraine-Russia talks revealed a stark reality A historical rehabilitation?",
    "\"The trend comes down to the idea of the greatness of the state,\" says Yan Rachinsky, a human rights activist who works to expose Stalin's crimes at the Moscow branch of Memorial, a renowned rights group that now operates on a local level after the closure of its international arm.",
    "\"For the current government, the main thing is the state.",
    "The state is sacred, the state is above everything, the state is infallible.",
    "That is why criticism of Stalin is constantly decreasing.\"",
    "Russia's current leader has previously condemned Stalin's repressions.",
    "But he's also said the country shouldn't be made to feel guilty about its past.",
    "\"Putin's old statement that one should be proud of history - that's it,\" says Mr Rachinsky.",
    "\"Everything that prevents us from being proud of history fades into the shadows.\"",
    "Be the first to get Breaking News Install the Sky News app for free It certainly feels that way, looking at the statue.",
    "Stalin's historical horrors are out of sight, and seemingly, out of mind."
  ],
  "topics": {
    "Culture": 0.9944977164268494,
    "Conflict": 0.98804771900177,
    "Politics": 0.9819350242614746,
    "Crime": 0.9644774198532104,
    "Technology": 0.9611567258834839,
    "Health": 0.9440499544143677,
    "Elections": 0.9335460066795349,
    "Environment": 0.9308291673660278,
    "Economy": 0.9282174706459045,
    "Transport": 0.9266736507415771,
    "Diplomacy": 0.9095584154129028,
    "Energy": 0.8582758903503418,
    "Education": 0.8297916054725647,
    "Military": 0.703096330165863
  },
  "sentiment": {
    "positive": 0.625,
    "negative": 0.375,
    "neutral": 0.0
  }
}