{
  "title": "‘Every day there is shelling’: Ukrainian border town torn between hope and despair",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/22/ukrainian-border-town-bilopillya-sumy-hope-despair",
  "original_language": "en",
  "cleaned_sentences": [
    "Even before the Russian strike on a shuttle bus travelling from his frontline town at the weekend, the mayor of Bilopillya, Yuri Zarko, was very sceptical that Vladimir Putin’s agreement to direct Russia-Ukraine talks in Istanbul would lead to peace.",
    "The strike, which killed nine people including five over 60, only confirmed his conviction that talks to end the war were going nowhere and Ukraine had a challenging time ahead.",
    "“I was born an optimist,” Zarko said in a cafe in the neighbouring regional capital of Sumy, which he had reached taking a lift in one of his town’s ambulances along a dangerous road that is often shelled by the Russians.",
    "“But there’s a funny story that I like about how an optimist and pessimist meet.",
    "The pessimist says: life is getting worse!",
    "The optimist replies: oh, but it will be much worse later.",
    "That describes where we are.” Ukrainian and Russian delegations met face-to-face in Istanbul last week for the first time since 2022, but without Russia agreeing to a US-proposed 30-day ceasefire already accepted by Kyiv.",
    "A subsequent two-hour phone call on Monday between Putin and Donald Trump also ended without Russian agreement to a ceasefire.",
    "“It’s very difficult situation in my town.",
    "The centre of Bilopillya is 10km from the Russian border and the outskirts are 5-6km away,” Zarko said.",
    "“Every day and every night there is shelling, usually glide bombs.",
    "Ten days ago we had a day where there were 120 strikes throughout the area of our community.",
    "The Russians are very active now.” Between 85 and 90% of those living in his town had now evacuated, he said, with banks, supermarkets and other key services closed for those who remain.",
    "He showed a picture on his phone of a recent strike by a 1.5-tonne bomb that left a crater 5 metres deep and 10 across, dwarfing those standing at its rim.",
    "He knows what has happened to towns similar to his in other parts of Ukraine – to Bakhmut, Chasiv Yar, Pokrovsk and Avdiivka, where Russian artillery and bombs turned or are turning them to rubble – and hopes the same fate can be avoided for his own town of 16,000.",
    "“I need Bilopillya to survive,” he said.",
    "But Zarko is aware that what happens next is out of his hands.",
    "“There are no peace negotiations,” he said.",
    "“We can see how the Russian side is trying to prolong the talks just to buy time.",
    "What happened with the shuttle bus was proof of that.",
    "“It was timed after the peace talks in Istanbul had broken up.",
    "It was a gesture to the civilised world, to EU leaders.",
    "It was meant to punch them on the nose, a message from the Russians to say: we don’t care about peace negotiations.” On Zarko’s mind, and of those in the wider Sumy region, are comments made this week by Putin on a visit to the neighbouring Kursk region of Russia – where Ukraine last year launched a major incursion – that turning Sumy into a “sanitised grey zone” was a more practical solution than using Russian forces to take it, as one local municipal leader suggested.",
    "On Thursday that threat became suddenly concrete as Putin said he had ordered his military “to create a security buffer zone” along the border and that operation was already in progress.",
    "At first glance, the situation in Sumy on a warm spring day belies the threat, with residents walking on tree-lined boulevards and sitting in cafes.",
    "But the reality of life here is constant air alarms from drones, loitering munitions and KAB glide bombs.",
    "The city was partly occupied by Russian forces at the beginning of the war in 2022.",
    "“The first two months of the war were very tough days but then the situation stabilised for a while,” said Oksana Solodovnyk, a regional correspondent for the 1+1 channel.",
    "The situation had got much worse again since Ukraine’s incursion into Kursk last year, she said.",
    "“Our day starts at midnight because of drones and glide bombs.",
    "They all fly over my house, not always very high.",
    "My daughter is nine and I worry about her.",
    "She can only go into her school one day a week because they are teaching in the basement.",
    "“Recently it feels like the Russians have changed tactic.",
    "Because drones coming in low can be shot down, they are using Lancets like ballistic missile.",
    "They fire them up high and then they dive down.",
    "Two days ago they attacked a big plant in Sumy with seven strikes.",
    "The lack of sleep makes people exhausted and anxious.” Solodovnyk said she and her friends hoped for something out of peace talks but were under no illusions that even if there was a ceasefire everything would stop and peace would come immediately.",
    "She said Trump was helping the side that was stronger and had more money, so Ukraine would have to rely on its military.",
    "“My personal feeling is that if we are going to have peace talks it should be between the two leaders,” she said.",
    "“And while I dream about a return to Ukraine’s 1991 border including Crimea, I realise it’s unreal.",
    "I want it but I know it is a fantastic dream and that feeling is splitting me in half because a lot of friends have died fighting for Ukraine.",
    "“But I also know that if we freeze the conflict for a while along the frontlines, Russia will never stop.” “Everyone wants peace,” said Oleksandr Miroshnychenko, an agricultural company executive.",
    "“We are living under stress every day and every night because of the explosions.",
    "“But I’m not sure anyone will help us.",
    "Europe is helping us enough to avoid Putin annexing parts of their territory.",
    "We hope America will help, but the last Trump statement saying we should just talk to Putin suggests that the situation will get worse.",
    "“If I am realistic then maybe the war will end next year.",
    "And if that happens I’ll be happy.”"
  ],
  "topics": {
    "Conflict": 0.951158881187439,
    "Diplomacy": 0.9481458067893982,
    "Culture": 0.9464976191520691,
    "Politics": 0.9453165531158447,
    "Education": 0.943114161491394,
    "Environment": 0.936737596988678,
    "Economy": 0.9336701035499573,
    "Military": 0.9095317721366882,
    "Elections": 0.9066802263259888,
    "Health": 0.9051055908203125,
    "Energy": 0.9038670659065247,
    "Crime": 0.9017797112464905,
    "Transport": 0.8970642685890198,
    "Technology": 0.8925149440765381
  },
  "sentiment": {
    "positive": 0.204,
    "negative": 0.796,
    "neutral": 0.0
  }
}