{
  "title": "FBI whistleblower claims he tried to get to Musk to warn him he was being targeted by Russia",
  "published_date": null,
  "url": "https://www.theguardian.com/us-news/ng-interactive/2025/may/22/fbi-whistleblower-musk-russia",
  "original_language": "en",
  "cleaned_sentences": [
    "A former FBI counterintelligence agent turned whistleblower has claimed he tried to gain access to Elon Musk in 2022 to warn the billionaire that he was the target of a covert Russian campaign seeking to infiltrate his inner circle, possibly to gain access to sensitive information.",
    "Johnathan Buma, who was arrested by the FBI earlier this year on a misdemeanor charge of disclosing confidential information, said in an interview that he tried – but ultimately failed – to gain access to Musk to personally brief and “inoculate” him against “outreach from the Kremlin”.",
    "Buma, who is on bail and living in Arizona after his 17 March arrest at New York’s Kennedy airport, spoke to both ZDF, the German broadcaster, and the Guardian.",
    "He has also recently filed paperwork to run as a Democratic candidate for a congressional House seat in Arizona.",
    "The 48-year-old did not provide specific details about why he believed Musk was being targeted by Russian operatives, but said it involved individuals he believed were being “placed” in Musk’s inner circle at the time and were gaining influence with him.",
    "“Those efforts were intense and they were ongoing,” he said.",
    "“I can’t go into too much more detail.” Musk, the world’s richest man, was not under investigation and was not suspected of wrongdoing, Buma said.",
    "Reporting by the Wall Street Journal indicates that Buma was not the only person who was concerned about individuals who were gaining access to Musk at that time.",
    "A July 2022 article reported that Jared Birchall, who serves as Musk’s wealth manager, had “cornered” his boss to discuss his concerns about a then new adviser to the Tesla CEO named Igor Kurganov, a Russian-born ex-professional gambler.",
    "Birchall reportedly saw Kurganov as a “newcomer who suddenly had immense influence on what to do with Musk’s money”.",
    "The Journal described how Kurganov had spent time sleeping in Musk’s home during the pandemic, and that Musk reportedly told Birchall he was considering leaving Kurganov in charge of his charitable giving.",
    "Musk’s personal fortune was worth about $230bn at the time.",
    "The Journal said it was basing its reporting on more than a dozen people close to Musk, Birchall and Kurganov.",
    "The newspaper also reported at the time that Birchall had learned that an FBI agent had been making preliminary inquiries into Kurganov as part of his job “to watch for foreign interference in US companies”, citing people familiar with the matter.",
    "Kurganov had not been accused of wrongdoing, the Journal reported, and he did not provide a comment to the newspaper at the time.",
    "The Guardian is not aware of Kurganov being named as a foreign agent, and he has no known connections to Russia, other than having been born there.",
    "Efforts to reach him directly did not elicit a response.",
    "The Guardian also reached out to Kurganov’s wife, Liv Boeree, a professional poker player.",
    "She said in an emailed statement: “My husband’s only connection to Russia is that he was pushed out of his Mum’s vagina on its soil.” In his interview with the Guardian, Buma said he did not have direct dealings with Musk.",
    "He said he tried to convey his concerns to another agent, who was described as an FBI liaison to SpaceX, but claimed the other agent was not responsive.",
    "Birchall, the Wall Street Journal reported, asked Musk to remove Kurganov from his post at Musk’s private foundation in May 2022, which Musk then agreed to do.",
    "The FBI’s national press office did not respond to a request for comment.",
    "The Guardian also reached out to the FBI’s Los Angeles field office, which declined to comment.",
    "Musk did not respond to an emailed request for comment.",
    "The Guardian attempted to call and send messages to Birchall via WhatsApp but he did not respond.",
    "Buma’s new claims follow earlier reporting by Business Insider and the Atlantic about Buma’s relationship with another prominent billionaire, Peter Thiel, who reportedly became a source for the FBI in 2021.",
    "Buma, it has previously been reported, was Thiel’s handler.",
    "It is not clear whether Thiel has maintained a source relationship with the FBI.",
    "Thiel and Musk have a long history together.",
    "The two both spent their early years in South Africa.",
    "Thiel founded PayPal, the online payment company where Musk also served as CEO before he was reportedly ousted by Thiel and his allies.",
    "The two are believed to be on good terms, with Thiel crediting Musk’s support for Trump with helping other Silicon Valley leaders support the US president in the run-up to last year’s presidential election.",
    "In his interview with the Guardian, Buma said Thiel had been “receptive to collaboration [with the FBI] and threat briefings”.",
    "“The purpose of the briefings was to educate [Thiel] about what to look out for, what a targeting looks like, what it’s like to be bumped by a foreign intelligence agent, and then what to do when that’s done,” Buma said.",
    "“He essentially confirmed and provided helpful information to help us identify the nodes through which these outreaches have occurred.” Thiel did not respond to a request for comment.",
    "Buma has been a controversial figure inside the FBI since he filed his first internal complaint in the bureau in January 2022.",
    "An FBI affidavit, filed on 18 March in the US district court in California in connection to his arrest, describes him as working in various capacities over his 15-year career at the bureau, where from 2013 to 2022 he focused on counterintelligence and counterproliferation matters.",
    "Until December 2022, the FBI has said, his responsibilities included managing “confidential human sources”.",
    "Buma has described himself as specializing for a decade in public corruption and Russian foreign counterintelligence operations, a role that he said led the FBI to train him to speak and read Russian.",
    "In January 2019, a tip from one of Buma’s sources led to the FBI’s first inquiry into possible tax evasion by Joe Biden’s son Hunter, who was a director at the Ukrainian company Burisma.",
    "Hunter Biden pleaded guilty in 2024 to federal tax evasion charges connected to his foreign business deals.",
    "He was later pardoned by his father, the then president Joe Biden, who in a statement said he believed his son had been “selectively and unfairly prosecuted”.",
    "Buma was also involved in an FBI investigation into possibly illegal lobbying and campaign violations involving Rudy Giuliani, the former prosecutor, mayor of New York and personal attorney to Donald Trump.",
    "Giuliani’s home and office were raided in 2021 in connection to FBI suspicions around his dealings with Ukrainian figures, but all of the investigations were ultimately dropped and Giuliani was never charged with any crime as a result of the inquiry.",
    "Buma began seeking whistleblower protection, both inside the FBI and later in Congress, beginning in 2022, when he began to report what he called “highly suspicious suppression of investigations and intelligence gathering” in matters related to the Russian intelligence service.",
    "At the heart of his allegations, which were submitted to the Senate judiciary committee in a 22-page statement, was Buma’s contention that investigations into Giuliani had been quashed and that he had faced internal FBI retaliation, which he said led to the suppression of his intelligence reporting.",
    "It also led, Buma said, to his diagnosis of post-traumatic stress disorder on 25 October 2023.",
    "At that time, he began to take unpaid leave from the FBI.",
    "Weeks later, on 13 November 2023, federal law enforcement officials raided Buma’s home, according to the FBI affidavit filed in March 2025.",
    "The affidavit claimed that agents found “numerous” FBI documents, including a compilation of emails, in that search.",
    "But Buma was not arrested at that time.",
    "He remained on unpaid leave from the FBI until he submitted a resignation letter on 16 March 2025.",
    "The FBI affidavit also alleged that Buma began emailing chapters of a book draft to associates between October and December 2023, including information that the FBI said was subject to restrictions.",
    "The FBI has alleged that Buma sent messages to individuals at that time that discussed his involvement in press reports about confidential human sources.",
    "Buma has denied wrongdoing.",
    "Even as the FBI officer was facing scrutiny, so was Elon Musk.",
    "The Wall Street Journal reported on 25 October 2024 that Musk, who had emerged as an important supporter of Donald Trump’s re-election campaign, had been “in regular contact” with Russia’s president, Vladimir Putin, since late 2022.",
    "The report cited several current and former US, European and Russian officials and said the conversations touched on personal topics, business and geopolitical tensions.",
    "The Journal report also noted that the contacts raised potential national security concerns, given Musk’s security clearance connected to SpaceX, which has billions of dollars in contracts with the Pentagon, and Musk’s access to classified information.",
    "Musk did not respond to the Journal’s request for comment at the time but posted a comment on X following the story’s publication, including one tweet that said: “Welp, the Swamp’s ‘Trump is Hitler’ didn’t work.",
    "Might as well give ‘Elon is a Russian agent’ a whirl.” Musk has had a high-profile role at the White House since Trump’s November 2024 election victory as the unofficial head of the so-called “department of government efficiency”, or Doge, which has overseen the firing of thousands of federal workers and an attempted dismantling of federal agencies.",
    "Among a myriad of controversies over Doge’s actions was an official whistleblower complaint by a member of the IT department at the National Labor Relations Board, whose disclosure was detailed in a 15 April 2025 report by NPR.",
    "The whistleblower, Daniel Berulis, grew alarmed when technical staff members noticed a spike in sensitive data leaving the NLRB after Doge engineers were granted access to the data, followed by what was described as “suspicious log-in attempts” from an IP address in Russia.",
    "NPR said Berulis’s account was corroborated by internal documentation that was reviewed by 11 technical experts across other government agencies and the private sector.",
    "The report added that Doge’s access to data was a “widespread concern”.",
    "The NLRB has denied that the agency granted Doge access and said it had determined that no breach of agency systems occurred.",
    "Buma was arrested on 17 March 2025, just weeks after Trump’s new director of the FBI, Kash Patel, had been confirmed in his role.",
    "Buma said he was at Kennedy airport awaiting a flight to the UK, where he planned to have a meeting with the HarperCollins publisher Arabella Pike, when he was suddenly surrounded by agents.",
    "He was released on bail the next day.",
    "The bail included a restriction that he refrain from excessive use of alcohol.",
    "This restriction appears to arise from an October 2023 text message reviewed by the FBI.",
    "Buma denies drinking excessively.",
    "His meeting with Pike was canceled by the publisher after his arrest, according to a screenshot of a text message seen by the Guardian.",
    "Pike did not respond to a request for comment.",
    "Buma was arraigned in Los Angeles weeks after his arrest, on 1 May, and charged with a single misdemeanor.",
    "US prosecutors have claimed Buma “knowingly published, divulged, disclosed, and made known” the identity and personal identifying information of an individual who was a confidential FBI source.",
    "Buma told the Guardian he believed this was related to the news report that publicly identified Thiel as an FBI source.",
    "He denied any involvement in the matter and has pleaded not guilty."
  ],
  "topics": {
    "Conflict": 0.9360032081604004,
    "Diplomacy": 0.9203004240989685,
    "Politics": 0.8931010365486145,
    "Culture": 0.8761289715766907,
    "Economy": 0.8726343512535095,
    "Energy": 0.8631144165992737,
    "Transport": 0.861374020576477,
    "Environment": 0.8338512778282166,
    "Elections": 0.8251891136169434,
    "Technology": 0.8179289698600769,
    "Education": 0.812435507774353,
    "Crime": 0.7737301588058472,
    "Health": 0.7255008816719055,
    "Military": 0.6417152285575867
  },
  "sentiment": {
    "positive": 0.231,
    "negative": 0.769,
    "neutral": 0.0
  }
}