{
  "title": "Ukraine war briefing: Multiple injuries as Russia attacks Kyiv with drones and missiles",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/24/ukraine-war-briefing-multiple-injuries-as-russia-attacks-kyiv-with-drones-and-missiles",
  "original_language": "en",
  "cleaned_sentences": [
    "- Kyiv came under heavy drone and missile attack by Russian forces overnight into Saturday, triggering fires and injuring at least 14 people, Ukrainian authorities said.",
    "Explosions and machine-gun fire were heard throughout the capital and many residents took shelter in underground subway stations.",
    "Debris fell in at least four districts, the Kyiv military administration said, calling the combined attack one of the biggest to date on the city.",
    "- The Ukrainian air force said Russia launched 250 long-range drones and 14 ballistic missiles at Ukraine overnight, with Kyiv the main target.",
    "Pictures posted online showed smoke billowing from the top of one block of flats in Kyiv and flames leaping from part of another as emergency crews trained water on it.",
    "- Russia and Ukraine on Friday began a major, complicated exchange of military prisoners of war and civilians, write Peter Beaumont and Pjotr Sauer.",
    "Volodymyr Zelenskyy, Ukraine’s president, said the first phase brought home 390 Ukrainians, with further releases expected over the weekend.",
    "Russia’s defence ministry said it received the same number from Ukraine.",
    "- Ukraine should focus on fighting a “hi-tech war of survival” that minimises losses of its personnel and not expect to recapture Russian-occupied territory, according to Valerii Zaluzhnyi, the former head of Ukraine’s armed forces.",
    "Zaluzhnyi, who is the Ukrainian ambassador to the UK, said Ukraine should be “using a minimum of economic means to achieve maximum benefit … Ukraine is not capable of another war in terms of demography and economy, and we shouldn’t even entertain the thought.” Peter Beaumont reports that Ukraine’s military has announce the expansion of a “drone wall” or “drone line” to counter Russian forces.",
    "- A €150bn (£126bn/$170bn) loans programme to rearm Europe was finalised this week.",
    "Member states can request EU-backed loans under the €150bn security action for Europe (Safe) scheme, which was approved on Wednesday.",
    "It is part of an €800bn rearmament plan drawn up after Donald Trump interrupted US military aid to Ukraine.",
    "Once the loans agreement is rubber-stamped next week, EU member states have six months to draw up plans for defence projects.",
    "“Member states will take those loans ….",
    "and will use them for joint procurement together with Ukraine and for Ukrainian needs,” Andrius Kubilius, the EU’s defence commissioner, told the Guardian’s Jennifer Rankin.",
    "- Russia’s foreign minister said it would send Ukraine its terms for a peace settlement once their prisoner swap was complete.",
    "Sergei Lavrov didn’t say what those terms would be and the Kremlin has shown no sign of walking back its maximalist demands.",
    "- Ukraine’s military general staff said it hit a Russian battery-manufacturing facility in the Lipetsk region which it said supplied Russia’s missile and bomb manufacturers.",
    "It struck the Energiya plant in the city of Yelets, it said on Telegram on Friday.",
    "“The shutdown of Energiya may leave some of the Russian occupiers’ military equipment and weapons without critical batteries.” - A Russian military court in the western city of Ryazan has jailed a Russian-Italian man for 29 years after finding him guilty of terrorism-related charges and blowing up a freight train in 2023 at Ukraine’s behest, Russian state media reported.",
    "The RIA news agency cited Ruslan Sidiki’s lawyer as saying his client had partially admitted his guilt.",
    "Russian-language news outlets have in the past reported that Sidiki admitted his actions but denied intent to harm anyone or acting on anyone else’s orders.",
    "He viewed his actions as sabotage rather than terrorism and himself as a prisoner of war, those reports said.",
    "Ukraine war briefing: Multiple injuries as Russia attacks Kyiv with drones and missiles Explosions heard across capital and fires ignited while Russia and Ukraine begin largest prisoner swap of war.",
    "What we know on day 1,186 Explore more on these topics"
  ],
  "topics": {
    "Economy": 0.972974419593811,
    "Health": 0.9682544469833374,
    "Technology": 0.9623416066169739,
    "Environment": 0.9514856338500977,
    "Conflict": 0.9506733417510986,
    "Military": 0.9481194019317627,
    "Politics": 0.9429598450660706,
    "Diplomacy": 0.9231228828430176,
    "Transport": 0.910908579826355,
    "Crime": 0.8954892754554749,
    "Culture": 0.8950490951538086,
    "Education": 0.8722360134124756,
    "Energy": 0.8679837584495544,
    "Elections": 0.8130912780761719
  },
  "sentiment": {
    "positive": 0.192,
    "negative": 0.808,
    "neutral": 0.0
  }
}