{
  "title": "Romania election: EU breathes sigh of relief after Dan defeats far-right, pro-Russia rival",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/19/romania-election-eu-relief-nicusor-dan-defeats-far-right-pro-russia-rival-george-simion",
  "original_language": "en",
  "cleaned_sentences": [
    "The centrist mayor of Bucharest, Nicuşor Dan, has begun sounding out Romania’s political parties over forming a new majority government after winning the country’s presidential election in a surprise result greeted with relief across the EU.",
    "With all votes counted on Monday morning, Dan, who had described the second round vote as a battle between “a pro-western and an anti-western Romania”, scored 53.6%, official figures showed, against 46.4% for his far-right rival George Simion.",
    "Dan, 55, a quietly-spoken mathematician who has been the capital’s independent mayor since 2020, came from behind to win after losing heavily to Simion, a brash, EU-critical Trump admirer who had wanted to halt aid to Ukraine, in the first round.",
    "At nearly 65%, turnout was the highest in a Romanian election for a quarter of a century, reflecting the importance of a vote with huge consequences for the country’s strategic alignment and economic prospects, as well as for EU unity.",
    "Staunchly pro-EU and pro-Nato, Dan had campaigned on a pledge to fight corruption, maintain support for neighbouring Ukraine – where Romania has played an important logistical role – and keep the country firmly within the western mainstream.",
    "“It’s a victory of thousands and thousands of people who … believe that Romania can change in the right direction,” he told his supporters after the outcome became clear, while calling for “hope and patience” as the country faced “a difficult period ahead”.",
    "Simion, a former soccer ultra and ultranationalist agitator, at first refused to concede, claiming on social media on Sunday: “I am the new president of Romania.” But he later acknowledged Dan “won the election, and this was the will of the Romanian people”.",
    "The far-right candidate vowed, however, to “continue the fight for freedom and our great values along with other patriots, sovereignists and conservatives all over the world.",
    "We may have lost a battle, but we will certainly not lose the war.” EU leaders congratulated Dan.",
    "The European Commission’s president, Ursula von der Leyen, said the result would help “a strong Europe”, while the European Council president, António Costa, called it “a strong signal of Romanians’ attachment to the European project”.",
    "The French president, Emmanuel Macron, said Romania had “chosen democracy, the rule of law, and the European Union”.",
    "Ukraine’s leader, Volodymyr Zelenskyy, also congratulated Dan, saying it was “important to have Romania as a reliable partner”.",
    "The result deprives Hungary’s illiberal leader, Viktor Orbán, the EU’s disrupter-in-chief, and Slovakia’s Robert Fico – both of whom oppose military aid for Ukraine – of a new ally in key decisions on the war, energy, EU enlargement and the bloc’s budget.",
    "The election came nearly six months after an initial vote was annulled amid evidence of campaign finance irregularities and a “massive” Russian interference campaign in favour of its far-right winner, Călin Georgescu, who was banned from standing again.",
    "Simion had said that if he won he would nominate the Moscow-friendly Georgescu, who is under investigation on six counts including misreporting campaign spending, illegal use of digital technology and promoting fascist groups, as prime minister.",
    "Cristian Preda, a professor of politics at the University of Bucharest, said the result reflected voters’ concern that “for the first time in Romania’s electoral history, we had a potential president who was openly supported by Moscow”.",
    "Preda said a clear majority of about 60% of voters were deeply disillusioned with Romania’s mainstream centre-left Socials Democrats (PSD) and centre-right Liberals (PNL) – but that a similar proportion were also solidly pro-European and anti-Russian.",
    "“Voters were faced with a choice between the positions of the Kremlin, and those of Brussels,” he said.",
    "“Dan was pro-western and represented neither of the big parties, in an election in which security was key.",
    "For me, the result was never really in doubt.” Dan faces a daunting in-tray and a tough challenge finding a prime minister to form a majority in parliament to reduce Romania’s budget deficit – the largest in the EU – as well as to reassure investors and markets spooked by a possible Simion win.",
    "Romanian presidents have a semi-executive role, with considerable powers over foreign policy, national security, defence spending and judicial appointments, and can also dissolve parliament if MPs reject two prime ministerial nominations.",
    "Simion’s victory in the 4 May first round triggered the collapse of Romania’s PSD-PNL ruling coalition.",
    "Local media suggested Dan would first seek to form a new majority with the two main parties and a prime minister from his Save Romania Union (USR).",
    "Failing that, he may work towards a minority coalition with the Liberals, with a confidence-and-supply arrangement with the Social Democrats.",
    "He has ruled out any cooperation with Simion’s AUR party, the second largest in parliament.",
    "The voting in Romania took place on the same day as the first round of a Polish election in which a liberal frontrunner, Rafał Trzaskowski, edged ahead of Karol Nawrocki, who was backed by the opposition nationalist Law and Justice (PiS) party.",
    "Trzaskowski did worse than expected, with final results showing he scored 31.36% to Nawrocki’s 29.54%.",
    "Since Polish presidents can veto laws passed by parliament, the 1 June runoff will determine prime minister Donald Tusk’s ability to push through his reformist, pro-EU agenda."
  ],
  "topics": {
    "Diplomacy": 0.8518092632293701,
    "Culture": 0.7964558005332947,
    "Conflict": 0.7678908109664917,
    "Politics": 0.764286458492279,
    "Elections": 0.7258378267288208,
    "Transport": 0.7023401856422424,
    "Economy": 0.7010279297828674,
    "Education": 0.6882556676864624,
    "Technology": 0.6851779818534851,
    "Crime": 0.6754677295684814,
    "Energy": 0.6136710047721863,
    "Military": 0.6062705516815186,
    "Environment": 0.5991291999816895,
    "Health": 0.5239475965499878
  },
  "sentiment": {
    "positive": 0.571,
    "negative": 0.429,
    "neutral": 0.0
  }
}