{
  "title": "Trump has brought Ukraine-Russia peace talks back to square one - just where Putin wants them",
  "published_date": null,
  "url": "https://www.theguardian.com/commentisfree/2025/may/20/russia-ukraine-peace-talks-vladimir-putin-volodymyr-zelenskyy-donald-trump",
  "original_language": "en",
  "cleaned_sentences": [
    "After more than three years of stalled diplomacy, the past few days have brought a flurry of activity in the Russia-Ukraine peace process – sadly none of it with any meaningful progress.",
    "The much-anticipated Russia-Ukraine peace talks in Istanbul – billed as the first serious negotiations since 2022 – came and went with little more than symbolic fanfare.",
    "The subsequent two-hour phone call between Donald Trump and Vladimir Putin on Monday concluded with Trump appearing to withdraw from mediating the peace talks altogether.",
    "Once again, the Russian president got what he wanted without even showing up to a meeting that he himself requested.",
    "Trump’s statement that “the conditions for [the peace] will be negotiated between the two parties, as it can only be” sounded like the opposite of his boast last year that only he could end this war, and in a single day at that.",
    "Even more jarring was Trump’s emphasis on the economic opportunities that Russia offers – tone-deaf, given the scale of Russian atrocities, and a slap in the face to the US’s European allies.",
    "If Trump is indeed stepping back from his self-appointed role as mediator, as his press release suggested, that would be a welcome shift from his earlier efforts to force Ukraine into a deal on Russia’s terms.",
    "Any move away from that is a move in Ukraine’s favour.",
    "Ukraine can and should holds its own in negotiations with Russia.",
    "At the same time, anybody hoping for successful direct Russia-Ukraine negotiations should temper their expectations.",
    "Putin has no interest in genuine negotiations, and likely never will.",
    "He has repeatedly refused to meet Zelenskyy – not because there’s no agenda, but because acknowledging Ukraine’s leader would mean recognising Ukraine’s sovereignty.",
    "In Putin’s imperial worldview, Ukraine isn’t a country and therefore cannot have a legitimate government.",
    "This from a man whose own political legitimacy is propped up by ballot stuffing and electoral spectacle rivalling the Bolshoi theatre.",
    "Scholars of international conflict often describe war and negotiation as two sides of the same coin.",
    "War is, in essence, a costly information-gathering process.",
    "It reveals and establishes the ground truth – each side’s capabilities – which helps to identify the range of peace deals that both sides might prefer to continued fighting.",
    "The key to getting an upper hand in peace negotiations, therefore, is to use the battlefield to demonstrate your capacity to win, thereby compelling the other side to cut their losses and make concessions at the negotiating table.",
    "But after three years of war, it is Russia – not Ukraine – that has been confronted by the limits of its power.",
    "The so-called “second most powerful army in the world” has failed to achieve its strategic objectives.",
    "Since January, Russia’s territorial advances have amounted a handful of fields and abandoned villages, totalling under 1,000 sq km.",
    "And its economy is crumbling under the weight of sanctions and mobilisation.",
    "After the failure of his original plan of “take Kyiv in three days”, Putin’s plan B appears to amount to speaking with confidence and hoping for luck.",
    "Ukraine, by contrast, has proved to be stronger and more resilient than many expected.",
    "President Volodymyr Zelenskyy has forged an impressive international coalition.",
    "Ukraine successfully withstood Russia’s initial assault, recovered key territory and stabilised much of the frontline.",
    "Its performance on the battlefield has shifted perceptions of its strength and bolstered its negotiating position.",
    "Yet Russia continues to cling to its maximalist demands of demilitarisation, sweeping territorial concessions and regime change.",
    "Putin refuses to revise his war aims in light of battlefield evidence.",
    "He continues to demand territories he is unable to take by force, as if he can make them his by simply claiming they are his.",
    "So, what is he doing?",
    "To understand the Russian leader’s logic, we need to first understand the domestic political context in which he operates.",
    "Unlike a democratically elected leader, Putin faces no real checks from domestic institutions or the public.",
    "His only political constraint is the inner circle of elites who keep him in power – military and conservative figures with an imperialist worldview.",
    "To them, Ukraine is not just any territory to be divided in proportion to battlefield success.",
    "Rather, it is a coveted prize, central to restoring Russia’s lost greatness.",
    "Civilian casualties and economic pain are secondary concerns.",
    "Concessions, in this worldview, are not just unnecessary – they are unthinkable.",
    "As Russia’s chief negotiator in Istanbul, Vladimir Medinsky, told the Ukrainian delegation: “[Russia] fought with Sweden for 21 years.” The message is that Putin is prepared to wait.",
    "But he’s hoping he won’t have to wait 21 years.",
    "The hope is to get lucky.",
    "Putin’s grievances have found fertile ground in Donald Trump and his inner circle.",
    "The Russian president is only too happy to lead them along, and they fall for the same trick again and again.",
    "The media often portrays Putin as a master strategist, but that is not exactly right.",
    "His war strategy hasn’t evolved since the failed blitz on Kyiv.",
    "He demands the moon, then lashes out when it is not delivered.",
    "What he is, however, is a master manipulator.",
    "He believes that if he cannot take Ukrainian territory by force, he can secure it through narrative – by convincing sympathetic voices in the west that Russia deserves it anyway.",
    "From Crimea to the Minsk agreements, from Syria to Chechnya, Putin has built his legacy on making up facts on the ground and daring the world to challenge them.",
    "Why would he stop now?",
    "He won’t – not until he can no longer afford the lead to make the bullets.",
    "But Ukraine has demonstrated that it can hold its own.",
    "If the goal is to stop the bloodshed, the only way forward is to force Russia to face reality rather than manufacturing its own.",
    "- Olga Chyzh researches political violence and repressive regimes.",
    "She is an assistant professor in the Department of Political Science at the University of Toronto"
  ],
  "topics": {
    "Diplomacy": 0.6965420842170715,
    "Conflict": 0.5815492868423462,
    "Politics": 0.567714273929596,
    "Culture": 0.523026168346405,
    "Energy": 0.4878503084182739,
    "Transport": 0.4510484039783478,
    "Environment": 0.4281439483165741,
    "Military": 0.42756202816963196,
    "Technology": 0.36794695258140564,
    "Economy": 0.32423439621925354,
    "Education": 0.30771490931510925,
    "Elections": 0.3052896559238434,
    "Health": 0.2933271527290344,
    "Crime": 0.2609054148197174
  },
  "sentiment": {
    "positive": 0.455,
    "negative": 0.545,
    "neutral": 0.0
  }
}