{
  "title": "Former Ukrainian politician shot dead outside Madrid school",
  "published_date": null,
  "url": "https://www.theguardian.com/world/2025/may/21/former-ukrainian-politician-andriy-portnov-shot-dead-outside-madrid-school",
  "original_language": "en",
  "cleaned_sentences": [
    "A former Ukrainian politician who worked as a senior aide to the former pro-Russian president has been shot and killed outside his children’s school in an upmarket suburb of Madrid.",
    "In the latest violence to rattle Spain since Russia’s invasion of Ukraine, Andriy Portnov was killed on Wednesday morning outside the American School of Madrid in Pozuelo de Alarcón.",
    "Authorities said Portnov, who worked closely with Ukraine’s former president, Viktor Yanukovych, had been targeted when he was getting into his car, a black Mercedes-Benz.",
    "“Several people shot him in the back and the head and then fled towards a forested area,” said a source at Spain’s interior ministry.",
    "Local media said Portnov had been dropping off his children at the school, where classes had begun 30 minutes before the shooting.",
    "Police sources told El País he had two daughters at the school.",
    "Portnov was found dead when medics arrived.",
    "He had been shot at least three times, Madrid’s emergency services told reporters.",
    "Police cordoned off a car park near the private school, while helicopters and drones circled above, searching for the suspected killers.",
    "Police said they believed the shooting had involved two or three assailants and, according to the newspaper El Mundo, were investigating whether the shooting was a settling of scores related to organised crime or a political act.",
    "Alvaro Fernandez Garcia, a 22-year-old student who lives nearby, told AFP the shooting was shocking.",
    "“We usually see this on the news, or in other countries.” Widely seen as a pro-Russia political figure, Portnov, 52, was a Ukrainian lawmaker in the 2000s and became deputy head of the presidential administration under Yanukovych, an ally of Vladimir Putin.",
    "Portnov had been involved in drafting legislation targeting participants of the 2014 revolution in Ukraine before Yanukovych was ousted by a popular uprising.",
    "Portnov fled Ukraine shortly afterwards.",
    "In 2015, he was reportedly living in Russia and later relocated to Austria.",
    "In recent years, he had been the subject of multiple investigations.",
    "In 2018, Ukraine’s security service SBU opened an investigation against him on suspicion of state treason, alleging Portnov had been involved in Russia’s illegal annexation of the Crimean peninsula.",
    "The criminal case was closed in 2019.",
    "In 2021, the US Treasury department imposed sanctions upon him, alleging that “Portnov took steps to control the Ukrainian judiciary, influence associated legislation, sought to place loyal officials in senior judiciary positions, and purchase court decisions”.",
    "Portnov, who was also the subject of EU sanctions that were later dropped, appeared to have been living in Madrid since at least April 2024, according to a report by Radio Free Europe/Radio Liberty.",
    "Since Russia launched its full-scale invasion of Ukraine, Spain has been the scene of several high-profile crimes involving Russians and Ukrainians.",
    "The southern European country is home to significant populations from both countries.",
    "In 2022, six letter bombs were sent to targets across the country, including Spain’s prime minister, Pedro Sánchez, the Ukrainian and US embassies, and government offices.",
    "A retired Spanish civil servant, whose social media posts suggested that he opposed western support for Ukraine after Russia’s invasion, was later found guilty of terrorism and manufacturing explosives.",
    "In February 2024, a Russian helicopter pilot who had defected to Ukraine one year earlier in a secret operation was found dead from gunshot wounds in a parking garage near the coastal city of Alicante.",
    "Wednesday’s shooting marked the second high-profile political shooting in Madrid in as many years; in 2023, the Spanish rightwing politician and former vice-president of the European parliament, Alejo Vidal-Quadras, survived after being shot in the face by a masked gunman in a wealthy Madrid neighbourhood.",
    "Police later arrested five people in connection with the shooting, though the suspected gunman – a French national of Tunisian origin with several previous convictions in France – remains at large."
  ],
  "topics": {
    "Politics": 0.43441644310951233,
    "Culture": 0.4201289415359497,
    "Conflict": 0.41592779755592346,
    "Economy": 0.3565468192100525,
    "Environment": 0.33200252056121826,
    "Health": 0.3078710734844208,
    "Technology": 0.29533007740974426,
    "Transport": 0.25981995463371277,
    "Military": 0.2513013482093811,
    "Crime": 0.21732650697231293,
    "Diplomacy": 0.2125931680202484,
    "Energy": 0.20913012325763702,
    "Elections": 0.1725260466337204,
    "Education": 0.17229792475700378
  },
  "sentiment": {
    "positive": 0.185,
    "negative": 0.815,
    "neutral": 0.0
  }
}