{
  "title": "What would Russia’s peace deal demands really mean for Ukraine? - visualised",
  "published_date": null,
  "url": "https://www.theguardian.com/world/ng-interactive/2025/may/22/what-would-russias-peace-deal-demands-really-mean-for-ukraine-visualised",
  "original_language": "en",
  "cleaned_sentences": [
    "One of the few explicit peace proposals is a US outline reportedly seen by Reuters last month.",
    "It asks Ukraine to accept de jure recognition of Russia’s annexation of Crimea and de facto recognition of its occupation of large parts of several oblasts in the country’s east.",
    "On Monday, Volodymyr Zelensky confirmed that Russia is demanding Ukrainian troops abandon five oblasts as a precondition not for peace, but for a ceasefire and the opening of negotiations.",
    "Before the war, those oblasts were home to about 11 million Ukrainians.",
    "To put that into context, we visualised some broadly comparable populated areas in three European countries and one US state, in each case starting from the north-east corner.",
    "The shaded areas represent populations of about 11 million French, British, Italian and US citizens.",
    "For many Ukrainians, the proposal means never being able to return home to areas now occupied by Russians, and accepting that the Ukrainians who remain there, friends and family, become permanently subject to a violent and repressive Russian regime.",
    "Orysia Lutsevych, a researcher at Chatham House, said: “There is strong nationwide sentiment that Russia will want to take more of Ukraine’s territory, so any concessions are only feeding the monster.",
    "Ukrainians know that life under occupation is horrific.",
    "Ukrainians will never agree to legally recognise its occupied land as anything else than illegal brutal annexation.” The displaced It is not clear how many people remain in the areas now occupied by the Russians.",
    "In some cases, whole towns have been reduced to rubble in the course of the war, and many Ukrainians fled to safety either in Ukrainian-held territory or in other countries.",
    "The UN says there are 3 million Ukrainians who have been displaced by the conflict inside the country, and a further 6 million abroad.",
    "Vladimir Putin says he wants elections in Ukraine (he wants Volodymyr Zelenskyy voted out).",
    "Where will those 9 million people vote?",
    "As residents of Donetsk, where some of them have not been since 2014?",
    "As residents of Kharkiv?",
    "Lutsevych said: “Elections will need careful preparations because of the many displaced people inside Ukraine and abroad.",
    "Ukraine must protect its reputation as an electoral democracy.",
    "If elections are rushed too soon and are not properly prepared, Ukrainians will question their legitimacy.",
    "This is exactly what Putin wants – a failed state with disorder that cannot govern itself.",
    "There is no demand for early elections now and the pressure from the US and Russia looks like interference in Ukraine’s sovereignty.” The price of uncertainty One of the most alarming aspects of these proposals for Ukraine is that they create unfinished business, which hampers reconstruction.",
    "On the Russian side, a Putin who is neither defeated nor chastened can be expected to try again, or at the very least to go back to meddling in Ukrainian politics, as he did in the years leading up to 2014.",
    "Even on the Ukrainian side, a deal that is seen as illegitimate can create instability and a desire to reopen the question.",
    "Security guarantees by Europe or the US, meanwhile, need to be backed up with real force to be credible, and they need to be a believably long-term commitment to make a difference.",
    "Mujtaba Rahman, the managing director for Europe at the analysts Eurasia Group, said: “The key question for Ukraine is this: will there be a credible security guarantee which will enable private capital to flow back into the country?",
    "The only security guarantee that Putin’s hasn’t challenged is [Nato’s] article 5, and that’s why Ukrainians are determined to join Nato.",
    "Absent such a guarantee, you don’t get private capital returning and there can be no reconstruction.” Domestic stability is important, too.",
    "Lutsevych said: “Russian territorial occupations fester and obstruct reform and democratic consolidation, which is key for joining both the EU and Nato.",
    "The risk of instability scares FDI [foreign direct investment].",
    "“Ukrainians see the EU first of all as an instructional modernisation project and a way to eradicate corruption.",
    "Nato is more related to collective security but it does have a strong economic effect.",
    "In order to rebuild Ukraine, it is key for Kyiv to succeed in the EU accession process.",
    "The fact that the EU has opened accession talks with Ukraine is viewed as one of the victories by the Ukrainian people.” Sources: pre-war populations from State Statistics Service of Ukraine.",
    "IDP movements from Institute of Migration."
  ],
  "topics": {
    "Health": 0.9304570555686951,
    "Environment": 0.9300681948661804,
    "Energy": 0.9212769865989685,
    "Elections": 0.9142317175865173,
    "Conflict": 0.9062805771827698,
    "Economy": 0.9040319919586182,
    "Diplomacy": 0.9019376635551453,
    "Transport": 0.8816444873809814,
    "Education": 0.8744142055511475,
    "Crime": 0.8557820916175842,
    "Politics": 0.8503077626228333,
    "Culture": 0.8453012704849243,
    "Technology": 0.7949187159538269,
    "Military": 0.7821040749549866
  },
  "sentiment": {
    "positive": 0.294,
    "negative": 0.706,
    "neutral": 0.0
  }
}