{
  "title": "Πόλεμος στη Γάζα: Στα άδυτα της Χαμάς - Βίντεο ντοκουμέντο από τα μυστικά τούνελ",
  "published_date": null,
  "url": "https://www.tanea.gr/2023/11/04/world/polemos-sti-gaza-sta-adyta-tis-xamas-vinteo-ntokoumento-apo-ta-mystika-tounel/",
  "original_language": "el",
  "cleaned_sentences": [
    "A journalist's journey into Hamas underground tunnels under the gauze and interviews he received from fighters broadcast Israeli media, while army engineers are trying to destroy them by all means.",
    "The report was made for Russia Today and was brought to light by Jerusalem Post via the X platform.",
    "A Russia Today (RT) reporter allowed a rare visit to the so -called \"Gaza Metro\", which reaches up to 300 miles below the war -damned war.",
    "Hamas senior official Musa Abu Marzuk was asked why they did not allow the besieged civilian population to flee the bombings in the tunnels.",
    "\"The protection of Gaza civilians is the responsibility of the UN and Israel ... We have made the tunnels to protect ourselves from becoming goals and killing.",
    "They are intended to protect us from airplanes, \"his answer was.",
    "Watch a Russian Reporter's 'Journey' to the Underground Tunnels in Gaza.",
    "Learn More: pic.twitter.com/ty3mdx3lt1 - The Jerusalem Post (@jerusalem_Post) November 4, 2023 Carry weapons and grenades The RT journalist entered the network, descending from an electric lifting 200 feet (60 meters) below the ground.",
    "All sides of the tunnels are lined with reinforced concrete and the roof is arched to add extra durability.",
    "The reporter can stand up and pass by a series of propaganda posters as members of Hamas hold weapons and grenades.",
    "It is noted that the video was filmed before this conflict, specifically in 2021.",
    "But one of the Hamas members says its fighters are ready to stay there for \"days or months\".",
    "The video also shows Hamas members running along the tunnels carrying weapons and in the meantime digging by hand to expand the network."
  ],
  "topics": {
    "Technology": 0.8319716453552246,
    "Conflict": 0.8220807313919067,
    "Politics": 0.771519660949707,
    "Military": 0.7318033576011658,
    "Culture": 0.731731653213501,
    "Transport": 0.49471044540405273,
    "Economy": 0.4742397964000702,
    "Crime": 0.4521755874156952,
    "Energy": 0.4359603226184845,
    "Environment": 0.4257313013076782,
    "Health": 0.422105073928833,
    "Diplomacy": 0.3245997428894043,
    "Education": 0.2771978974342346,
    "Elections": 0.1118483915925026
  },
  "sentiment": {
    "positive": 0.462,
    "negative": 0.538,
    "neutral": 0.0
  }
}