{
  "title": "Γάζα: Ταξίδι στα τούνελ της Χαμάς - Η κυνική παραδοχή ότι δεν φτιάχτηκαν για τους αμάχους",
  "published_date": null,
  "url": "https://www.newsit.gr/kosmos/gaza-taksidi-sta-tounel-tis-xamas-i-kyniki-paradoxi-oti-den-ftiaxtikan-gia-tous-amaxous/3896444/",
  "original_language": "el",
  "cleaned_sentences": [
    "A journey under Gaza was made by the Arab branch of the Russia Today channel (RT), which presented a trek to the famous Hamas tunnel under the area.",
    "At the same time, a high -ranking Hamas executive acknowledged the Memri network that the tunnels were built to protect the members of the organization from Israel and not the civilians.",
    "As onalert.gr said, Mousa Abu Marzouk member of the organization's political part, speaking on the Memri network, rightly stressed that the tunnels in Gaza were built so that Hamas terrorists would not be in danger of Israel's attacks and were not made there.",
    "ADVERTISING \"The protection of Gaza civilians is the responsibility of the UN and Israel,\" said Mousa Abu Marzouk, while Hamas herself speaks of more and more civilians who are losing their lives from the Israeli bombings.",
    "Speaking to Hamas's executive, Memri's journalist told him that some might rightly wonder why the organization does not use the 500km tunnels below Gaza to protect civilians.",
    "The answer was cynical and raw.",
    "\"These tunnels were made to protect us from Israeli aircraft.",
    "We are fighting through these tunnels.",
    "75% of Gaza residents are refugees and it is the UN's responsibility to protect them, \"said Hamas official.",
    "ADVERTISING Hamas Official Mousa Abu Marzouk: The Tunnels in Gaza Were Built to Protect Hamas Fighters, Not Civilians; Protecting Gaza Civilians is the Responsibility of the U.N. and israel #hamas #gaza pic.twitter.com/llivcqx6dt - Memri (@Memrireports) October 30, 2023 Meanwhile the Arab branch of the Russia Today (RT) channel ... entered Hamas's tunnels under the gauze.",
    "The RT journalist toured his viewers in the sanctuaries of the extremist Islamist organization and talked to some of its members.",
    "Inside the tunnels of al-Quds brigades, the armed wing of the islamic Jihad Movement, in Gaza.",
    "pic.twitter.com/z2HDWUEB9R - Clash Report (@ClashReport) October 31, 2023 Everywhere in the tunnels there are weapons, rockets, posters with photos of executives, perhaps Hamas \"witnesses\" and armed men.",
    "Some of them - during the shooting of the video - seem to be on the job, that is, to run with portable rockets to perform theoretically."
  ],
  "topics": {
    "Politics": 0.9665117859840393,
    "Conflict": 0.9601970314979553,
    "Culture": 0.9089288711547852,
    "Military": 0.8533239960670471,
    "Environment": 0.8206071257591248,
    "Health": 0.7982385158538818,
    "Transport": 0.7776191234588623,
    "Economy": 0.7148815393447876,
    "Technology": 0.663474977016449,
    "Energy": 0.6151072382926941,
    "Elections": 0.5659697651863098,
    "Education": 0.506702184677124,
    "Diplomacy": 0.4595661461353302,
    "Crime": 0.27507084608078003
  },
  "sentiment": {
    "positive": 0.143,
    "negative": 0.857,
    "neutral": 0.0
  }
}