{
  "title": "Διευθυντής του Russia Today δήλωσε ότι θα έπνιγε ή θα έκαιγε τα παιδιά στην Ουκρανία",
  "published_date": null,
  "url": "https://www.newsit.gr/kosmos/dieythyntis-tou-Russia-Today-dilose-oti-tha-epnige-i-tha-ekaige-ta-paidia-stin-oukrania/3625585/",
  "original_language": "el",
  "cleaned_sentences": [
    "The extreme comments of the director of Russia Today have caused rage, who did not hesitate to argue \"On Air\" that Ukraine's children should drown or burn.",
    "The reason for the 47 -year -old Anton Krasovsky, who after this statement was made available.",
    "The well -known journalist at Russia Today is generally known for his extreme views, but also for the support he shows in the Russian government's decision to move on war.",
    "The controversial comment on the children in Ukraine was made by the 47-year-old during an interview with Sergei Lukyanenko, a Russian science fiction writer, also known for his anti-Ukrainian views.",
    "ADVERTISING Anton Krasovsky said, inter alia, that, \"he would kill the children of Ukraine\" in response to what the Russian writer told him that \"when he first visited the country in the 1980s.",
    "Then his children told him they would live better if Russia had not understood their country\".",
    "\"They should have drowned in the river, where the duck was swimming.",
    "Just drown these kids, drown them in Tysyna (river in Russian).",
    "You throw them into the river that has strong power, \"Anton Krasovsky said without any hesitation who, while he was talking, raised his fist to imitate how he would choke the children.",
    "He also refused the right of Ukraine, demanded that the Ukrainians be shot and jumped up for the rape of women there.",
    "View in detail in the video below: ADVERTISING The management of the Russian network \"RT\", as reported by the Daily Mail, made 47 -year -old Anton Krasovsky available and there were a few colleagues who criticized him for his comments.",
    "The post of the editor -in -chief of Margarita Simonovna Simonyan, who in her post, announced the interruption of their cooperation and described his statements as \"disgusting and suffering\".",
    "- маргарита Симоньян (@M_simonyan) october 23, 2022 Возможно, антон объяснится, каким временн take помешательством оно было вызвано и как Сорвалось с ео яыка.",
    "However, Ukrainian Foreign Minister Dmytro Kuleba, who asked the international community to throw \"black\" on Russia Today, however, was also placed on the issue.",
    "\"Governments that have not yet banned 'RT' will have to watch this quote of the interview,\" he said on his Twitter account.",
    "Governments which still have not banned RT must watch this Excerpt.",
    "This is what you say with if you allow RT to operate in your counties.",
    "Aggressive Genocide Incitement (we will get this person on trial for it), which is not to do with freedom of speech.",
    "- Dmytro Kuleba (@dmytrokuleba) October 23, 2022 It is noted that the Research Committee, which manages serious violations, said it was called upon to investigate Anton Krasovsky's \"sharp statements\" and ordered a report.",
    "\"In the air ... you are drifting\" the journalist replies In a post on social media, the 47 -year -old director of Russia Today wrote that he was \"ashamed\".",
    "\"It happens, you are in the air, you are drifting and you can't stop.",
    "I ask that everyone who was shocked by it be forgiven, \"Anton Krasovsky wrote."
  ],
  "topics": {
    "Conflict": 0.7301833033561707,
    "Politics": 0.6815651655197144,
    "Culture": 0.6787967681884766,
    "Military": 0.5803736448287964,
    "Technology": 0.5339924097061157,
    "Economy": 0.47944769263267517,
    "Health": 0.4271498918533325,
    "Energy": 0.35718029737472534,
    "Transport": 0.3459435701370239,
    "Environment": 0.3222948908805847,
    "Crime": 0.2793567180633545,
    "Diplomacy": 0.22519977390766144,
    "Elections": 0.122947096824646,
    "Education": 0.11495177447795868
  },
  "sentiment": {
    "positive": 0.318,
    "negative": 0.682,
    "neutral": 0.0
  }
}