{
  "title": "Αγριο τρολάρισμα στη νικήτρια του διαγωνισμού ομορφιάς στη Ρωσία - Η φωτό που δεν την κολακεύει καθόλου",
  "published_date": null,
  "url": "https://www.iefimerida.gr/zoi/trolarisma-nikitria-mis-rosia-foto-dierreyse",
  "original_language": "el",
  "cleaned_sentences": [
    "Can a photo be so bad that it makes a man look completely different?",
    "This is supported by the organizers of the MRS Russia beauty contest who had to defend their victorious after the derision they received on the internet.",
    "But let's take things from the beginning.",
    "It all started on Tuesday, when 34 -year -old Natalia Oscar from Kabbarovsk, Eastern Russia, won the beauty contest.",
    "It is a competition that differs from Miss Russia's beauty - as it is aimed at married women with children.",
    "So the winner was Natalia - a young child's mother - whose Instagram profile is full of beautiful, gentle illuminated photos.",
    "\"If this is the winner, I'm afraid to ask how the others were\": Wild terrorism on social However, after her victory, a photo of the competition that showed her with a greasy front, wrinkles on her face and her excessively swollen lips to stand out, went viral on the internet.",
    "Social media users - many from Ukraine - began ruthlessly for both her lips, heavy makeup and the fact that she is quite short.",
    "Others said he had done too many plastic while others commented that he looked \"completely different\" from the person who won the beauty contest.",
    "\"If this is the winner, I'm afraid to ask if there are photos of the rest,\" one wrote with another commenting: \"Russia lies about everything.",
    "Even for the appearance. \"",
    "Was he the only candidate? \"",
    "wondered someone else.",
    "The response of the organizers The organizers of the beauty contest, seeing the public reaction, wanted to answer the critics, saying the photo was \"taken from a bad angle\", according to the Telegraph.",
    "\"It looks really beautiful in our official photos,\" said Irina Kirsanova, organizer of the Calligraphics, in the Podyem media.",
    "\"I was amazed at the reaction of the public.",
    "It was a bad photo, taken from a bad, low angle.",
    "It is very different.",
    "Everyone in the jury loved her. \""
  ],
  "topics": {
    "Culture": 0.5830521583557129,
    "Conflict": 0.5681762099266052,
    "Economy": 0.4196515381336212,
    "Technology": 0.41905784606933594,
    "Politics": 0.3488912880420685,
    "Health": 0.3274819850921631,
    "Energy": 0.30801093578338623,
    "Environment": 0.2734505832195282,
    "Crime": 0.2534070909023285,
    "Education": 0.2053041309118271,
    "Diplomacy": 0.17626787722110748,
    "Transport": 0.17343498766422272,
    "Military": 0.1568610668182373,
    "Elections": 0.08832762390375137
  },
  "sentiment": {
    "positive": 0.421,
    "negative": 0.579,
    "neutral": 0.0
  }
}