{
  "title": "No new direct Russia-Ukraine peace talks scheduled, Kremlin says",
  "published_date": null,
  "url": "https://www.breakingnews.ie/world/no-new-direct-russia-ukraine-peace-talks-scheduled-kremlin-says-1765521.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine have scheduled no further direct talks on ending their more than three-year war, a Kremlin spokesman has said.",
    "The comment comes almost a week after the first face-to-face engagement between the countries’ delegations since 2022 and days after US President Donald Trump announced they would start ceasefire negotiations “immediately”.",
    "“There is no concrete agreement about the next meetings,” Kremlin spokesman Dmitry Peskov told reporters.",
    "“They are yet to be agreed upon.” During two hours of talks in Istanbul last Friday, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, in what would be their biggest such swap.",
    "Apart from that step, the meeting delivered no significant breakthrough.",
    "Several months of intensified US and European pressure on the two sides to accept a ceasefire and negotiate a settlement have yielded little progress.",
    "Meanwhile, Russia is readying a summer offensive to capture more Ukrainian land, Ukrainian government and military analysts say.",
    "Russian President Vladimir Putin said earlier this week that Moscow would “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty”.",
    "Mr Putin has effectively rejected a 30-day ceasefire proposal that Ukraine has accepted.",
    "He has linked the possibility to a halt in Ukraine’s mobilisation effort and a freeze on Western arms shipments to Kyiv as part of a comprehensive settlement.",
    "European leaders have accused Mr Putin of dragging his feet in peace efforts while he tries to press his bigger army’s battlefield initiative and capture more Ukrainian land.",
    "The major prisoner swap is a “quite laborious process” that “requires some time”, Mr Peskov said.",
    "But he added: “The work is continuing at a quick pace, everybody is interested in doing it quickly.” Ukrainian President Volodymyr Zelensky said on Thursday that preparations are under way for the potential prisoner exchange, which he described as “perhaps the only real result” of the talks in Turkey.",
    "Mr Peskov disputed a report on Thursday in the Wall Street Journal that Mr Trump told European leaders after his phone call with Mr Putin on Monday that the Russian leader was not interested in talks because he thinks that Russia is winning.",
    "“We know what Trump told Putin, we don’t know what Trump told the Europeans.",
    "We know President Trump’s official statement,” Mr Peskov said.",
    "“What we know contrasts with what was written in the article you mentioned.” Apart from the continuing war of attrition along the roughly 1,000-kilometre (620-mile) front line, which has killed tens of thousands of troops on both sides, the warring parties have been firing dozens of long-range drones at each other’s territory almost daily.",
    "Russia’s Defence Ministry said that it had shot down 105 Ukrainian drones overnight, including 35 over the Moscow region.",
    "It was the second straight night that Kyiv’s forces have targeted the Russian capital.",
    "More than 160 flights were delayed across three of Moscow’s four main airports, the city’s transport prosecutor said, as officials grounded planes citing concerns for passenger safety.",
    "The attack prompted some regions to turn off mobile internet signals, including the Oryol region southwest of Moscow, which was targeted heavily on Wednesday.",
    "The Defence Ministry claimed it downed 485 Ukrainian drones over several regions and the Black Sea between Tuesday evening and Thursday morning, including 63 over the Moscow region, in one of the biggest drone attacks.",
    "It was not possible to verify the numbers.",
    "Meanwhile, the Ukrainian air force said Russia launched 128 drones at Ukraine overnight.",
    "Among the targets were Ukraine’s central Dnipropetrovsk region, damaging an industrial facility, power lines, and several private homes, regional governor Serhii Lysak said on Telegram.",
    "In Kyiv, debris from a Russian drone fell onto the grounds of a school in the capital’s Darnytskyi district, according to the head of the Kyiv City Military Administration, Tymur Tkachenko.",
    "No injuries were reported.",
    "Ukrainian shelling in Russia’s Kursk region killed a 50-year-old man and injured two others, acting regional Governor Alexander Khinshtein said on Thursday.",
    "Mr Putin visited the Kursk region on Tuesday for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month.",
    "Kyiv officials denied the claim.",
    "“Despite the liberation of our territory, the border region is still subject to enemy attacks,” Mr Khinshtein warned residents on Telegram.",
    "“It is still dangerous to be there.” Mr Putin has said Russian forces have orders to create a “security buffer zone” along the border.",
    "That would help prevent Ukraine from striking areas inside Russia with artillery, Mr Putin told a government meeting, but he gave no details of where the proposed buffer zone would be or how far it would stretch."
  ],
  "topics": {
    "Diplomacy": 0.8982324004173279,
    "Conflict": 0.8972970247268677,
    "Culture": 0.8746538758277893,
    "Politics": 0.8690947890281677,
    "Technology": 0.8560596108436584,
    "Environment": 0.8312508463859558,
    "Military": 0.8156816363334656,
    "Economy": 0.8134983777999878,
    "Transport": 0.8113470077514648,
    "Energy": 0.8072772026062012,
    "Education": 0.7339912056922913,
    "Health": 0.6613536477088928,
    "Crime": 0.6356097459793091,
    "Elections": 0.6035372614860535
  },
  "sentiment": {
    "positive": 0.152,
    "negative": 0.848,
    "neutral": 0.0
  }
}