{
  "title": "Will Putin chicken out? Ukraine piles on pressure on Vlad to meet Zelensky as Russia stays deathly silent on showdown",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15198964/vladimir-putin-zelensky-talks-istanbul-russia/",
  "original_language": "en",
  "cleaned_sentences": [
    "UKRAINE is now piling the pressure on Russia as Vladimir Putin stays silent on his own offer to meet for peace talks on Thursday.",
    "Moscow's bungle has seen Volodymyr Zelenksy take up Vlad's offer to for a face-to-face meet in Istanbul for long-awaited negotiations between the two leaders.",
    "But the Kremlin has gone deathly silent as Putin weighs rejecting the offer he sent to the Ukrainians.",
    "Zelensky has filled the dead air and now said he will definitely go to Istanbul - but will only meet with his counterpart Putin and not any other members of a Russian delegation.",
    "The Ukrainian is pressing his diplomatic advantage and says Putin is being “very strangely silent” about his own offer.",
    "Zelensky said: \"Russian shelling and assaults continue.",
    "Moscow remained silent all day regarding the proposal for a direct meeting.",
    "A very strange silence.",
    "Read more on world news \"One way or another, Russia will have to end this war – and the sooner, the better.\"",
    "Some in Russia have responded to the possible talks.",
    "The deputy speaker of Russia's upper house said Zelensky's proposal to meet Putin was “comedy and spectacle”.",
    "Konstantin Kosachev said Zelensky should \"be afraid\" of meeting Putin.",
    "Most read in The US Sun He said: “High-level meetings, especially under such difficult circumstances, are absolutely not arranged this way.\"",
    "Another Putin crony denied there had been an invite in the first place and backtracked over the offer.",
    "Vladimir Dzhabarov, deputy chair of the Federation Council’s foreign affairs committee, said the invite did simply not exist.",
    "He said: \"Who invited him to Istanbul?",
    "\"Does he really think our president would meet personally with someone who has blood on his hands, who betrayed the memory of the great heroism of both Ukrainians and the entire Soviet people — the heroism of his own grandfather?",
    "\"Who is he, that we should sit down with him at the negotiating table?” Trump has suggested he could join Zelensky and Putin in Istanbul for the talks.",
    "The US President said on Monday he was considering flying to Istanbul and he had a good feeling about the talks.",
    "The two leaders are jockeying for favour with Donald Trump - as they try to get the American on their side.",
    "Ukraine wants America to keep supporting it in its valiant war, while Moscow wants Washington to cut support and acquiesce to Putin conquering his neighbour.",
    "Zelensky said: \"Ukraine would appreciate it if President Trump could be there with us at this meeting in Turkey.",
    "This is the right idea.",
    "We can change a lot.\"",
    "He added: \"I will be in Turkey.",
    "I hope that the Russians will not evade the meeting.\"",
    "Any meeting would come in the wake of an stern, unified warning to Putin from the leaders of France, Germany, Poland and the UK to sign a 30-day ceasefire agreement or face crippling sanctions.",
    "Putin has said he wants peace, but is continuing to attack Ukraine and launch brutal drone attacks.",
    "What is Zelensky’s offer?",
    "On Sunday, Volodymyr Zelensky called Putin's bluff and said he would travel to Istanbul for a face-to-face peace talks.",
    "Vladimir Putin has always been open to talks - but has not changed his strategic goals away from dismembering Ukraine and replacing its government with a puppet.",
    "Putin is yet to reveal whether he will travel or meet directly with his arch rival.",
    "That's because Ukraine, the US, and European nations are demanding Russia agree to a 30-day ceasefire as a first step toward peace.",
    "Donald Trump has long demanded a quick peace to end the war.",
    "But Ukraine and Russia both want to keep fighting and are deftly trying to position themselves to win the favour of Trump.",
    "Putin wants to peel America away from supporting Ukraine, while Zelensky needs American weapons and finance to keep fighting Russia.",
    "Zelensky wants an immediate pause in fighting saying “we expect a ceasefire from [Monday] – complete and lasting, to provide the necessary basis for diplomacy.",
    "\"There is no point in prolonging the killings.\"",
    "Trump has put pressure on Zelensky to meet with Putin - even though the Russian leader refused to agree to a ceasefire.",
    "He said: “President Putin of Russia doesn’t want to have a Cease Fire Agreement with Ukraine, but rather wants to meet on Thursday, in Turkey, to negotiate a possible end to the BLOODBATH.",
    "“Ukraine should agree to this, IMMEDIATELY.",
    "“At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the U.S., will know where everything stands, and can proceed accordingly!",
    "“I’m starting to doubt that Ukraine will make a deal with Putin, who’s too busy celebrating the Victory of World War ll, which could not have been won (not even close!)",
    "without the United States of America.",
    "\"HAVE THE MEETING, NOW!!",
    "!” Hundreds of suicide bomber drones were launched by Russia at Ukraine over the weekend striking in civilian areas.",
    "Sunday's attack came just after a 1am Moscow press conference where Putin dramatically rejected a month-long ceasefire but insisted Russia was ready to resume direct peace talks in Istanbul on Thursday.",
    "Zelensky wants an immediate pause in fighting saying “we expect a ceasefire from [Monday] – complete and lasting, to provide the necessary basis for diplomacy.",
    "\"There is no point in prolonging the killings.\""
  ],
  "topics": {
    "Diplomacy": 0.9221100211143494,
    "Politics": 0.9148772358894348,
    "Environment": 0.8886169195175171,
    "Economy": 0.8729768991470337,
    "Conflict": 0.8680411577224731,
    "Transport": 0.8650587797164917,
    "Culture": 0.862864077091217,
    "Technology": 0.8527699708938599,
    "Health": 0.8516502380371094,
    "Military": 0.8378019332885742,
    "Energy": 0.8337246179580688,
    "Elections": 0.8027548789978027,
    "Education": 0.7766358256340027,
    "Crime": 0.7376686930656433
  },
  "sentiment": {
    "positive": 0.265,
    "negative": 0.735,
    "neutral": 0.0
  }
}