{
  "title": "Is the secret CIA songwriting group behind one of the great cold war conspiracy theories Ireland’s secret Eurovision weapon?",
  "published_date": null,
  "url": "https://www.irishmirror.ie/news/news-opinion/ireland-eurovision-entry-emmy-cia-35228686",
  "original_language": "en",
  "cleaned_sentences": [
    "Vladimir Putin is not much of a music aficionado by all accounts.",
    "Other than once singing Blueberry Hill at a charity event and declaring he likes “Russian music”, there is little on record about him having much interest.",
    "It does make me wonder, does his hostility stem from losing the Cold War?",
    "Putin has declared the collapse of the old Soviet Union after the fall of the Berlin Wall to be the great tragedy of the 20th Century.",
    "He has been very busy trying to reverse that tragedy by any means necessary since coming to power, most notably by rolling his tanks into Ukraine.",
    "What’s that got to do with rock 'n' roll you ask?",
    "Well only perhaps the greatest spy conspiracy ever told.",
    "In the late 1980s, German rockers Scorpion had a monster hit with their ‘haunting ballad’, Winds of Change.",
    "It became the anthem of a generation across the old Soviet and eastern European bloc just as real winds of change were beginning to shake the Berlin Wall and blow open the Iron Curtain.",
    "But in 2020, a podcast revealed the mind-blowing conspiracy that the tune was allegedly penned by a secret song-writing unit embedded deep in the CIA, as a soundtrack to encourage revolution.",
    "Scorpions’ frontman Klaus Meine has always denied his greatest smash hit was written by anyone other than himself and the band.",
    "Well he would, wouldn’t he?",
    "But if there was a secret rock’n’roll wing to the CIA that helped bring down the old Soviet Union, wouldn’t now be as good a time as any to get the band back together?",
    "Strangely, into this moment in history – just as Putin’s nostalgia for the old days is peaking - steps Ireland’s Eurovision entry, Emmy.",
    "With a song challenging the myths about Soviet prowess and invincibility, could Laika Party be the Winds of Change for a new generation?",
    "The song is all about a Moscow street mongrel named Laika that was sent on a one-way ticket to space oblivion aboard the USSR’s Sputnik II rocket in 1957.",
    "The western press dubbed the mission at the time “Muttnik”, proving it was the golden age of puns as well as space exploration.",
    "In what would become a forerunner of Vlad’s disinformation campaigns, it took 45 years for the Russians to admit the truth of Laika’s demise - that she died of overheating in a malfunctioning Sputnik capsule.",
    "So rather than being the first hero of the space race, Laika was actually sacrificed as cannon fodder on the altar of bungling Soviet hubris and imperialism.",
    "That makes Ireland’s Eurovision entry - which reimagines a defiant Laika having survived and giving two paws to her old Soviet masters as she continues to orbit the earth - as subversive in its own way as that Scorpion’s Cold War anthem.",
    "Eurovision has always been part of the great geopolitical power struggle anyway.",
    "Russia remains banned.",
    "Israel is facing calls for a boycott.",
    "Neighbours have settled trade wars and border disputes with the awarding of their ‘Douze Points’.",
    "On the frontlines in Ukraine, Laika Party can remind Russian conscripts how their masters really treat the rank and file.",
    "And across Europe, the song can be a rallying call of defiance to Vlad’s dream of rebuilding the Soviet empire.",
    "Which does make you wonder about whether those old CIA hitmakers have come back for an encore to help Ireland’s Eurovision bid.",
    "They would certainly know that their new commander in chief in the White House loves a good bit of canine propaganda (“they’re eating the dogs!”) And if the youth of Europe adopt Laika as their Eurovision winner, they can still save her from the sad fate of being boiled alive in that sputnik space capsule.",
    "They can ensure she keeps orbiting the earth, partying on in cyberspace to viral infinity and beyond!",
    "Subscribe to our newsletter for the latest news from the Irish Mirror direct to your inbox: Sign up here."
  ],
  "topics": {
    "Politics": 0.8848884701728821,
    "Conflict": 0.8431554436683655,
    "Culture": 0.8253891468048096,
    "Technology": 0.8211230039596558,
    "Economy": 0.772366464138031,
    "Environment": 0.7319952845573425,
    "Health": 0.7210599780082703,
    "Elections": 0.6980217695236206,
    "Military": 0.6699519157409668,
    "Transport": 0.6575057506561279,
    "Energy": 0.5891079306602478,
    "Diplomacy": 0.4989880323410034,
    "Crime": 0.37466850876808167,
    "Education": 0.23135560750961304
  },
  "sentiment": {
    "positive": 0.533,
    "negative": 0.467,
    "neutral": 0.0
  }
}