{
  "title": "Watch dramatic Nato vs Russia sea clash erupt as warplanes buzz Putin’s ‘shadow fleet’ vessel as it’s ordered ‘stop NOW’",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15211469/watch-dramatic-nato-russia-sea-clash/",
  "original_language": "en",
  "cleaned_sentences": [
    "THIS is the dramatic moment Nato and Russian warplanes clashed above the Baltic Sea - after a tense standoff over an undercover Russian tanker.",
    "Estonian sea and air forces stalked and tried to board an oil tanker thought to be part of Russia's shadow fleet - but it fought back.",
    "The tanker called Jaguar was draped in the Gabon flag, but Britain sanctioned it on Friday - accusing it of being a Russian pawn.",
    "Nato aircraft - including Polish MiG-29s - were scrambled when the vessel refused to cooperate.",
    "In response, Russia scrambled a Su-35S fighter jet which is said to have violated Estonian airspace as it stormed in to cover for the fleeing Jaguar.",
    "The spectacular clash came ahead of crunch direct talks between Russia and Ukraine - where Vladimir Putin snubbed Zelenksy's challenge to meet him in-person.",
    "read more on russia In dramatic footage, the Polish Nato plane can be seen tailing the Russian Su-35 in a dogfight over the Gulf of Finland - part of the Baltic Sea.",
    "A Russian voice on the bridge of the tanker goaded the Estonians, calling them “clowns” as they tried and failed to board.",
    "The tanker ultimately anchored near Gogland Island - controlled by Russia - in the eastern Baltic Sea.",
    "Footage shows the high drama in one of the most tense regions in the world amid disputes between Russia and Nato over Ukraine.",
    "Most read in The US Sun “This is how we're greeted with helicopters,” said a voice -apparently Russian - on the tanker.",
    "\"They're demanding we anchor.” A message is heard saying: “This is Estonian warship Papa 6732.",
    "“Your request will be denied.",
    "“Follow my instructions.",
    "Immediately change course to 105.",
    "Over.” A voice from the tanker in Hindi says: “That looks like our drone in front….” A Russian voice demands: “Go on, hit it running….” Referring to the Estonians, he says: “What a bunch of clowns!” The Estonian vessel comes close to the tanker seeking to swerve it to the right.",
    "An Estonian A139 helicopter and an M-28 Skytruck plane of the Estonian defence forces were seen circling the vessel.",
    "Boasting a success against the West, pro-Kremlin news outlet Izvestia reported: “Despite this show of force, the Estonian authorities were unable to stop the vessel.",
    "“The Jaguar ultimately reached Gogland Island, a Russian-controlled territory in the Gulf [of Finland], and resumed its route to Primorsk”.",
    "Russian outlet News-Pravda reported, “Sailors from the Baltic Republic [Estonia] twice tried to land troops from a helicopter.” After the extraordinary clash, Nato state Estonia summoned the Russian Chargé d'Affaires in Tallinn, Lenar Salimullin, who was handed a note of protest, accusing the Putin warplane of violating the republic's airspace.",
    "Estonian Foreign Minister Margus Tsahkna said: \"From Estonia's point of view, this is a very serious and regrettable incident that is in no way unacceptable.\"",
    "Latest on the peace talks DIRECT peace talks between Russia and Ukraine are due on Thursday - for the first time since March 2022, a month into the invasion.",
    "The talks were suggested by Putin himself in response to demands for him to agree to a 30-day ceasefire from world leaders.",
    "Zelensky challenged Putin to meet him in person in Istanbul on Thursday - and Donald Trump even suggested he could join.",
    "But, at the eleventh hour, Russia announced Putin would snub the meeting.",
    "A short time later, the US said that Trump would stay away as well.",
    "On Thursday, Zelensky arrived in the Turkish capital Ankra to meet President Erdoğan.",
    "Meanwhile, Nato officials gathered in Istanbul ahead of the talks.",
    "In a twist, Trump suggested that he might fly to Turkey on Friday - and join the talks if they were still rumbling on.",
    "Putin's absence will fuel the belief that he is not actually interested in ending the war - as Zelensky has said many times.",
    "The Ukrainian leader wasted no time in slamming Putin's decision.",
    "He demanded that Russia \"must face tougher, faster sanctions\" .",
    "The tanker had been near Naissaar Island, off Tallinn, when the Estonian Navy communicated with it by radio at 15:30 GMT on Tuesday, said Commander Ivo Vark.",
    "He added that it was was sailing \"without a nationality” and Estonia \"had an obligation to verify the vessel's documents and legal status\".",
    "\"The vessel denied cooperation and continued its journey toward Russia [...] given the vessel's lack of nationality, the use of force, including boarding the vessel, was deemed unnecessary.” Estonia escorted it until the vessel reached Russian waters.",
    "Estonian Defence Minister Hanno Pevkur said the ship was sent from Estonian to Russian territorial waters to prevent a threat to his country’s critical infrastructure.",
    "He said: \"The issue was the ship's flag state, and our most important goal was to ensure the security of critical infrastructure.",
    "The 800-ft long Jaguar is a crude oil tanker reportedly sailing under the flag of Gabon.",
    "The Equasis database suggested the ship changed its name and flag state at the beginning of February.",
    "According to this data its name is now Argent and its flag state is Guinea-Bissau.",
    "Putin uses a vast network of non-Russian tankers - called a shadow fleet - to avoid oil sanctions."
  ],
  "topics": {
    "Conflict": 0.9448161125183105,
    "Politics": 0.944806694984436,
    "Technology": 0.9206121563911438,
    "Energy": 0.899601399898529,
    "Economy": 0.8974672555923462,
    "Diplomacy": 0.8919169306755066,
    "Culture": 0.8888260722160339,
    "Transport": 0.8811317086219788,
    "Military": 0.8619853258132935,
    "Elections": 0.816909909248352,
    "Environment": 0.8097853064537048,
    "Health": 0.7304943203926086,
    "Education": 0.7099750638008118,
    "Crime": 0.6703399419784546
  },
  "sentiment": {
    "positive": 0.415,
    "negative": 0.585,
    "neutral": 0.0
  }
}