{
  "title": "Rubio and other Nato diplomats to meet ahead of possible Ukraine-Russia talks",
  "published_date": null,
  "url": "https://www.breakingnews.ie/world/rubio-and-other-nato-diplomats-to-meet-ahead-of-possible-ukraine-russia-talks-1763061.html",
  "original_language": "en",
  "cleaned_sentences": [
    "US secretary of state Marco Rubio and his Nato counterparts meet in Turkey on Thursday to prepare a pivotal summit of alliance leaders next month that will set the course for future European security as America focuses on challenges elsewhere.",
    "The meeting in the Mediterranean coastal city of Antalya comes amid a flurry of negotiations aimed at producing a ceasefire agreement between Russia and Ukraine, including talks in Istanbul that Mr Rubio and president Donald Trump’s special envoy Steve Witkoff plan to attend on Friday.",
    "Mr Rubio and Mr Witkoff are coming to Turkey after accompanying Mr Trump on portions of his trip to Gulf Arab countries.",
    "On the sidelines of the Nato meeting, Ukrainian foreign minister Andrii Sybiha met on Wednesday with Mr Rubio, who also is having separate talks with new German foreign minister Johann Wadephul and foreign minister Hakan Fidan of Turkey, whose country is trying to help broker a deal that might end the more than three-year-old war.",
    "Mr Sybiha and Mr Fidan on Wednesday discussed efforts to establish a ceasefire and steps toward securing a lasting peace with Russia, according to the Turkish foreign ministry.",
    "The same day that Nato foreign ministers gather, Ukrainian President Volodymyr Zelensky is set to meet with Turkish President Recep Tayyip Erdogan in Ankara.",
    "It is an open question whether Mr Trump or Russian President Vladimir Putin will participate on Thursday.",
    "Mr Trump teased a possible visit to Istanbul while flying from Saudi Arabia to Qatar on Wednesday, but there was no immediate indication that his travel plans would change.",
    "“He’d like me to be there, and that’s a possibility,” Mr Trump said, referring to Mr Putin.",
    "“I don’t know that he would be there if I’m not there.",
    "We’re going to find out.” Mr Zelensky has been pushing for direct talks with Russia but only if Mr Putin attends.",
    "Mr Putin, who has rebuffed previous such calls, has been coy and has not committed to a meeting.",
    "The Kremlin on Wednesday said Mr Putin’s aide, Vladimir Medinsky, will head the Russian delegation, which also will include deputy defence minister Alexander Fomin, deputy foreign minister Mikhail Galuzin and Igor Kostyukov, chief of the General Staff’s main directorate.",
    "The list did not include Mr Putin himself.",
    "Mr Zelensky also remains keen on Ukraine joining Nato, which Russia has adamantly rejected and Mr Trump appears to have agreed with.",
    "So even with a Ukrainian presence in Antalya, it appeared unlikely there would be any decisions made about Ukraine’s future, or lack thereof, in the military alliance.",
    "Of greater concern to the US is money, with the Trump administration saying it wants to hear how European members of Nato and Canada plan to boost their national defence investments to 5% of gross domestic product.",
    "In 2023, as Russia’s full-scale war on Ukraine entered its second year, Nato leaders agreed to spend at least 2% of GDP on national defence budgets.",
    "So far, 22 of the 32 member countries have done so.",
    "The leaders will set a new goal at a summit in The Hague on June 25.",
    "Mr Trump insists that US allies should commit to spending at least 5% to be ready to defend themselves, but that would require investment at an unprecedented scale.",
    "Mr Trump has cast doubt over whether the US would defend allies that spend too little.",
    "The US was projected to have spent 3.38% last year, Nato figures show, the only ally whose spending has dropped over the last decade.",
    "Asked last month whether the US would match the 5% target, Mr Rubio said: “Sure.",
    "We’re heading there now.” “Make no mistake, this ministerial is going to be different,” US envoy to Nato Matthew Whitaker said this week, adding: “5% is not just a number, it is a necessity for our security.",
    "The alliance is facing significant threats.” He did not outline those threats.",
    "Nato leaders insisted at their summit last year that “Russia remains the most significant and direct threat to Allies’ security”, but some countries are uneasy about Mr Trump re-engaging with Mr Putin.",
    "Mr Fidan, the Turkish foreign minister who is hosting the meeting, is expected to express Turkey’s commitment to strengthening Nato and call for the inclusion of Nato allies that are not European Union members — such as Turkey — into European security and defence initiatives, according to Turkish officials.",
    "Mr Fidan also would advocate a comprehensive, “360-degree security” approach focusing not only on ending the Russia-Ukraine war but also on stability in the Middle East and regions adjacent to Nato members, the officials said.",
    "Meanwhile, the defence spending plan under consideration appears to be for all allies to aim for 3.5% of GDP on “hard military spending by 2032”, and an extra “1.5% related spending (on) infrastructure, cybersecurity and things like that.",
    "Also achievable by 2032,” according to the Dutch government.",
    "While the two figures add up to 5%, factoring in infrastructure and cybersecurity would change the basis on which Nato traditionally calculates defence spending.",
    "The seven-year time frame is also short by the alliance’s usual standards.",
    "Mr Whitaker, the US Nato ambassador, appeared this week to confirm the plan, saying it “also includes things like mobility, necessary infrastructure, cybersecurity”.",
    "“It is definitely more than just missiles, tanks and howitzers,” he said.",
    "It is difficult to see how many allies might reach even 3.5% of GDP.",
    "The meeting in Turkey may provide more clarity."
  ],
  "topics": {
    "Diplomacy": 0.7530350685119629,
    "Conflict": 0.5790672898292542,
    "Military": 0.46851882338523865,
    "Transport": 0.37162768840789795,
    "Politics": 0.37076082825660706,
    "Culture": 0.3612107038497925,
    "Economy": 0.3179071843624115,
    "Energy": 0.3130066990852356,
    "Environment": 0.2968083322048187,
    "Technology": 0.27931907773017883,
    "Elections": 0.25155729055404663,
    "Health": 0.227481409907341,
    "Education": 0.18830935657024384,
    "Crime": 0.17488394677639008
  },
  "sentiment": {
    "positive": 0.595,
    "negative": 0.405,
    "neutral": 0.0
  }
}