{
  "title": "Huge Ukrainian drone strike on Russia causes Putin to SHUT all four major Moscow airports",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15161389/ukrainian-drone-strike-russia-putin-shut-moscow-airports/",
  "original_language": "en",
  "cleaned_sentences": [
    "A HUGE Ukrainian drone strike has forced Russia to shut all four of its major airports in a dramatic show of force against Moscow.",
    "In the second consecutive night of aerial assaults on the capital, Russia’s aviation watchdog Rosaviatsia confirmed the airports were closed “to ensure safety” and only reopened hours later.",
    "Ukrainian strikes overnight reached within just six miles of the Kremlin and Red Square, ahead of the vast 80th anniversary commemoration of the defeat of Hitler.",
    "All four major Moscow airports - Vnukovo, Sheremetyevo, Domodedovo and Zhukovsky - were closed as the drones targeted the capital, with multiple diversions of incoming aircraft.",
    "At least nine other airports were also disrupted.",
    "Russian tourists complained about being trapped in a Nesma Airlines plane from Egyptian resort Hurghada to Moscow for ten hours after it was diverted to St Petersburg due to the drone strikes amid air chaos.",
    "Read more on Ukraine war Moscow’s mayor Sergei Sobyanin said at least 19 Ukrainian drones were destroyed before reaching the city “from different directions.” He added: “Some of the debris had landed on one of the key highways into the city,” but claimed there were no casualties.",
    "The attack sent shockwaves through the city as unverified reports by Russian military bloggers claimed apartment windows in southern Moscow had been shattered by blasts.",
    "Ukraine has not commented on the strikes, but the mayor of Kharkiv said Russia had simultaneously carried out its own drone attacks in his city and near Kyiv.",
    "Most read in The Sun A clean-up was underway on Moscow’s Kashirskoye Highway, as Kyiv refuses to accept Putin’s unilateral three day ceasefire starting tomorrow night - demanding instead a month-long truce as a prelude to ending the war.",
    "Russia was forced to stage a massive air defence operation, claiming 105 Ukrainian drones were shot down overnight, mostly aimed at Moscow from multiple directions.",
    "If the drone strikes continue, they threaten to disrupt Putin’s military extravaganza on Thursday when foreign guests will be led by Chinese president Xi Jinping.",
    "In Odesa, one person was killed in a Russian drone strike overnight, according to regional governor Oleh Kiper.",
    "“As a result of the Russian strike on the Odesa region, a number of civilian infrastructure facilities were damaged, including private residential buildings,” said a statement.",
    "“Fires broke out in some places, which were quickly extinguished by our rescuers.",
    "“The body of a dead person was found in one of the houses.” The drone war is intensifying.",
    "On Monday night alone, Russia said it shot down 26 Ukrainian drones, while this latest wave has now hit multiple Russian regions, including Penza and Voronezh.",
    "Meanwhile, fierce clashes erupted in Russia’s Kursk region, where Kyiv claimed it struck a drone command unit near Tyotkino.",
    "Ukraine claimed to have killed 20 Russian troops at a control post for drone pilots at Tetkino, in Kursk region.",
    "Ukraine’s general staff said: “Nine months after the start of the Kursk operation, Ukraine’s Defence Forces maintain a military presence on the territory of Russia’s Kursk region.” Russian officials reported a major power outage in the town of Rylsk after an electrical substation was hit in another attack.",
    "“Two transformers were damaged,” said acting governor Alexander Khinshtein, adding that “two teenagers had been injured by shrapnel from the blast.” Military bloggers described dramatic scenes of Ukrainian forces “blowing up bridges with rockets” and storming the border in armoured vehicles.",
    "“There is a heavy battle going on at the border,” wrote one under the handle RVvoenkor.",
    "Ukrainian forces originally pushed into Kursk in August 2024 in a surprise incursion aimed at creating a buffer zone to protect the northeastern city of Sumy, just 12km from Tyotkino.",
    "Earlier, Russian strikes on Ukraine’s Sumy region killed three, and injured seven, amid intense border battles.",
    "At least 18 Ukrainian drones shot down over Russia's Voronezh region, said officials.",
    "One - seen on video - hit a children's playground, catching fire.",
    "Civilians in Sumy are now also being told to evacuate two settlements.",
    "Russia also set fire to Barabashovo market, one of the largest in Europe, in a series of strikes.",
    "Footage showed the market ablaze with at least four civilians wounded.",
    "Putin’s attack drones hit four separate districts of Kharkiv, Ukraine’s second city in two hours of hellish attacks from drones.",
    "Kharkiv mayor Ihor Terekhov said: “For two hours, Kharkiv was under a massive attack by enemy combat drones.",
    "“During this time, 17 hits on the city were recorded.",
    "“Four districts of Kharkiv were under attack - Shevchenkivskyi, Kievskyi, Kholodnogorskyi and Industrialny” It comes after Vladimir Putin unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.",
    "Russia's latest barbaric attack on the Ukrainian capital has left at least 11 injured - including two children.",
    "The strikes from Moscow came just hours after Volodymyr Zelensky warned Kyiv won't be \"playing games\" with peace.",
    "Putin has imposed his own three-day ceasefire to coincide with Russia's Victory Day parade next week.",
    "Ukraine has rejected the offer and described it as typical Kremlin theatrics.",
    "Instead, they called for a 30-day truce with Russia which Putin and his cronies have dully ignored."
  ],
  "topics": {
    "Culture": 0.9564982056617737,
    "Conflict": 0.9561964273452759,
    "Military": 0.9447438716888428,
    "Environment": 0.9369509816169739,
    "Health": 0.9322654008865356,
    "Transport": 0.9309157729148865,
    "Politics": 0.930724024772644,
    "Crime": 0.9293988347053528,
    "Energy": 0.9276381134986877,
    "Economy": 0.9173902869224548,
    "Diplomacy": 0.9135229587554932,
    "Elections": 0.9076681137084961,
    "Technology": 0.8949769735336304,
    "Education": 0.7871996164321899
  },
  "sentiment": {
    "positive": 0.132,
    "negative": 0.868,
    "neutral": 0.0
  }
}