{
  "title": "Putin spurns Zelensky meeting but lower-level Ukraine-Russia talks are still on",
  "published_date": null,
  "url": "https://www.breakingnews.ie/world/putin-spurns-zelensky-meeting-but-lower-level-ukraine-russia-talks-are-still-on-1763253.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine are set to hold their first direct peace talks in three years, both countries said, but hopes for a breakthrough remained dim after Russian President Vladimir Putin spurned an offer by Ukrainian President Volodymyr Zelensky to meet face-to-face in Turkey.",
    "Mr Zelensky said he is sending a team headed by his defence minister from the Turkish capital Ankara to Istanbul to meet a Russian delegation, even though Moscow’s side does not include “anyone who actually makes decisions”.",
    "Few had expected Mr Putin to show up in Turkey, and his absence punctured any hope of significant progress in efforts to end the three-year-old war that was given a push in recent months by the Trump administration and Western European leaders.",
    "It also raised the prospect of intensified international sanctions on Russia that have been threatened by the West.",
    "Mr Zelensky, speaking to reporters in Ankara where he flew on Thursday after challenging Mr Putin to sit down with him, accused Moscow of not taking efforts to end the war seriously by sending a low-level negotiating team that he described as “a theatre prop”.",
    "His proposal to Mr Putin came after a flurry of manoeuvring last weekend as each side sought a diplomatic advantage.",
    "The head of the Russian delegation, presidential aide Vladimir Medinsky, said in Istanbul the representatives were ready to meet Ukrainian officials.",
    "“The task of these direct negotiations with Ukraine is to establish long-term peace sooner or later by eliminating the root causes of this conflict,” he said in a brief statement.",
    "It was not clear when they would meet.",
    "Mr Medinsky said late on Thursday that the Russian delegation would be waiting for Ukrainian officials at 10am on Friday.",
    "US secretary of state Marco Rubio said he would confer on Friday in Istanbul with Turkish foreign minister Hakan Fidan and the Ukrainian delegation, adding that the Russian delegation would be meeting with other members of the US team and that he hoped all sides could get together.",
    "“We don’t have high expectations of what will happen tomorrow.",
    "And frankly, at this point, I think it’s abundantly clear that the only way we’re going to have a breakthrough here is between President Trump and President Putin,” Mr Rubio told reporters in Antalya, Turkey, where he was attending a Nato foreign ministers meeting.",
    "Mr Zelensky, who is heading on Friday to a gathering of European officials in Albania, said he had decided to send the delegation to Istanbul to demonstrate to US President Donald Trump that Ukraine wants to end the fighting.",
    "He said the Ukrainian side would be headed by defence minister Rustem Umerov and its aim is “to attempt at least the first steps toward de-escalation, the first steps toward ending the war – namely, a ceasefire”.",
    "Turkish President Recep Tayyip Erdogan earlier welcomed Mr Zelensky with an honour guard at the presidential palace in Ankara before the two held talks.",
    "The war has killed tens of thousands of soldiers on both sides and more than 12,000 Ukrainian civilians, according to the UN, and continues along the roughly 1,000-kilometre (620-mile) front line.",
    "Russian forces are preparing a fresh military offensive, Ukrainian government and Western military analysts say.",
    "At least five civilians were killed and 29 injured in the past day, according to authorities in five eastern regions of Ukraine where Russia’s army is trying to advance.",
    "The diplomatic manoeuvring began on Saturday when European leaders met Mr Zelensky in Kyiv and urged the Kremlin to agree to a full, unconditional 30-day ceasefire as a first step towards peace.",
    "Mr Putin responded early on Sunday by proposing direct talks with Ukraine in Istanbul.",
    "Then came Mr Zelensky’s challenge to Mr Putin for face-to-face talks.",
    "After days of silence, Kremlin spokesman Dmitry Peskov finally said on Thursday that Mr Putin had no plans to travel to Istanbul in the next few days.",
    "Mr Trump said he was not surprised that Mr Putin was a no-show.",
    "The US president had pressed for Mr Putin and Mr Zelensky to meet but brushed off Mr Putin’s apparent decision not to attend.",
    "“I didn’t think it was possible for Putin to go if I’m not there,” Mr Trump told reporters at a meeting with business executives in Doha, Qatar, on the third day of his visit to the Middle East.",
    "Mr Trump said a meeting between him and Mr Putin was crucial to break the deadlock.",
    "“I don’t believe anything’s going to happen whether you like it or not, until (Putin) and I get together,” he said on Air Force One while travelling from Doha to Abu Dhabi, the capital of the United Arab Emirates.",
    "“But we’re going to have to get it solved because too many people are dying.” Mr Peskov said Mr Putin has no plans to meet with Mr Trump in the coming days.",
    "Mr Medinsky is leading the Russian team that also includes three other senior officials, the Kremlin said.",
    "Mr Putin also appointed four lower-level officials as “experts” for the talks in Istanbul.",
    "Also absent from the talks were Russian foreign minister Sergey Lavrov and Mr Putin’s foreign policy adviser Yuri Ushakov, both of whom represented Russia at the talks with the US in Saudi Arabia in March.",
    "The top-level Ukrainian delegation included Mr Umerov, foreign minister Andrii Sybiha and the head of the Ukrainian presidential office Andriy Yermak, a Ukrainian official said.",
    "Mr Zelensky will sit at the negotiating table only with Mr Putin, said presidential adviser Mykhailo Podolyak.",
    "Mr Putin met on Wednesday evening with senior government officials and members of the delegation in preparation for the talks, Mr Peskov said.",
    "Defence minister Andrei Belousov, General Staff chief Valery Gerasimov and National Security Council secretary Sergei Shoigu also attended.",
    "The Kremlin billed Thursday’s talks as a “restart” of peace negotiations that were held in Istanbul in 2022 but quickly fell apart.",
    "Moscow accused Ukraine and the West of wanting to continue fighting, while Kyiv said Russia’s demands amounted to an ultimatum rather than something both sides could agree on.",
    "Russia’s delegation then was also headed by Mr Medinsky.",
    "Mr Putin’s proposal came after more than three months of diplomacy kickstarted by Mr Trump, who promised during his campaign to end the devastating war swiftly – though it has been hard to pull off.",
    "The Trump administration in recent weeks indicated that it might walk away from the peace effort if there was no tangible progress soon.",
    "Mr Sybiha met with US state secretary Marco Rubio and Senator Lindsey Graham on Wednesday night in the Turkish city of Antalya, which is hosting Nato foreign ministers to discuss new defence investment goals as the US shifts its focus to security challenges away from Europe.",
    "Mr Sybiha reaffirmed Ukraine’s support for Mr Trump’s mediation efforts and thanked the US for its continued involvement, urging Moscow to “reciprocate Ukraine’s constructive steps” towards peace.",
    "“So far, it has not,” Mr Sybiha said.",
    "On Thursday morning, Mr Sybiha also met with other European foreign ministers, including his French counterpart Jean-Noel Barrot, who in a post on X reiterated the call for a ceasefire and the threat of “massive sanctions” if Russia does not comply.",
    "“We’re in a very difficult spot right now, and we hope that we can find the steps forward that provide for the end of this war in a negotiated way and the prevention of any war in the future,” Mr Rubio said on Thursday.",
    "British Prime Minister Sir Keir Starmer accused Mr Putin of “standing in the way of peace”.",
    "“There was only one country that started this conflict – that was Russia.",
    "There’s only one country now standing in the way of peace – that is Russia, that is Putin,” he said in a visit to Tirana, Albania.",
    "Mr Barrot echoed that sentiment, saying: “In front of Ukrainians there is an empty chair, one that should have been occupied by Vladimir Putin.",
    "“Vladimir Putin is dragging his feet and in all evidence does not want to enter into these peace discussions.”"
  ],
  "topics": {
    "Diplomacy": 0.7326085567474365,
    "Conflict": 0.7107208967208862,
    "Culture": 0.6841818690299988,
    "Politics": 0.616942286491394,
    "Energy": 0.5799568891525269,
    "Economy": 0.5199497938156128,
    "Environment": 0.5094927549362183,
    "Transport": 0.5086351633071899,
    "Technology": 0.46358606219291687,
    "Military": 0.4366905093193054,
    "Education": 0.3996709883213043,
    "Elections": 0.33677855134010315,
    "Health": 0.28661638498306274,
    "Crime": 0.28041163086891174
  },
  "sentiment": {
    "positive": 0.412,
    "negative": 0.588,
    "neutral": 0.0
  }
}