{
  "title": "Desperate locals in Kharkiv urge Russia to sign up to 30-day ceasefire plan after thousands killed",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15187582/kharkiv-locals-putin-ceasefire-plea/",
  "original_language": "en",
  "cleaned_sentences": [
    "DESPERATE locals in one of Ukraine’s hardest hit cities yesterday urged Russia to sign up to the 30-day ceasefire plan.",
    "As President Volodymyr Zelensky was hosting European leaders in Kyiv, war weary residents in Kharkiv were praying for peace.",
    "The eastern city of 1.3million people is just a few miles from the front line and has suffered a non-stop bombardment since the war began.",
    "Around a quarter of the city has been destroyed, thousands have been killed and 700,000 people have fled.",
    "Those who remain yesterday told The Sun they were tired of war and want Vladimir Putin to agree to the ceasefire proposed by Ukraine, America and Europe.",
    "But they are so used to an almost daily bombardment they struggle to believe the crazed tyrant will agree to lay down his arms.",
    "READ MORE ON UKRAINE Seamstress Valentina Hoydenko, 65, is one of those whose family has paid the ultimate price.",
    "She said: “My son joined the army last year and was killed a few months later.",
    "“We have lost too much and we are tired and we want peace.",
    "“I really hope it will happen and I hope Putin agrees to this deal but I find it hard to believe he will.",
    "Most read in The Sun “The shelling never stops.",
    "Two days ago I heard a missile go over which hit a market.",
    "“My own house has been damaged and is now being repaired.",
    "“People are so used to it that they hardly turn their heads when a drone or a missile goes over.",
    "“We want peace and we hope Putin agrees to a ceasefire as a first step but it is hard to find the faith that he will.” The city is just 18 miles from the border and is so close to enemy troops that Russian missiles can reach it in less than a minute.",
    "But it is hoped that a 30-day ceasefire would lead to a more permanent peace and an end to the non-stop blitz.",
    "After three years of war admin assistant Vadim Medvediuk, 25, told how he has given up going to the shelter when the siren sounds unless he fears a direct hit on his apartment block.",
    "He said: “Everyone is so used to attacks that they treat it as an ordinary daily event.",
    "“I don’t even bother going to the air raid shelter now when the siren sounds.",
    "“I only go if I can actually hear the drone.",
    "I live on the 9th floor of a residential block which has 16 floors so if there is any chance of it hitting my block I will hopefully hear it and then I will go to the shelter.",
    "“We are really tired of the war and want it to end.",
    "This 30-day plan would be a good first step in getting there.",
    "“But would Russia stick to it?",
    "There was supposed to be a ceasefire over the last few days but the attacks continued.” Those attacks included one in Sumy which killed an 85-year-old woman, injured three others and destroyed 19 homes, all when Russia was supposed to be observing a three-day ceasefire to mark Friday’s Victory Parade.",
    "Another strike hit the eastern Donetsk region injuring one person setting two apartment blocks on fire.",
    "Rescuers who raced to the scene were then targeted in a “double tap” strike.",
    "And in Kherson a 58-year-old was injured in a drone attack."
  ],
  "topics": {
    "Conflict": 0.6829079389572144,
    "Politics": 0.6081434488296509,
    "Culture": 0.5532422065734863,
    "Transport": 0.5445295572280884,
    "Economy": 0.5109190940856934,
    "Health": 0.49920767545700073,
    "Environment": 0.4748899042606354,
    "Elections": 0.46071749925613403,
    "Technology": 0.4531892240047455,
    "Military": 0.4280988574028015,
    "Diplomacy": 0.4170229732990265,
    "Energy": 0.39188888669013977,
    "Crime": 0.3128298819065094,
    "Education": 0.2816029191017151
  },
  "sentiment": {
    "positive": 0.143,
    "negative": 0.857,
    "neutral": 0.0
  }
}