{
  "title": "Russia blitzes Kyiv with massive drone strike as Putin snubs 30-day ceasefire and Zelensky warns 'I will not play games'",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15153499/putin-ukraine-ceasefire-zelensky-kyiv/",
  "original_language": "en",
  "cleaned_sentences": [
    "VLADIMIR Putin has unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.",
    "Russia's latest barbaric attack on the Ukrainian capital has left at least 11 injured - including two children.",
    "The strikes from Moscow come just hours after Volodymyr Zelensky warned Kyiv won't be \"playing games\" with peace.",
    "Putin has imposed his own three-day ceasefire to coincide with Russia's Victory Day parade next week.",
    "Ukraine has rejected the offer and described it as typical Kremlin theatrics.",
    "Instead, they called for a 30-day truce with Russia which Putin and his cronies have dully ignored.",
    "read more in Ukraine war Alongside their attempts to stifle genuine peace talks, Moscow has also continued to carry out attacks on Ukraine.",
    "Putin's military deployed a number of drones which hit civilians in Kyiv overnight.",
    "Two children - aged 14 and `17 - were among the 11 left injured in the city alongside dozens of badly damaged buildings.",
    "A 12-floor residential tower block and a kindergarten were both left crumbling under Putin's attacks.",
    "Most read in The Sun Terrifying footage showed firefighters in the capital desperately battling the flames after the drone strikes.",
    "Several cars were left burnt out as residents were evacuated from their decimated homes.",
    "Many civilians were asleep at the time of the attacks and were awoken by the sound of smashed glass and screaming neighbours.",
    "Images taken in the morning after showed huge craters in the ground from the drone blasts.",
    "Emergency officials spent hours cleaning up debris and helping those forced out of their homes return safely.",
    "Elsewhere, Shahed drone strikes hit Cherkasy and Izyum, Kharkiv region.",
    "Ukraine valiantly hit back with strikes of their own on Saturday night.",
    "They reportedly hit the military-linked Strela electrical components plant at Suzemka.",
    "Images showed how it was left up in smoke after an attack.",
    "Kyiv’s forces also hit a Russian command post in the Bakhmut direction which Ukrainian officials labelled a “devastating blow”.",
    "A day earlier, Zelensky's men made history as they destroyed one of Putin's prized fighter jets using a new missile-armed sea drone.",
    "Ukraine's GUR military intelligence agency celebrated the remarkable strike - hailing it as the first time in history that a warplane was destroyed by a sea drone.",
    "These latest tit-for-tat strikes came after Zelensky again demanded that a month-long ceasefire came into effect immediately.",
    "He said: “We are ready to move toward a ceasefire as soon as possible – even starting today – if Russia is ready to take reciprocal steps – to establish complete silence, a lasting ceasefire of at least 30 days.",
    "“Russia must stop the war and halt its assaults and shelling.” But Putin’s mouthpiece Dmitry Peskov said Moscow will only accept a three days of peace.",
    "Peskov claimed it was a test to judge \"Kyiv’s readiness\" to find a suitable solution to end the gruelling conflict.",
    "These disagreements over a temporary halt to the war has only helped to increase anger over in Washington.",
    "US President Donald Trump announced earlier this week that the US will no longer act as the mediator between Russia and Ukraine.",
    "They said the decision has been made after Putin refused to accept a full ceasefire and instead offered a short three-day truce.",
    "America said the country is changing “the methodology of how we contribute” to the talks and will no longer “fly around the world at the drop of a hat” for meetings.",
    "The shift comes just two days after the US and Ukraine signed a historic minerals deal - in what appeared to be final push by Washington to broker a peace plan."
  ],
  "topics": {
    "Conflict": 0.9439186453819275,
    "Health": 0.9018397927284241,
    "Politics": 0.8857835531234741,
    "Crime": 0.8467101454734802,
    "Culture": 0.8393734693527222,
    "Technology": 0.8338738083839417,
    "Military": 0.8289996981620789,
    "Economy": 0.7992438673973083,
    "Environment": 0.7819806337356567,
    "Diplomacy": 0.761262059211731,
    "Education": 0.7250345349311829,
    "Transport": 0.7200486660003662,
    "Elections": 0.6888770461082458,
    "Energy": 0.6824785470962524
  },
  "sentiment": {
    "positive": 0.097,
    "negative": 0.903,
    "neutral": 0.0
  }
}