{
  "title": "Russia 'fooling Ukrainian children into becoming suicide bombers for money' as desperate Putin turns to sick tactic",
  "published_date": null,
  "url": "https://www.thesun.ie/news/15143126/russia-ukrainian-children-suicide-bombers/",
  "original_language": "en",
  "cleaned_sentences": [
    "VLADIMIR Putin has been accused of recruiting Ukrainian children and brainwashing them into becoming suicide bombers.",
    "The desperate Russian despot has been offering teenagers and vulnerable civilians cash in exchange for their lives, according to Ukrainian security services.",
    "Back in March, a 15-year-old and a 17-year-old were recruited by Putin's henchmen and given orders to construct and carry a bag of explosives through a Ukrainian city, reports New Lines Magazine.",
    "The teens were walking through the city of Ivano-Frankivsk when the improvised explosives they were carrying suddenly exploded.",
    "The 17-year-old was instantly killed in the blast.",
    "His younger friend was left hospitalised with life changing injuries.",
    "read more in Ukraine war Ukrainian officials later claimed the device they had been carrying - given to them by Russian handlers - had been remotely detonated.",
    "Both had been offered \"easy money\", Ukraine said.",
    "A similar tragedy saw a group of Ukrainian soldiers targeted by a hired mum-of-one.",
    "In February, an innocent looking woman walked up to a group of men who were outside a cafe in Mykolaiv.",
    "Most read in The Sun She placed her bag next to the crowd and within seconds it exploded.",
    "It was remotely detonated and killed the 42-year-old and three of the soldiers who were all members of Ukraine’s demining corps, Kyiv announced.",
    "Russian media tried to claim the mum had acted out of vengeance after her young son was killed in the horrors of war.",
    "But she had actually been allegedly recruited by Russia through Telegram.",
    "A Russian intelligence agent had given her the bag and said it contained a large amount of money which needed to be delivered to the men, the magazine reports says.",
    "The woman had no idea she was set up to be a suicide bomber, it added.",
    "There are no limits to what the Russians will do now Ed Bogan The bomb had reportedly even been prepared by a group of teenagers aged between 14 and 17 from Poltava Oblast.",
    "A Ukrainian intelligence officer told New Lines that he believes Moscow deliberately entices in young people as they are easier to brainwash.",
    "They said: “Teenagers and young people are easier to recruit for such actions, when you characterise what they’re being asked to do as some sort of game.",
    "“The Russian intelligence services consider such people ‘one-time’ assets and have never been worried about them.” These attacks are just the latest in a slew of examples showing how Russia has become increasingly more desperate in their gruelling war.",
    "Ed Bogan, a former CIA officer, blasted Putin's new warfare ploys and even compared them to other prolific terror groups.",
    "He said: \"It’s al Qaeda and ISIS-level tactics.",
    "\"There are no limits to what the Russians will do now.\"",
    "Russian hybrid warfare expert Liubov Tsybulska labelled it an \"incredibly sinister and insidious tactic.\"",
    "He also agreed with Mr Bogan.",
    "“It’s similar to tactics used by al Qaeda or Islamic State, except the people Russia recruits don’t know they’re going to blow themselves up,\" Tsybulska said.",
    "\"And they are happy to use the most vulnerable people - women or children - in such attacks.",
    "They really don’t care.” A nationwide campaign has even been launched by the Security Service of Ukraine to warn school children of the lurking threat of Russian recruitment online.",
    "The kids are being urged to report any suspicious activity on social media straight away to the authorities so they can investigate properly.",
    "Another one of Russia's deadly tactics is their incessant use of air attacks on innocent Ukrainians.",
    "Two people were killed and at least 15 more were injured in overnight strikes by Putin.",
    "They are happy to use the most vulnerable people - women or children - in such attacks.",
    "They really don’t care Liubov Tsybulska Ukraine's air force said that mad Vlad launched at least five ballistic missiles and 170 drones.",
    "One of the most devastating was a drone strike on Odesa - just hours after the US and Ukraine signed a landmark mineral deal.",
    "The long-awaited deal comes two months after a historic bust-up between Don and his Ukrainian counterpart which shocked the world.",
    "For Kyiv, the deal is central to binding it to Washington's might and preventing any more Russian invasions after a peace deal.",
    "Trump has vowed he wants peace in Ukraine, but has said that the US must be repaid for all the military support it has given the country.",
    "The deal will provide Washington privileged access to new investment projects to develop Ukraine's natural resources, including aluminium, graphite, oil and natural gas.",
    "It also means America will continue to back Ukraine in the war.",
    "US-Ukraine minerals deal explained By Sayan Bose, Foreign News Reporter The minerals deal sets out the creation of a joint US-Ukrainian fund for reconstruction, which will receive 50 per cent of profits and royalties accruing to the Ukrainian state from new natural resources permits in Ukraine.",
    "The deal does not spell out how the joint fund's revenues will be spent, who benefits or who controls decisions about the spending.",
    "Now that the deal has been closed, the two sides will agree on two further technical and supplementary documents outlining issues such as how the funds are accumulated.",
    "Ukraine would retain control of all its resources in the deal, while the fund will invest in the development of Ukraine for 10 years, according to the country's prime minister Denys Shmyhal.",
    "The US could use its future military assistance to Ukraine as its contribution to the fund, Shmyhal said, with no previous military aid to the country reflected in the deal.",
    "\"Ukraine will only make a contribution from new licenses, from new royalties on mineral resources.",
    "This will be our contribution, 50% of which will be given to this fund,\" he added.",
    "A draft of the main minerals agreement showed that Ukraine had secured the removal of any requirement for it to pay back the US for past military assistance, something Ukraine had staunchly opposed.",
    "Washington has been Ukraine's single largest military donor since Russia's 2022 invasion, with aid of more than 64 billion euros ($72 billion), according to the Kiel Institute in Germany."
  ],
  "topics": {
    "Conflict": 0.8081953525543213,
    "Diplomacy": 0.7967854738235474,
    "Politics": 0.7008574604988098,
    "Military": 0.6701668500900269,
    "Transport": 0.6641219258308411,
    "Energy": 0.664107084274292,
    "Culture": 0.6609001755714417,
    "Technology": 0.6584406495094299,
    "Economy": 0.6560617685317993,
    "Education": 0.5844698548316956,
    "Environment": 0.5803917050361633,
    "Health": 0.5607268214225769,
    "Crime": 0.5215929746627808,
    "Elections": 0.49988991022109985
  },
  "sentiment": {
    "positive": 0.271,
    "negative": 0.729,
    "neutral": 0.0
  }
}