{
  "title": "Cannibal serial killer who ate his victims pardoned and freed from jail",
  "published_date": null,
  "url": "https://www.irishmirror.ie/news/world-news/cannibal-serial-killer-who-ate-35213278",
  "original_language": "en",
  "cleaned_sentences": [
    "A serial killer, who turned cannibal and was injured while fighting for Russia in the Ukraine war, has been granted a presidential pardon in exchange for his military service.",
    "However, it's believed he'll be looking over his shoulder for the rest of his life as the families of his victims now have an opportunity for revenge.",
    "Denis Gorin, 45, hailing from the town of Aniva in Russia's Sakhalin region, was sentenced to 22 years in a penal colony in 2018.",
    "This sentence was handed down after Gorin stabbed a man to death and then consumed some of his victim's flesh.",
    "In early 2023, while still in the penal colony, Gorin signed up with a private military company (PMC) and was deployed to Ukraine to participate in Russia's invasion of the country.",
    "Gorin served in the ranks of Storm-Z and was injured during a battle.",
    "Following this, President Putin pardoned him, allowing Gorin to return as a free man to his hometown.",
    "This move sparked widespread outrage across Russia and ignited a heated debate about the morality of authorities pardoning criminals for their participation in the war, reports the Mirror US.",
    "By all accounts, Gorin started his life on the right track and was well-regarded by locals who knew him growing up.",
    "He wasn't known to engage in any criminal activities or aggressive behaviour and appeared to be a trusted member of the community.",
    "However, after finishing high school, he got married and had two children, which he found difficult to provide for.",
    "Financial difficulties began to plague the family due to Gorin's lack of further education.",
    "In the early 2000s, Gorin turned to alcohol and ended up living on the streets.",
    "In late 2002, at the age of 23, he committed his first known murder.",
    "The victim was someone he knew, and Gorin was arrested shortly afterwards and charged with murder and desecration of a corpse.",
    "During his trial, Gorin revealed that after killing the victim, he removed and consumed the soft tissues from the body, claiming he did so under threat from his brother Yevgeny.",
    "As reported by the New York Post, Yevgeny, who was an accomplice, allegedly threatened to kill him if he didn't eat part of the victim.",
    "On March 6, 2003, Gorin was handed a sentence of nine years and 11 months in a strict regime colony, serving his time at an undisclosed location in the Irkutsk Oblast.",
    "After seven years, he was released on parole on April 19, 2010, and returned to Aniva, where he continued his life on the streets for the next few years.",
    "During this time, Gorin was jobless, making money through odd jobs and theft, spending most of his time among other homeless people and alcoholics.",
    "It is reported that Denis then acted with the help of his brother Yevgeny, committing several more murders in his hometown.",
    "In June 2011, the Gorin brothers were incensed upon discovering that their nephew had been mistreated by an acquaintance.",
    "They stormed the apartment to confront the man, who was absent.",
    "Instead, they brutally assaulted a young man, unconnected to their nephew's incident, until he lost consciousness.",
    "Seizing the opportunity, Denis slit the victim's throat.",
    "The brothers then transported the body to the Lyutoga River bank, where it was buried in a shallow grave.",
    "The victim's remains stayed concealed until they were unearthed in spring 2012.",
    "The brothers' next act of murder occurred on the night of 14–15 January 2012.",
    "During a visit to a local store, they clashed with an acquaintance, whom Denis proceeded to stab approximately 30 times with a knife.",
    "The man later succumbed to his injuries.",
    "On the same day, the murderer was apprehended by the police and promptly confessed.",
    "On 27 February 2013, he was found guilty of both murders and sentenced to 20 years and 10 months in prison.",
    "His brother Evgeniy didn't live to witness the trial; he died under mysterious circumstances while detained at a temporary detention centre in Aniva in mid-2012.",
    "Following his trial, Gorin was moved to a penal colony.",
    "However, in June 2017, he reached out to the Sakhalin Oblast Prosecutor's Office and confessed to an unsolved murder, leading to his return to Aniva for testimony.",
    "According to Gorin, this additional killing took place on 21 November 2010, with the victim being another acquaintance named Alexander.",
    "This confession brought Gorin's murder count to four, solidifying his status as a serial killer.",
    "Denis, Alexander's brother, had been held at a temporary detention centre from 25 February to 6 March 2003, a period during which Gorin was also present.",
    "While sharing drinks, Gorin recounted a story that amused him about a time when he and Denis were both in the detention centre.",
    "Alexander, who was drunk, had attempted to deliver a parcel to his brother but was arrested for disorderly conduct due to his visible intoxication.",
    "The story seemed to irritate Alexander, leading to a heated argument and subsequent separation.",
    "Later that same night, after attending his ex-wife's birthday party, a drunken Gorin decided to visit Alexander's house to settle their earlier disagreement.",
    "Instead of resolving their issues, they continued to argue, culminating in Gorin grabbing a knife and stabbing Alexander twice in the chest.",
    "After Alexander's death, Gorin gruesomely cut off pieces of the man's biceps, calves, and thighs, which he chillingly proceeded to eat.",
    "He then dragged the lifeless body to the old familiar Lyutoga River, where he undressed it, picked it up, and hauled it into the water.",
    "Gorin pulled the body a significant distance from the shore before discarding it.",
    "He then returned to his ex-wife's birthday party, as if nothing had happened.",
    "Despite leaving for approximately 35–40 minutes, apparently nobody had noticed Gorin's absence during this time.",
    "When quizzed about why he ate parts of his victim's remains, Gorin simply explained that he had developed a taste for human flesh after committing his first murder back in 2002.",
    "In the months following, however, he recanted his testimony and claimed that the police had tortured him into confessing.",
    "Despite his claims, the overwhelming amount of evidence proved that he had indeed committed the murder, and on June 27, 2018, Gorin was handed a 22-year prison sentence.",
    "He managed to avoid receiving life imprisonment due to his initial confession and cooperation with law enforcement, before he was even given time served by the district court.",
    "With these factors taken into account, he was scheduled for release in 2032.",
    "The actual number of victims a cannibal has claimed remains hotly contested, with some neighbours buzzing that he boasted about killing upwards of 13 people.",
    "The man's wartime exploits add further murkiness to the tally.",
    "\"Dmitri,\" a neighbour, chillingly recounted how, upon his 2012 arrest, cops flung open a fridge to discover stacks of human flesh, prepped for consumption.",
    "\"Dmitri\" spilled more beans: the two brothers once tried offing another local in boozy violence, and Denis had hauled him to a hole purportedly crammed with 12 corpses' remnants.",
    "The neighbour reckoned this pit held a clutch of skeletons including what looked like a little girl's.",
    "The bobbies have kept mum, leaving everyone guessing if they dug deeper into these sinister tales.",
    "Hence, Gorin's kill count might be vastly underrated.",
    "\"The other murders could not be proved in court,\" Dmitri weighed in.",
    "\"They considered only those killings to which Gorin and his brother had confessed themselves.\"",
    "But Dmitri ominously forecasted a grizzly fate for Gorin.",
    "\"The victims have many relatives in Aniva and in South-Sakhalinsk.",
    "Something tells me that Gorin won't be walking free for long,\" a neighbour remarked.",
    "\"If the authorities cannot guarantee a punishment, family members will take matters into their own hands.",
    "What else is there to do?"
  ],
  "topics": {
    "Environment": 0.9703128337860107,
    "Conflict": 0.9608088135719299,
    "Energy": 0.9555169343948364,
    "Crime": 0.9516836404800415,
    "Economy": 0.9306955337524414,
    "Culture": 0.9220643043518066,
    "Diplomacy": 0.9220075011253357,
    "Education": 0.9178118109703064,
    "Health": 0.909980833530426,
    "Transport": 0.9062605500221252,
    "Military": 0.8864649534225464,
    "Elections": 0.8817282915115356,
    "Technology": 0.8600049018859863,
    "Politics": 0.8597043752670288
  },
  "sentiment": {
    "positive": 0.194,
    "negative": 0.806,
    "neutral": 0.0
  }
}