{
  "title": "Putin’s plan to outlast Ukraine and the US",
  "published_date": null,
  "url": "https://www.livemint.com/opinion/russia-ukraine-peace-talks-vladimir-putin-ukraine-war-volodymyr-zelensky-peace-offer-donald-trump-ukraine-policy-11747639763086.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Putin’s plan to outlast Ukraine and the US Summary Russia’s leader ‘blossoms whenever he talks about war’ and hopes Trump will give up on a peace deal.After all the speculation about how Russian President Vladimir Putin would respond to Ukrainian President Volodymyr Zelensky’s offer to meet for peace talks in Istanbul, it isn’t surprising that Mr. Putin declined.",
    "Instead he sent a low-level delegation, headed by the ultraconservative former culture minister Vladimir Medinsky.",
    "Having repeatedly declared Mr. Zelensky’s government illegitimate, Mr. Putin would have made a huge concession—and appeared weak—if he had met with Mr. Zelensky.",
    "More important, a meeting between the two, which President Trump had suggested he might attend as well, wouldn’t have achieved much.",
    "Mr. Putin relishes being a wartime leader and is determined to continue the conflict until Ukraine is coerced into becoming a “friendly\" neighbor.",
    "In keeping with Mr. Trump’s stance that Russia isn’t the aggressor in the Ukraine war, a White House proposal to end the conflict, crafted last month, made major concessions to the Kremlin, legitimizing Russia’s occupation of Crimea and granting Russia all the territory it has gained since the war began.",
    "The plan also proposed a gradual lifting of the economic sanctions against Russia that were imposed in 2014, as well as a promise that Ukraine won’t join the North Atlantic Treaty Organization.",
    "When Mr. Zelensky rejected the deal, Mr. Trump accused him of being “inflammatory\" and suggested that he—not Mr. Putin—was the problem.",
    "Mr. Trump began to change his tune after Russia’s deadly April 24 missile and drone attack on Kyiv, saying the strikes were unnecessary and “very bad timing.\"",
    "Then, following a meeting with Mr. Zelensky before the funeral of Pope Francis, Mr. Trump questioned Mr. Putin’s interest in a peace deal and raised the possibility of new sanctions against Russia.",
    "He also said Russia had stolen Crimea from Ukraine.",
    "The sudden signing of an economic partnership agreement between the U.S. and Ukraine, announced April 30, further suggested that Mr. Trump was shifting to a more favorable stance toward Ukraine as he grew frustrated with Russia’s response to peace proposals.",
    "Meanwhile, top officials in Mr. Putin’s government began talking tough.",
    "On April 24 the head of Russia’s security council, former Defense Minister Sergei Shoigu, addressed proposals for a Western peacekeeping contingent in Ukraine to monitor compliance with a future cease-fire.",
    "Stating that Russia had invaded Ukraine because of the threat of NATO military deployment in Russia’s “historical territory\" inside Ukraine, Mr. Shoigu said that the introduction of foreign troops in Ukraine could lead to a direct military conflict between Russia and NATO countries.",
    "In an interview with the Russian news agency TASS on April 29, Mr. Shoigu’s predecessor and Putin ally Nikolai Patrushev, now an adviser to the Russian president, claimed that NATO was conducting naval exercises with nuclear-armed submarines and working out scenarios for a “nuclear apocalypse\" with strikes on Russian bases that house nuclear weapons.",
    "In an April 28 interview Foreign Minister Sergei Lavrov laid out Russia’s maximalist demands for peace negotiations that went well beyond those in the Trump proposal.",
    "Against this backdrop Mr. Putin made an offer for Ukrainian and Russian negotiators to meet directly in Istanbul, without accepting a proposal for a 30-day truce supported by Ukraine, the U.S. and the European members of NATO as a precondition for further peace talks.",
    "Mr. Trump jumped on Mr. Putin’s proposal, leaving the Europeans and Ukrainians at a loss.",
    "Mr. Zelensky took a gamble and not only agreed but said he would attend, putting Mr. Putin in a difficult position.",
    "The day before the talks began, Mr. Putin and his top security and defense team met with Mr. Medinsky to prepare for the negotiations.",
    "If these men were concerned that Mr. Putin’s absence would reinforce Mr. Trump’s doubts about their leader’s intentions for peace, they were probably reassured by Mr. Trump’s subsequent statement: “Nothing’s going to happen until Putin and I get together\"—suggesting that the two can still reach a peace deal without including Mr. Zelensky.",
    "Mr. Trump apparently doesn’t understand that Mr. Putin isn’t ready to end hostilities.",
    "He said on Fox News Friday that “Putin is tired of the war.\"",
    "But, as Russian commentator Maksim Katz pointed out on May 13, Mr. Putin seems to enjoy the conflict: “Putin blossoms whenever he talks about war.",
    "Instead of an aging dictator, he appears as a military leader, a character in some exciting movie that is playing in real time 3D right around him.\"",
    "Having rallied his people to support a patriotic struggle against Western enemies and fueled Russia’s economic growth with massive military spending, Mr. Putin wants Mr. Trump to cut off arms deliveries and crucial intelligence to Ukraine so that Russian troops can move beyond their snail’s-pace offensive and gain substantial swaths of Ukrainian territory.",
    "With this goal in mind, Mr. Putin is going along with the negotiations in the hope that Mr. Trump eventually will give up on a peace settlement and walk away from the conflict altogether.",
    "As expected, Friday’s talks between Russian and Ukrainian delegations failed to make progress because the Russians put forth their usual maximalist demands.",
    "The next day Mr. Trump announced that he will be talking by phone with Mr. Putin on Monday, and plans to call Mr. Zelensky after.",
    "Mr. Trump should make clear to Mr. Putin that if Russia doesn’t agree to a 30-day cease-fire and back off from its demands, the U.S. will keep providing Ukraine with the military aid necessary to defend itself against Russian aggression.",
    "Ms. Knight is author, most recently, of “The Kremlin’s Noose: Putin’s Bitter Feud With the Oligarch Who Made Him Ruler of Russia.\""
  ],
  "topics": {
    "Environment": 0.9773524403572083,
    "Conflict": 0.9765580296516418,
    "Military": 0.9711481332778931,
    "Culture": 0.9705552458763123,
    "Education": 0.9673610925674438,
    "Transport": 0.966728687286377,
    "Politics": 0.9639947414398193,
    "Crime": 0.9618175625801086,
    "Diplomacy": 0.9611085653305054,
    "Energy": 0.959780752658844,
    "Economy": 0.9584082961082458,
    "Health": 0.9571407437324524,
    "Technology": 0.9316495656967163,
    "Elections": 0.923902153968811
  },
  "sentiment": {
    "positive": 0.406,
    "negative": 0.594,
    "neutral": 0.0
  }
}