{
  "title": "Turkey to Hold Talks with Russia, Ukraine Teams on Friday: Sources",
  "published_date": null,
  "url": "https://www.deccanchronicle.com/world/turkey-to-hold-talks-with-russia-ukraine-teams-on-friday-sources-1879178",
  "original_language": "en",
  "cleaned_sentences": [
    "Turkey to Hold Talks with Russia, Ukraine Teams on Friday: Sources The meeting between Foreign Minister Hakan Fidan and the delegation headed by Vladimir Medinsky at Istanbul's Dolmabahce Palace finished late on Thursday, the source added.",
    "Istanbul: Talks in Istanbul between Turkey's top diplomat and a Russian delegation have ended with the two sides set to meet again Friday with the Ukrainians, a foreign ministry source said.",
    "The meeting between Foreign Minister Hakan Fidan and the delegation headed by Vladimir Medinsky at Istanbul's Dolmabahce Palace finished late on Thursday, the source added.",
    "\"The meeting has ended.",
    "Tomorrow there will be more talks in different formats,\" he said, indicating that \"trilateral talks between Russia, Ukraine and Turkey are on the agenda\".",
    "There would also be a round of US, Ukrainian and Turkish talks.",
    "\"It has not been finalised whether there will be a quadrilateral format,\" grouping officials from all four countries, he added.",
    "Russia and Ukraine had been expected to meet Thursday in Istanbul for their first direct peace talks in more than three years.",
    "But as the day wore on without any concrete indications of timings, it remained unclear when the sides would meet, with US Secretary of State Marco Rubio suggesting the meetings would happen on Friday.",
    "Speaking to reporters on the sidelines of a NATO summit in the southern coastal city of Antalya, Rubio said he would meet Ukraine's top diplomat, Andriy Sybiga in Istanbul on Friday.",
    "And he said a lower-level US official would meet with the Russian delegation.",
    "\"I want to be frank... we don't have high expectations of what will happen tomorrow,\" Rubio told reporters, saying he hoped Turkey would work to bring the two delegations together.",
    "Ukrainian President Volodymyr Zelensky, who had flown to Turkey in the hope of meeting a top-level Russian delegation in Istanbul, instead stayed in Ankara where he held talks with Turkey's Recep Tayyip Erdogan.",
    "With Russia showing up with a relatively low-level team, Zelensky then decided to send his defence minister, Rustem Umerov, to lead the Ukrainian delegation.",
    "Medinsky, who heads the Russian team, is a hawkish adviser to Russian President Vladimir Putin who has questioned Ukraine's right to exist and led failed talks in 2022 at the start of the war.",
    "( Source : AFP ) Next Story"
  ],
  "topics": {
    "Conflict": 0.8753097057342529,
    "Politics": 0.8722782731056213,
    "Diplomacy": 0.8264076113700867,
    "Military": 0.701612114906311,
    "Technology": 0.6617594361305237,
    "Culture": 0.636896014213562,
    "Health": 0.5273762941360474,
    "Energy": 0.48918959498405457,
    "Crime": 0.4874797463417053,
    "Transport": 0.4833361506462097,
    "Economy": 0.46167823672294617,
    "Elections": 0.3819364905357361,
    "Education": 0.3738287389278412,
    "Environment": 0.3321724236011505
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}