{
  "title": "Russia, Ukraine Agree On 1000-For-1000 POW Exchange As Peace Talks Move Ahead In Istanbul",
  "published_date": null,
  "url": "https://www.news18.com/world/russia-ukraine-officials-meet-in-istanbul-for-first-direct-peace-talks-in-3-years-9340150.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia, Ukraine Agree On 1000-For-1000 POW Exchange As Peace Talks Move Ahead In Istanbul The officials present sat around a U-shaped table, with the Russians and Ukrainians facing each other.",
    "As delegations from Russia and Ukraine met on Friday in Istanbul for their first direct peace talks in three years, both the countries agreed to exchange 1,000 prisoners of war each.",
    "Notably, the exchange would be their biggest prisoners of war swap since the start of the war in 2022.",
    "After the peace talks were held, the head of Russia’s delegation Vladimir Medinsky said that Moscow and Kyiv agreed to provide each other with detailed proposals for a ceasefire.",
    "Recommended Stories Meanwhile, Ukraine requested a meeting between heads of state, and Russia will take it under consideration, he said, adding that Russia is ready to continue talks.",
    "The development came after delegations from Russia and Ukraine both met in Istanbul for their direct peace talks, first since the onset of the deadly aggression between the two countries.",
    "A Ukrainian delegation was led by Defence Minister Rustem Umerov while the Russian team was headed by President Vladimir Putin’s aide, Vladimir Medinsky.",
    "The officials present sat around a U-shaped table, with the Russians and Ukrainians facing each other.",
    "Putin Rejects Zelenskyy’s Challenge, Remains Absent The push to end the Russia-Ukraine war got off to a rocky start on Thursday after Putin spurned an offer by Ukrainian President Volodymyr Zelenskyy to have a face-to-face meeting.",
    "Notably, Zelenskyy had stated that he would be a part of the meeting only if the Russian President attended it.",
    "After Putin didn’t take up Zelenskyy’s challenge to sit down with him in the Turkish capital on Thursday, the Ukrainian president accused Moscow of not making a serious effort to end the war by sending a “low-level negotiating team\" that he described as “a theatre prop\".",
    "Following Putin’s absence, Zelenskyy stated that he was sending a team headed by his Defense Minister to Friday’s meeting in Istanbul.",
    "“That would show Trump that Ukraine is determined to press ahead with peace efforts despite Russian foot-dragging,\" Zelenskyy said, amid intense diplomatic maneuvering by Kyiv and Moscow.",
    "Meanwhile, Zelenskyy flew to Albania to attend a meeting on Friday of the leaders of 47 European countries to discuss security, defense and democratic standards against the backdrop of the war.",
    "Trump Likely To Meet Putin While the two sides are far apart in their conditions for ending the war, US President Donald Trump on Thursday stated that a meeting between himself and Putin was crucial to breaking the deadlock.",
    "On Friday, Trump said a meeting with Putin would happen “as soon as we can set it up.\"",
    "“I think it’s time for us to just do it,\" Trump was quoted as saying in Abu Dhabi.",
    "- Location : - First Published:"
  ],
  "topics": {
    "Politics": 0.8965819478034973,
    "Diplomacy": 0.8883391618728638,
    "Conflict": 0.883639931678772,
    "Culture": 0.7754306197166443,
    "Military": 0.7123436331748962,
    "Technology": 0.6481746435165405,
    "Health": 0.5952951908111572,
    "Transport": 0.5891701579093933,
    "Environment": 0.5622190237045288,
    "Economy": 0.495970755815506,
    "Crime": 0.45807981491088867,
    "Elections": 0.42886999249458313,
    "Energy": 0.40524670481681824,
    "Education": 0.31751033663749695
  },
  "sentiment": {
    "positive": 0.556,
    "negative": 0.444,
    "neutral": 0.0
  }
}