{
  "title": "Russia Launches War's Largest Drone Attack On Ukraine Ahead Of Putin-Trump Call",
  "published_date": null,
  "url": "https://www.news18.com/world/russia-launches-wars-largest-drone-attack-ahead-of-putin-trump-call-ws-l-9342517.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia Launches War's Largest Drone Attack On Ukraine Ahead Of Putin-Trump Call Ukraine's intelligence service said it also believed Moscow intended to fire an intercontinental ballistic missile later on Sunday as an attempt to intimidate the West Russia launched on Sunday its largest drone attack on Ukraine since the start of the war, destroying homes and killing at least one woman a day before U.S. President Donald Trump is due to discuss a proposed ceasefire with Russia’s Vladimir Putin.",
    "Ukraine’s intelligence service said it also believed Moscow intended to fire an intercontinental ballistic missile later on Sunday as an attempt to intimidate the West.",
    "There was no immediate response from Moscow to the accusation.",
    "Recommended Stories President Volodymyr Zelenskiy, straining to restore ties with Washington after a disastrous February White House visit, met Vice President JD Vance and Secretary of State Marco Rubio in Rome on Sunday on the sidelines of Pope Leo’s inauguration.",
    "Zelenskiy said the meeting was “good\" and released pictures of Ukrainian and U.S. officials sitting outside at a round table and smiling.",
    "Ukrainian media said the meeting lasted 40 minutes.",
    "“I reaffirmed that Ukraine is ready to be engaged in real diplomacy and underscored the importance of a full and unconditional ceasefire as soon as possible,\" said Zelenskiy, who also met the new pope.",
    "Ukraine and Russia held their first face-to-face talks in more than three years on Friday, under pressure from Trump to agree to a ceasefire in a war he has pledged to bring to a quick end.",
    "The foes agreed to swap 1,000 prisoners each but failed to agree a truce, after Moscow presented conditions that a member of Ukraine’s delegation called “non-starters\".",
    "The leaders of Britain, France, Germany and Poland planned to speak to Trump before the U.S. and Russian presidents speak on Monday, German Chancellor Friedrich Merz said.",
    "The four European leaders jointly visited Kyiv last week and have been calling for Trump to back new sanctions on Russia.",
    "Asked if it was time to impose tougher sanctions on Russia, U.S. Treasury Secretary Scott Bessent said that was up to Trump.",
    "“I think we will see what happens when both sides get to the table,\" he told NBC News’ “Meet the Press\" programme.",
    "“President Trump has made it very clear, that if President Putin does not negotiate in good faith, that the United States will not hesitate to up the Russia sanctions along with our European partners.\"",
    "After a night of air alerts, Ukraine’s air force said that as of 8 a.m. on Sunday Russia had launched 273 drones at Ukrainian cities, more than the previous record Moscow had set in February on the war’s third anniversary.",
    "‘I COULD HEAR THE DRONE’ In the ruins of her family home in the Obukhiv region west of Kyiv, Natalia Piven, 44, recounted how she squeezed into a cellar with her son after an air raid warning, just in time to survive a first wave of drones.",
    "They then ran out to a bomb shelter at a kindergarten, before another wave of drones bore down on the village.",
    "Their house was completely destroyed.",
    "A 28-year-old woman who lived next door was killed.",
    "Ukrainian authorities said three other people were injured, including a four-year-old child.",
    "“I cannot get over it.",
    "I could clearly hear the drone flying right towards my house,\" Piven told Reuters.",
    "Trump has shifted U.S. rhetoric from supporting Ukraine towards accepting some of Moscow’s narrative about the war that Putin launched in 2022.",
    "But Kyiv and its European allies are working hard to persuade Trump that it is Moscow that is holding up a truce now.",
    "Zelenskyy has said he would accept Trump’s proposal for an immediate ceasefire of at least 30 days with no conditions.",
    "Moscow says it would consider a ceasefire but only if conditions are met, including a halt in arms supplies to Kyiv.",
    "It also says any peace talks must address the “root causes\" of the conflict, including its demands that Ukraine cede territory, be disarmed and accept neutral status.",
    "Kyiv says that would amount to capitulation and leave it defenceless.",
    "(This story has not been edited by News18 staff and is published from a syndicated news agency feed - Reuters)- Location : - First Published:"
  ],
  "topics": {
    "Conflict": 0.9094077944755554,
    "Diplomacy": 0.8970820307731628,
    "Economy": 0.8817064762115479,
    "Health": 0.8613395690917969,
    "Transport": 0.851434051990509,
    "Politics": 0.8495475649833679,
    "Elections": 0.847355306148529,
    "Technology": 0.8350332975387573,
    "Military": 0.8270288705825806,
    "Culture": 0.8196810483932495,
    "Energy": 0.8183529376983643,
    "Education": 0.8114103674888611,
    "Environment": 0.8027521967887878,
    "Crime": 0.7631367444992065
  },
  "sentiment": {
    "positive": 0.379,
    "negative": 0.621,
    "neutral": 0.0
  }
}