{
  "title": "Zelenskyy Names Delegation for Russia-Ukraine Talks at Istanbul",
  "published_date": null,
  "url": "https://www.deccanchronicle.com/world/zelenskyy-names-delegation-for-russia-ukraine-talks-at-istanbul-1879179",
  "original_language": "en",
  "cleaned_sentences": [
    "Zelenskyy Names Delegation for Russia-Ukraine Talks at Istanbul The Istanbul delegation will be led by Defence Minister Rustem Umerov and will include military and intelligence officials Kyiv: Ukrainian President Volodymyr Zelenskyy on Thursday announced that a Ukrainian delegation will participate in talks with Russia in Istanbul, with the primary goal of achieving a ceasefire.",
    "The Istanbul delegation will be led by Defence Minister Rustem Umerov and will include military and intelligence officials.",
    "Talks between Ukrainian and Russian diplomats are scheduled to take place in Istanbul today, according to a Turkish Foreign Ministry source quoted by the Cerman news agency dpa, as reported by DW News.",
    "In a post on X, Zelenskyy wrote, \"I want to sincerely thank President @RTErdogan, his team, and the people of Turkiye for their support of Ukraine's territorial integrity and sovereignty.",
    "President Erdogan reaffirmed during our meeting today that he supports Ukraine and recognises Crimea as part of Ukraine.",
    "We demonstrated the strength and seriousness of our delegation, which includes: the Minister of Foreign Affairs, the Head of the Office of the President, the Minister of Defence, the Chief of the General Staff, the Head of the Security Service of Ukraine, and representatives all our intelligence agencies.\"",
    "\"I want to emphasise that Turkiye has welcomed us with a delegation of equal standing -- at the highest level.",
    "Unfortunately, after learning the composition of the Russian delegation, it became clear that they are not approaching real talks seriously,\" the post added.",
    "Despite expressing doubts about Russia's commitment to negotiations, Zelenskyy emphasised that Ukraine is proceeding with the talks out of respect for Turkish President Recep Tayyip Erdogan and US President Donald Trump.",
    "Zelenskyy said, \"Nevertheless, despite the extremely low level of the Russian delegation, out of respect--for President Trump, for the high-level delegations present in Turkiye, and for President Erdogan, and out of a sincere desire to take at least the first steps toward de-escalation and ending the war, beginning with a ceasefire.",
    "I have decided to send a Ukrainian delegation to Istanbul.",
    "Not all members of our delegation will go the Head of the Security Service and the Chief of the General Staff will not attend.",
    "However, the Ukrainian delegation in Istanbul will be led by the Minister of Defence, Rustem Umerov.",
    "He will be Joined by military professionals and intelligence officers.\"",
    "Zelenskyy further said that Russia is not taking the talks seriously and \"does not genuinely want to end the war.\"",
    "\"As for the agenda, the mandate for our delegation is clear ceasefire is priority number one.",
    "I remain convinced that Russia is not serious about these meetings and does not genuinely want to end the war.",
    "But we'll see if they are willing to show at least something during the discussions,\" Zelenskyy said.",
    "( Source : ANI ) Next Story"
  ],
  "topics": {
    "Conflict": 0.971269428730011,
    "Military": 0.9504079818725586,
    "Politics": 0.9408974647521973,
    "Diplomacy": 0.9139088988304138,
    "Culture": 0.8874579668045044,
    "Energy": 0.8204992413520813,
    "Technology": 0.8148202300071716,
    "Economy": 0.7577120661735535,
    "Health": 0.7552438974380493,
    "Transport": 0.7268598079681396,
    "Education": 0.696830153465271,
    "Crime": 0.6601921916007996,
    "Environment": 0.6586880683898926,
    "Elections": 0.6290082335472107
  },
  "sentiment": {
    "positive": 0.579,
    "negative": 0.421,
    "neutral": 0.0
  }
}