{
  "title": "Russia and Ukraine hold first direct talks in 3 years, agree on prisoner swap, but no truce",
  "published_date": null,
  "url": "https://www.firstpost.com/world/russia-and-ukraine-hold-first-direct-talks-in-3-years-agree-on-prisoner-swap-but-no-truce-13889165.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine agreed a large-scale prisoner exchange, said they would trade ideas on a possible ceasefire and discussed a potential meeting between Volodymyr Zelenskyy and Vladimir Putin in their first direct talks in over three years on Friday.",
    "But coming out of the highly anticipated talks in Istanbul, which lasted just over 90 minutes, there were few signs of more significant progress toward ending the three-year war.",
    "Kyiv was seeking an “unconditional ceasefire” to pause a conflict that has destroyed large swathes of Ukraine and displaced millions of people.",
    "Moscow has consistently rebuffed those calls, and the only concrete agreement appeared to be a deal to exchange 1,000 prisoners each.",
    "The two sides said they would “present their vision of a possible future ceasefire”, according to Russia’s top negotiator, Vladimir Medinsky.",
    "They did not agree any suspension to the fighting.",
    "Russia said it had also taken note of Ukraine’s request for a meeting of Presidents Vladimir Putin and Zelenskyy.",
    "“Overall, we are satisfied with the results and ready to continue contacts,” Medinsky said.",
    "Ukraine’s top negotiator, Defence Minister Rustem Umerov, said the “next step” would be a meeting between Putin and Zelenskyy.",
    "“We understand that if we want to make progress, we need to have this meeting of leaders,” Ukrainian foreign ministry spokesman Georgiy Tykhy later said, praising the prisoner swap as a “great result”.",
    "Putin ‘afraid’ Turkish Foreign Minister Hakan Fidan, who presided over the meeting, said the sides had “agreed in principle to meet again” and would present ceasefire ideas “in writing”.",
    "Fidan sat at the head of a table in front of Turkish, Russian and Ukrainian flags at Istanbul’s Dolmabahce Palace for the talks - with Russian and Ukrainian delegations facing each other, footage from the room showed.",
    "But progress on more fundamental issues appeared minimal.",
    "Tykhy said Russia had raised a number of “unacceptable demands”, with a source telling AFP that Russia had demanded Kyiv give up more territory - a strategy it said was designed to derail the negotiations.",
    "Nevertheless, the fact the meeting took place at all was a sign of movement, with both sides having come under steady pressure from Washington to open talks.",
    "Putin declined to travel to Turkey for the meeting, sending a second-tier team instead.",
    "Zelensky said Putin was “afraid” of meeting, and criticised Russia for not taking the talks “seriously”.",
    "Speaking at a European summit in Albania, the Ukrainian leader urged a “strong reaction” from the world if the talks failed, including new sanctions.",
    "The two sides spent 24 hours slinging insults at each other before the meeting, with Zelensky accusing Moscow of sending “empty heads” to the negotiating table.",
    "Both Moscow and Washington have also talked up the need for a meeting between Putin and US President Donald Trump on the conflict.",
    "The leaders of Ukraine, France, Germany, Britain and Poland held a phone call with Trump on Friday, Zelensky’s spokesperson said, without elaborating.",
    "Trump has said “nothing’s going to happen” on the conflict until he meets Putin face-to-face.",
    "‘Unacceptable demands’ Ahead of the talks, Ukrainian officials in Istanbul held meetings with US Secretary of State Marco Rubio, Trump’s special envoy Keith Kellogg and the national security advisors of Britain, France and Germany.",
    "Rubio urged a “peaceful” end to the war and said “the killing needs to stop”, according to State Department spokeswoman Tammy Bruce.",
    "While the talks were ongoing, a Ukrainian source told AFP that Russia was advancing hardline territorial demands.",
    "Moscow claims annexation of five Ukrainian regions – four since its 2022 invasion, and Crimea, which it annexed in 2014.",
    "“Russian representatives are putting forward unacceptable demands… such as for Ukraine to withdraw forces from large parts of Ukrainian territory it controls in order for a ceasefire to begin,” the source said.",
    "They accused Moscow of seeking to “throw non-starters” so the talks end “without any results”.",
    "Another source familiar with the talks said Russia had threatened to capture Ukraine’s Sumy and Kharkiv regions.",
    "Both regions border Russia and were invaded by Moscow’s army at the start of the conflict, though Russia has not previously made formal territorial claims over them.",
    "Russia has repeatedly said it will not discuss giving up any territory that its forces occupy, and Putin last year called for Kyiv to withdraw from parts of the Donetsk, Lugansk, Kherson and Zaporizhzhia regions that it still controls."
  ],
  "topics": {
    "Conflict": 0.8532701134681702,
    "Politics": 0.8369956016540527,
    "Economy": 0.8185115456581116,
    "Energy": 0.8071407079696655,
    "Environment": 0.7872905135154724,
    "Diplomacy": 0.7553398013114929,
    "Technology": 0.7198435068130493,
    "Crime": 0.7139735817909241,
    "Transport": 0.6997172832489014,
    "Culture": 0.6737574934959412,
    "Education": 0.672747790813446,
    "Health": 0.6530647873878479,
    "Military": 0.5621891021728516,
    "Elections": 0.5198498964309692
  },
  "sentiment": {
    "positive": 0.323,
    "negative": 0.677,
    "neutral": 0.0
  }
}