{
  "title": "India asserts zero-tolerance on terrorism in Russia, UAE and Japan after Operation Sindoor",
  "published_date": null,
  "url": "https://www.firstpost.com/world/india-asserts-zero-tolerance-on-terrorism-in-russia-uae-and-japan-after-operation-sindoor-13891165.html",
  "original_language": "en",
  "cleaned_sentences": [
    "Indian parliamentary delegations on Friday conveyed New Delhi’s unwavering “zero-tolerance” policy on terrorism to senior officials in Russia, the United Arab Emirates and Japan as part of a diplomatic outreach following Operation Sindoor.",
    "The delegations engaged in detailed discussions on enhancing cooperation in counter-terrorism efforts and combating radicalism with their counterparts in the three countries.",
    "The outreach is part of a broader initiative by India to build global consensus and coordination against terrorism, particularly in the wake of its recent counter-terror operation.",
    "“#TeamIndia sends a strong and united message on combating terrorism,” External Affairs Minister S Jaishankar, who is on a three-nation tour of Europe, said in a post on X. India is sending out seven multi-party delegations to 33 global capitals to reach out to the international community on Pakistan’s designs and India’s response to terror in wake of the Pahalgam terror attack after which India launched Operation Sindoor.",
    "In Moscow, the all-party delegation led by DMK MP Kanimozhi Karunanidhi met Deputy Foreign Minister of the Russian Federation Andrey Rudenko to sensitise the Russian side about terror emanating from Pakistan, a month after the Pahalgam attack that left 26 people dead.",
    "Hon’ble MPs @KanimozhiDMK , @RajeevRai , @CaptBrijesh , @guptapc50 , @DrAshokKMittal and @ambmanjeevpuri are received by the Chair of the State Duma Committee on International Affairs H.E.",
    "Mr. Leonid Slutsky along with other Members of the State Duma.#OperationSindoor… pic.twitter.com/I447cXfB3N — India in Russia (@IndEmbMoscow) May 23, 2025 In Japan, the delegation led by JD(U) MP Sanjay Jha held a “focused and lively” press engagement held at the Indian Embassy in Tokyo where the MPs “briefed the Japanese media on India’s ‘New Normal’ against cross-border attacks, zero tolerance for terrorism, and all parties resolve to stand united in all matters of national interest,” the Embassy said in a post on X.",
    "In the United Arab Emirates (UAE), the delegation led by Shiv Sena MP Shrikant Shinde, sent a “strong message of harmony, tolerance and peaceful coexistence - the values shared & cherished by India and UAE,” the Indian Embassy in Abu Dhabi said.The delegation paid obeisance at the Sheikh Zayed Grand Mosque, BAPS Hindu Temple and Guru Nanak Darbar Gurudwara, the Embassy said in a post on X.",
    "The all party delegation met Nikolay Mladenov, Director General of Anwar Gargash Diplomatic Academy and “exchanged views on furthering India-UAE cooperation in counter-terrorism and combating radicalism.",
    "“The Indian MPs in Moscow earlier had a detailed exchange of views at a round-table meeting with all-party members of the Russian Federation Assembly (Parliament) led by the Duma (lower house) International Affairs Committee chair Leonid Slutsky of the Liberal-Democratic Party.",
    "The delegation also met with First Deputy Chair of the Committee on International Affairs Andrey Denisov and other senators in the Federation Council of the Russian Federation, said a post from the Indian Embassy in Russia.",
    "“The Russian side condemned the terrorist attack in Pahalgam and stated that Russia stands in solidarity with India for the elimination of terrorism in all its forms and manifestations!",
    "Russia and India have a shared position in the fight against terrorism.",
    "Russia India | Together in the fight against terrorism!” it added.",
    "The delegation in Tokyo also met Yasuhiro Hanashi, Acting Chairperson of the Research Committee on Counter-terrorism of the Liberal Democratic Party (LDP) and former Minister of Justice.",
    "India’s unified and determined stance against terrorism in all its forms was highlighted.",
    "Both sides reiterated their zero-tolerance approach to terrorism,” the Embassy of India in Japan said in another post on X.",
    "The delegation also held fruitful interaction with Minoru Kihara, Former Defence Minister of Japan, and Shinako Tsuchiya, Director General of the International Bureau, Liberal Democratic Party (LDP).",
    "Tensions between India and Pakistan escalated after the April 22 Pahalgam terror attack that claimed 26 lives.",
    "As part of the Operation Sindoor in response to the Pahalgam attack, India carried out precision strikes on terror infrastructure in Pakistan and Pakistan-occupied Kashmir in the early hours of May 7, following which Pakistan attempted to attack Indian military bases on May 8, 9 and 10.",
    "The Indian side responded strongly to the Pakistani actions and attacked air bases.",
    "The two countries reached an understanding to ceasefire on May 10."
  ],
  "topics": {
    "Conflict": 0.7467182874679565,
    "Energy": 0.716139554977417,
    "Diplomacy": 0.6997838020324707,
    "Politics": 0.6115419864654541,
    "Health": 0.5567337274551392,
    "Culture": 0.5506596565246582,
    "Military": 0.5127911567687988,
    "Technology": 0.5092161297798157,
    "Environment": 0.4951910674571991,
    "Economy": 0.44905877113342285,
    "Transport": 0.44063103199005127,
    "Crime": 0.3927142918109894,
    "Education": 0.2747301757335663,
    "Elections": 0.20103663206100464
  },
  "sentiment": {
    "positive": 0.818,
    "negative": 0.182,
    "neutral": 0.0
  }
}