{
  "title": "Trump to speak with Putin to end Ukraine ‘bloodbath’",
  "published_date": null,
  "url": "https://www.firstpost.com/world/trump-to-speak-with-putin-to-end-ukraine-bloodbath-13889370.html",
  "original_language": "en",
  "cleaned_sentences": [
    "US President Donald Trump said Saturday he would speak by phone with Russian President Vladimir Putin to end the “bloodbath” in Ukraine, a day after the first direct talks between Russia and Ukraine in more than three years.",
    "Trump, who has been pressing Russia to agree a 30-day unconditional ceasefire, said he would speak with him by phone on Monday.",
    "Kremlin spokesman Dmitri Peskov told the state TASS news agency the call was “being prepared”.",
    "Earlier Saturday, the Kremlin had said that a meeting between Putin and Ukrainian President Volodymyr Zelenskyy would be possible only after both sides reach an agreement.",
    "That came a day after direct talks between the two countries led to an agreement for another exchange of prisoners.",
    "Early Saturday, a Russian drone attack on a minibus carrying evacuated civilians in Ukraine’s eastern Sumy region killed nine people and wounded five, local authorities said.",
    "Zelenskyy, denouncing the attack and Russia’s refusal so far to agree a ceasefire, repeated his call for fresh sanctions against Moscow.",
    "“Without stronger sanctions, without stronger pressure on Russia, there will be no real diplomacy there,” he insisted.",
    "On Friday in Istanbul, the first direct Ukraine-Russia talks since the spring of 2022 – shortly after Moscow’s full-scale invasion that February – led to an agreement to exchange 1,000 prisoners each.",
    "Ukraine’s top negotiator, Defence Minister Rustem Umerov, said the “next step” would be a meeting between Zelenskyy and Putin.",
    "Russia said it had taken note of the request.",
    "“We consider it possible, but only as a result of the work and upon achieving certain results in the form of an agreement between the two sides,” the Kremlin’s spokesman said.",
    "Trump denounces ‘bloodbath’ Russia’s top negotiator Vladimir Medinsky said Moscow and Kyiv would “present their vision of a possible future ceasefire”, without saying when.",
    "The Kremlin said that first the POW swap had to be completed and both sides need to present their visions for a ceasefire before fixing the next round of talks.",
    "“For now, we need to do what the delegations agreed on yesterday” in Turkey, Kremlin spokesman Dmitry Peskov said, which meant “first and foremost to complete a 1,000 for 1,000 swap”.",
    "The head of Ukraine’s military intelligence, Kirillo Budanov, told broadcaster TSN he hoped the exchange would happen next week.",
    "Posting on Truth Social Saturday, Trump said he would speak to Putin on Monday to discuss finding a way out of the “BLOODBATH”.",
    "Afterwards, he added, he would speak to Zelenskyy and Nato officials, expressing hope that a “ceasefire will take place, and this very violent war… will end”.",
    "Both Moscow and Washington have already stressed the need for a meeting on the conflict between Putin and Trump.",
    "Trump has argued that “nothing’s going to happen” on the conflict until he meets Putin face-to-face.",
    "US Secretary of State Marco Rubio welcomed the latest prisoner exchange in a telephone call with Russian Foreign Minister Sergei Lavrov.",
    "And in an interview with CBS, he said Lavrov had told him Moscow was preparing a document outlining its requirements for a ceasefire.",
    "If Russia and Moscow can both provide “serious and viable” proposals “then there’s been real progress, and we can work off of that,” Rubio said.",
    "Fighting goes on The attack on the bus happened near the city of Bilopillya, local community head Yuri Zarko told Suspilne TV.",
    "A family of three were among the dead, the authorities said.Elsewhere on the frontlines, the Russian army said its troops captured Oleksandropil village in the eastern Donetsk region, site of some of the most intense fighting.",
    "As well as Sumy, Russia also pounded eastern Ukraine with missiles and drones, killing six and wounding more than a dozen, officials said.",
    "In Kherson, Russian shelling hit a truck carrying humanitarian aid Saturday morning.",
    "Zelenskyy accused Putin of being “afraid” after he declined to Travel to Turkey for talks and argued that Russia was not taking the talks seriously.",
    "“Yesterday in Istanbul, everyone saw a weak and unprepared Russian delegation with no significant powers.",
    "We need real steps to end the war,” Zelenskyy said Saturday.",
    "On Friday, Zelenskyy had called for a “strong reaction” from the world, including new sanctions, if the Istanbul talks failed.",
    "Macron said European nations were coordinating with Washington on additional sanctions should Moscow continue to refuse an “unconditional ceasefire.” On Saturday, Zelenskyy said he had spoken to Canadian Prime Minister Mark Carney about fresh and effective sanctions against Russia.",
    "During the Istanbul talks, the Ukrainian side said Russia had made “unacceptable” territorial demands.",
    "Moscow claims annexation of five Ukrainian regions – four since its 2022 invasion, and Crimea, which it annexed in 2014."
  ],
  "topics": {
    "Politics": 0.9415327906608582,
    "Conflict": 0.8752129077911377,
    "Diplomacy": 0.8693193793296814,
    "Culture": 0.8582338094711304,
    "Transport": 0.8331150412559509,
    "Technology": 0.8137738108634949,
    "Energy": 0.8105273246765137,
    "Military": 0.8094974160194397,
    "Economy": 0.8003788590431213,
    "Crime": 0.7589159607887268,
    "Environment": 0.7434131503105164,
    "Health": 0.7393209338188171,
    "Elections": 0.653759241104126,
    "Education": 0.6437324285507202
  },
  "sentiment": {
    "positive": 0.382,
    "negative": 0.618,
    "neutral": 0.0
  }
}