{
  "title": "Oggi la telefonata Trump-Putin, Rubio: \"Facciamo sul serio\"",
  "published_date": null,
  "url": "https://www.corriere.it/esteri/25_maggio_19/oggi-la-telefonata-trump-putin-rubio-facciamo-sul-serio-ed66f71f-8066-4f00-b131-81ffff93cxlk.shtml",
  "original_language": "it",
  "cleaned_sentences": [
    "Today the Trump-Putin phone call, Rubio: \"Let's seriously do\" The Secretary of State reassures the allies: \"Ready to hit with devastating sanctions\".",
    "The US think of Russian oil exports measures New York/Rome - Today at 10 in the morning of Washington Donald Trump will talk to Vladimir Putin.",
    "The themes of the phone call, described on Saturday on social networks by the American president: \"put an end to the\" bloodshed \"that kills on average over 5,000 Russians and Ukrainians every week; and trade ».",
    "The next day, at Villa Taverna, the Roman residence of the American ambassador Tilman Fertitta, there was the meeting between a smiling vice president JD Vance accompanied by the secretary of state Marco Rubio, and the Ukrainian leader Zelensky.",
    "The two American envoys also met many other international leaders on the sidelines of the Pope's Mass.",
    "The Roman appointment had been prepared in time by several governments - of course by Zelensky but also by British, French and German - well before Trump's surprise announcement on the phone call with Putin.",
    "The numerous interlocutors felt repeated from Rubio on Saturday and Sunday a key concept: «We must make Putin understand that we are serious.",
    "We are ready to hit him with devastating sanctions ».",
    "Trump also in the interview with Fox News on the return from the trip to the Gulf spoke of sanctions: \"Honestly, I will impose them if we cannot make an agreement ... they will be destructive for Russia, because they are in difficulty with the economy and the price of oil is low\".",
    "Trump also repeated that he intends to establish a date to meet Putin.",
    "The sanctions to which the Americans refer are linked to the proposal presented by South Senator Carolina Lindsey Graham who has already collected 77 signatures and should reach 80 (a large bipartisan deployment): it would include heavy penalties on the Russian oil exports and duties borne by the countries that acquire hydrocarbons and Russian Uranium (but among these there are also China and India, so it becomes a political problem, therefore it becomes a political problem.",
    "\"We have been clear with the Russians for 6-7 weeks that this Senate initiative was in progress and that we cannot stop it, we do not control it-said Rubio from Rome in an interview broadcast yesterday by the TV CBS-.",
    "The Congress and the Republicans in particular gave us space to negotiate but we warned the Russians two months ago that (this law, ed) is coming ... ».",
    "When asked if he does not believe that Putin is just taking time, Rubio replied: «That's what we are trying to understand and we will know very soon.",
    "In the meeting in Russian and Ukrainian Türkiye, they agreed that documents written with their ideas on the cease will be exchanged.",
    "If these ideas are realistic and rational we will progress; If they contain requests that we know to be unrealistic, we will make a different evaluation.",
    "On the one hand we are trying to get to peace in a bloody and expensive conflict, and you need patience but on the other we have no time to waste with infinite interviews ».",
    "This setting likes Zelensky very much, but Rubio and Vance have not been able to ensure neither the Ukrainian leader nor the Europeans who will shake the threat of sanctions in the phone call with Putin.",
    "Also for this reason the German chancellor Merz came out in the open with an official press release, claiming that Europeans should be affected Trump before the American president speaks with Putin.",
    "Giorgia Meloni spoke on the phone with Trump on Saturday, according to diplomatic sources mentioned by the Adnkronos agency.",
    "In general, in Rome the Europeans have communicated to the two Americans a certain skepticism for the outcome of the Trump-Putin phone call.",
    "Skepticism also shared by Mark Carney, Canadian premier and Anthony Albanese, Australian premier.",
    "Both met Zelensky; Carney also saw Vance.",
    "Canada and Australia were among the first countries to offer soldiers for a military mission in Ukraine.",
    "Instead from Washington the special correspondent for Russia Steve Witkoff said to TV ABC that the phone call will be very useful \"to identify where we are and how to complete these negotiations.",
    "It will be a successful phone call ... they know each other, the president is determined to complete this thing ... if he can't do it, nobody can succeed »."
  ],
  "topics": {
    "Diplomacy": 0.9377950429916382,
    "Conflict": 0.9354890584945679,
    "Politics": 0.9275268912315369,
    "Culture": 0.9248576164245605,
    "Economy": 0.9160356521606445,
    "Energy": 0.9025256633758545,
    "Environment": 0.8852540850639343,
    "Health": 0.854216992855072,
    "Military": 0.8524870276451111,
    "Elections": 0.8177125453948975,
    "Transport": 0.7963650226593018,
    "Technology": 0.7802867889404297,
    "Education": 0.7615437507629395,
    "Crime": 0.7196391224861145
  },
  "sentiment": {
    "positive": 0.385,
    "negative": 0.615,
    "neutral": 0.0
  }
}