{
  "title": "Zafesova: “Russia e Ucraina, tregua molto difficile. Nessuno vuole mollare”",
  "published_date": null,
  "url": "https://www.quotidiano.net/esteri/intervista-zafesova-russia-ucraina-uu9c2v9b",
  "original_language": "it",
  "cleaned_sentences": [
    "Rome, 14 May 2025 - A Putin President in difficulty, close between Zelensky's pressures and Washington's expectations.",
    "It is a summit, from which, if it takes place, nothing will come out.",
    "Anna Zafesova (photo), a specialized analyst on Russia and the ex Soviet area and in the bookstore with its new book, 'Russia.",
    "The empire that cannot die \"(Rizzoli), explained why in Moscow they are more nervous than in Kiev in view of tomorrow's meeting.",
    "Anna ZaFeova, dry question: what does Putin do tomorrow?",
    "Do you go or do not go to Istanbul?",
    "\"It is very difficult for him.",
    "It would not go to the figure of the coward the eyes of his people and not to meet the president Trump, which he cares a lot.",
    "In order not to go he must find a sufficiently credible trick\".",
    "Zelensky on the other hand seems to have no doubts ... \"Zelensky, also thanks to the European allies, moved much more skillfully leaving the Russian president forced to decide.\"",
    "Let's admit that tomorrow they are both in Istanbul, how probability are there to get to a respite?",
    "\"In my opinion nobody.",
    "None of the two sides is intent on giving up.",
    "Russia wants to continue its expansionist policy, and Ukraine is determined to resist.",
    "Both sides, then still have the tools to continue fighting.",
    "In war, the fire is reached when one of the two parts can no longer do it\".",
    "It goes on to the bitter end ... \"A war is never a static phenomenon, but until the balance does not change there will be no negotiations\".",
    "What could lead to the beginning of the negotiations?",
    "\"For example, if new sanctions hit Russia, this may no longer be able to finance the war, where many resources have already been diverted, in a period in which the Russian economy is already weak\".",
    "Why is Putin still not willing to stop?",
    "\"Because everything has bet on this war.",
    "On his outcome his political survival also depends on Ukrainian, the situation is very different.",
    "Kiev has decided nothing, this war was imposed on it\".",
    "How is the Russian advance on the ground?",
    "\"I think it has been very emphasized by the newspapers, in recent weeks the Russian territorial gains have been scarce and sources, even officials, speak of lack of means, especially of armored\"."
  ],
  "topics": {
    "Conflict": 0.9854221940040588,
    "Politics": 0.9667771458625793,
    "Military": 0.76885586977005,
    "Economy": 0.7072947025299072,
    "Culture": 0.6556198000907898,
    "Energy": 0.5453049540519714,
    "Diplomacy": 0.4195060431957245,
    "Technology": 0.365498423576355,
    "Transport": 0.33832454681396484,
    "Crime": 0.21749916672706604,
    "Health": 0.1764276623725891,
    "Environment": 0.15961050987243652,
    "Education": 0.12689179182052612,
    "Elections": 0.05100451037287712
  },
  "sentiment": {
    "positive": 0.2,
    "negative": 0.8,
    "neutral": 0.0
  }
}