{
  "title": "Ucraina, via libera al 17esimo pacchetto di sanzioni Ue contro la Russia. Mosca non svela la delegazione in Turchia",
  "published_date": null,
  "url": "https://www.ilsole24ore.com/art/ucraina-via-libera-17esimo-pacchetto-sanzioni-ue-contro-russia-AHhragk",
  "original_language": "it",
  "cleaned_sentences": [
    "Putin will not be at the Russia-Ukraine summit of Istanbul.",
    "The EU Vara new penalties against Moscow The Ukrainian president, Volodymyr Zelensky, said that Sunday \"probably\" will see Pope Leo XIV 3 'of reading Vladimir Medinsky, former minister of culture and current councilor of President Vladimir Putin, will lead the Russian delegation to direct negotiations with Ukraine scheduled starting from May 15 in Istanbul, Turkey.",
    "Putin himself will therefore be absent but also the foreign minister Serghei Lavrov.",
    "The Kremlin reports it.",
    "Medinsky also played a leading role in the latest direct negotiations in 2022.",
    "For the United States, however, starting from Friday 16, the secretary of state Marco Rubio and the special correspondent of the White House Steve Witkoff will be present.",
    "The presence of President Trump is excluded: this hypothesis would have been taken into consideration only if Putin had participated in the Turkish summit.",
    "On the eve of the summit, the Ukrainian president Volodymyr Zelensky instead said that Kiev is ready to \"any negotiation format\" to end the war with Russia and that he would have decided the \"next steps\" depending on the composition of the Russian drawing.",
    "On Sunday 11 May Russian President Vladimir Putin had suggested that Kiev and Moscow resumed direct negotiations without preparing in Istanbul on May 15th.",
    "Following, the President of the United States Donald Trump had said that Ukraine should accept Putin's offer \"immediately\".",
    "Shortly thereafter, Ukrainian President Volodymyr Zelensky had declared on social media that Putin would have expected in Türkiye.",
    "The EU Vara 17th Package of penalties against Russia Green light of the permanent representatives of the 27 EU countries (Coreper II) to the 17th pack of penalties against Russia.",
    "The new European measures provide for sanctions relating to the hybrid activities of Russia, to violations of human rights and the use of chemical weapons.",
    "The package targeted the new \"ghost\" oil tankers used to circumvent the sanctions existing aimed at limiting the exports of Russian oil, have affirmed diplomatic sources cited by France Presse.",
    "The package also includes the insertion of 75 individuals or entities related to the Russian military industry in the black list; commercial restrictions for 30 companies that have evaded penalties against Moscow, in particular in the trade in dual assets; penalties against judges and prosecutors involved in the processes for opponents Aleksej Navalny and Vladimir Kara-Murza; Establishment of the legal bases to affect the boats that attack European infrastructures as well as 20 guilty entities of spreading fake news in favor of Russian propaganda.",
    "These new penalties are independent of the \"massive\" ones planned in the event that Moscow refuses to negotiate and accept a 30-day cessate-cassate already accepted by Kiev and requested by its western allies.",
    "The package was adopted unanimously, as requested in these cases: it has therefore also seen the green light of Hungary and Slovakia.",
    "Only two Member States have yet to go through their respective national parliaments, but it is a procedural aspect.",
    "\"I welcome the agreement on our seventeenth package of penalties against Russia.",
    "We are further limiting access to military use technologies.",
    "We also included 189 \"shadow fleet\" ships to hit Russian energy exports.",
    "We will continue to keep the pressure on the Kremlin high »writes the president of the European Commission, Ursula von der Leyen, in a post on social media.",
    "NATO sources, \"uses Zelensky to invite to the Hague\" The United States are opposed to extending the invitation to participate in the NATO summit of the Hague of June 24 in the Ukrainian president Volodymyr Zelensky.",
    "Allied diplomatic sources confide it to Ansa.",
    "At the moment, in fact, the participations were sent only to the four Asian partners: Japan, South Korea, Australia and New Zealand.",
    "\"Almost all of the allies expressed perplexity on this choice in Washington,\" said a source.",
    "The theme, among others, could peek at the Informal Foreign Ministerial of Antalya, who opens this evening with the dinner organized by the hosts."
  ],
  "topics": {
    "Technology": 0.9070958495140076,
    "Military": 0.8770620822906494,
    "Culture": 0.8605426549911499,
    "Politics": 0.843842089176178,
    "Energy": 0.8183079361915588,
    "Conflict": 0.7837863564491272,
    "Diplomacy": 0.7595499753952026,
    "Transport": 0.7381609082221985,
    "Environment": 0.6471021175384521,
    "Economy": 0.6058276295661926,
    "Health": 0.5963690876960754,
    "Crime": 0.5066493153572083,
    "Elections": 0.3956126272678375,
    "Education": 0.3143482506275177
  },
  "sentiment": {
    "positive": 0.481,
    "negative": 0.519,
    "neutral": 0.0
  }
}