{
  "title": "9 civili uccisi, Trump auspica un accordo con Putin Il Fatto Quotidiano",
  "published_date": null,
  "url": "https://www.ilfattoquotidiano.it/2025/05/17/attacco-russo-ucraina-civili-uccisi-trump-putin-trattativa-guerra-news/7991793/",
  "original_language": "it",
  "cleaned_sentences": [
    "Ukraine, Russian drone attacks Minivan: 9 dead.",
    "Zelensky: \"Deliberated murder, they knew they were civil\" A new Russian attack in Ukraine causes the death of nine people.",
    "To be hit was a minibus that in the northern part of the country: according to the regional authorities there were also four injured.",
    "\"An enemy drone hit a bus near Bilopillia, killing nine people and injuring four,\" said the military administration of the Sumy border region on Telegram, publishing the photos of the hit miniBus.",
    "The attack took place at 6:17 (5:17 in Italy), while the vehicle was leaving the city of Bilopillia for Sumy, announced the head of the regional military administration, Oleg Grigorov.",
    "\"This is not only another bombing, it is a cynical war crime.",
    "The Russian army has again affected a civil goal, violating all the rules of international law and humanity,\" commented an official of the National Police Department, as reported by RBC-Ukraine.",
    "The Ukrainian President Volodymyr Zelensky denounced Sumy's attack on X.",
    "\"The victims reported burns, fractures and explosion trauma.",
    "Everyone is receiving the necessary medical assistance,\" he wrote.",
    "\"According to the first information, the Russians killed a family: father, mother and daughter died in the attack,\" he added, expressing condolences to family members.",
    "Zelensky accused Moscow of deliberately hit civilians: \"The Russians could not not know what type of vehicle they were targeting.",
    "It was a deliberate murder\".",
    "The hit miniBus was a vehicle used for evacuation operations, said the mayor of Bilopillia, Yuriy Zarko, adding that most of the nine victims were old women.",
    "Zarko spoke of a \"black Saturday\" in the history of the city and declared three days of mourning, from today until Monday.",
    "\"People were on this bus leaving for an evacuation -said the mayor -.",
    "Outside the city, the bus was hit by a (drone, ed) Lancet, led by a reconnaissance drone\".",
    "During the night, the Russian forces attacked Ukraine with 62 dronones of various types, including the Kamikaze Shahed, according to Telegram reported by the Air Force of Kiev.",
    "The attack concerned the regions of Sumy, Odessa, Kharkiv, Dnipropetrovsk and Donetsk.",
    "According to the Ukrainian areonautics press release, 36 pilot-free aircraft were demolished and six drones-ites have fallen into open areas.",
    "Also in the night between 16 and 17 May, the Russian aerial defenses instead shot down two Ukrainian drones: one on the territory of the Belgorod region and one on the territory of the Kursk region, the Ministry of Moscow defense has made known on Telegram.",
    "Citing a source of Ukrainian security, the Kyiv Independent writes that Ukrainian Droni hit a storage of ammunition used by the 126th Russian coast defense brigade near the village of Perevalne, in the occupied Crimea.",
    "The deposit, located near a key highway between Simferopoli and Alushta, contained military equipment, ammunition and fuel.",
    "\"Ukrainian security services continue to effectively affect legitimate military objectives in the Crimea occupied by the Russians,\" said the source.",
    "According to reports, the attack would have caused significant damage and would have pushed Russian forces to block traffic along the highway.",
    "There are also reports of Russian soldiers killed in the explosion, added the source."
  ],
  "topics": {
    "Crime": 0.8000406622886658,
    "Conflict": 0.7622836232185364,
    "Health": 0.5156666040420532,
    "Transport": 0.4813554286956787,
    "Technology": 0.466191828250885,
    "Energy": 0.4481396973133087,
    "Culture": 0.44186070561408997,
    "Military": 0.37290850281715393,
    "Economy": 0.37265342473983765,
    "Politics": 0.37230274081230164,
    "Environment": 0.2539414167404175,
    "Education": 0.15568773448467255,
    "Diplomacy": 0.14770790934562683,
    "Elections": 0.0806594118475914
  },
  "sentiment": {
    "positive": 0.115,
    "negative": 0.885,
    "neutral": 0.0
  }
}