{
  "title": "I primi negoziati diretti e pubblici fra Russia e Ucraina sono già finiti",
  "published_date": null,
  "url": "https://www.ilpost.it/2025/05/16/nuovi-negoziati-russia-ucraina-istanbul/",
  "original_language": "it",
  "cleaned_sentences": [
    "The first direct and public negotiations between Russia and Ukraine are already over The Istanbul meeting led to an agreement for an exchange of 1,000 prisoners, but there is no step forward towards a cease The first direct and public negotiations between Russia and Ukraine after more than three years of war, which began on Friday, lasted less than two hours.",
    "The only result of Istanbul's meeting in Türkiye was an agreement for an exchange of 1,000 prisoners of war.",
    "There have been no steps forward in the negotiations for the ceasefire or for peace.",
    "According to a Ukrainian official who spoke anonymously with the AP news agency, the negotiations were soon interrupted for Russia's \"irrelevable requests\".",
    "The Ukrainian delegation then officially said that he had requested a direct meeting between the presidents Volodymyr Zelensky and Vladimir Putin and to have discussed all the \"possible ways\" of a ceased.",
    "However, it does not seem that there are advancements in this sense.",
    "The Russian delegation confirmed the exchange of prisoners, without providing further details.",
    "However, the expectations were low.",
    "For a few days there had been talk of the possibility that the negotiations were attended by Ukrainian President Zelensky, the Russian one Putin and also the American one Donald Trump, but this hypothesis did not take place, first of all because Putin decided not to attend.",
    "There were therefore two not very high level delegations.",
    "It was the same US administration to say that he did not expect a lot from the meeting, while Trump claimed that he will come to peace only when he and Putin will talk directly.",
    "On Friday from the United Arab Emirates he added that it was the \"moment to do it\" and that the meeting will be organized \"as soon as possible\".",
    "Putin had said that he considered the negotiations of Friday as a continuation of those (non -public) organized a few months after the Russian invasion in 2022.",
    "Then they failed because Russia asked the neutrality of Ukraine and limitations to its possibility of having an army, however referring every discourse to the occupied territories.",
    "On Friday's meeting had been proposed by Putin, in response to a request for a ceased the 30 -day fire made by Ukraine and by the main European leaders (however, a request that had rejected).",
    "The Russian delegation was led by Vladimir Medinskij, former Caponegotiator in the meeting of 2022, councilor of Putin and former Minister of Culture: the director of the military secret services, Igor Kostyukov, and the deputy ministers Mikhail Galuzin (Foreign) and Alexander Fomin (defense) were also present.",
    "The Ukraine was composed of the Minister of Defense Rustmus Umerov, the deputy minister of foreign stores Sergiy Kyslysya and from high -level representatives of the secret services.",
    "The meeting was mediated by representatives of the Turkish government and took place on an U -shaped table, in which Russians and Ukrainians were in front, on the long sides.",
    "Before the meetings in Istanbul there were informal meetings between the Ukrainian delegation and the national security councilors of the United States, France, Germany and the United Kingdom, as well as an official meeting between the Ukrainian representatives, the Turkish mediators and the US secretary of State Marco Rubio.",
    "- Read also: all the negotiations failed on the war in Ukraine"
  ],
  "topics": {
    "Conflict": 0.7608115077018738,
    "Politics": 0.5823190808296204,
    "Military": 0.5068569183349609,
    "Diplomacy": 0.4980376064777374,
    "Technology": 0.35396867990493774,
    "Health": 0.34244418144226074,
    "Environment": 0.28244420886039734,
    "Economy": 0.27585098147392273,
    "Energy": 0.21886210143566132,
    "Transport": 0.21656359732151031,
    "Crime": 0.17887082695960999,
    "Education": 0.12271647900342941,
    "Culture": 0.10921698063611984,
    "Elections": 0.09738899767398834
  },
  "sentiment": {
    "positive": 0.2,
    "negative": 0.8,
    "neutral": 0.0
  }
}