{
  "title": "Ucraina, sanzioni contro la Russia: l'Europa ci riprova e dà il via libera al 17esimo pacchetto",
  "published_date": null,
  "url": "https://www.affaritaliani.it/esteri/guerra-ucraina-sanzioni-russia-pacchetto-europa-969298.html",
  "original_language": "it",
  "cleaned_sentences": [
    "Foreign Ukraine, penalties against Russia: Europe tries again and gives the green light to the 17th package Green light of the permanent representatives of the 27 EU countries (Coreper II) to the 17th pack of penalties against Russia Ukraine, Europe tries again and gives the green light to new penalties against Russia Green light of the permanent representatives of the 27 EU countries (Coreper II) to the 17th pack of penalties against Russia, as far as we learn.",
    "The new European measures, in addition to hitting the so -called 'shadow fleet' of Moscow again, also include sanctions relating to the hybrid activities of Russia, the violations of human rights and the use of chemical weapons.",
    "The ratification of the new penalties - to which Hungary and Slovakia have also given green light - is expected now for May 20, on the occasion of the EU Foreign Affairs Council.",
    "The ships of the Shadow Fleet sanctioned are, as far as it is learned, almost 200, including oil tankers.",
    "Other 30 companies involved in the elimination of penalties, in particular as regards the assets with double use, will undergo new commercial restrictions.",
    "75 individual sanctions were also approved for people and companies related to the Russian military industry complex.",
    "Sanction that the 20 entities and individuals that spread disinformation."
  ],
  "topics": {
    "Conflict": 0.8529724478721619,
    "Politics": 0.8033637404441833,
    "Culture": 0.5942844748497009,
    "Military": 0.5608934164047241,
    "Diplomacy": 0.3217911124229431,
    "Transport": 0.2526465654373169,
    "Economy": 0.18377919495105743,
    "Technology": 0.1300390660762787,
    "Crime": 0.12765121459960938,
    "Environment": 0.1033129021525383,
    "Energy": 0.07893465459346771,
    "Health": 0.05930979177355766,
    "Elections": 0.026540394872426987,
    "Education": 0.019949115812778473
  },
  "sentiment": {
    "positive": 0.143,
    "negative": 0.857,
    "neutral": 0.0
  }
}