{
  "title": "Avi Loeb on UAP and a possible link with 'Oumuamua",
  "published_date": null,
  "url": "https://tpo.nl/2021/06/23/avi-loeb-on-uap-and-a-possible-link-with-oumuamua/",
  "original_language": "en",
  "cleaned_sentences": [
    "“The Pentagon is about to deliver a report to Congress stating that some unidentified aerial phenomena (UAP) are real but that their nature is unknown.",
    "If UAP originated from China or Russia and were a national security risk, their existence would have never been revealed to the public.",
    "Hence, it is reasonable to conclude that the U.S. government believes that some of these objects are not human in origin.",
    "This leaves two possibilities: either UAP are natural terrestrial phenomena or they are extraterrestrial in origin.",
    "Both possibilities imply something new and interesting that we did not know before.",
    "The study of UAP should therefore shift from occupying the talking points of national security administrators and politicians to the arena of science where it is studied by scientists rather than government officials.",
    "We should collect better scientific data and clarify the nature of UAP.",
    "This can be done by deploying state-of-the-art cameras on wide-field telescopes that monitor the sky.",
    "The sky is not classified; only government-owned sensors are.",
    "By searching for unusual phenomena in the same geographical locations from where the UAP reports came, scientists could clear up the mystery in a transparent analysis of open data.",
    "As noted in my recent book Extraterrestrial, I do not enjoy science fiction stories because the story lines often violate the laws of physics.",
    "But we should be open-minded to the possibility that science will one day reveal a reality that was previously considered as fiction.” Avi Loeb (Harvard) is zo’n beetje de enige wetenschapper die hardop ver buiten de bestaande wetenschappelijke consensuskaders over buitenaards leven durft te denken.",
    "Nergens zegt hij dat de recente bezoeker van buiten ons zonnestelsel ‘Oumuamua een bewijs van buitenaards leven is, maar hij houdt die mogelijkheid wel open.",
    "Dat is al heel wat meer dan de meeste andere wetenschappers.",
    "Nu UFO’s (UAP) mainstream zijn geworden pleit hij er voor dat waarvan we niet weten wat het is ook gewoon te behandelen met de methode die we horen te gebruiken als we meer willen weten van iets waarvan we niet weten wat het is: wetenschap.",
    "Het zou dan zomaar eens bewezen kunnen worden dat het inderdaad iets ‘nieuws en interessant is waarvan we nog nooit eerder hadden gehoord’."
  ],
  "topics": {
    "Culture": 0.9211310744285583,
    "Conflict": 0.8692795634269714,
    "Technology": 0.8118825554847717,
    "Economy": 0.6966816186904907,
    "Transport": 0.67680424451828,
    "Health": 0.6415535807609558,
    "Environment": 0.6387195587158203,
    "Energy": 0.6165447235107422,
    "Military": 0.5414345264434814,
    "Education": 0.5163761973381042,
    "Diplomacy": 0.5050346255302429,
    "Politics": 0.325544148683548,
    "Crime": 0.31830033659935,
    "Elections": 0.25609290599823
  },
  "sentiment": {
    "positive": 0.312,
    "negative": 0.688,
    "neutral": 0.0
  }
}