{
  "title": "Motstandsgruppa bak angrep i Russland:",
  "published_date": null,
  "url": "https://www.dagbladet.no/nyheter/blir-advart-ma-erstattes/79344775",
  "original_language": "no",
  "cleaned_sentences": [
    "Resistance group behind attacks in Russia: Being warned: - must be replaced Ilja Ponomaev, leader of the Russian resistance group \"Liberty of Russia Legion\", claims that his group is behind attacks on the Russian side of the border.",
    "- This war can only end in Moscow.",
    "That's what Russian-Ukrainian Ilja Ponomaev says to the British radio station LBC.",
    "He is the leader of the Russian resistance group \"Liberty of Russia Legion\", claiming that his group, along with another, is behind attacks in the Russian city of Kozinka.",
    "Now they also have units on their way to Grajvoron, a city in the Russian Belgorod region, Ponomaev claims.",
    "He is a former deputy leader of the opposition in Russia's parliament, and voted, among other things, against the annexation of Crimea in 2014.",
    "- This war will not end in Ukraine, it can only end in Moscow.",
    "When Putin's regime is replaced, he tells the radio channel.",
    "- We move on According to Reuters news agency, Ponomaev has said that the border town of Kozinka has been released and that they have reached Grajvoron further east.",
    "Russia should be free, he writes on Twitter.",
    "On Monday, several reports of attacks have been reported in Russia, both from Russian and Ukrainian.",
    "Aftenposten, who has served videos from the area, writes that there are clashes in several villages in the area.",
    "The videos show vehicles along the roads near the border and smoke a little further northeast, writes NTB.",
    "Russian authorities have implemented a counter -terrorism regime, and must have evacuated several residents from Belgorod.",
    "According to the Russian, state -owned news agency RIA, the authorities have also introduced strict controls in the area.",
    "Among other things, they should have started with telephone interception in the region.",
    "🇷🇺 Air Show over Belogord 🇷🇺 - Jason Jay Smart (@officejjsmart) May 22, 2023 Russians, who are fighting on the page of Ukraine 🇺🇦, are invading Belgorod 🇷🇺.",
    "Russia initially claimed that there was no need to panic - all was fine - news of an attack was more 🇺🇦 propaganda.",
    "Now Russian Tanks Are Headed to Belgorod.",
    "~ PIC.TWITTER.com/9EQ0UFLHY5 The Reuters news agency writes on Monday that saboteurs have crossed the border from Ukraine.",
    "Russia claims Ukraine is behind, while Ukrainian authorities point to the Russian opposition groups \"Liberty of Russia Legion\" and \"Russian Volunteer Corps\" - both consisting of Russian citizens.",
    "- trained by Ukraine According to Ponomaev, his group consists of Russian military offers who have been trained by the Ukrainian military intelligence agency Gur.",
    "- It is clear that (to set aside Putin) will not be done by Ukrainians, NATO forces or British forces.",
    "It will be done by Russians.",
    "It is not fair for Ukrainians to have to bleed for our freedom, he says.",
    "Governor in Belgorod, Vyacheslav Gladkov, says in a statement on Telegram that the Russian army, border guard and security service FSB is involved in the operation of running out the saboteurs.",
    "According to him, at least eight people were injured, in addition to the fact that three houses and one administration building have injuries as a result of the attacks.",
    "States about the Kremlin attack The Baza telegram channel, with links to the Russian security service, writes that there are indications of matches in three settlements along the main road into Russia.",
    "Another Telegram channel claims that both power and water for several villages have been cut.",
    "The information is not confirmed by independent sources.",
    "Furthermore, Ponomaev argues that no Ukrainian forces participate in the operation, and that the other group that is involved - in addition to its own is a right -wing militia.",
    "He also states about the alleged drone attack on the Kremlin earlier in May.",
    "Several experts have been critical of the videos to show the attack, and some have thought the clip does not look real.",
    "However, Ponomaev goes a long way in confirming the attack, and says \"it was done by people we know\"."
  ],
  "topics": {
    "Conflict": 0.9804365634918213,
    "Politics": 0.9724604487419128,
    "Environment": 0.9654116630554199,
    "Economy": 0.950238823890686,
    "Diplomacy": 0.9099140763282776,
    "Culture": 0.9071653485298157,
    "Health": 0.9038266539573669,
    "Elections": 0.9024787545204163,
    "Transport": 0.8989866375923157,
    "Military": 0.892837405204773,
    "Technology": 0.8901124596595764,
    "Energy": 0.8199247717857361,
    "Education": 0.7279980182647705,
    "Crime": 0.7139554023742676
  },
  "sentiment": {
    "positive": 0.088,
    "negative": 0.912,
    "neutral": 0.0
  }
}