{
  "title": "- Absolutt ikke utenkelig",
  "published_date": null,
  "url": "https://www.dagbladet.no/nyheter/absolutt-ikke-utenkelig/76020810",
  "original_language": "no",
  "cleaned_sentences": [
    "Claim they defy Putin: - certainly not unthinkable The experts are in agreement on the rumors of the Ukrainian legion \"Freedom of Russia\".",
    "- Not a news Putin needs, says Lieutenant General.",
    "As many as 300 Russian soldiers should have joined the Ukrainian legion \"Freedom of Russia\" to fight against Vladimir Putin's regime, writes the Ukrainian website Interfax.",
    "The newspaper further writes that the Legion will consist of a much larger number, but they will not go into specific figures for safety reasons.",
    "The retired general element, Arne Bård Dalhaug, has not even read anything about the Ukrainian legion, but says that is not difficult to imagine.",
    "More questions - I do not see that it has been reported, but it does not have to mean that it has not happened.",
    "It is certainly not inconceivable that it may have happened.",
    "The question is under what circumstances it has happened, he tells Dagbladet.",
    "Dalhaug points to several different potential scenarios that may have happened if it is true that several Russians have changed sides.",
    "- They may have been captured.",
    "North of Kharkiv, Ukrainian forces have had a violent offensive, and it is conceivable that they have surrounded Russian soldiers who have put down their weapons and become prisoners of war.",
    "In that case, there is nothing special.",
    "But: - They may also have come over to the enemy and surrendered.",
    "It's a imaginable thing that may have happened.",
    "The reason I believe it is that it is no secret that the morality of the Russian soldiers has been bad all the time.",
    "It may be an indication that there may be something in it, says Dalhaug.",
    "- What would it have to say for the Russian fighting will if it turns out that Russian soldiers change sides?",
    "- If it has happened, then it is not a news Putin just before the May 9 celebration.",
    "- Want to undermine the morale That it can go beyond the morale of the Russian soldiers is something Colonel Geir Hågen Karlsen stands behind.",
    "He, like Dalhaug, cannot confirm the information.",
    "- I think we should take such information with a pinch of salt.",
    "There is a Ukrainian desire to put the Russians in a bad light and undermine morality internally in the forces.",
    "This is just one way to do it.",
    "When asked if this is a normal phenomenon in warfare, he says: - Everyone wants to undermine the opponent's morality in a war.",
    "Russians and Ukrainians are quite close to each other, and many of them have lived in Ukraine, but been ethnic Russian and talked Russian.",
    "The potential for people to change sides there is quite much larger than in other wars where there is a greater difference between those who fight."
  ],
  "topics": {
    "Conflict": 0.9522489905357361,
    "Military": 0.8480403423309326,
    "Culture": 0.8396804928779602,
    "Politics": 0.813120424747467,
    "Technology": 0.7479097843170166,
    "Economy": 0.7218237519264221,
    "Health": 0.6909579038619995,
    "Environment": 0.6598919034004211,
    "Energy": 0.6506209373474121,
    "Transport": 0.5487892627716064,
    "Crime": 0.4358288049697876,
    "Education": 0.3861863613128662,
    "Elections": 0.19613578915596008,
    "Diplomacy": 0.17256160080432892
  },
  "sentiment": {
    "positive": 0.192,
    "negative": 0.808,
    "neutral": 0.0
  }
}