{
  "title": "\"Russia Collusion\" gjenoppstår, også i tilknytning til Ukraina",
  "published_date": null,
  "url": "https://www.document.no/2024/09/04/russia-collusion-gjenoppstar-ogsa-i-tilknytning-til-ukraina/",
  "original_language": "no",
  "cleaned_sentences": [
    "On Wednesday, the Biden administration announced a comprehensive set of measures to handle a large-scale Russian government-supported efforts.",
    "Once again, it is talked about the Russians trying to influence the US presidential election in 2024, according to CNN.",
    "In addition, the Russian company Social Design Agency is accused of running a campaign to convince the US public that the United States should not fund the Ukrainian war effort.",
    "Therefore, charges have been taken against two Russian citizens, sanctions against ten individuals and units and the seizure of 32 internet domains.",
    "On instructions from Russian President Vladimir Putin, three Russian companies used fake profiles to promote false narratives on social media, says US Deputy Attorney Lisa Monaco in a statement.",
    "Two employees in Rt, the state Russian media network, were indicted in an American court for allegedly being part of a scheme that was to channel almost $ 10 million to create and lead a Tennessee-based front company to produce content online that aimed to create split among the Ministry of Justice.",
    "Many people probably think that Americans are able to create split without foreign help.",
    "But the authorities take this seriously, according to NTB reuters.",
    "The seizure appears in court documents in which the Russian company Social Design Agency is accused of running a campaign to convince the US public that the United States should not finance the Ukrainian war effort.",
    "Social Design Agency is already subject to financial sanctions for the alleged operation of false news sites in Europe on behalf of Russian authorities.",
    "The US Ministry of Finance says they are introducing sanctions against ten people and two companies.",
    "Among these are the editor -in -chief and the show editor of the state Russian media group RT - formerly Russia Today.",
    "US officials consider Rt to have a key role in Russia's propaganda business.",
    "-using PR firms to spread disinformation \"The United States believes RT employees funded a scheme to influence American opinion on Russia and the country's war on Ukraine,\" said Justice Minister Merrick Garland.",
    "He says Rt and the employees would use a company in the state of Tennessee to spread Russian -friendly content.",
    "The Minister of Justice believes the inner circle of Russian President Vladimir Putin is behind, to promote disinformation as part of a program to influence this year's elections in the United States.",
    "\"We want to aggressively and incessantly work to counteract and prevent the US, China or other foreign players from interfering in our elections,\" said Garland, who also accuses Iran of increasingly aggressive attempts at election.",
    "This is suspiciously reminiscent of Russia Collusion, which proved to be a pure bluff.",
    "US voices are suspected of participating in \"money laundering\" by Russian disinformation.",
    "At the same time, there are probably thousands of bureaucrats in the United States that launder the Biden regime's fake news.",
    "So now we have both good and evil fake news.",
    "Russian parliamentarian Marija Butina rejects the claims of Russia's attempt to influence the US elections.",
    "\"The American claims were and are pure rubbish and a witch-hunt,\" Butina told CNN after sources had told the channel that the Biden government planned to make charges of election effect.",
    "Butina was imprisoned for 15 months in the United States, accused of being a Russian agent.",
    "\"Russia thinks it has nothing to say who wins the election in the United States-the only winner will be US's private military-industrial complex,\" she says.",
    "Russian authorities have repeatedly said that they do not interfere in the elections in the United States, but as the rest of the world, they are closely monitoring the development.",
    "Document is a fearless and independent newspaper that tells you the truth."
  ],
  "topics": {
    "Elections": 0.8147434592247009,
    "Culture": 0.49911966919898987,
    "Politics": 0.42508119344711304,
    "Military": 0.4217749536037445,
    "Economy": 0.4159228801727295,
    "Diplomacy": 0.3934378921985626,
    "Transport": 0.3277185261249542,
    "Technology": 0.2739013731479645,
    "Energy": 0.25807201862335205,
    "Environment": 0.2575998902320862,
    "Conflict": 0.23757794499397278,
    "Education": 0.22938686609268188,
    "Crime": 0.19883686304092407,
    "Health": 0.19004355370998383
  },
  "sentiment": {
    "positive": 0.222,
    "negative": 0.778,
    "neutral": 0.0
  }
}