{
  "title": "Hipnotizante video del vuelo del MS-21, el avión 'Made in Russia'",
  "published_date": null,
  "url": "https://actualidad.rt.com/actualidad/548639-hipnotizante-video-vuelo-ms21",
  "original_language": "es",
  "cleaned_sentences": [
    "Hypnotizer video of the MS-21 flight, the 'Made in Russia' plane The Russian Corporation Rostec shared a video that shows the first flight of the prototype of the novel Russian flagship plane MS-21, built with the use of the most advanced technologies and exclusively with national manufacturing components.",
    "The plane rose on April 29 after obtaining new systems and components produced in Russia.",
    "The device took off the airfield of the Irkutsk Aviation Plant, belonging to the Yákovlev company, and flew for an hour and 15 minutes.",
    "It reached a speed of 580 kilometers per hour and an altitude of 3,000 meters.",
    "Hypnotizer Video of the MS-21 flight, the plane 'Made in Russia' pic.twitter.com/7bygqrfvux - RT in Spanish (@ActualidadRT) May 3, 2025 During the flight the plane and the electricity and air conditioning systems were tested, among other national manufacturing systems.",
    "\"All systems, including new national systems, worked without problems,\" Rostc declared the day of the test.",
    "According to Rostec executive director, Oleg Yevtushenko, MS-21 aircraft are designed to replace in the sky of Russia the devices manufactured by Boeing and Airbus.",
    "According to his words, it is an \"advanced, very modern and comfortable plane, with an exceptional aerodynamics and new generation systems on board.\"",
    "Everything to know about the most anticipated flagship 'Made in Russia', in this article"
  ],
  "topics": {
    "Technology": 0.8861247301101685,
    "Culture": 0.7438431978225708,
    "Military": 0.7029541730880737,
    "Economy": 0.6720452904701233,
    "Energy": 0.6480368971824646,
    "Transport": 0.6216716766357422,
    "Health": 0.6123114228248596,
    "Politics": 0.5829962491989136,
    "Conflict": 0.5588308572769165,
    "Environment": 0.5552177429199219,
    "Education": 0.4138048589229584,
    "Diplomacy": 0.3494225740432739,
    "Crime": 0.25705620646476746,
    "Elections": 0.24931611120700836
  },
  "sentiment": {
    "positive": 0.667,
    "negative": 0.333,
    "neutral": 0.0
  }
}