{
  "title": "\"Parásito que vive del dinero de EE.UU.\": Batalla dentro de Occidente y encrucijada para Rusia",
  "published_date": null,
  "url": "https://actualidad.rt.com/actualidad/541414-batalla-dentro-occidente-encrucijada-rusia",
  "original_language": "es",
  "cleaned_sentences": [
    "\"Parasite living from the US money\": battle within the West and crossroads for Russia Relationships between the United States, Russia and Europe now go through a decisive stage that leads to two roads: Europeans could continue to lower their heads against Washington or could find the strength to group and resist the pressure exerted by its main ally, according to an article by Fiódor Lukiánov, editor chief of the magazine Russia in Global Affairs and president of the Council of Russia for Russia for foreign policy.",
    "In this context, the political scientist raises two issues: what does this equilibrium change mean to Russia within the collective west and what course will take geopolitical relations between the key actors after the return of US President Donald Trump to the White House?",
    "Trump is not interested in Ukraine Trump's return to the White House had the effect of \"a powerful volcanic eruption or a tectonic change\" that caused the land under NATO's feet to begin to tremble.",
    "According to Lukiánov emphasized, it is paradoxical that among the causes of the rupture between the United States and Europe is the Ukrainian conflict, which, under the administration of the American former president Joe Biden, \"was elevated to a range of the global battle between good and evil.\"",
    "\"Trump is not interested in Ukraine, he makes no sense in the US involvement in this collision, while Washington has other important issues such as China, North America and, possibly, South America, the Arctic, to some extent Middle East,\" he adds.",
    "\"The bets, including propagandists, have become so high that a gradual exit from the conflict became simply impossible.",
    "It is not because of anything that the administration drives, until the last days of his mandate, sent everything he could to maintain the war,\" says the analyst.",
    "It also indicates that by changing the course of politics in the US, it has also modified rhetoric to both Ukraine and Europe, and here the desire of the new administration is also manifested to distinguish itself from the previous one, having its own vision.",
    "Therefore, he continues, if the Biden team said that Ukraine is a key issue for politics, Trump's will argue that it is simply \"an evil empty place\" and \"the country that lives from others and should do what the donor tells him.\"",
    "Meanwhile, Europe, for Trump, \"is a parasite that lives as a king with American money\" and component not from the collective west, but \"of collective drums\", which was supported by the European authorities throughout its electoral campaign.",
    "Thus, Lukiánov links two phenomena: the creation of the so -called collective west and the Ukrainian conflict, which led to the European Unity itself.",
    "But after Trump's return, \"Europe is confused and ensures being able to face all the challenges even without the Americans, but nobody knows how it can be done,\" says the political scientist.",
    "It is not \"a battle for the future world order, but the end of the Cold War\" However, the Ukrainian crisis could not unite all European actors, which was \"an unpleasant surprise\" for the US, as well as \"demonstrated that the political environment is now structured differently.\"",
    "While during all these years Moscow has been reinforcing its relations with developed and developing countries in Asia, Africa and Latin America, it has now opened the possibility of choosing whether or does not want to restore dialogue with the West, within which a crucial battle for its future has already been triggered.",
    "\"One of the parties [USA] has considered beneficial to involve Russia.",
    "To some extent this coincides with Russian interests, but the most important thing [for Moscow] is not to get involved in the confrontation of others,\" the article mentions.",
    "Although for historical and cultural reasons, Lukiánov recalls, Russia is easier to establish negotiations with European colleagues than with representatives of other regions, it is crucial to think about the future and \"not yield\" to this \"temptation to return to good times\", since Russia's return to the cradle of usual relations with the West \"means the cementation of the scheme of the cold war.\"",
    "Along these lines, he states that \"such a model clings to Russia to the US, while the rest of the world will increasingly seek to increase diversification to the maximum and avoid binding relationships.\"",
    "The Ukrainian conflict, in this way, is not \"a battle for the future world order, but the end of the cold war that lasted the entire second half of the twentieth century.\"",
    "\"A political, military and diplomatic solution satisfactory of the conflict will undoubtedly strengthen Russia's position in the next period,\" the author concludes."
  ],
  "topics": {
    "Diplomacy": 0.8380482792854309,
    "Energy": 0.7196148037910461,
    "Environment": 0.7079963088035583,
    "Conflict": 0.6708343625068665,
    "Politics": 0.6685770750045776,
    "Transport": 0.6667408347129822,
    "Health": 0.6636165976524353,
    "Culture": 0.5563128590583801,
    "Economy": 0.5510634183883667,
    "Elections": 0.48711028695106506,
    "Crime": 0.4207848906517029,
    "Education": 0.36906832456588745,
    "Technology": 0.32793980836868286,
    "Military": 0.14014975726604462
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}