{
  "title": "Videojuegos: Juegos online: Steam ofrece la saga Assassin’s Creed con hasta el 80%",
  "published_date": null,
  "url": "https://depor.com/depor-play/videojuegos/juegos-online-steam-ofrece-la-saga-assassins-creed-con-hasta-el-80-de-descuento-por-tiempo-limitado-noticia/",
  "original_language": "es",
  "cleaned_sentences": [
    "The perfect opportunity to play the Assassin’s created saga on your computer.",
    "The online game store offers discounts of up to 80%, so check out the entire content available for this week.",
    "The online games platform offers, for example, Assassin's Creed Origins with 80% discount until October 20, so you will pay 35.99 soles.",
    "Until the same date you can also acquire Assassin’s Creed Odyssey with 70% discount, which becomes 53.99 soles.",
    "Assassin’s Creed Syndicate and Assassin’s Creed Liberation have 75% discount, so the users of the online game store will pay 22.49 soles and 9.99 soles, respectively.",
    "Assassin’s Creed Unity comes with 85% discount, which becomes a price of 13.49 soles.",
    "Assassin’s Creed Chronicles Russia, India and China deliveries are also available with 70%discounts, so Steam users will pay 8.99 soles.",
    "To download the online games with the special discount, you must have a Steam account, download the installer and then proceed with the acquisition of the title.",
    "Remember to have your bank card at hand.",
    "Free games | Sonic The Hedgehog 2 Sega is offer in Steam.",
    "The developer turns 60, so it offers all kinds of discounts on her most emblematic titles.",
    "Even, one can be downloaded as a free game if you do the installation on time.",
    "This is Sonic The Hedgehog 2, which will be a free game for Steam users if they add it to their account before October 19.",
    "It must be considered that Steam warns that some limitations will be applied.",
    "Taking into account that the video game has 14.95 soles, the gift is perfect.",
    "Another interesting offer is Sonic Mania, \"a new adventure by Sonic, Tails and Knuckles with unique final bosses, glorious 2D scenarios and the classic game mode of the saga.\"",
    "The game can buy it at 12.48 soles (75% discount) until October 19."
  ],
  "topics": {
    "Economy": 0.4308944642543793,
    "Culture": 0.3224087953567505,
    "Technology": 0.2988552749156952,
    "Elections": 0.21484290063381195,
    "Conflict": 0.19892622530460358,
    "Military": 0.15543614327907562,
    "Environment": 0.1520063281059265,
    "Crime": 0.15194553136825562,
    "Health": 0.10868729650974274,
    "Energy": 0.0889921709895134,
    "Transport": 0.08061231672763824,
    "Diplomacy": 0.064366415143013,
    "Education": 0.06151118129491806,
    "Politics": 0.04321581870317459
  },
  "sentiment": {
    "positive": 0.353,
    "negative": 0.647,
    "neutral": 0.0
  }
}