{
  "title": "VIDEO: MS-21, el avión insignia 'Made in Russia', completa su vuelo con avanzados sistemas nacionales",
  "published_date": null,
  "url": "https://actualidad.rt.com/actualidad/548137-video-vuelo-avion-avanzado-ms21-ruso",
  "original_language": "es",
  "cleaned_sentences": [
    "Video: MS-21, the flagship plane 'Made in Russia', completes its flight with advanced national systems The novel Russian flagship plane MS-21, built with the use of the most advanced technologies and exclusively with national manufacturing components, approaches certification and arrival to the market.",
    "The prototype of the aircraft made its first flight after obtaining new systems and components produced in Russia, the state corporation Rostec said Tuesday.",
    "The plane took off from the Irkutsk aviation plant airfield, belonging to the Yákovlev company, and flew for an hour and 15 minutes.",
    "It reached a speed of 580 kilometers per hour and an altitude of 3,000 meters.",
    "✈️🇷🇺 The first flight of the MS-21 Russian advanced plane, equipped with national manufacturing systems, which must replace the devices manufactured by Boeing and Airbus in the Russian market, reached the speed of 580 km/h and an altitude of 3,000 meters.",
    "pic.twitter.com/t7i9wqpcxx - Know more (@sepa_mass) April 29, 2025 Within the framework of the flight, airplane, electricity and air conditioning systems, among other national manufacturing systems have been tested.",
    "\"All systems, including the new nationals, worked without problems,\" says the Rostec statement.",
    "MS-21 aircraft are designed to replace the devices made by Boeing and Airbus in the sky of Russia, said Rostec Executive Director, Oleg Yevtushenko.",
    "According to his words, it is an \"advanced, very modern and comfortable plane, with an exceptional aerodynamics and new generation systems on board.\"",
    "\"Our aircraft manufacturers have done a huge job by replacing about 80 foreign systems and units so as not to depend on sanctions or suppliers from other countries.",
    "Today's flight brings us closer to certification and at the beginning of deliveries to the MS-21 market to replace imports,\" said Yevtushenko.",
    "Prominent characteristics of the flagship - The MS-21 aircraft is aimed at the most popular segment of the national passenger transport market and has been developed under conditions of western sanctions.",
    "The beginning of its serial production is scheduled for 2026 and now all kinds of tests are happening for certification.",
    "-The 'heart' of the MS-21 is its fifth generation PD-14 engine, which combines the best national traditions with the new standards of the 21st century aviation.",
    "Among the most prominent advantages of PD-14 are a reduction in specific fuel consumption by 10-15 %, a reduction in the cost of the life cycle by 15-20 %, as well as a operation with a lower cost than 14 %to 17 %, compared to its existing analogues.",
    "-The MS-21-310, capable of transporting up to 211 passengers, establishes a new comfort standard for narrow fuselage aircraft, at the height of long-distance airplanes standards.",
    "- For its construction, a record proportion is used in its class of advanced compound materials manufactured exclusively in Russian plants: more than 30 %.",
    "Everything to know about the most anticipated flagship 'Made in Russia', in this article"
  ],
  "topics": {
    "Technology": 0.9681699872016907,
    "Culture": 0.8465059995651245,
    "Transport": 0.8250731229782104,
    "Economy": 0.8201984167098999,
    "Energy": 0.7504070401191711,
    "Environment": 0.7261021733283997,
    "Politics": 0.7139609456062317,
    "Military": 0.6292860507965088,
    "Health": 0.6286200881004333,
    "Education": 0.5917244553565979,
    "Conflict": 0.546238124370575,
    "Diplomacy": 0.5087507963180542,
    "Elections": 0.4521833658218384,
    "Crime": 0.20563223958015442
  },
  "sentiment": {
    "positive": 0.722,
    "negative": 0.278,
    "neutral": 0.0
  }
}