{
  "title": "Azerbaijan's president says crashed plane was shot at from Russia",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/azerbaijan-president-says-crashed-plane-shot-from-russia/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "Azerbaijani President Ilham Aliyev said on Sunday, December 29, that a passenger plane that crashed last week, killing 38 people, had been damaged by shooting from the ground in Russia, and he said some in Russia had lied about the cause of the disaster.",
    "President Vladimir Putin on Saturday, December 28, apologized to Aliyev for Wednesday’s, December 25, “tragic incident” in Russian airspace involving the plane after Russian air defenses engaged Ukrainian attack drones.",
    "A Kremlin statement did not say Russia had shot down the plane, only noting a criminal case had been opened.",
    "“Our plane was shot down by accident,” Aliyev told state television on Sunday, adding that the plane had come under some sort of electronic jamming and had then been shot at while it was approaching the southern Russian city of Grozny.",
    "“Unfortunately, in the first three days we heard only absurd versions from Russia,” Aliyev said, citing statements in Russia that attributed the crash to birds or the explosion of some sort of gas cylinder.",
    "“We witnessed clear attempts to cover up the matter,” said the Azerbaijani leader, who has close ties to Russia and was educated at one of Moscow’s top universities.",
    "Aliyev said he wanted Russia to accept it was guilty of downing the plane and punish those responsible for fatally damaging the aircraft.",
    "Putin and Aliyev held another telephone call on Sunday, the Kremlin said.",
    "It gave no details but on Saturday it said that both civilian and military specialists were being questioned about what had taken place.",
    "The chief of Russia’s Investigative Committee, Alexander Bastrykin, on a phone call assured Azerbaijan’s Prosecutor General that Moscow had assigned the investigation to the most experienced experts and that actions were being taken to establish the cause and circumstances of the incident.",
    "The plane crashed on Wednesday, December 25, near the city of Aktau in Kazakhstan after diverting from southern Russia where Ukrainian drones were attacking several cities at the time, according to the Kremlin.",
    "The extremely rare publicized apology from Putin on Saturday, December 28, is the closest Moscow has come to accepting some blame for the disaster.",
    "Four sources with knowledge of the preliminary findings of Azerbaijan’s investigation into the disaster told Reuters on Thursday, December 26, that Russian air defenses had mistakenly shot it down.",
    "Burials Aliyev’s remarks came as Azerbaijan paid tribute to the pilots and passengers of the plane.",
    "Captain Igor Kshnyakin and co-pilot Alexander Kalyaninov, both ethnic Russians with Azerbaijan citizenship, and Hokuma Aliyeva, a flight attendant, were given full honors at a ceremony at the Alley of Honour in central Baku attended by Aliyev and his wife, Mehriban.",
    "“The pilots were experienced and knew they would not survive this crash landing,” Aliyev said, praising them for sacrificing themselves by putting the nose down first in an attempt to save some of the passengers.",
    "“In order to save the passengers, they acted with great heroism and as a result of this there were survivors,” he said.",
    "Aliyev awarded the crew posthumously with the titles of National Hero of Azerbaijan.",
    "Kazakhstan’s President Kassym-Jomart Tokayev also awarded citizens who helped rescue the survivors, including emergency workers, medics, police and employees at the airport and a local power company.",
    "The Embraer passenger jet had flown from Azerbaijan’s capital Baku to Grozny, in Russia’s southern Chechnya region, before veering off hundreds of miles across the Caspian Sea.",
    "Azerbaijan’s presidential office said that after the yet-to-be explained incident over Russian airspace, the pilots battled to control the plane — desperately trying to find a landing spot.",
    "With holes in the fuselage, some crew injured, passengers praying for their lives in a de-pressurized cabin and the plane spiralling out of control, the pilots flew across the Caspian Sea towards their death in a crash landing.",
    "The Alley of Honour is Azerbaijan’s most sacred modern burial ground — where prominent politicians, poets and scientists are laid to rest, including Heydar Aliyev, the late father of the current president.",
    "Captain Kshnyakin’s daughter, Anastasia Kshnyakina, said her father was a dedicated pilot who took his responsibilities to his passengers extremely seriously.",
    "“My father always said: when I take off, I am responsible not only for my life, but also for the lives of all passengers and crew members,” Kshnyakina said.",
    "“With his last flight, he proved what a true hero should be.” – Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Diplomacy": 0.7717196941375732,
    "Conflict": 0.7296963930130005,
    "Culture": 0.7201370000839233,
    "Energy": 0.70487380027771,
    "Environment": 0.7012317776679993,
    "Economy": 0.6895869970321655,
    "Transport": 0.638008177280426,
    "Technology": 0.606694757938385,
    "Crime": 0.6013256907463074,
    "Politics": 0.5751143097877502,
    "Health": 0.5437818169593811,
    "Military": 0.525534451007843,
    "Education": 0.4830326735973358,
    "Elections": 0.3772466778755188
  },
  "sentiment": {
    "positive": 0.467,
    "negative": 0.533,
    "neutral": 0.0
  }
}