{
  "title": "American Marc Fogel greeted by Trump after being released from prison by Russia",
  "published_date": null,
  "url": "https://www.rappler.com/world/us-canada/marc-fogel-greeted-donald-trump-after-being-released-from-prison-russia/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "WASHINGTON, USA – American schoolteacher Marc Fogel, freed by Russia after three and a half years in prison, got a flag-waving welcome from US President Donald Trump at a snowy White House on Tuesday, February 11, after a flight home from Moscow.",
    "“I feel like the luckiest man on earth right now,” said Fogel, an American flag draped around his shoulders.",
    "“I’m a middle-class school teacher who’s now in a dream world.” Trump, standing alongside Fogel in the White House Diplomatic Reception Room, said: “To me he looks damned good.” The release of 63-year-old Fogel, who had been detained in Russia since August 2021 and was serving a 14-year sentence, came as Trump seeks to improve relations with Moscow as part of an effort to secure an end to the war in Ukraine.",
    "Trump said Fogel’s release “could be a big important part” of ending the Ukraine war.",
    "He and Fogel both thanked Russian President Vladimir Putin for his release.",
    "“We just wanted to get him back home,” Trump said, adding that he would take Fogel on a tour of the Lincoln Bedroom upstairs in the White House.",
    "Trump said another person would be released on Wednesday, without identifying who it would be.",
    "He called the terms of Fogel’s release “very fair.” Fogel was released into the custody of Trump’s Middle East envoy, Steve Witkoff, who made an unannounced stop in Moscow on Tuesday to pick him up.",
    "On a plane home, Fogel, who is from Pennsylvania, was shown with a raised glass, a cheese plate and his US passport in a photo posted on social media by Trump’s chief hostage envoy Adam Boehler.",
    "Asked what the United States gave up in exchange for Fogel, Trump told reporters earlier: “Not much” and called the release a show of good faith from the Russians.",
    "“We were treated very nicely by Russia.",
    "Actually, I hope that’s the beginning of a relationship where we can end that (Ukraine) war and millions of people can stop being killed,” Trump said.",
    "Fogel was sentenced to 14 years in prison for drug smuggling after he was detained in Moscow’s Sheremetyevo airport in August 2021 with 17 grams of marijuana in his luggage.",
    "The marijuana had been medically prescribed in Pennsylvania, where it is legal, said Martin De Luca, a member of Fogel’s legal team.",
    "Witkoff’s plane was on the ground in Moscow for a few hours before leaving with Fogel onboard, flying through central Europe and back to Washington, De Luca told Reuters.",
    "“We are beyond grateful, relieved, and overwhelmed that after more than three years of detention, our father, husband, and son, Marc Fogel, is finally coming home,” the Fogel family said in a statement.",
    "“This has been the darkest and most painful period of our lives, but today, we begin to heal.” Dmitry Ovsyannikov, who had served as Fogel’s Russian lawyer in the past,told Russia’s Interfax news agency that Fogel was last week transferred from a prison in Rybinsk, north of Moscow, to a pre-trial detention center in Moscow ahead of his release.",
    "Fogel was left out of a historic swap of prisoners in August that involved 24 prisoners — 16 sent from Russia to the West, including Wall Street Journal reporter Evan Gershkovich, and eight sent back to Russia from the West.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Technology": 0.8611459732055664,
    "Diplomacy": 0.8477476239204407,
    "Politics": 0.8168311715126038,
    "Culture": 0.8066431283950806,
    "Education": 0.7346493005752563,
    "Economy": 0.711449384689331,
    "Health": 0.7048435211181641,
    "Conflict": 0.7033196687698364,
    "Transport": 0.6502634882926941,
    "Energy": 0.638717532157898,
    "Environment": 0.5633823275566101,
    "Military": 0.5628098249435425,
    "Elections": 0.552993893623352,
    "Crime": 0.36001506447792053
  },
  "sentiment": {
    "positive": 0.609,
    "negative": 0.391,
    "neutral": 0.0
  }
}