{
  "title": "Russia bans Elton John AIDS Foundation to defend 'spiritual and moral values'",
  "published_date": null,
  "url": "https://www.rappler.com/entertainment/celebrities/russia-bans-elton-john-aids-foundation-defend-moral-values/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – Russia’s general prosecutor on Thursday, April 3, banned the activities of the Elton John AIDS Foundation, accusing it of taking a negative stance towards countries like Russia that protect “traditional spiritual and moral values.” The prosecutor’s office said the ban applied specifically to two non-governmental organizations, one registered in the United States and the other in Britain and both called the Elton John AIDS Foundation.",
    "It officially designated them as “undesirable organizations.” The foundation was set up by Elton John, the gay British singer and songwriter who in the past has given sell-out concerts in Russia and spoken out against what he has said is unacceptable discrimination against gay people by the Russian authorities.",
    "President Vladimir Putin has rejected such assertions.",
    "He has cast Russia as a bastion of “traditional values” locked in an existential struggle with a decadent West.",
    "The Elton John AIDS Foundation said it was “devastated” by the decision, which it said would prevent it from providing lifesaving care to people living with HIV in Russia.",
    "“For more than two decades, we have worked in collaboration with federal and non-governmental partners in Russia to provide hundreds of thousands of people with vital HIV services, including testing, treatment, and care,” it said in a statement.",
    "“This work is urgent: in 2024, there were over 1.2 million people living with HIV in Russia, with over 430,000 not receiving treatment.",
    "Today’s decision…will undoubtedly endanger lives and disrupt critical HIV prevention efforts.” The prosecutor’s office cast the foundation as a malign influence on Russian society on its official Telegram channel.",
    "“When a musician plays along with the promoters of democracy, you get propaganda.",
    "And if Elton John is at the piano, it is not just anti-Russian propaganda,” it said.",
    "“The NGOs actively participate in an information campaign orchestrated by the ‘collective West’ to discredit traditional values and escalate social tensions,” it added.",
    "In a separate statement on its website, the prosecutor’s office complained about the foundation’s promotion of “non-traditional sexual relationships, Western family models, and gender reassignment”.",
    "Without citing examples, the statement accused the foundation of taking part in what it called a Western campaign to “denigrate Russia” over its war in Ukraine, which the prosecutor called a “special military operation.” Putin has encouraged women to have at least three children to battle a birth rate dip in the country, and a 2022 law widened a ban on “LGBT propaganda” to effectively ban any public expressions regarding homosexuality.",
    "In November, Russia’s lower house of parliament voted unanimously to ban what authorities cast as pernicious propaganda for a child-free way of life.",
    "In a mission statement on its website, the Elton John AIDS Foundation said it had raised more than $600 million to support over 3,100 projects in 95 countries globally to increase access to health care, tackle LGBTQ+ stigma, and end AIDS.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Culture": 0.7786815762519836,
    "Politics": 0.774954617023468,
    "Health": 0.7645002007484436,
    "Technology": 0.7394843697547913,
    "Economy": 0.7071177959442139,
    "Crime": 0.639015257358551,
    "Energy": 0.6232789754867554,
    "Conflict": 0.48408499360084534,
    "Elections": 0.48304736614227295,
    "Education": 0.4736923575401306,
    "Transport": 0.4682054817676544,
    "Environment": 0.4555184841156006,
    "Military": 0.4343087673187256,
    "Diplomacy": 0.4225093722343445
  },
  "sentiment": {
    "positive": 0.4,
    "negative": 0.6,
    "neutral": 0.0
  }
}