{
  "title": "Trump says he will speak with Putin on March 18 about ending war in Ukraine",
  "published_date": null,
  "url": "https://www.rappler.com/world/us-canada/donald-trump-speak-vladimir-putin-about-ending-ukraine-war/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "WASHINGTON, USA – US President Donald Trump said he plans to speak to Russian President Vladimir Putin on Tuesday, March 18, and discuss ending the war in Ukraine, after positive talks between US and Russian officials in Moscow.",
    "“We want to see if we can bring that war to an end,” Trump told reporters on Air Force One during a flight back to the Washington area from Florida.",
    "“Maybe we can, maybe we can’t, but I think we have a very good chance.",
    "“I’ll be speaking to President Putin on Tuesday.",
    "A lot of work’s been done over the weekend.” Trump is trying to win Putin’s support for a 30-day ceasefire proposal that Ukraine accepted last week, as both sides continued trading heavy aerial strikes through the weekend and Russia moved closer to ejecting Ukrainian forces from their months-old foothold in the western Russian region of Kursk.",
    "When asked about what concessions are being considered in ceasefire negotiations, Trump said: “We’ll be talking about land.",
    "We’ll be talking about power plants…We’re already talking about that, dividing up certain assets.” Trump did not elaborate but was most likely referring to the Russian-occupied Zaporizhzhia facility in Ukraine, Europe’s largest nuclear plant.",
    "Russia and Ukraine have accused each other of risking an accident at the plant with their actions.",
    "There was no immediate response from the Kremlin to a request for comment from Reuters.",
    "The Kremlin said on Friday that Putin had sent Trump a message about his ceasefire plan via US envoy Steve Witkoff, who held talks in Moscow, expressing “cautious optimism” that a deal could be reached to end the three-year conflict.",
    "In separate appearances on Sunday TV shows in the United States, Witkoff, Secretary of State Marco Rubio, and Trump’s national security adviser, Mike Waltz, emphasized that there were still challenges to be worked out before Russia agrees to a ceasefire, much less a final peaceful resolution to the war.",
    "Asked on ABC whether the US would accept a peace deal in which Russia was allowed to keep stretches of eastern Ukraine that it has seized, Waltz replied, “Are we going to drive every Russian off of every inch of Ukrainian soil?” He added that the negotiations had to be grounded in “reality.” Rubio told CBS a final peace deal would involve “concessions from both Russia and Ukraine,” and that it would be difficult to even begin those negotiations “as long as they’re shooting at each other”.",
    "An overnight Ukrainian drone attack targeted energy facilities in Russia’s southern Astrakhan region, injuring one person and sparking a fire, the regional governor said.",
    "Kyiv’s mayor said on Monday Russia had carried out an overnight drone attack on the Ukrainian capital.",
    "‘Ironclad’ guarantees Ukraine’s President Volodymyr Zelenskyy said on Friday that he saw a good chance to end the Russian war after Kyiv accepted the US proposal for a 30-day interim ceasefire.",
    "However, Zelenskyy has consistently said the sovereignty of his country is not negotiable and that Russia must surrender the territory it has seized.",
    "Russia seized the Crimea peninsula in 2014 and now controls most of four eastern Ukrainian regions since it invaded the country in 2022.",
    "Russia will seek “ironclad” guarantees in any peace deal that NATO nations exclude Kyiv from membership and that Ukraine will remain neutral, a Russian deputy foreign minister said in remarks published on Monday.",
    "In an interview with the Russian media outlet Izvestia that made no reference to the ceasefire proposal, Deputy Foreign Minister Alexander Grushko said that any long-lasting peace treaty on Ukraine must meet Moscow’s demands.",
    "“We will demand that ironclad security guarantees become part of this agreement,” Izvestia cited Grushko as saying.",
    "“Part of these guarantees should be the neutral status of Ukraine, the refusal of NATO countries to accept it into the alliance.” Putin has said his military incursion into Ukraine was because NATO’s creeping expansion threatened Russia’s security.",
    "He has demanded that Ukraine drop its NATO ambitions, that Russia keeps control of all Ukrainian territory seized, and that the size of the Ukrainian army be limited.",
    "He also wants Western sanctions eased and a presidential election in Ukraine, which Kyiv says is premature while martial law is in force.",
    "The European Union’s foreign policy chief, Kaja Kallas, said on Monday that the conditions demanded by Russia to agree to a ceasefire showed that Moscow does not really want peace.",
    "Peacekeepers Trump, who has upended US policy by shifting closer to Moscow, berated Zelenskyy in a meeting in Washington last month that ended with the Ukrainian leader leaving the White House early.",
    "But Ukraine’s acceptance of a proposed ceasefire has now put the onus on Russia to cede to Trump’s demands and will test the US president’s more positive view of Putin.",
    "British Prime Minister Keir Starmer said on Saturday that Western allies other than the US were stepping up preparations to support Ukraine in the event of a ceasefire with Russia, with defense chiefs set to firm up “robust plans” next week.",
    "Britain and France both have said that they are willing to send a peacekeeping force to monitor any ceasefire in Ukraine.",
    "Russia has ruled out peacekeepers until the war has ended.",
    "“If they appear there, it means that they are deployed in the conflict zone with all the consequences for these contingents as parties to the conflict,” Russia’s Grushko said.",
    "“We can talk about unarmed observers, a civilian mission that would monitor the implementation of individual aspects of this agreement, or guarantee mechanisms.",
    "In the meantime, it’s just hot air.” – Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Politics": 0.9111770391464233,
    "Education": 0.9086611866950989,
    "Military": 0.9081224203109741,
    "Conflict": 0.8992987871170044,
    "Culture": 0.8886619210243225,
    "Environment": 0.8881452083587646,
    "Diplomacy": 0.8799725770950317,
    "Transport": 0.866559624671936,
    "Energy": 0.8658461570739746,
    "Health": 0.8285154104232788,
    "Economy": 0.8231024742126465,
    "Technology": 0.8146072626113892,
    "Crime": 0.8019428849220276,
    "Elections": 0.7905831336975098
  },
  "sentiment": {
    "positive": 0.361,
    "negative": 0.639,
    "neutral": 0.0
  }
}