{
  "title": "Russia says it will definitely respond to Ukraine's latest ATACMS strike",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/russia-will-respond-ukraine-latest-atacms-strike/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – Russia will definitely respond to Ukraine’s latest use of US-made ATACMS missiles to strike Russian territory, the Kremlin said on Thursday, December 12.",
    "Russia said on Wednesday that Ukraine had struck a military airfield on the Azov Sea with six US-made ATACMS ballistic missiles, a move that could prompt Moscow to launch another experimental intermediate-range hypersonic missile at Ukraine.",
    "Russia’s defense ministry said on Wednesday that the “attack by Western long-range weapons will not go unanswered and appropriate measures will be taken.” It is unclear exactly how Russia will respond.",
    "“I would like to recall the absolutely unambiguous and direct statement of the defense ministry of the Russian Federation made yesterday, where it was clearly stated that a response would follow,” Kremlin spokesman Dmitry Peskov said.",
    "“The response will follow in a manner deemed appropriate.",
    "But it will definitely follow,” Peskov said.",
    "Russia fired a new intermediate-range hypersonic ballistic missile known as “Oreshnik”, or Hazel Tree, at Ukraine on November 21 in what President Vladimir Putin said was a direct response to strikes on Russia by Ukrainian forces with US and British missiles.",
    "A US official said on Wednesday that Russia could launch another hypersonic ballistic missile against Ukraine in the coming days, but Washington does not consider the Oreshnik weapon a game-changer in the war.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Conflict": 0.7929596304893494,
    "Technology": 0.650055468082428,
    "Military": 0.5356336832046509,
    "Culture": 0.52756667137146,
    "Economy": 0.45905548334121704,
    "Diplomacy": 0.44845011830329895,
    "Transport": 0.4304729700088501,
    "Politics": 0.4056546092033386,
    "Environment": 0.37700486183166504,
    "Energy": 0.37024664878845215,
    "Health": 0.2645437717437744,
    "Crime": 0.24017390608787537,
    "Education": 0.2298876792192459,
    "Elections": 0.10883945226669312
  },
  "sentiment": {
    "positive": 0.462,
    "negative": 0.538,
    "neutral": 0.0
  }
}