{
  "title": "Ukraine kills top Russian general in Moscow it accuses of chemical weapons crimes",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/ukraine-kills-russian-general-igor-kirillov/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – A top Russian general accused by Ukraine of being responsible for the use of chemical weapons against Ukrainian troops was assassinated in Moscow by Ukraine’s SBU intelligence service on Tuesday morning, December 17, in the most high-profile killing of its kind.",
    "Lieutenant General Igor Kirillov, who was chief of Russia’s Nuclear, Biological and Chemical Protection Troops, was killed outside an apartment building along with his assistant when a bomb hidden in an electric scooter went off, Russia’s Investigative Committee, which probes serious crimes, said.",
    "An SBU source confirmed to Reuters that the Ukrainian intelligence agency had been behind the hit.",
    "“The liquidation of the chief of the radiation and chemical protection troops of the Russian Federation is the work of the SBU,” the source said.",
    "The source said that a scooter containing explosives was detonated, killing both Kirillov and his aide, as they stepped into the entrance of a house on Ryazansky Prospekt in Moscow.",
    "Kirillov, 54, is the most senior Russian military officer to be assassinated inside Russia by Ukraine and his murder is likely to prompt the Russian authorities to review security protocols for the army’s top brass and to find a way to avenge his killing.",
    "Former president Dmitry Medvedev, now a senior Russian security official, was cited by the state RIA news agency as saying that Ukraine’s military and political leadership now faced imminent revenge for Kirillov’s murder.",
    "Moscow holds Ukraine responsible for a string of high-profile assassinations on its soil designed to weaken morale and punish those Kyiv regards guilty of war crimes.",
    "Ukraine, which says Russia’s war against it poses an existential threat to the Ukrainian state, has made clear it regards such targeted killings as a legitimate tool.",
    "Reuters photographs and video from the scene showed a shattered entrance to an apartment building with bomb-blackened bricks and the doors hanging off their hinges and what looked like two bodies lying beneath black plastic sheets on the snow.",
    "Investigators said they had opened a criminal case into the murder of two servicemen.",
    "Law enforcement sources told Russian media a terrorism case was likely to be opened.",
    "Kirillov worked ‘fearlessly for the motherland’ Russia denies Ukrainian allegations it uses chemical weapons on the battlefield and Kirillov, who was married with two sons, was himself sometimes shown on state TV giving briefings at the Defence Ministry in which he accused Ukraine of violating nuclear safety protocols or the West of various alleged crimes.",
    "Maria Zakharova, a spokeswoman for Russia’s Foreign Ministry, paid tribute to Kirillov, saying he had worked “fearlessly” for “the Motherland” to expose what she said were the West’s chemical weapons-related and other crimes and what Moscow says were cover-ups in Syria and elsewhere.",
    "Britain in October imposed sanctions on Kirillov and his nuclear defence forces for using riot control agents and over multiple reports of the use of the toxic choking agent chloropicrin on the battlefield.",
    "Such agents, Ukraine has alleged, are used to disorientate its troops leaving them unable to defend themselves against Russian attacks.",
    "Kirillov was murdered a day after Ukrainian state prosecutors were reported to have charged him in absentia with the alleged use of banned chemical weapons, the Kyiv Independent cited the SBU as saying at the time.",
    "The Lieutenant General was also listed in a sprawling unofficial Ukrainian database of people considered to be enemies of the country called Myrotvorets (Peacemaker).",
    "A photograph of Kirillov on the website was overwritten with the word “Liquidated” in red letters on Tuesday morning.",
    "Russia says Ukraine has carried out a string of targeted assassinations on its soil since the start of Moscow’s full-scale war on Ukraine in February 2022.",
    "The most high-profile cases include the 2022 killing of Darya Dugina, the daughter of Russian nationalist ideologue Alexander Dugin, in a car bomb attack, the murder of pro-war blogger Vladlen Tatarsky in a 2023 cafe bombing, and the shooting last year of a Russian submarine commander accused of war crimes by Kyiv.",
    "Russia’s radioactive, chemical and biological defense troops, known as RKhBZ, which Kirillov commanded, are special forces who operate under conditions of radioactive, chemical and biological contamination and who are tasked with protecting ground forces operating in extreme conditions.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Conflict": 0.895128071308136,
    "Technology": 0.868399441242218,
    "Politics": 0.8539658188819885,
    "Culture": 0.8328633904457092,
    "Diplomacy": 0.8264896869659424,
    "Environment": 0.8247459530830383,
    "Health": 0.7878299951553345,
    "Energy": 0.7786334753036499,
    "Economy": 0.7743232250213623,
    "Crime": 0.7435169816017151,
    "Military": 0.7095404267311096,
    "Education": 0.6640359163284302,
    "Transport": 0.6607776880264282,
    "Elections": 0.6460577249526978
  },
  "sentiment": {
    "positive": 0.185,
    "negative": 0.815,
    "neutral": 0.0
  }
}