{
  "title": "FACT CHECK: No statement from Putin backing calls for Mindanao secession",
  "published_date": null,
  "url": "https://www.rappler.com/newsbreak/fact-check/russia-no-statement-vladimir-putin-backs-calls-mindanao-secession/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "Claim: Russian President Vladimir Putin supports calls for an independent Mindanao.",
    "Rating: FALSE Why we fact-checked this: The TikTok video containing the claim has 1.2 million views, 92,700 likes, 2,123 shares, and 12,600 comments as of writing.",
    "Text in the video states: “Ready na ba [kayo] taga Mindanao na magiging independent country na [tayo]?",
    "The most supporter [sic] president in Russia, Putin to be independent country in Mindanao.” (Are you ready, people of Mindanao, for us to become an independent country?",
    "Putin, the president of Russia, is the biggest supporter of Mindanao becoming an independent country.)",
    "Some social media users seem to believe the video, posting comments like “Yes to the Republic of Mindanao!” and “Yes to Mindanao’s independence!” The facts: No documented evidence, official government statement, or credible news report shows that Putin has expressed support for Mindanao becoming an independent country.",
    "The TikTok post merely shows a photo of Putin and Philippine Vice President Sara Duterte with the superimposed text but provides no evidence or reliable sources to back up this claim.",
    "Russia’s stance: According to analysts, Russia selectively supports separatist movements and ultra-nationalist parties to promote its geopolitical interests.",
    "In 2022, Putin recognized the two Russian-backed separatist regions of eastern Ukraine as independent entities, with analysts saying this move could be used as a pretext for war.",
    "Russia has since invaded Ukraine, with the ongoing crisis considered as the biggest attack by one state against another in Europe since World War Two.",
    "Secession calls: In February 2024, former president Rodrigo Duterte called for Mindanao’s independence after accusing the Marcos administration of being behind the so-called people’s initiative to amend the 1987 Constitution and perpetuate the Marcos family in power.",
    "The former president later walked back his remarks after Mindanao leaders and President Ferdinand Marcos Jr. opposed the secession calls, citing concerns over national stability.",
    "Duterte-Marcos rift: The misleading video surfaced amid rising tensions between the Marcoses and Dutertes.",
    "After forming an alliance to secure electoral victories in 2022, the relationship between the country’s top officials has since deteriorated.",
    "Duterte, who resigned from Marcos’ Cabinet in June 2024, has since criticized his administration for its handling of national issues.",
    "The Vice President now faces three impeachment complaints accusing her of financial mismanagement and betrayal of public trust.",
    "This follows congressional inquiries into her use of confidential funds and her assassination threat against Marcos.",
    "False claims: Amid the controversy surrounding the Vice President, several posts on social media have circulated alleging shows of support for her.",
    "Rappler has recently debunked a claim that North Korea had expressed support for Duterte.",
    "Other posts misrepresented mass gatherings and public events as pro-Duterte protests: - FACT CHECK: No rally in New York opposing impeachment bids vs Sara Duterte - FACT CHECK: Video shows 2016 protest in South Korea, not pro-Duterte INC rally - FACT CHECK: Videos show 2023 jeepney phaseout protests, not pro-Duterte rally – Marjuice Destinado/Rappler.com Marjuice Destinado is a Rappler intern.",
    "She is a third-year political science student at Cebu Normal University (CNU), serving as feature editor of Ang Suga, CNU’s official student publication.",
    "Keep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com.",
    "Let us battle disinformation one Fact Check at a time.",
    "Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Politics": 0.9379320740699768,
    "Conflict": 0.9068788886070251,
    "Culture": 0.8936887383460999,
    "Elections": 0.8359752893447876,
    "Health": 0.8282739520072937,
    "Economy": 0.8273383975028992,
    "Technology": 0.8217675089836121,
    "Transport": 0.7784734964370728,
    "Military": 0.7421072721481323,
    "Diplomacy": 0.7124993801116943,
    "Crime": 0.676128625869751,
    "Environment": 0.658580482006073,
    "Energy": 0.5496994853019714,
    "Education": 0.5373829007148743
  },
  "sentiment": {
    "positive": 0.143,
    "negative": 0.857,
    "neutral": 0.0
  }
}