{
  "title": "Russia's Putin apologizes to Azerbaijan over 'tragic' airliner crash",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/vladimir-putin-apologizes-azerbaijan-president-plane-incident-russian-airspace/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – Russian President Vladimir Putin on Saturday, December 28, apologized to Azerbaijan‘s leader for what the Kremlin called a “tragic incident” over Russia in which an Azerbaijan Airlines plane crashed after Russian air defenses were fired against Ukrainian drones.",
    "The extremely rare publicized apology from Putin was the closest Moscow had come to accepting some blame for Wednesday’s disaster, although the Kremlin statement did not say Russia had shot down the plane, only noting that a criminal case had been opened.",
    "Flight J2-8243, en route from Baku to the Chechen capital Grozny, crash-landed on Wednesday, December 25, near Aktau in Kazakhstan after diverting from southern Russia, where Ukrainian drones were reported to be attacking several cities.",
    "At least 38 people were killed.",
    "Four sources with knowledge of the preliminary findings of Azerbaijan’s investigation told Reuters on Thursday, December 26, that Russian air defenses had mistakenly shot it down.",
    "Passengers said they heard a loud bang outside the plane.",
    "Putin called President Ilham Aliyev and “apologized for the tragic incident that occurred in Russian airspace and once again expressed his deep and sincere condolences to the families of the victims and wished a speedy recovery to the injured,” the Kremlin said.",
    "“At that time, Grozny, Mozdok, and Vladikavkaz were being attacked by Ukrainian unmanned aerial vehicles, and Russian air defense systems repelled these attacks.” The Kremlin said “civilian and military specialists” were being questioned.",
    "Putin also phoned Kassym-Jomart Tokayev, his counterpart in Kazakhstan, to express his condolences over the loss of life in the crash, the Kremlin said.",
    "On Saturday, US President Joe Biden responded to a shouted question about whether Putin should take responsibility for the crash while he was leaving church in St. Croix in the US Virgin Islands, where he is on vacation.",
    "“Apparently he did, but I haven’t spoken to him or my team,” Biden replied.",
    "The White House said on Friday it had seen early indications suggesting the airliner was possibly brought down by Russian air defense systems and added that Washington had offered assistance to the investigation into the crash.",
    "MSNBC on Friday cited two unidentified US military sources as saying that there was American intelligence that Russia may have mistakenly shot down the airliner after misidentifying it as an incoming drone.",
    "Ukrainian President Volodymyr Zelenskiy also said he had called Aliyev to offer condolences, and in his statement on the X platform demanded that Russia provide “clear explanations.” Objects smashed through airplane’s fuselage Azerbaijan for its part said Aliyev had noted to Putin that the plane had been “subjected to external physical and technical interference in Russian airspace, resulting in a complete loss of control and redirection to the Kazakh city of Aktau.” Until Saturday, Russia’s last working day before a long New Year holiday, the Kremlin had said it was improper to comment on the incident before official investigations were concluded.",
    "The Embraer jet had flown from Azerbaijan’s capital Baku to Grozny, in Russia’s southern Chechnya region, where the incident occurred, and then travelled, badly damaged, another 280 miles (450 km) across the Caspian Sea.",
    "Footage shot by passengers before the plane crashed showed oxygen masks down and people wearing life jackets.",
    "Later videos showed bloodied and bruised passengers climbing out of the wreckage.",
    "There were 29 survivors.",
    "Baku cited injuries from objects that had penetrated the aircraft’s fuselage from outside and testimonies from survivors as evidence of “external physical and technical interference”.",
    "The crash underscored the risks to civil aviation even when aircraft are flying hundreds of miles from a war zone, especially when Ukraine has deployed drones en masse to try to hit back at Russia behind the front lines.",
    "Russia uses electronic jamming to confuse the geolocation and communication systems of Ukrainian drones, which it also targets with air defence systems.",
    "In 2020, Iranian Revolutionary Guards mistakenly shot down a Ukrainian airliner, killing all 176 on board.",
    "And in 2014, Malaysian Airlines Flight MH17 was shot down over eastern Ukraine, with the loss of 298 passengers and crew, by what Dutch investigators said was a Russian BUK missile system.",
    "Russia denied involvement.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Diplomacy": 0.8383210897445679,
    "Conflict": 0.7944365739822388,
    "Culture": 0.7938868403434753,
    "Technology": 0.7667179107666016,
    "Environment": 0.7421314716339111,
    "Health": 0.7293391227722168,
    "Energy": 0.711040735244751,
    "Economy": 0.7076744437217712,
    "Transport": 0.6952296495437622,
    "Elections": 0.6841191053390503,
    "Crime": 0.6512051820755005,
    "Military": 0.6152941584587097,
    "Politics": 0.6071757674217224,
    "Education": 0.5853806734085083
  },
  "sentiment": {
    "positive": 0.138,
    "negative": 0.862,
    "neutral": 0.0
  }
}