{
  "title": "Russia in contact with Syrian rebels, hopes to keep military bases, Interfax reports",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/russia-contact-syria-rebels-hope-keep-military-bases/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – Russia has established direct contact with the political committee of Syria’s Islamist rebel group, Hayat Tahrir al-Sham, the Interfax news agency quoted Russian Deputy Foreign Minister Mikhail Bogdanov as saying on Thursday, December 12.",
    "Interfax reported that Bogdanov, speaking to journalists, also said Moscow aimed to maintain its military bases in Syria.",
    "Bogdanov said contacts with HTS, the most powerful force in the country after the overthrow of President Bashar al-Assad, were “proceeding in constructive fashion”.",
    "Russia, he said, hoped the group would fulfil its pledges to “guard against all excesses”, maintain order and ensure the safety of diplomats and other foreigners.",
    "Bogdanov said Russia hoped to maintain its two bases in Syria — a naval base in Tartous and the Khmeimim Air Base near the port city of Latakia — to keep up efforts against international terrorism.",
    "“The bases are still there, where they were on Syrian territory.",
    "No other decisions have been made for the moment,” he was quoted as saying.",
    "“They were there at the Syrians’ request with the aim of fighting terrorists from the Islamic State.",
    "I am proceeding on the basis of the notion that everyone agrees that the fight against terrorism, and what remains of IS, is not over.” Maintaining that fight, he said, “requires collective efforts and in this connection, our presence and the Khmeimim base played an important role in the context of the overall fight against international terrorism.” Another Russian Deputy Foreign Minister, Sergei Vershinin, and the UN’s special envoy for Syria Geir Pedersen, called for measures to stabilize the situation in and around Syria, according to a statement on the foreign ministry’s website.",
    "The statement said the two diplomats discussed by telephone finding a political settlement in a way to be determined by the Syrian people and ensuring Syria’s sovereignty and territorial integrity.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Technology": 0.942753255367279,
    "Diplomacy": 0.8518454432487488,
    "Conflict": 0.8495805859565735,
    "Military": 0.8408413529396057,
    "Culture": 0.8062681555747986,
    "Politics": 0.7910996079444885,
    "Economy": 0.7478025555610657,
    "Transport": 0.7426425218582153,
    "Environment": 0.7033597826957703,
    "Health": 0.6966654062271118,
    "Energy": 0.6593282222747803,
    "Elections": 0.6091283559799194,
    "Education": 0.5734518766403198,
    "Crime": 0.4203413128852844
  },
  "sentiment": {
    "positive": 0.4,
    "negative": 0.6,
    "neutral": 0.0
  }
}