{
  "title": "Ukraine to present partial truce after row",
  "published_date": null,
  "url": "https://manilastandard.net/news/314567383/ukraine-to-present-partial-truce-after-row.html",
  "original_language": "en",
  "cleaned_sentences": [
    "JEDDAH – Ukraine will present the United States on Tuesday with a plan for a partial ceasefire with Russia, hoping to restore support from its key benefactor, which under President Donald Trump has demanded concessions to end the three-year war.",
    "The talks in Saudi Arabia will be the most senior since a disastrous White House meeting on February 28, when Trump berated Ukraine’s President Volodymyr Zelenskyy for purported ingratitude.",
    "Since Trump’s dressing down of Zelenskyy, Washington has suspended military aid to Ukraine as well as intelligence sharing and access to satellite imagery in a bid to force it to the negotiating table.",
    "Zelenskyy, who wrote a repentant letter to Trump, flew to the port city of Jeddah to meet Saudi rulers, but was leaving the talks to three top aides.",
    "US Secretary of State Marco Rubio, who will be joined by Trump’s national security advisor Mike Waltz, said the aid suspension was “something I hope we can resolve” in the talks on Tuesday.",
    "“Hopefully, we’ll have a good meeting and good news to report,” Rubio said.",
    "Rubio said that the United States had not cut off intelligence for defensive operations.",
    "Zelenskyy left the White House without signing an agreement demanded by Trump that would give the United States access to much of Ukraine’s mineral wealth as compensation for past weapons supplies.",
    "Zelensky has said he is still willing to sign, although Rubio said it would not be the focus of Tuesday’s talks.",
    "Russia has since ramped up its attacks, striking hard against Ukrainian infrastructure and taking back villages in its Kursk region that Ukraine had captured in a bid for bargaining leverage.",
    "In the White House meeting, Zelenskyy refused to bite his tongue in the face of criticism from Vice President JD Vance, with the Ukrainian leader questioning why his country should trust promises from Russia which launched a full-scale invasion in 2022 despite previous diplomacy.",
    "But faced with Washington’s pressure, Ukraine will lay out its support for a limited ceasefire.",
    "“We do have a proposal for a ceasefire in the sky and ceasefire at sea,” a Ukrainian official told AFP on Monday, speaking on condition of anonymity.",
    "“Because these are the ceasefire options that are easy to install and to monitor, and it’s possible to start with them.” Rubio signalled that the Trump administration would likely be pleased by such a proposal.",
    "“I’m not saying that alone is enough, but it’s the kind of concession you would need to see in order to end the conflict,” he told reporters.",
    "“You’re not going to get a ceasefire and an end to this war unless both sides make concessions.” “The Russians can’t conquer all of Ukraine and obviously it will be very difficult for Ukraine in any reasonable time period to force the Russians all the way back to where they were back in 2014,” Rubio said, referring to the time of a partial offensive and Russian seizure of the Crimea peninsula.",
    "In a meeting with Saudi Crown Prince Mohammed bin Salman ahead of the US-Ukraine talks, Zelensky discussed Ukraine’s conditions for any permanent peace deal, including the release of prisoners and the return of children Kyiv accuses Moscow of abducting, the Ukrainian leader’s office said in a statement Monday.",
    "The two leaders “discussed the possible mediation of Saudi Arabia in the release of military and civilian prisoners and the return of deported children”, the statement said.",
    "“The leaders exchanged views on the formats of security guarantees and what they should be for Ukraine so that war does not return again.” Rubio said he did not expect to sit in a room in Jeddah with the Ukrainians “drawing lines on a map” towards a final deal.",
    "But Rubio said he would bring the ideas back to Russia.",
    "Rubio and Waltz met last month, also in Saudi Arabia, with counterparts from Russia, ending a freeze in high-level contacts imposed by former president Joe Biden after Russia defied Western warnings and launched its invasion.",
    "Trump last week also threatened further sanctions against Russia to force it to the table as it carried out strikes on Ukraine.",
    "But Trump’s abrupt shift in US policy has stunned many allies.",
    "Rubio said the United States was objecting to “antagonistic” language on Russia at a gathering of Group of Seven foreign ministers later this week in Canada.",
    "German Foreign Minister Annalena Baerbock called the scene from the White House “unspeakable” and described a “new age of infamy” that will require Europeans to shoulder more responsibility.",
    "French senator Claude Malhuret, in a speech that went viral in the United States even in translation, said that Trump had failed to see through Kremlin propaganda and that Russia was failing in Ukraine, picking up only small pockets of land after three years attacking a smaller country.",
    "“The American lifeline to Putin is the biggest strategic mistake ever made during a war,” he said."
  ],
  "topics": {
    "Conflict": 0.9695336222648621,
    "Politics": 0.9586348533630371,
    "Energy": 0.9196203947067261,
    "Economy": 0.9076259732246399,
    "Diplomacy": 0.8999496698379517,
    "Environment": 0.8885817527770996,
    "Culture": 0.8761087656021118,
    "Transport": 0.8583648204803467,
    "Military": 0.8580856919288635,
    "Health": 0.8411606550216675,
    "Elections": 0.8373864889144897,
    "Education": 0.8261435627937317,
    "Technology": 0.8190063238143921,
    "Crime": 0.7849788069725037
  },
  "sentiment": {
    "positive": 0.444,
    "negative": 0.556,
    "neutral": 0.0
  }
}