{
  "title": "Trump bashes Zelenskyy for invasion",
  "published_date": null,
  "url": "https://manilastandard.net/news/314559604/trump-bashes-zelenskyy-for-invasion.html",
  "original_language": "en",
  "cleaned_sentences": [
    "PALM BEACH – US President Donald Trump has effectively blamed Ukrainian leader Volodymyr Zelenskyy for Russia’s invasion, as French President Emmanuel Macron prepares for another round of talks with EU and non-European partners on Wednesday.",
    "Zelenskyy previously criticized the US-Russia talks for excluding Kyiv, saying efforts to end the war must be “fair and involve European countries.",
    "The Ukrainian leader’s comments appeared to incense Trump, who launched a series of verbal attacks on Zelenskyy.",
    "“I’m very disappointed, I hear that they’re upset about not having a seat,” Trump told reporters at his Mar-a-Lago resort in Florida on Tuesday.",
    "“Today I heard, ‘oh, well, we weren’t invited.’ Well, you’ve been there for three years… You should have never started it.",
    "You could have made a deal.” Trump also suggested he could meet Russian President Vladimir Putin before the end of the month in Saudi Arabia as he overhauls Washington’s stance towards Moscow — a shift that has alarmed European leaders.",
    "Earlier Tuesday, Russia and the United States had agreed to establish teams to negotiate a path to ending the war in Ukraine after talks that drew a strong rebuke from Kyiv, with Zelenskyy postponing his own trip to Saudi Arabia.",
    "France’s Macron announced another meeting in Paris on Ukraine after the US-Russia talks, adding that Trump “can restart a useful dialogue” with Putin.",
    "Trump also increased pressure on Zelenskyy to hold elections — echoing one of Moscow’s key demands.",
    "Asked whether the United States would support demands that Russia wanted to force Zelenskyy to hold new elections as part of any deal, Trump began by criticizing what he said were the Ukrainian’s approval ratings.",
    "“They want a seat at the table, but you could say… wouldn’t the people of Ukraine have a say?",
    "It’s been a long time since we’ve had an election,” said Trump.",
    "“That’s not a Russian thing, that’s something coming from me, from other countries.” Zelenskyy was elected in 2019 for a five-year term, but has remained in office as Ukraine is still under martial law.",
    "Trump’s latest remarks are unlikely to allay fears among some European leaders, already worried that Washington will make serious concessions to Moscow and re-write the continent’s security arrangement in a Cold War-style deal.",
    "Washington noted European nations would have to have a seat at the negotiating table “at some point”.",
    "The US-Russia talks — the first high-level official talks between the two countries since the 2022 invasion of Ukraine — drew a fiery response from Kyiv.",
    "“This will only be feeding Putin’s appetite,” a Ukrainian senior official requesting anonymity told AFP, referring to the launch of talks without Ukraine.",
    "Trump for his part said he was “much more confident” of a deal after the Riyadh talks, telling reporters Tuesday at his Mar-a-Lago estate: “I think I have the power to end this war.” US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov agreed to “appoint respective high-level teams to begin working on a path to ending the conflict in Ukraine as soon as possible”, the State Department said.",
    "Washington added that the sides had also agreed to “establish a consultation mechanism” to address “irritants” to the US-Russia relationship, noting the sides would lay the groundwork for future cooperation.",
    "Riyadh marks a diplomatic coup for Moscow, which had been isolated for three years under the previous US administration of Joe Biden.",
    "Moscow’s economic negotiator, Kirill Dmitriev, said Western attempts to isolate Russia had “obviously failed”.",
    "“We did not just listen but heard each other, and I have reason to believe the American side has better understood our position,” Lavrov told reporters.",
    "The veteran diplomat noted that Russia opposed any deployment of NATO-nation troops to Ukraine as part of an eventual ceasefire.",
    "European allies publicly diverged this week over whether they would be open to sending truce peacekeepers to Ukraine.",
    "Macron, in an interview with French regional newspapers, appeared open to the idea of sending troops to Ukraine but only in the most limited fashion and away from conflict zones.",
    "He said new talks would take place “with several European and non-European states”, after an emergency meeting on Monday in Paris which brought together a small number of key European countries.",
    "Moscow has long called for the withdrawal of NATO forces from eastern Europe, viewing the alliance as an existential threat on its flank.",
    "The Kremlin on Tuesday said Ukraine had the right to join the European Union, but not the NATO military alliance.",
    "It also said Putin was “ready” to negotiate with Zelenskyy “if necessary.”"
  ],
  "topics": {
    "Diplomacy": 0.7776983976364136,
    "Politics": 0.7319684624671936,
    "Energy": 0.6784042119979858,
    "Conflict": 0.6585079431533813,
    "Environment": 0.6425238847732544,
    "Technology": 0.6349779963493347,
    "Education": 0.6174098253250122,
    "Transport": 0.5892863273620605,
    "Culture": 0.5678499341011047,
    "Economy": 0.5602940917015076,
    "Military": 0.519855797290802,
    "Elections": 0.4650314748287201,
    "Health": 0.4556530714035034,
    "Crime": 0.436197429895401
  },
  "sentiment": {
    "positive": 0.517,
    "negative": 0.483,
    "neutral": 0.0
  }
}