{
  "title": "Crashed jetliner was shot down by Russia unintentionally",
  "published_date": null,
  "url": "https://www.sunstar.com.ph/network/azerbaijans-president-says-crashed-jetliner-was-shot-down-by-russia-unintentionally",
  "original_language": "en",
  "cleaned_sentences": [
    "Azerbaijan’s President Ilham Aliyev said Sunday that the Azerbaijani airliner that crashed last week was shot down by Russia, albeit unintentionally, and criticized Moscow for trying to “hush up” the issue for days.",
    "Related story: Plane crash in Kazakhstan kills 38 \"We can say with complete clarity that the plane was shot down by Russia.",
    "(...) We are not saying that it was done intentionally, but it was done,” he told Azerbaijani state television.",
    "Aliyev said that the airliner, which crashed Wednesday in Kazakhstan, was hit by fire from the ground over Russia and “rendered uncontrollable by electronic warfare.\"",
    "Aliyev accused Russia of trying to “hush up” the issue for several days, saying he was “upset and surprised” by versions of events put forward by Russian officials.",
    "“Unfortunately, for the first three days we heard nothing from Russia except delirious versions,” he said.",
    "The crash killed 38 of 67 people on board.",
    "The Kremlin said that air defense systems were firing near Grozny, the regional capital of the Russian republic of Chechnya, where the plane attempted to land, to deflect a Ukrainian drone strike.",
    "Aliyev said Azerbaijan made three demands to Russia in connection with the crash.",
    "“First, the Russian side must apologize to Azerbaijan.",
    "Second, it must admit its guilt.",
    "Third, punish the guilty, bring them to criminal responsibility and pay compensation to the Azerbaijani state, the injured passengers and crew members,” he said.",
    "Aliyev noted that the first demand was “already fulfilled” when Russian President Vladimir Putin apologized to him on Saturday.",
    "Putin called the crash a “tragic incident\" though stopped short of acknowledging Moscow’s responsibility.",
    "He said that an investigation into the crash was ongoing, and that “the final version (of events) will be known after the black boxes are opened.” He noted that Azerbaijan was always “in favor of a group of international experts” investigating the crash, and had “categorically refused” Russia’s suggestion that the Interstate Aviation Committee, which oversees civil aviation in the Commonwealth of Independent States, investigate it.",
    "“It is no secret that this organization consists mostly of Russian officials and is headed by Russian citizens.",
    "The factors of objectivity could not be fully ensured here,” Aliyev said.",
    "Kremlin spokesman Dmitry Peskov told Russian state media on Sunday that Putin had spoken to Aliyev over the phone again, but did not provide details of the conversation.",
    "The Kremlin also said a joint investigation by Russia, Azerbaijan and Kazakhstan was underway at the crash site near the city of Aktau in Kazakhstan.",
    "The plane was flying from Azerbaijan’s capital, Baku, to Grozny when it turned toward Kazakhstan, hundreds of kilometers (miles) across the Caspian Sea from its intended destination, and crashed while making an attempt to land.",
    "Passengers and crew who survived the crash told Azerbaijani media that they heard loud noises on the aircraft as it was circling over Grozny.",
    "Dmitry Yadrov, head of Russia’s civil aviation authority Rosaviatsia, said Friday that as the plane was preparing to land in Grozny in deep fog, Ukrainian drones were targeting the city, prompting authorities to close the area to air traffic.",
    "The crash is the second deadly civil aviation accident linked to fighting in Ukraine.",
    "Malaysia Airlines Flight 17 was downed with a Russian surface-to-air missile, killing all 298 people aboard, as it flew over the area in eastern Ukraine controlled by Moscow-backed separatists in 2014.",
    "Russia has denied responsibility, but a Dutch court in 2022 convicted two Russians and a pro-Russia Ukrainian man for their role in downing the plane with an air defense system brought into Ukraine from a Russian military base."
  ],
  "topics": {
    "Conflict": 0.9046028256416321,
    "Culture": 0.8573599457740784,
    "Crime": 0.7665577530860901,
    "Politics": 0.7619419693946838,
    "Military": 0.7324876189231873,
    "Technology": 0.7158367037773132,
    "Economy": 0.7127212882041931,
    "Health": 0.6759175658226013,
    "Environment": 0.6010050177574158,
    "Transport": 0.5754009485244751,
    "Energy": 0.5219609141349792,
    "Diplomacy": 0.44766780734062195,
    "Elections": 0.3950574994087219,
    "Education": 0.26756247878074646
  },
  "sentiment": {
    "positive": 0.08,
    "negative": 0.92,
    "neutral": 0.0
  }
}