{
  "title": "Kyiv, Moscow to hold direct 1st talks",
  "published_date": null,
  "url": "https://manilastandard.net/news/world-news/314590622/kyiv-moscow-to-hold-direct-1st-talks.html",
  "original_language": "en",
  "cleaned_sentences": [
    "ISTANBUL, Turkey – War rivals Ukraine and Russia are set to go into their first direct talks in more than three years on Thursday, with Russian President Vladimir Putin not included on the list of attendees.",
    "Ukraine’s President Volodymyr Zelenskyy had challenged Putin to meet him in person in Istanbul, but the Russian delegation names only a lower-level team.",
    "Putin’s absence would diminish the importance of the first direct negotiations since a failed effort in the weeks after Russia’s 2022 invasion.",
    "Tens of thousands have been killed since the offensive started in February 2022.",
    "Russia has occupied about a fifth of Ukraine’s territory in what is now Europe’s worst conflict since World War II.",
    "Putin had proposed holding talks on May 15 in Istanbul as a counter-offer after Ukraine and European nations last week called for a 30-day unconditional ceasefire.",
    "Zelenskyy agreed, but said this week that if Putin did not attend himself, it would signal he was not genuinely interested in peace.",
    "“This is his war… Therefore, the negotiations should be with him,” Zelenskyy said.",
    "The Kremlin delegation is set to be headed by Vladimir Medinsky, a hardline aide to Putin and ex-culture minister who was involved in the 2022 negotiations.",
    "Putin, Foreign Minister Sergei Lavrov and Kremlin foreign policy aide Yuri Ushakov — who had all been rumored as top negotiators after leading previous talks with the United States — were not named in the Kremlin’s delegation list.",
    "Medinsky is seen as influential in advancing Russia’s historical claims over Ukrainian territory.",
    "The other three negotiators were named as Deputy Foreign Minister Mikhail Galuzin, Deputy Defence Minister Alexander Fomin and Igor Kostyukov, director of Russia’s GRU military intelligence agency.",
    "European leaders have said new sanctions will be quickly imposed on Russia if the Istanbul talks do not produce results.",
    "On the eve of the talks, Zelenskyy said he would decide Ukraine’s next “steps” based on who represents Moscow.",
    "“Ukraine is ready for any format of negotiations, and we are not afraid of meetings.",
    "Tomorrow – in Turkey,” Zelenskyy said.",
    "“I am waiting to see who will arrive from Russia.",
    "Then I will decide what steps Ukraine should take.” Russia insists the talks address what it calls the “root causes” of the conflict, including the “denazification” and demilitarisation of Ukraine, two vague terms Moscow has used to justify its invasion.",
    "It has also repeated that Ukraine must cede territory occupied by Russian troops.",
    "Kyiv said it will not recognize its territories as Russian — though Zelensky has acknowledged that Ukraine might only get them back through diplomatic means.",
    "US Secretary of State, Marco Rubio, will be in Istanbul on Friday.",
    "Rubio met Ukraine’s Foreign Minister Andriy Sybiga at a NATO meeting in Turkey on Wednesday.",
    "And US President Donald Trump on Wednesday indicated he could take a mediation role in Turkey.",
    "“I don’t know that he (Putin) would be there if I’m not there,” Trump told reporters accompanying him on a Middle East tour.",
    "“I know he would like me to be there, and that’s a possibility.",
    "If we could end the war, I’d be thinking about that,” he said.",
    "US President Donald Trump on Wednesday offered to go to Turkey if Putin also showed up.",
    "US Secretary of State Marco Rubio is expected in Istanbul on Friday for part of the talks.",
    "Rubio met with Ukraine’s Foreign Minister Andriy Sybiga on Wednesday on the sidelines of a NATO foreign ministers’ meeting in Antalya, Turkey.",
    "Sybiga said on X that he explained Zelenksyy’s “vision of further peace efforts” during “this critical week”.",
    "“We discussed in detail the logic of further steps and shared our approaches,” he added.",
    "Medinsky is seen as influential in advancing Russia’s historical claims over swathes of Ukraine and has written text-books advancing a nationalist view of Russian history that has been questioned by independent historians.",
    "The other three negotiators were named as Deputy Foreign Minister Mikhail Galuzin, Deputy Defence Minister Alexander Fomin and Igor Kostyukov, director of Russia’s GRU military intelligence agency.",
    "Putin last weekend proposed direct negotiations and had come under intense international pressure — including from some allies — to meet with Zelenskyy.",
    "Trump floated the idea of mediating if Putin attended.",
    "“I don’t know that he (Putin) would be there if I’m not there,” Trump told reporters while on his Middle East tour.",
    "“I know he would like me to be there, and that’s a possibility.",
    "If we could end the war, I’d be thinking about that,” he said.",
    "He said he had a packed schedule but added: “That doesn’t mean I wouldn’t do it to save a lot of lives.”"
  ],
  "topics": {
    "Politics": 0.9851995706558228,
    "Conflict": 0.9850996732711792,
    "Diplomacy": 0.983116865158081,
    "Environment": 0.9799123406410217,
    "Energy": 0.9791995286941528,
    "Health": 0.9772459268569946,
    "Culture": 0.9752848744392395,
    "Technology": 0.9749707579612732,
    "Elections": 0.9681915640830994,
    "Education": 0.9681351184844971,
    "Transport": 0.9591505527496338,
    "Economy": 0.9584043622016907,
    "Military": 0.9538862705230713,
    "Crime": 0.9329715371131897
  },
  "sentiment": {
    "positive": 0.538,
    "negative": 0.462,
    "neutral": 0.0
  }
}