{
  "title": "Wary Russia awaits details from US on Ukraine ceasefire plan",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/russia-awaits-details-united-states-ukraine-ceasefire-plan/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – The Kremlin said on Wednesday, March 13, it was awaiting details from Washington about a proposal for a 30-day ceasefire in Ukraine, while senior Moscow sources said a deal would have to take account of Russia’s advances and address its concerns.",
    "After Russian forces made gains in 2024, US President Donald Trump reversed US policy on the war, launching bilateral talks with Moscow and suspending military assistance to Ukraine, demanding that it take steps to end the conflict.",
    "The United States agreed on Tuesday to resume weapons supplies and intelligence sharing after Kyiv said at talks in Saudi Arabia that it was ready to support a ceasefire proposal.",
    "The Kremlin said it was carefully studying the results of the meeting and would await details from US Secretary of State Marco Rubio and White House National Security Adviser Mike Waltz.",
    "Kremlin spokesman Dmitry Peskov suggested a reporter was getting “a little ahead” of himself by asking if Russia intended to tie a ceasefire proposal to the lifting of international sanctions imposed over the war in Ukraine.",
    "“Rubio and Waltz said that they would pass on detailed information to us through various channels about the essence of the conversation that took place in Jeddah.",
    "First, we must receive this information,” Peskov said.",
    "Rubio said the United States was hoping for a positive response, and that if the answer was “no” then it would tell Washington a lot about the Kremlin’s true intentions.",
    "He said there would be contacts with Moscow on Wednesday, that Europe would have to be involved in any security guarantee for Ukraine, and that the sanctions Europe has imposed would also be on the table.",
    "Russia’s invasion of Ukraine in early 2022 has left hundreds of thousands of dead and injured, displaced millions of people, reduced towns to rubble and triggered the biggest confrontation between Moscow and the West in six decades.",
    "President Vladimir Putin has repeatedly said that he is ready to talk about an end to the war and Trump says he thinks Putin is serious, though other Western leaders disagree.",
    "Trump said on Tuesday that he hoped Russia would agree to a ceasefire and that he would talk to Putin this week.",
    "Reuters reported in November that Putin was ready to negotiate a deal with Trump, but would refuse to make major territorial concessions and would insist Kyiv abandon ambitions to join NATO.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Technology": 0.9598145484924316,
    "Conflict": 0.955778181552887,
    "Culture": 0.9166864156723022,
    "Politics": 0.8761278390884399,
    "Military": 0.840080976486206,
    "Diplomacy": 0.8329700231552124,
    "Economy": 0.8152010440826416,
    "Health": 0.8007623553276062,
    "Crime": 0.74500572681427,
    "Transport": 0.7355365753173828,
    "Education": 0.7143904566764832,
    "Energy": 0.6955719590187073,
    "Environment": 0.6894830465316772,
    "Elections": 0.6515890955924988
  },
  "sentiment": {
    "positive": 0.389,
    "negative": 0.611,
    "neutral": 0.0
  }
}