{
  "title": "Russia scolds Macron for pushing Europe towards the abyss of world war",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/russia-scolds-macron-pushing-europe-towards-abyss-world-war/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "MOSCOW, Russia – Russian officials and lawmakers on Thursday, March 6, poured scorn on French President Emmanuel Macron for saying that Russia threatened Europe, and cautioned that such talk could lead the West towards the abyss of a new world war.",
    "Russia’s invasion of Ukraine triggered the biggest confrontation between the West and Russia since the 1962 Cuban Missile Crisis, and both the Kremlin and the White House have cautioned against missteps that could trigger World War Three.",
    "But the advance of Russian forces in Ukraine in 2024 and US President Donald Trump’s upending of US policy towards Ukraine and Russia and demand for a peace deal to end the war have triggered a crisis among European powers who fear the United States is turning its back on Europe.",
    "Macron said in an address to the nation on Wednesday that Russia was “a threat for France and Europe”, that the Ukraine was already a “global conflict” and that he would open a debate about extending the French nuclear umbrella to allies in Europe.",
    "“Such an erroneous analysis leads to fatal errors,” said Konstantin Kosachev, a senior Russian senator, who said Macron had mistaken Russia’s reaction to the enlargement and aggression of the US-led military alliance towards Russia.",
    "“Macron maniacally imposes on his citizens, allies and the entire world a completely false concept of what is happening — ‘the Russians are coming!’ Such false conclusions and false suggestions lead to the abyss.” Russia and the United States are by far the world’s biggest nuclear powers, with over 5,000 nuclear warheads each, followed by China with about 500 and then France with 290 and the United Kingdom with 225, according to the Federation of American Former Russian president Dmitry Medvedev, who once presented himself as a moderniser and now tries to outhawk the Kremlin’s most ardent hawks, said “Micron” posed no threat at all and predicted he would lose power by 2027.",
    "War Russian officials say the tough rhetoric from Macron, British Prime Minister Keir Starmer and other European powers over recent days is simply not backed up by hard military power and point to Russia’s advance on the battlefield in Ukraine.",
    "President Vladimir Putin last year ordered the regular size of the Russian army to be increased by 180,000 troops to 1.5 million active servicemen in a move that would make it the second largest in the world after China’s.",
    "Maria Zakharova, spokeswoman for Russia’s foreign ministry, mocked Macron’s remarks that France had the most effective army in Europe suggesting that he should perhaps engage in a measurement exercise of some sort.",
    "Sergei Markov, a former Kremlin adviser, said Macron had slandered Russia with lies and military propaganda.",
    "Putin has repeatedly dismissed as nonsense Western claims that Russia could one day attack a NATO member, which under the NATO charter would be considered an attack on all 32 members of the alliance.",
    "Ukraine and the West say Putin is engaged in an imperial-style land grab in Ukraine, and have repeatedly vowed to defeat Russia, which currently controls just under 20% of Ukraine, including Crimea, and a chunk of eastern and southern Ukraine.",
    "Putin casts the war as part of a historic struggle with the West, which he says humiliated Russia after the Soviet Union fell in 1991 by enlarging NATO and encroaching on what he considers Moscow’s sphere of influence, including Ukraine.",
    "Kosachev said that Macron was moving away from the legacy of former president Charles de Gaulle and said Macron was clearly seeking to shift the blame for all France and Europe’s problems solely on Russia’s shoulders.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Conflict": 0.9432889819145203,
    "Military": 0.9195202589035034,
    "Technology": 0.8865852355957031,
    "Politics": 0.858957827091217,
    "Culture": 0.8378540277481079,
    "Economy": 0.8377372622489929,
    "Diplomacy": 0.791547417640686,
    "Health": 0.7516198754310608,
    "Transport": 0.736900269985199,
    "Crime": 0.7257038950920105,
    "Energy": 0.7105152606964111,
    "Environment": 0.6795927882194519,
    "Elections": 0.6621755361557007,
    "Education": 0.5279185771942139
  },
  "sentiment": {
    "positive": 0.368,
    "negative": 0.632,
    "neutral": 0.0
  }
}