{
  "title": "Macron says France does not want ‘World War III’ over Ukraine strife",
  "published_date": null,
  "url": "https://manilastandard.net/news/314590030/macron-says-france-does-not-want-world-war-iii-over-ukraine-strife.html",
  "original_language": "en",
  "cleaned_sentences": [
    "PARIS – President Emmanuel Macron has said France did not want to unleash “World War III” over Russia’s invasion of Ukraine and vowed referendums on key issues as he outlined his aims for for the remaining two years of his mandate in a marathon television appearance.",
    "Macron, who came to power in 2017 promising radical change, will step down in 2027 after serving the maximum two terms allowed under the Constitution.",
    "Meanwhile, in Brussels, the EU Wednesday approved a fresh package of sanctions on Russia, clamping down on its “shadow” oil fleet, as Europe threatens further punishment if Moscow does not agree to a Ukraine truce.",
    "The new measures against the Kremlin — the 17th round of sanctions from the EU since Russia’s 2022 full-scale invasion of Ukraine — were in the pipeline before European leaders issued their latest ultimatum to Moscow over US-led peace efforts.",
    "Diplomats representing the EU’s 27 member states approved the package at a meeting in Brussels, according to the Polish presidency of the bloc.",
    "The package — set to be formally adopted on Tuesday — includes blacklisting some 200 oil tankers used to circumvent curbs on Russian oil exports.",
    "Companies in countries including Vietnam, Serbia and Turkey accused of helping supply goods to the Russian military are also set to face restrictions.",
    "On occasion over the last year, Macron has appeared as a lame duck especially after his decision to hold snap legislative elections backfired, leaving the far-right as the biggest party in parliament and his own party a diminished, minority presence.",
    "But recent months have seen a newly energized Macron, boosted by his presence on the international front as he seeks to bring an end to the three-year-war sparked by Russia’s invasion of Ukraine.",
    "“We must help Ukraine defend itself but we do not want to unleash a Third World War,” Macron said in the interview that lasted more than three hours.",
    "“The war must cease and Ukraine must be in the best possible situation to go into negotiations,” he added.",
    "But Macron said France was ready to start discussing with other European countries deploying French warplanes armed with nuclear weapons on their territory, as the United States does.",
    "“The Americans have the bombs on planes in Belgium, Germany, Italy, Turkey,” Macron said.",
    "“We are ready to open this discussion.",
    "I will define the framework in a very specific way in the weeks and months to come,” he said.",
    "Those who put their points of view in front of Macron ranged from the head of the hardline CGT union, Sophie Binet, to Tibo Inshape, a muscular and massively followed fitness influencer.",
    "Amid concern about some 600 jobs in France, Macron told Binet that the French operations of steelmaker ArcelorMittal would not be nationalized but vowed to save its two plants in the country.",
    "In a key announcement, he said he favored holding several referendums on the same day for voters to decide on French social and economic “reforms”.",
    "“I want us to organize a series of consultations,” Macron said, adding that the votes would take place on one day in coming months and address “major” economic and social reforms.",
    "While he would not go into details, he was open to a suggestion by Prime Minister Francois Bayrou, who has proposed holding a referendum on a plan to reduce France’s debt.",
    "Referendums could also address social reforms such as access to social media for under-15s and assisted dying.",
    "However, Macron rejected the idea of putting immigration issues to a popular vote despite repeated requests from the right and far right.",
    "Tackling delicate social issues, the French president spoke out against the wearing of religious symbols, such as the Islamic veil, in sports competitions, but he added that for non-competitive sports practice it was up to sports federations to decide.",
    "While Macron, 47, must step down in 2027 after serving two consecutive terms, he could in theory return in 2032, something no French leader has ever done before.",
    "But he said at the end of the TV marathon he had not yet thought about his future after 2027 and was only thinking of France in his daily work.",
    "“When I’m done (with the current term), I’ll think about what’s next.",
    "Then I’ll be able to answer you.",
    "But today, I haven’t thought about it,” he said."
  ],
  "topics": {
    "Politics": 0.8629704117774963,
    "Culture": 0.8521807193756104,
    "Diplomacy": 0.7927646040916443,
    "Conflict": 0.7790380716323853,
    "Economy": 0.7574434280395508,
    "Energy": 0.7397181987762451,
    "Technology": 0.6427531242370605,
    "Environment": 0.6328517198562622,
    "Transport": 0.6276664137840271,
    "Military": 0.6270481944084167,
    "Health": 0.6260207295417786,
    "Elections": 0.6254907250404358,
    "Education": 0.5383679866790771,
    "Crime": 0.4570562243461609
  },
  "sentiment": {
    "positive": 0.464,
    "negative": 0.536,
    "neutral": 0.0
  }
}