{
  "title": "China, Russia always moving forward 'hand in hand,' Xi tells Putin",
  "published_date": null,
  "url": "https://www.rappler.com/world/asia-pacific/china-russia-new-year-greetings-2024/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "BEIJING, China – Chinese President Xi Jinping said China and Russia have always moved forward “hand in hand” on the right path, the official Chinese news agency Xinhua said on Tuesday, December 31, months after the two countries struck a “new era strategic partnership” on key issues.",
    "The two leaders agreed in May to deepen bilateral ties and cooperate on areas of mutual interest such as Taiwan, Ukraine, and mutual rival the United States.",
    "Russia’s state-run RIA news agency also quoted Moscow’s ambassador to Beijing as saying last Friday that Xi will visit Russia in 2025.",
    "In an exchange of New Year greetings with Russian President Vladimir Putin, Xi lauded the mutual trust and strategic coordination between both countries and expressed his desire to maintain close ties with Putin.",
    "China-Russia cooperation in various fields will continue to lead to new development opportunities, Xi added.",
    "The Chinese president was received in the Kremlin as a “dear friend” in 2023 after he obtained an unprecedented third term in office.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Culture": 0.7567395567893982,
    "Economy": 0.587563157081604,
    "Transport": 0.5795750617980957,
    "Conflict": 0.5787239074707031,
    "Health": 0.5450002551078796,
    "Technology": 0.5344805717468262,
    "Diplomacy": 0.5286316871643066,
    "Environment": 0.5094082355499268,
    "Energy": 0.49591901898384094,
    "Military": 0.49096423387527466,
    "Politics": 0.45280396938323975,
    "Education": 0.43258848786354065,
    "Crime": 0.3136380612850189,
    "Elections": 0.22643165290355682
  },
  "sentiment": {
    "positive": 0.636,
    "negative": 0.364,
    "neutral": 0.0
  }
}