{
  "title": "UK, European leaders join forces to draft Ukraine peace plan to take to US",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/united-kingdom-european-leaders-join-forces-draft-ukraine-peace-plan/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "LONDON, United Kingdom – British Prime Minister Keir Starmer said on Sunday European leaders had agreed to draw up a Ukraine peace plan to take to the United States, a vital step for Washington to be able to offer security guarantees Kyiv says are vital to deter Russia.",
    "At a summit in London just two days after Volodymyr Zelenskyy clashed with US President Donald Trump and cut short a visit to Washington, world leaders offered a strong show of support to the Ukrainian president and promised to do more to help his nation.",
    "European leaders agreed they must spend more on defence to show Trump the continent can protect itself.",
    "And the European Commission chief, with many EU nations struggling with already stretched public finances, suggested the bloc could ease its rules that limit debt levels.",
    "Starmer, who welcomed a visibly shaken Zelenskyy on Saturday with a warm hug, said Britain, Ukraine, France and some other nations would form a “coalition of the willing” and draw up a peace plan to take to Trump.",
    "He did not name other nations, but said more countries were willing to join.",
    "“We are at a crossroads in history today,” Starmer said.",
    "“This is not a moment for more talk.",
    "Time to step up and lead and to unite around a new plan for a just and enduring peace.” Zelenskyy said after the summit that European unity was “at an extremely high level not seen for a long time.” “We are all working together in Europe in order to find a basis for cooperation with America for a true peace and guaranteed security,” Zelenskyy wrote on Telegram.",
    "Europe is scrambling to ensure that Kyiv is not squeezed out of any talks after Trump’s shouting match with Zelenskyy in the Oval Office raised fears that the US could pull support for Ukraine and impose a peace plan negotiated with Russia.",
    "Several leaders said they must increase defence spending — something that could help bring Trump on side to offer a US security guarantee in the event of peace.",
    "“After a long time of underinvestment, it is now of utmost importance to step up the defence investment for a prolonged period of time,” Ursula von der Leyen, president of the European Commission, the EU’s executive body, told reporters.",
    "“Member states need more fiscal space to do a surge in defence spending,” she said, adding that Europe needed to turn “Ukraine into a steel porcupine that is indigestible for potential invaders”.",
    "Polish Prime Minister Donald Tusk said leaders agreed Europe needed to take on more responsibility and start bearing the burden of “more spending on its defence budgets within NATO”.",
    "He added the leaders all agreed they must keep close ties with the US.",
    "Lacking weaponry, stocks Europe, which lacks the weaponry and depth of ammunition stocks of the US, hopes to convince Trump that it can defend itself but that Russia will only adhere to a peace deal if it comes with the backing of the United States.",
    "Talks with the US have centred on Washington providing a so-called backstop for a European peacekeeping role, possibly in the form of air cover, intelligence and surveillance and a greater but unspecified threat if Russian President Vladmir Putin again sought to take more territory Crucial to getting any agreement from Trump is for European nations to increase defence spending and signal they would take part in any peacekeeping role — something Starmer acknowledged was difficult to get unanimity on.",
    "Starmer increased the UK’s defence spending before his visit to Washington last week, and NATO Secretary General Mark Rutte said some European leaders had privately set out new plans on defence spending at the meeting but he declined to give details.",
    "‘Uncomfortable viewing’ Trump has upended US policy on the three-year-old war since he returned to the White House in January, casting doubt on U.S. military and political support for Ukraine — and Europe — and ending the isolation of Moscow.",
    "Trump had blindsided Europe by calling Putin without warning and sending a delegation to Saudi Arabia for talks with Russia without including Ukraine or Europe.",
    "Trump has falsely suggested that Kyiv was responsible for starting the war, and on Friday, he criticised Zelenskyy for not being grateful for US aid.",
    "Zelenskyy’s clash with Trump on Friday ended a week when Europe had appeared to be in a better position in its drive to encourage Trump to continue to offer support to Ukraine after cordial visits to Washington by French President Emmanuel Macron and Starmer.",
    "Starmer described watching the spat between Zelenskyy and Trump in the Oval Office as uncomfortable viewing, but was keen to push the conversation forward by offering himself as a go-between for Europe and the United States.",
    "In a further show of support for the Ukrainian leader, Zelenskyy later on Sunday flew to meet King Charles at his private residence in eastern England.",
    "The Trump administration on Sunday continued to criticise Zelenskyy.",
    "White House national security adviser Mike Waltz told CNN that the US needs a Ukranian leader who is willing to secure a lasting peace with Russia, but that it is not clear Zelenskyy is prepared to do so.",
    "Russian Foreign Minister Sergei Lavrov praised Trump’s “common sense” approach and accused European countries of seeking to prolong the conflict by propping up Zelenskyy “with their bayonets in the form of peacekeeping units”.",
    "Starmer said the leaders on Sunday also agreed to work to ensure Kyiv is at the table of any peace talks and boost the country’s own defence capabilities.",
    "“Europe must do the heavy lifting, but to support peace in our continent and to succeed, this effort must have strong US backing,” Starmer told a news conference.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Politics": 0.9489566087722778,
    "Culture": 0.9299505949020386,
    "Conflict": 0.9110518097877502,
    "Diplomacy": 0.9091410636901855,
    "Energy": 0.8955574035644531,
    "Transport": 0.8852832317352295,
    "Military": 0.8849302530288696,
    "Economy": 0.8735389709472656,
    "Environment": 0.8721157908439636,
    "Health": 0.8491442799568176,
    "Education": 0.8217025399208069,
    "Technology": 0.8092719316482544,
    "Elections": 0.7832698225975037,
    "Crime": 0.6550953388214111
  },
  "sentiment": {
    "positive": 0.441,
    "negative": 0.559,
    "neutral": 0.0
  }
}