{
  "title": "US to resume security support to Ukraine as Kyiv says it is ready to accept ceasefire proposal",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/us-resume-security-support-ukraine-kyiv-ready-accept-ceasefire-proposal/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "JEDDAH, Saudi Arabia – The United States agreed on Tuesday, March 11, to resume military aid and intelligence sharing with Ukraine after talks where Kyiv said it would accept a US proposal for a 30-day ceasefire in its conflict with Russia, the countries said in a joint statement.",
    "US Secretary of State Marco Rubio said the US would now take the offer to Russia, and the ball is in Moscow’s court.",
    "“Our hope is that the Russians will answer ‘yes’ as quickly as possible, so we can get to the second phase of this, which is real negotiations,” Rubio told reporters, referring to US President Donald Trump, after more than eight hours of talks in Jeddah, Saudi Arabia.",
    "The Kremlin launched a full-scale invasion of Ukraine three years ago, and Russia, which has been making advances, now holds around a fifth of Ukraine’s territory, including Crimea, which it annexed in 2014.",
    "Rubio said Washington wanted a full agreement with both Russia and Ukraine “as soon as possible.” “Every day that goes by, this war continues, people die, people are bombed, people are hurt on both sides of this conflict,” he said.",
    "How Moscow would respond was far from certain.",
    "Russian President Vladimir Putin has said he is open to discussing a peace deal, but he and his diplomats have repeatedly stated they are against a ceasefire and would seek a deal that safeguards Russia’s “long-term security.” Putin has ruled out territorial concessions and said Ukraine must withdraw fully from four Ukrainian regions claimed and partly controlled by Russia.",
    "On Tuesday, Russia’s foreign ministry said only that it did not rule out contacts with US representatives.",
    "Ukrainian President Volodymyr Zelenskyy, who was in Saudi Arabia but did not participate in the talks, said the ceasefire was a “positive proposal,” that covers the frontline in the conflict, not just fighting by air and sea.",
    "The Ukrainian leader said the ceasefire would take effect as soon as Russia agreed.",
    "“When the agreements come into force, during these 30 days of ‘silence,’ we will have time to prepare with our partners at the level of working documents all the aspects for reliable peace and long-term security,” Zelenskyy said.",
    "Rubio said the plan would be delivered to the Russians through multiple channels.",
    "Trump’s national security adviser, Mike Waltz, was due to meet his Russian counterpart in the coming days and Trump’s special envoy Steve Witkoff plans to visit Moscow this week to meet Putin.",
    "On Tuesday, Trump said he hoped for a swift ceasefire and thought he would talk to Putin this week.",
    "“I hope it’ll be over the next few days,” he told reporters at a White House event to promote his close adviser Elon Musk’s Tesla car company.",
    "The US-Ukraine agreement was a sharp turnaround from an acrimonious White House meeting on February 28 between the new Republican US president, who has long been a Ukraine aid skeptic, and Zelenskyy.",
    "In Tuesday’s joint statement, the two countries said they agreed to conclude as soon as possible a comprehensive agreement for developing Ukraine’s critical mineral resources, which had been in the works and was thrown into limbo by that meeting.",
    "Following that encounter, the United States cut off intelligence sharing and weapons shipments to Ukraine, underlining Trump’s willingness to pressure a US ally as he pivots to a more conciliatory approach to Moscow.",
    "Trump said on Tuesday he would invite Zelenskyy back to the White House.",
    "Ukrainian officials said late on Tuesday that both US military assistance and intelligence sharing had resumed.",
    "European partners A top aide to Zelenskyy said options for security guarantees to Ukraine were discussed with U.S. officials.",
    "Security guarantees have been one of Kyiv’s key aims, and some European countries have expressed willingness to explore sending peacekeepers.",
    "In the joint statement, Ukraine reiterated that European partners should be involved in the peace process.",
    "NATO Secretary General Mark Rutte will be at the White House on Thursday.",
    "“It seems like the Americans and Ukrainians have taken an important step towards peace.",
    "And Europe stands ready to help reach a just and lasting peace,” Polish Prime Minister Donald Tusk said on X. Waltz said the initial resumption of military assistance for Ukraine would involve equipment from US stockpiles approved by former US President Joe Biden and stopped by Trump.",
    "As the diplomacy plays out, Ukraine’s battlefield positions have been under heavy pressure, particularly in Russia’s Kursk region where Moscow’s forces have launched a push to flush out Kyiv’s troops, which had been trying to hold a patch of land as a bargaining chip.",
    "Ukraine overnight launched its biggest drone attack on Moscow and the surrounding region yet, showing Kyiv can also land major blows after a steady stream of Russian missile and drone attacks, one of which killed 14 people on Saturday.",
    "The attack, in which 337 drones were downed over Russia, killed at least three employees of a meat warehouse and caused a short shutdown at Moscow’s four airports.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Military": 0.734660267829895,
    "Conflict": 0.7337803840637207,
    "Diplomacy": 0.6907073259353638,
    "Politics": 0.6172675490379333,
    "Technology": 0.6025258302688599,
    "Culture": 0.598071813583374,
    "Energy": 0.5927232503890991,
    "Economy": 0.5919519662857056,
    "Transport": 0.5435729026794434,
    "Education": 0.5287933349609375,
    "Environment": 0.4922759234905243,
    "Crime": 0.42748314142227173,
    "Health": 0.38959836959838867,
    "Elections": 0.3541581332683563
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}