{
  "title": "After Trump clash, Ukraine's Zelenskyy gets warm UK welcome before European summit",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/ukraine-volodymyr-zelenskyy-warm-welcome-united-kingdom-march-1-2025/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "LONDON, United Kingdom – British Prime Minister Keir Starmer greeted President Volodymyr Zelenskyy with a warm embrace on Saturday, March 1, after the Ukrainian leader flew to London for talks following his clash at the White House with US President Donald Trump.",
    "In an extraordinary Oval Office meeting on Friday, February 28, Trump threatened to withdraw support for Ukraine, three years after Russia invaded its smaller neighbor.",
    "French President Emmanuel Macron spoke to Zelenskyy and Trump on Saturday and called for calm in an interview following Friday’s White House clash.",
    "In London, a crowd cheered as Zelenskyy arrived for talks with Starmer at his Downing Street office before a summit of European leaders that the Ukrainian president will attend on Sunday, March 2, to discuss a peace plan for Ukraine.",
    "“I hope you heard some of that cheering in the street.",
    "That is the people of the United Kingdom coming out to demonstrate how much they support you…and our absolute determination to stand with you,” Starmer told him.",
    "Starmer told Zelenskyy he had “full backing across the United Kingdom.” “We stand with you and Ukraine for as long as it may take,” Starmer said.",
    "Zelenskyy said on Saturday he had “important and warm” talks with Starmer, with a discussion on strengthening Ukraine’s position and obtaining reliable security guarantees.",
    "“During our talks we discussed the challenges standing before Ukraine and all of Europe, coordination with our partners, concrete steps to strengthen Ukraine’s position and ending the war in a just fashion, with reliable security guarantees,” Zelenskyy wrote on the Telegram messaging app.",
    "Other European leaders also issued messages of support for Zelenskyy and Ukraine after his meeting with Trump, highlighting differences between traditional allies the United States and Europe over the war since Trump returned to office.",
    "Senior Russian politicians have reacted with glee to what they see as Zelenskyy’s White House humiliation, saying the Ukrainian leader got what he deserved and that US military aid to Kyiv must now be cut.",
    "Macron: ‘Everybody needs to calm down’ The French presidency said Macron had also spoken to British Starmer, European Council President Antonio Costa, and NATO chief Mark Rutte, on the eve of the London summit.",
    "“I think that beyond the frayed nerves, everybody needs to calm down, show respect and gratitude, so we can move forward concretely, because what’s at stake is too important,” Macron said in an interview with several Sunday newspapers.",
    "Macron said Zelenskyy had told him he was willing to “restore dialogue” with the United States, including on a deal giving the US access to revenues from Ukraine’s natural resources, but did not say what Trump told him in the call.",
    "The White House had no immediate comment.",
    "In an interview with CNN on Friday, Trump’s Secretary of State Marco Rubio called on Zelenskyy to “apologize for turning this thing into the fiasco for him that it became.” In an interview with Fox News on Friday Zelenskyy said he believed his relationship with Trump could be salvaged and appeared to express some regret, saying “I’m sorry for this.” The falling-out meant that Ukraine and the United States failed to sign a much-vaunted minerals deal Kyiv hoped would spur Trump to back Ukraine’s war effort and potentially win support from Republicans in Congress for a new round of aid.",
    "Trump is not interested in revisiting the minerals deal at the moment, a senior White House official told Reuters on Friday evening.",
    "Starmer spoke to both Trump and Zelenskyy on Friday, and French President Emmanuel Macron also visited Trump in Washington this week.",
    "Zelenskyy is also due to meet King Charles on Sunday.",
    "Britain’s Sun newspaper said the meeting would take place at the monarch’s Sandringham estate in eastern England.",
    "“I’m very happy that His Majesty the King accepted my meeting tomorrow,” Zelenskyy told Starmer at the start of their meeting.",
    "Britain has been a vocal backer of Ukraine and Charles has previously expressed his support for Zelenskyy, speaking of the “determination and strength” of the Ukrainian people in the face of an unprovoked attack from Russia.",
    "During Starmer’s visit to the White House, he presented Trump with a written invitation from the King for a state visit, which would make the US president the first elected political leader in modern times to be hosted for two state visits by a British monarch.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Transport": 0.8459448218345642,
    "Diplomacy": 0.8405786752700806,
    "Politics": 0.8060653209686279,
    "Environment": 0.7930457592010498,
    "Conflict": 0.7804275751113892,
    "Technology": 0.7651032209396362,
    "Energy": 0.744825005531311,
    "Culture": 0.7419440150260925,
    "Economy": 0.7411865592002869,
    "Health": 0.692206084728241,
    "Military": 0.690258800983429,
    "Education": 0.6602795720100403,
    "Elections": 0.6120325922966003,
    "Crime": 0.4999106824398041
  },
  "sentiment": {
    "positive": 0.571,
    "negative": 0.429,
    "neutral": 0.0
  }
}