{
  "title": "Zelenskyy vows Ukraine will do everything in 2025 to stop Russia",
  "published_date": null,
  "url": "https://manilastandard.net/news/314542389/zelenskyy-vows-ukraine-will-do-everything-in-2025-to-stop-russia.html",
  "original_language": "en",
  "cleaned_sentences": [
    "KYIV – Ukraine’s President Volodymyr Zelenskyy has vowed his country will use 2025 to fight for an end to Russia’s nearly three-year-long invasion by any means necessary.",
    "The Ukrainian leader’s address caps a difficult year for the war-battered country which has been fending off a better-resourced Russian army for nearly three years.",
    "“May 2025 be our year,” Zelenskyy said in an address to the nation just before the clock struck midnight in Kyiv.",
    "“We know that peace will not be given to us as a gift but we will do everything to stop Russia and end the war.” Ukraine lost seven times more territory to Russia this year than in 2023, according to an AFP analysis, and is facing the possibility of a reduction in US military and political backing when Donald Trump takes over the White House.",
    "Incumbent US President Joe Biden’s administration unveiled almost $6 billion in military and budget aid for Ukraine on Monday in a race to support Kyiv before Trump takes office in January.",
    "The Republican has promised to end the conflict in “24 hours” once in power, raising fears in Ukraine that it will be forced to give up all the land the Kremlin currently controls in exchange for peace.",
    "In his new year’s address Zelenskyy said that Ukraine had to continue to fight to gain the upper hand — both on the battlefield and ahead of any prospective peace talks.",
    "“Every day in the coming year, I, and all of us, must fight for a Ukraine that is strong enough,” the Ukrainian leader said.",
    "“Because only such a Ukraine is respected and heard.",
    "Both on the battlefield and at the negotiating table.” But Zelenskyy appeared sanguine about Trump’s return.",
    "“I have no doubt that the new American President is willing and capable of achieving peace and ending (Russian President Vladimir) Putin’s aggression,” Zelenskyy said.",
    "In his own New Year’s Eve address on Tuesday, Putin did not explicitly mention the war in Ukraine but praised Russia’s soldiers for their “courage and bravery”.",
    "“You are true heroes who have undertaken the great military labour to defend Russia,” he said.",
    "Russian Defense Minister Andrei Belousov paid tribute to “fallen soldiers” in his address, saying that they had died fighting “Nazism” — a pretext Putin used to launch his invasion.",
    "Since that began in February 2022, Moscow has launched overnight aerial attacks on Ukraine almost every day.",
    "Those have targeted military and civilian infrastructure, including the power grid.",
    "Ukraine has stepped up its own attacks inside Russian territory in response, and urged its Western allies to supply more air defence systems.",
    "A Ukrainian drone strike in western Russia caused a fuel spill and fire at an oil depot, a Russian regional governor said earlier on Tuesday.",
    "Zelenskyy has urged his war-battered country’s allies to help end the invasion and bring lasting peace in 2025.",
    "Those hopes were echoed to AFP on the streets of Kyiv ahead of the turn of the new year.",
    "“I want peace to finally be obtained for Ukraine, for people to stop dying, for all our soldiers to return to their homes and celebrate next year and next Christmas with their families,” said Kateryna Chemeryz, a teacher.",
    "“It seems to me that everyone has one wish, one dream: that Ukraine will win, and all our territories are regained,” said Tetiana, a civil servant who declined to give her family name.",
    "The incoming US president has vowed to end the war but has not outlined any roadmap and there are concerns a deal could come at the expense of Ukrainian territory.",
    "Zelensky has sought to build bridges with Trump and his team, amid fears the Republican could slow vital US military aid or halt it entirely.",
    "“For me personally, there is some anxiety, because I was hoping for a different outcome,” Chemeryz, the teacher, said of Trump’s return to the White House.",
    "Tetiana was dismissive, saying Ukraine should work to determine its own fate “without Trump or anyone else.”"
  ],
  "topics": {
    "Conflict": 0.7939950227737427,
    "Diplomacy": 0.7742709517478943,
    "Economy": 0.750712513923645,
    "Military": 0.7435060143470764,
    "Environment": 0.6980476379394531,
    "Transport": 0.6719983220100403,
    "Culture": 0.6488691568374634,
    "Elections": 0.6309776306152344,
    "Energy": 0.6242708563804626,
    "Education": 0.6070883274078369,
    "Health": 0.6039509773254395,
    "Politics": 0.5304062962532043,
    "Technology": 0.47475746273994446,
    "Crime": 0.4327908754348755
  },
  "sentiment": {
    "positive": 0.692,
    "negative": 0.308,
    "neutral": 0.0
  }
}