{
  "title": "Russia hopes for ‘progress’ at Saudi talks",
  "published_date": null,
  "url": "https://manilastandard.net/news/world-news/314571691/russia-hopes-for-progress-at-saudi-talks.html",
  "original_language": "en",
  "cleaned_sentences": [
    "MOSCOW—Moscow is hoping to achieve “some progress” at talks in Saudi Arabia on Monday, a Russian negotiator told state media before the United States meets delegations from both Ukraine and Russia in a bid to halt the three-year conflict.",
    "Moscow has rejected a joint US-Ukraine proposal for a full and unconditional 30-day ceasefire, suggesting instead halting aerial strikes on energy facilities.",
    "Despite that offer, both sides have continued to launch aerial attacks in the run-up to the negotiations.",
    "A Russian strike on the southern Ukrainian city of Zaporizhzhia on Friday night killed a family of three, triggering anger among Ukrainian officials.",
    "Russia also launched drone attacks on Kyiv that hit apartment buildings and caused fires, killing at least two people, Ukraine’s emergency service said early Sunday.",
    "Kyiv mayor Vitali Klitschko said Sunday a “massive attack by enemy UAVs” caused falling debris in several districts of the city, wounding seven.",
    "US negotiators will meet separately with Ukrainian and Russian delegations in Saudi Arabia on Monday, in what US envoy Keith Kellogg described as “shuttle diplomacy” between hotel rooms.",
    "Despite the flurry of diplomacy and push from US President Donald Trump, a breakthrough has so far proved elusive.",
    "“We hope to achieve at least some progress,” Russian senator Grigory Karasin, who will lead the Russian delegation, told the Zvezda TV channel, without specifying on what issue.",
    "He said he and fellow negotiator, FSB advisor Sergey Beseda would take a “combative and constructive” mood into the talks.",
    "A senior Ukrainian official told AFP a day earlier that Kyiv hopes to secure agreement “at least” on a partial ceasefire covering attacks on energy, infrastructure and at sea.",
    "Kyiv is sending its defence minister to the negotiations.",
    "“We are going with the mood to fight for the solution of at least one issue,” Karasin told Zvezda, which is owned by Russia’s defense ministry.",
    "He said they were leaving for Saudi Arabia on Sunday and would return on Tuesday.",
    "Russia’s choice of negotiators for the talks has raised questions.",
    "Both are outside of traditional diplomatic decision-making institutions such as the Kremlin, foreign ministry or defense ministry.",
    "Karasin is a career diplomat who now sits in Russia’s upper house of parliament, while Beseda is a long-time FSB officer and now an advisor to the security service’s director.",
    "The FSB in 2014 admitted that Beseda was in Kyiv during a bloody crackdown in the Ukrainian capital in the midst of the country’s pro-EU revolution.",
    "Ukraine has accused Russia of not genuinely seeking peace and condemned its ongoing attacks, despite Russian President Vladimir Putin saying on Tuesday he had ordered his army to stop targeting Ukrainian energy sites.",
    "In contrast, a US official close to Trump, White House envoy Steve Witkoff, has praised Putin — whom he met in Moscow last week — as a “great” leader seeking to end the conflict with Kyiv.",
    "“I thought he was straight up with me,” Witkoff told an American right-wing podcast host, Tucker Carlson, in an interview aired Friday.",
    "“I don’t regard Putin as a bad guy.",
    "That is a complicated situation, that war, and all the ingredients that led up to it,” Trump’s envoy said.",
    "Russia fired 179 drones at Ukraine in its latest overnight barrage, the Ukrainian air force said Saturday.",
    "In the southern city of Zaporizhzhia, an entire family, including a 14-year-old girl, was killed when a drone crashed into their house Friday, the regional authorities said.",
    "An AFP photographer at the scene of one strike saw rescue workers sifting through the rubble of a destroyed building, as smoke and fog hung in the night air.",
    "In the eastern Donetsk region, Russian strikes on Saturday killed at least two people and wounded three, according to the local governor.",
    "Ukraine also targeted Russia with drone attacks overnight, wounding two in the southern city of Rostov-on-Don."
  ],
  "topics": {
    "Conflict": 0.9782362580299377,
    "Diplomacy": 0.9584492444992065,
    "Politics": 0.9263454675674438,
    "Energy": 0.9202296137809753,
    "Economy": 0.8605350852012634,
    "Health": 0.8540611863136292,
    "Environment": 0.8531216979026794,
    "Culture": 0.8384356498718262,
    "Technology": 0.7880204319953918,
    "Military": 0.7441123723983765,
    "Transport": 0.633868396282196,
    "Elections": 0.5995767712593079,
    "Crime": 0.4881572127342224,
    "Education": 0.460527241230011
  },
  "sentiment": {
    "positive": 0.286,
    "negative": 0.714,
    "neutral": 0.0
  }
}