{
  "title": "The Russian billionaires whose chemical factories fuel Russia's war machine",
  "published_date": null,
  "url": "https://www.rappler.com/world/europe/russia-billionaires-chemical-factories-fuel-war-machine/",
  "original_language": "en",
  "cleaned_sentences": [
    "SUMMARY This is AI generated summarization, which may have errors.",
    "For context, always refer to the full article.",
    "LONDON, United Kingdom – Chemicals factories founded or owned by some of Russia‘s wealthiest men are supplying ingredients to plants that manufacture explosives used by Moscow’s military during the war in Ukraine, an analysis of railway and financial data shows.",
    "Reuters identified five chemical companies, in which five Western-sanctioned billionaires hold stakes, that provided more than 75% of the key chemicals shipped by rail to some of Russia’s largest explosives factories from the start of the war until September this year, according to the railway data.",
    "The news agency’s analysis demonstrates for the first time how heavily factories forming part of Russia’s war machine rely on these men and their companies.",
    "The billionaires include Roman Abramovich, former owner of Chelsea Football Club, and Vagit Alekperov, who was ranked by Forbes in April as Russia’s richest man with a fortune estimated at $28.6 billion.",
    "Abramovich and Alekperov did not respond to requests for comment sent via their companies or lawyers.",
    "London-listed Evraz, in which Ambramovich holds a 28% stake, said it supplied the chemicals for “civilian use only.” Lukoil, a refiner in which Alekperov retains a shareholding, said it “does not manufacture explosives or any related components.” Anna Nagurney, a University of Massachusetts professor who closely studies supply chain networks related to the Ukraine-Russia war and reviewed Reuters’ findings, said the five companies were aiding Moscow not only by providing essential chemical ingredients for munitions but also by earning much-needed hard currency from exports of civilian products, including fertilizers.",
    "“These chemical companies may be operating as civilian ones, but they are sustaining the war effort,” Nagurney said.",
    "To determine from where Russia’s main munitions factories received their supplies, Reuters analyzed the movement of more than 600,000 rail shipments that carried the chemicals needed to make explosives from the invasion of Ukraine in February 2022 through September 2024.",
    "The railway data from two commercial databases in Russia was supplied to Reuters by the Open Source Centre, a British-based NGO devoted to collecting publicly-available intelligence and monitoring potential sanctions violations.",
    "It detailed the type of cargo in every railway wagon, the weight, origin and destination, and the names of the company that sent the goods and the company that received them.",
    "Reuters cross-checked the data from the two databases to confirm its accuracy.",
    "However, the news agency was unable to confirm whether the data included every rail shipment to the explosives factories, or the extent to which the plants received deliveries by road.",
    "The data showed that the billionaires’ companies supplied vital ingredients to five explosive and gunpowder factories in Russia that are subject to Western sanctions.",
    "The plants are subsidiaries of the giant Russian state arms manufacturer and automaker Rostec.",
    "Using leaked tax invoices covering parts of 2023, Reuters was also able to verify that four of the chemicals firms were suppliers to four of the explosives manufacturers.",
    "Neither the Kremlin, the defense ministry, nor Rostec responded to Reuters’ questions about civilian companies’ role in supplying Russia’s munitions industry.",
    "Before the war, all the explosives plants, as part of efforts to diversify, also used to make explosives or gunpowder for civilian use.",
    "Reuters could not determine whether such civilian sales continue and whether the chemicals supplied might be earmarked for civilian usage.",
    "Thomas Klapotke, a professor of energetics at the University of Munich, who helped Reuters analyze the data, said that, while all the raw materials had many potential uses, the combination of wagon-loads of specific chemicals needed for explosives manufacturing arriving at particular plants provided “red flags.” The analysis provides fresh evidence that the West’s strategy of imposing sanctions on Russia as punishment for its invasion of Ukraine has failed to curb its military production, according to several experts interviewed by Reuters.",
    "While the billionaires themselves are all under Western sanctions, the chemical companies involved have largely escaped major financial penalties or bans on their import of critical goods from the USA or the European Union.",
    "Most of the output of these chemical plants are civilian products like fertilizer that are critical to farming.",
    "Long-standing Western policies exempt food from sanctions to prevent famine and diplomatic blowback from developing nations.",
    "Peter Harrell, a former senior White House official who worked on Russia sanctions during the war’s first year and is now a scholar at the Carnegie Endowment for International Peace, said perhaps it’s time to review those 2022 decisions now that nations that once relied on Ukraine and Russia for wheat and fertilizer have had time to find alternative sources.",
    "“Potentially, the calculus would weigh towards imposing sanctions on these companies today,” Harrell said, commenting on Reuters’ findings.",
    "However, Manish N. Raizada, an agriculture professor at the University of Guelph in Canada, warned that imposing sanctions on Russian chemical companies could put hundreds of millions of small-scale farmers at risk, in return for a minor economic impact on Russia.",
    "Spokespersons for the US Treasury Department, which coordinates Washington’s sanctions, and the United Nations Development Program declined to comment on Reuters findings.",
    "A European Commission spokesperson, in response to questions about the chemicals companies, said: “We are actively exploring the possibilities for additional measures to step up pressure and close loopholes in a manner that would avoid negative implications for food security.” The spokesperson stressed that any action would only come after careful analysis of the effectiveness of any measures and their impact on European companies.",
    "However, he noted that EU sanctions would already apply to the companies, even if they were not specifically designated, if they were controlled or owned by a sanctioned individual.",
    "Artillery war The war in Ukraine has become an artillery duel where a shortage of high explosives available to NATO and Ukraine has allowed Russian forces to gain swathes of territory this year, according to multiple Ukraine commanders interviewed by Reuters.",
    "Moscow is investing heavily in military production and seeking to replenish its munitions stockpiles.",
    "In 2024, Russia produced about 2.4 million artillery rounds and imported 3 million from North Korea, according to a Ukraine security official.",
    "The North Korean embassy in London didn’t return calls from Reuters seeking comment.",
    "The five munitions plants supplied by the billionaires’ companies include the massive Sverdlov facility in Dzerzhinsk.",
    "The plant is the only significant maker in Russia of the plastic explosives HMX and RDX used in artillery and missiles, according to a Ukrainian intelligence official.",
    "Two factories run by Eurochem — founded by Russian billionaire Andrey Melnichenko — supply chemicals to Sverdlov, according to the railway data.",
    "Eurochem is one of the world’s largest manufacturers of mineral fertilizers.",
    "Its Nevinnomysskiy Nitrogen plant in southwest Russia has sent at least 38,000 metric tons of acetic acid to Sverdlov during the Ukraine war, according to a Reuters analysis of the railway data.",
    "A second Eurochem facility, Novomoskovskiy Nitrogen sent nearly 5,000 metric tons of nitric acid to Sverdlov in the same period, the railway data showed.",
    "Both acetic acid and nitric acid are used to make HMX and RDX.",
    "According to Reuters calculations, based on scientific literature and reviewed by an explosives expert, 5,000 tons of nitric acid could be used to make 3,000 tons of RDX, enough to fill 500,000 large-caliber artillery shells.",
    "The tax invoices reviewed by Reuters confirmed that Eurochem was a supplier to Sverdlov last year.",
    "In response to detailed questions, Eurochem said Reuters’ reporting contained “numerous material factual errors.” Specifically, “EuroChem is not part of the defense sector of the Russian economy and none of our products are designed for military purposes,” read a statement from the company, which is headquartered in Switzerland.",
    "Eurochem said that any suggestion Melnichenko controlled the company was false.",
    "Melnichenko did not respond to questions.",
    "The billionaire, said by Forbes to be worth $17.5 billion, placed his controlling stake in Eurochem into a trust that benefits his wife, as Reuters has reported, after the imposition of sanctions on him by the EU and Nato following the invasion of Ukraine.",
    "The statement said that while 97% of its output is fertilizer, Eurochem supplies other industrial products, including these chemicals, to a wide number of clients in Russia and abroad.",
    "The company didn’t answer Reuters’ questions about the chemical shipments to Sverdlov.",
    "Questions sent to the email address on Sverdlov’s website went unanswered.",
    "Tax data Another fertilizer giant, Uralchem, founded by sanctioned billionaire Dmitry Mazepin, provided Sverdlov more than 27,000 metric tons of ammonium nitrate, the railway data showed.",
    "Ammonium nitrate is used to make HMX and RDX, and is also mixed with TNT to produce an explosive called Amatol.",
    "Uralchem also supplied 6,000 metric tons of nitric acid from its nitrogen fertilizer plant in Berezniki to Sverdlov, the data showed.",
    "Two other state-owned munitions plants, the Tambov Gunpowder Plant and Kazan Gunpowder Plant, received shipments of acids from Uralchem, the rail data showed.",
    "The leaked Russian tax invoices, reviewed by Reuters, also revealed that Uralchem supplied the Sverdlov, Tambov, and Kazan factories as well as the state-owned Perm Powder plant last year.",
    "Asked in detail about the shipments, Uralchem said the information was “incorrect.” It did not provide further details or explanation.",
    "Mazepin, who reduced his ownership of the company from 100% to 48% just after the invasion of Ukraine, couldn’t be reached for comment.",
    "The Tambov, Perm, and Kazan plants didn’t reply to questions sent to email addresses listed on their websites or on corporate filings.",
    "A steel plant in Siberia owned by London-listed Evraz supplied 5,000 metric tons of toluene — an ingredient for TNT — to the Biysk Oleum Plant, according to the rail data.",
    "Evraz was sanctioned in 2022 by the British government which said it supplied steel to the Russian military.",
    "In a statement, Evraz said it only supplied toluene for “civilian use only.” The Biysk Oleum plant, a unit of Sverdlov, didn’t respond to requests for comment.",
    "In April 2024, the government of Altai region, which includes the city of Biysk, listed the plant among manufacturers that “significantly increased” their 2023 production in fulfilment of state defense procurement contracts.",
    "Reuters identified two other billionaire-linked companies supplying chemicals to munitions factories.",
    "The Sredneuralsk Copper Smelting Plant (SUMZ) in the Ural mountains, founded by metals magnate Iskander Makhmudov, provides oleum — also known as fuming sulphuric acid — used in the Tambov, Kazan, and Perm powder plants.",
    "The Lukoil refinery in Perm provided 6,500 metric tons of toluene to the Perm powder plant, Kazan, and Biysk.",
    "Lukoil is part-owned by billionaire Alekperov, the company’s former president.",
    "Like others, he divested many shares in 2022 but retained an 8.55% stake.",
    "The tax invoices reviewed by Reuters showed that the Lukoil plant was a supplier to the Perm powder plant last year.",
    "They also document shipments from SUMZ to the Kazan and Perm plants.",
    "In a statement, Lukoil said its Perm refinery “does not manufacture explosives or any related components” and that questions from Reuters about shipments from there contained “absurd speculations.” SUMZ did not respond to detailed questions.",
    "Its parent company, UMMC, which is under sanctions by the US and Britain, did not respond to a request for comment.",
    "Makhmudov, who divested his controlling stake in 2022, according to Forbes, also couldn’t be reached for comment.",
    "– Rappler.com Add a comment There are no comments yet.",
    "Add your comment to start the conversation.",
    "How does this make you feel?"
  ],
  "topics": {
    "Culture": 0.8430976271629333,
    "Energy": 0.8405740857124329,
    "Economy": 0.8272862434387207,
    "Conflict": 0.8175466656684875,
    "Education": 0.8009217381477356,
    "Technology": 0.798257052898407,
    "Diplomacy": 0.7962023615837097,
    "Transport": 0.7952859401702881,
    "Environment": 0.7885578870773315,
    "Politics": 0.7324317693710327,
    "Health": 0.7095685005187988,
    "Crime": 0.6564121246337891,
    "Elections": 0.6429020762443542,
    "Military": 0.6083374619483948
  },
  "sentiment": {
    "positive": 0.24,
    "negative": 0.76,
    "neutral": 0.0
  }
}