{
  "title": "Shafqat Ali Khan appointed as foreign office spokesperson",
  "published_date": null,
  "url": "https://www.bolnews.com/pakistan/2025/01/shafqat-ali-khan-appointed-as-foreign-office-spokesperson/",
  "original_language": "en",
  "cleaned_sentences": [
    "Career diplomat and former ambassador to Russia Shafqat Ali Khan on Thursday was appointed the new spokesperson for the Ministry of Foreign Affairs.",
    "Shafqat has been appointed as the new spokesperson for Pakistan’s Foreign Office, replacing Mumtaz Zahra Baloch, who has been designated as the country’s ambassador to France.",
    "Deputy Prime Minister and Foreign Minister Ishaq Dar announced the appointment during a press conference.",
    "He commended Mumtaz Baloch’s contributions as the outgoing spokesperson and stated that her posting as ambassador to France was a recognition of her exemplary service.",
    "Mumtaz Baloch initially assumed the role of Foreign Office spokesperson in November 2022, succeeding senior diplomat Asim Iftikhar Ahmed, who was also posted as ambassador to Paris.",
    "Interestingly, she has now replaced Iftikhar once again, as he has taken charge as the additional permanent representative (APR) of Pakistan at the United Nations headquarters in New York.",
    "Currently serving as additional secretary for Europe in the Ministry of Foreign Affairs, Shafqat Ali Khan has served as Pakistan’s ambassador to Russia and Poland, DG Europe at MoFA and deputy permanent representative to the United Nations in Geneva.",
    "Read More News On Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
  ],
  "topics": {
    "Politics": 0.9022529125213623,
    "Diplomacy": 0.8729740977287292,
    "Conflict": 0.7230891585350037,
    "Technology": 0.6830133199691772,
    "Culture": 0.50761878490448,
    "Elections": 0.462934285402298,
    "Military": 0.45982712507247925,
    "Energy": 0.43381571769714355,
    "Environment": 0.4152221083641052,
    "Economy": 0.3308858573436737,
    "Health": 0.32589423656463623,
    "Transport": 0.3122997581958771,
    "Education": 0.22305744886398315,
    "Crime": 0.15117788314819336
  },
  "sentiment": {
    "positive": 0.875,
    "negative": 0.125,
    "neutral": 0.0
  }
}