{
  "title": "Gazprom's grandeur fades as Europe abandons Russian gas",
  "published_date": null,
  "url": "https://finance.yahoo.com/news/gazproms-grandeur-fades-europe-abandons-070342076.html",
  "original_language": "en",
  "cleaned_sentences": [
    "(Reuters) -When the CEO of Russian state gas giant Gazprom, Alexei Miller, opened a lavish Italian palazzo-styled building in central St Petersburg to house the company's export arm 11 years ago, he augured a future funded by European sales.",
    "\"This is symbolic,\" he said, referring to the modern new offices in Russia's most European city.",
    "\"Europe will increasingly need Russian gas.\"",
    "Instead, the opulent offices have come to symbolize Gazprom's rapid decline, dragged down by the almost total loss of European markets after the war in Ukraine ruptured Russia's ties with the West.",
    "Reeling under multi-billion-dollar losses and scrambling for savings, the company is now considering putting the palazzo up for sale along with other luxury properties it owns, according to a Gazprom executive and another source with knowledge of internal discussions at Gazprom.",
    "Gazprom is arguably the Russian business hardest hit by the international sanctions imposed after Russia's full-scale invasion of Ukraine three years ago.",
    "Although Russia's economy has been resilient, growing signs of strain have appeared in several industries.",
    "Reuters has previously reported that President Vladimir Putin is concerned as heavy military spending distorts the wider economy.",
    "The number of staff at Gazprom Export, once the most prosperous unit of the company, overseeing Soviet and Russia's gas sales to Europe for over half a century, has shrunk to just a few dozen employees, the same two sources told Reuters.",
    "That's down from 600 employees five years ago, at the peak of Russian exports to Europe.",
    "The possible sale of the building and cuts at the unit have not been previously reported.",
    "Gazprom's media department and the Russian energy ministry did not respond to detailed requests for comment on the story's findings.",
    "With no European sales, the remaining workers are focused mainly on litigation with former EU buyers, the sources told Reuters.",
    "Gazprom Export is \"just a shell,\" one of the sources said.",
    "Alexei Grivach, from pro-Kremlin think tank the National Energy Security Fund, said Gazprom's less glamorous focus in the near future will be to bring gas to more Russian homes.",
    "\"Gazprom has been handed the social task of gasification and secure gas supply to the economy and the population at low regulated prices,\" he said.",
    "Reuters spoke to three executives and half a dozen former and current employees for this story on the depth of change at what used to be Russia's most valuable company.",
    "All requested anonymity, citing fear of professional repercussions.",
    "WIDER CUTS Gazprom's problems extend well beyond the export unit, the conversations with the employees reveal.",
    "Two of the sources told Reuters that Miller has now approved plans to cut 1,500 jobs at the parent company's headquarters in Russia and Europe's tallest skyscraper, the British-designed Lakhta Centre, also in St Petersburg.",
    "The dismissals at Gazprom headquarters have yet to be announced but staff have been asked to prepare individual presentations about why they should keep their jobs, according to one of the sources, who said employees were told to write up a description of their job functions in case of overlaps.",
    "The source said the process was expected to be completed within a few weeks.",
    "The cuts add up to about 40% of the staff at Gazprom's headquarters, but a small fraction of its half million strong work force, spread across Russia.",
    "Management misjudged how resolute European capitals would be, according to one of the executives, who said the thinking inside the company was that Europe would quickly be back \"begging\" for Russian gas supplies to resume.",
    "Despite the economic pain of higher energy costs, the EU has not rolled back sanctions.",
    "\"We proved to be wrong,\" the executive said.",
    "U.S. gas exporters quickly moved to replace Russian gas in Europe.",
    "The U.S. has become the biggest exporter of LNG to the continent, with supplies tripling since 2021.",
    "Europe still buys Russia's sea-borne liquefied natural gas (LNG), but mainly from Gazprom's rivals, Novatek's Yamal LNG plant.",
    "The European Union aims to end its use of Russian fossil fuels by 2027 and its overall gas consumption has decreased in part due to a shift to renewable energy sources.",
    "Last year, Gazprom posted a net loss of $7 billion for 2023, its first since 1999, the year Putin came to power.",
    "It posted another loss in the first 9 months of 2024, the latest period for which figures are available.",
    "Gazprom's share price fell in mid-December to its lowest since January 2009, touching 106.1 roubles, a decline of more than a third since the start of 2024.",
    "A few months after announcing the annual loss, Gazprom said last year it was selling a portfolio of high-end properties that include well-known luxury hotels in Moscow and in Armenia's Valley of Flowers.",
    "Gazprom has a long history of investing in luxury property, which it uses to reward employees with holidays, and to host conferences and events such as the 2014 Olympic Games.",
    "TRUMP TRADE The return of Donald Trump to the White House has helped Gazprom's share price recover to around 180 roubles on hopes a swift Ukrainian peace deal would lead to the restoration of exports to Europe, Alpha Bank said in a note last month.",
    "However, there are few signs the continent will rush to again tie itself to Russian gas, despite a Financial Times report that a long-time ally of Putin is lobbying the United States to allow investors to restart the $11 billion Nord Stream 2 pipeline that carried gas from Russia via Germany.",
    "Germany says it will stick with its policy of independence from Russian energy.",
    "Even if there were appetite, Nord Stream is out of service and partly damaged.",
    "Cederic Cremers, executive vice president of integrated gas at Shell, said in late February at the International Energy week conference in London in response to whether Russian pipeline gas could return to Europe: \"That depends on a lot of things.\"",
    "He cited multiple arbitration cases with Gazprom and asked \"will customers and Europe still want the same dependence on Russian gas?\"",
    "Gazprom's share in EU markets has shrunk to 7% from over 35% before EU sanctions, European Commission data shows.",
    "Its market capitalisation as of Wednesday stands at around $46 billion, down from the all-time high of $330.9 billion in 2007, according to the Moscow stock exchange, Gazprom and Reuters calculations.",
    "MILLER'S TIME As the company adjusts to its new role as a domestic gas supplier, the lofty ambitions of CEO Miller have been dashed.",
    "In 2007, Miller said the company would eventually have a market capitalisation of $1 trillion.",
    "At the time this seemed possible.",
    "Russia holds a fifth of the planet's gas resources, rendering Gazprom the world's largest natural gas company by reserves.",
    "At its height, Gazprom - formed in the Soviet Union from the Ministry of the Gas Industry - generated revenues that accounted for over 5 percent of Russia's $2 trillion annual gross domestic product.",
    "The company has been run by Miller, a close friend of Putin since the Russian president was mayor of St Petersburg in 1990s, for the past 24 years.",
    "Miller has been on the U.S. sanctions list since 2018, barring U.S. citizens and entities from any dealings with him.",
    "Gazprom controls entire towns in Siberia and the Arctic such as Nadym where tens of thousands of employees and their families depend on it as the sole employer.",
    "Yury Shafranik, Russian fuel and energy minister from 1993 to 1996, told Reuters in 2023 that Gazprom had been a \"state within a state.\"",
    "The sources Reuters spoke to did not describe plans for job cuts or the closure of production assets in such company towns.",
    "Putin's long-term promise to replace Europe's markets with exports to China look optimistic at best.",
    "Even the most ambitious projects currently being considered to pipe gas eastward would not amount to half of the previous annual peak exports of 180 billion cubic meters (bcm) Much of Russia's gas went through pipelines to Europe.",
    "When Germany and other European countries stopped buying it, there was nowhere else for the surplus to go.",
    "In contrast, Russia's oil exporters have been able to redirect tankers to refineries in Asian countries that have not imposed sanctions.",
    "Although gas production recovered slightly last year from a record low in 2023 on increased domestic demand and exports to China, there is little pipeline capacity to expand that trade.",
    "For now there is only one route for Russia to supply pipeline gas to China – the Power of Siberia pipeline, which transports 38 bcm per year.",
    "A second smaller pipeline with a capacity of 10 bcm per year is under construction, set to connect the Pacific island of Sakhalin to China by 2027.",
    "Russia and China have been in talks for over a decade about building a third pipeline, the Power of Siberia 2, to carry 50 bcm and meet over a tenth of Chinese gas consumption.",
    "This plan would take years to fully develop and discussions have stalled due to price differences, according to media reports.",
    "In May, Russian Deputy Prime Minister Alexander Novak said Russia and China expected to a sign a contract \"in the near future\" on the Power of Siberia 2 gas pipeline.",
    "Putin and China's President Xi Jinping discussed Power of Siberia-2 in January, news agency Interfax reported, but no agreement has been reached.",
    "China National Petroleum Corporation, which is dealing with Gazprom, declined to comment on the talks.",
    "The government of Russia did not respond to a request for comment.",
    "Even if the Power of Siberia 2 pipeline were completed quickly, volumes and pricing terms are likely to be much lower than past exports to Europe, analysts from the Center on Global Energy Policy at Columbia University.",
    "\"By 2030, Russian gas export revenues might fall by 55–80 percent compared to 2022, a year of record-high revenues for the Russian gas industry, at $165 billion,\" they said in a research note last year.",
    "(Reporting by Reuters; Editing by Simon Webb and Frank Jack Daniel)"
  ],
  "topics": {
    "Diplomacy": 0.5750693082809448,
    "Culture": 0.4789576530456543,
    "Politics": 0.46356651186943054,
    "Conflict": 0.460633784532547,
    "Economy": 0.4516966938972473,
    "Environment": 0.4233768880367279,
    "Transport": 0.4229046404361725,
    "Technology": 0.4200907051563263,
    "Energy": 0.4093295931816101,
    "Education": 0.35431626439094543,
    "Elections": 0.31748634576797485,
    "Military": 0.27535343170166016,
    "Health": 0.26892638206481934,
    "Crime": 0.2184816598892212
  },
  "sentiment": {
    "positive": 0.304,
    "negative": 0.696,
    "neutral": 0.0
  }
}