{
  "title": "A new compass for the Global South",
  "published_date": null,
  "url": "https://www.thenews.com.pk/print/1260637-a-new-compass-for-the-global-south",
  "original_language": "en",
  "cleaned_sentences": [
    "President Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support each other in taking the path to moderniaation” and announced the formation of a Global South Think Tanks Alliance to “promote people-to-people exchanges and experience-sharing”.",
    "Politicians and policymakers of the developing countries were quick to heed the call coming from the leader of a country that has accounted for close to three-quarters of global poverty reduction since 1980.",
    "In Nanjing in China’s Jiangsu province, during a historic conclave of political leaders and representatives of think tanks from over 100 countries, the Global South Think Tanks Alliance was officially launched on Thursday, November 14, 2024.",
    "This pool of resources from more than 200 universities and institutions from China and other developing counties will investigate, among others, the reasons behind the failures of Western theories of development and globalisation and conduct research to highlight how each developing country can forge its own unique path of modernisation, as demonstrated by the success of China.",
    "After World War I, the establishment of the Bretton Woods institutions and the UN system inaugurated the first-ever global security and economic order.",
    "However, the emergence of the USSR as an ideological rival prevented the US from exercising uncontested hegemony.",
    "All this changed when the curtain fell on the Soviet Union in December 1991.",
    "All international institutions were now under the political and ideological sway of the US and its European allies.",
    "For the next quarter century, the West purveyed its values, political institutions, economic models, security organisations, and cultural norms as the inexorable destiny of all mankind.",
    "No society could find stability, develop economically, or make social progress except within the framework of liberal democracy, market economy, and Western notions of freedom and human rights.",
    "Russia, other republics of the former Soviet Union, and nations of Eastern Europe were the first to experience the transformation of their societies in the ‘new world order’.",
    "These countries were cajoled and coerced by Washington into accepting the ‘shock therapy’ of disarmament, denuclearisation, democratisation, privatisation, and wholesale deregulation and liberalisation.",
    "The results were less than salubrious.",
    "Following the collapse of the Soviet Union, Russia, the biggest member state of the now-defunct Warsaw Pact countries, underwent an economic contraction worse than the one faced by the US during the Great Depression.",
    "It experienced a decade of political chaos, hyper-inflation, unemployment, breakdown of internal security, and disintegration of the moral fabric of society.",
    "The Russian population has been declining ever since.",
    "Countries in Africa, Latin America, and Asia were made to follow the same set of policies through soft and hard power tactics.",
    "After nearly three decades, the results outside Eastern Europe and the Commonwealth of Independent States are even less encouraging.",
    "Economically, countries in Latin America have either regressed or remain stagnant.",
    "Politically multi-party democracy has failed to flourish on the continent.",
    "During the same period, Africa’s share of the poor population of the world has risen from 56 per cent to over 67 per cent despite more than $2 trillion in development assistance according to some estimates.",
    "Sub-Saharan Africa is home to more failed states than any other part of the world.",
    "Only in East and Southeast Asia have countries succeeded in achieving regional peace, domestic stability, and economic progress.",
    "This has been made possible not by copying the Western template but by deviating from it in terms of ideology, institutional arrangements, and policy framework.",
    "China is the most notable example of this East Asian exceptionalism.",
    "Since the reform and opening up beginning in 1978, China has modernised and engaged with the outside world without succumbing to the Western model of development and global integration.",
    "China reestablished relations with the World Bank and the IMF in 1980 but has avoided falling into a debt trap or requiring financial bailouts.",
    "In the late 1980s, despite extreme national and international pressure, China wisely resisted calls for Western-style democracy.",
    "Ignoring the policy advice of multilateral institutions for en masse privatisation, China successfully incentivised and made its state-owned enterprises (SOE) profitable.",
    "Similarly, it protected its industrial base while successfully integrating into the global economy following accession to the World Trade Organization (WTO) in 2001.",
    "Most significantly, China rejected the West’s trickle-down economic theories and employed state machinery to divert resources towards less developed regions, sectors, and population groups.",
    "As a result, while other countries faltered, China succeeded in lifting nearly 800 million people out of poverty.",
    "China’s economic success has shattered the spell of Western ideological hegemony and opened new possibilities for developing countries to pursue policies that suit their social, political, and historic realities.",
    "These nations, a majority of whom are falling short in their goal to end extreme poverty by 2030, can draw encouragement from the example of China which has met the poverty reduction target of the UN’s 2030 Agenda for Sustainable Development ahead of schedule.",
    "China’s continuing modernisation drive since the election of Xi Jinping to the post of general secretary of the Communist Party of China (CPC) by the 18th National Congress in 2012 has defied the West’s ‘end of history’ thesis and proved wrong its predictions that economic growth would either turn China into a mirror image of Western society or the country would face social unrest and implode economically.",
    "The Western argument that multi-party adult franchise democracy and laissez-faire economic policies provide the sole pathway to prosperity no longer appears persuasive.",
    "The rise of China is not just characterised by strategic autonomy but also by humility, the principle of non-interference, and strategic restraint.",
    "While China has displayed leadership by initiating the Global South Think Tanks Dialogue and forming an alliance of research institutions from more than one hundred countries, it has no desire to export its political institutions and economic model.",
    "China only functions as a mirror.",
    "It is for the public intellectuals of the Global South to ponder why their societies are falling behind despite being the poster children of Western globalisation while China has succeeded in rejuvenating its civilisation by following a path forged by its people and history.",
    "The message of President Xi Jinping to the Global South, delivered at the G20 Summit in Rio de Janeiro on November 18, can serve as a source of inspiration: “if China can make it, other developing countries can make it too”.",
    "The writer is the chairperson of Crescent Foundation, Pakistan.",
    "Improving health and well-being of nurses and midwives must begin with protecting their basic rights But beyond euphoric headlines, reality unfolded quite differently and far more swiftly Whether we like it or not, we must accept that war is a reality; one can’t stop it from happening This does not augur well for country or people and must be remedied AI promises to inject much-needed agility, accuracy, and scalability into public administration As field marshal, he has also taken over command of other armed forces, including air force and navy"
  ],
  "topics": {
    "Diplomacy": 0.9051092267036438,
    "Economy": 0.8853930830955505,
    "Politics": 0.8763037919998169,
    "Culture": 0.8741648197174072,
    "Environment": 0.8588895797729492,
    "Energy": 0.8133792281150818,
    "Transport": 0.798202633857727,
    "Conflict": 0.7100998163223267,
    "Education": 0.6808397769927979,
    "Technology": 0.6704826354980469,
    "Elections": 0.649569034576416,
    "Health": 0.5983680486679077,
    "Military": 0.40174365043640137,
    "Crime": 0.18368735909461975
  },
  "sentiment": {
    "positive": 0.558,
    "negative": 0.442,
    "neutral": 0.0
  }
}