{
  "title": "Azerbaijan says Russia shot at plane before crash, demands it admit",
  "published_date": null,
  "url": "https://www.thenews.com.pk/latest/1266669-azerbaijan-says-russia-shot-at-plane-before-crash-demands-it-admit",
  "original_language": "en",
  "cleaned_sentences": [
    "Azerbaijani President Ilham Aliyev accused Russia on Sunday of firing at an Azerbaijan Airlines passenger jet before it crashed and of initially trying to cover up the cause of the fatal disaster, demanding that Moscow admit guilt.",
    "Aliyev made the accusation in an interview to state media at Baku airport four days after the AZAL plane crashed in Kazakhstan, killing 38 people of the 67 people on board.",
    "Azerbaijani officials have suggested the aircraft was hit by a Russian air-defence system as it tried to land in Grozny, capital of the Russian republic of Chechnya.",
    "Aliyev's unusually forthright accusation of his country's traditional ally came a day after he spoke by phone to Russian President Vladimir Putin.",
    "A Kremlin statement on the phone call gave no indication that Putin had claimed responsibility for the crash.",
    "\"The facts are that the Azerbaijani civilian plane was damaged from the outside over Russian territory, near the city of Grozny, and almost lost control,\" Aliyev told state television.",
    "\"We also know that electronic warfare systems put our plane out of control... At the same time, as a result of fire from the ground, the tail of the plane was also severely damaged,\" he said.",
    "Aliyev said that while \"of course, our plane was hit by accident\", Baku was angry that Moscow had apparently tried to hide the cause of the crash and demanded its ally admit what happened.",
    "He said it was \"regrettable and surprising\" that Moscow \"put forward theories\" that, he said, \"clearly showed he Russian side wanted to cover up the issue\".",
    "\"For the first three days, we heard nothing from Russia except some absurd theories,\" he said, adding that these included the plane hitting a flock of birds.",
    "He called the theory \"completely removed\" from reality, pointing out that the plane's \"fuselage is riddled with holes\".",
    "Russia has said Grozny was being attacked by Ukrainian drones the day the AZAL flight tried to land.",
    "Aliyev urged Moscow to issue a public apology to his country, saying Baku had made official \"demands\" to Russia two days ago.",
    "\"First, the Russian side must apologise to Azerbaijan.",
    "\"Second, it must acknowledge its guilt.",
    "\"Third, those responsible must be punished, brought to criminal responsibility, and compensation must be paid to the Azerbaijani state, as well as to the injured passengers and crew members.",
    "\"These are our conditions,\" Aliyev said, in unusually strong language towards Moscow.",
    "The Kremlin said on Saturday that during their phone conversation, Putin had apologised to Azerbaijan over the \"tragic incident\".",
    "Putin said Russian air defence was operating in Grozny on December 25 when the plane tried to land, before diverting and crashing in western Kazakhstan.",
    "The Kremlin statement gave no indication that Putin had said Russia was at fault.",
    "Later on Saturday, the Russian leader called for a \"transparent\" probe into the crash.",
    "Aliyev's office said on Saturday he had \"emphasised\" during the call that the plane had been subject to outside interference over Russia.",
    "Russian news agencies reported that Putin and Aliyev discussed the crash again on Sunday.",
    "The United States said this week it had \"early indications\" that Russia was responsible for the crash but did not provide details.",
    "The European Union called on Saturday for a \"swift\" and \"independent\" probe into the crash.",
    "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
  ],
  "topics": {
    "Technology": 0.9662489891052246,
    "Energy": 0.9341223239898682,
    "Politics": 0.9286898970603943,
    "Environment": 0.9253813028335571,
    "Culture": 0.9000417590141296,
    "Economy": 0.8909019231796265,
    "Conflict": 0.8859963417053223,
    "Health": 0.8567601442337036,
    "Elections": 0.8482010960578918,
    "Education": 0.823036253452301,
    "Diplomacy": 0.7673726081848145,
    "Transport": 0.745184063911438,
    "Military": 0.7232850193977356,
    "Crime": 0.54343581199646
  },
  "sentiment": {
    "positive": 0.154,
    "negative": 0.846,
    "neutral": 0.0
  }
}