{
  "title": "Russia ‘close to’ deal with rebels to retain military bases in Syria",
  "published_date": null,
  "url": "https://www.thenews.com.pk/print/1261088-russia-close-to-deal-with-rebels-to-retain-military-bases-in-syria",
  "original_language": "en",
  "cleaned_sentences": [
    "MOSCOW: Russia has established direct contacts with the political committee of Syria’s Islamist rebel group, Hayat Tahrir al-Sham, the Interfax news agency quoted Russian Deputy Foreign Minister Mikhail Bogdanov as saying on Thursday.",
    "Interfax reported that Bogdanov, speaking to journalists, also said that Moscow aimed to maintain its military bases in Syria to continue “fighting international terrorism”.",
    "Bogdanov said contacts with HTS, the most powerful force in the country after the overthrow of President Bashar al-Assad, were “proceeding in constructive fashion”.",
    "Russia, he said, hoped the group would fulfil its pledges to “guard against all excesses”, maintain order and ensure the safety of diplomats and other foreigners.",
    "Bogdanov said Russia hoped to maintain its two bases in Syria - a naval base in Tartous and the Khmeimim Air Base near the port city of Latakia - to keep up efforts against international terrorism.",
    "“The bases are still there, where they were on Syrian territory.",
    "No other decisions have been made for the moment,” he was quoted as saying.",
    "“They were there at the Syrians’ request with the aim of fighting terrorists from the Islamic State.",
    "I am proceeding on the basis of the notion that everyone agrees that the fight against terrorism, and what remains of IS, is not over.” Maintaining that fight, he said, “requires collective efforts and in this connection, our presence and the Khmeimim base played an important role in the context of the overall fight against international terrorism.” Five Russian warships, including three frigates and at least one submarine, were photographed in Tartus port last week but had left by Monday.",
    "The warships were in a holding pattern 10 miles off the Syrian coast, out of range of rebel artillery and drone attacks, images released by US-based Maxar showed.",
    "MarineTraffic data also showed no ship had docked at or left Tartus since Monday.",
    "Moscow has not commented, but well-connected military bloggers and propagandists confirmed the Kremlin had withdrawn its warship from Tartus.",
    "Sources have also said that Moscow withdrew its warplanes from the Khmeimim Air Base, 75 miles north of Tartus, while it opened negotiations with HTS commanders.",
    "Anastasia Kashevarova, a pro-war Russian propagandist, told her 250,000 Telegram followers that rebel fighters had surrounded Russia’s bases in Syria.",
    "“Currently, negotiations on Syria are underway between Russia, Turkey, Iran and others,” she said.",
    "“The issue of Russian military bases in Syria is open.” Putin is desperate to retain control of its military bases in Syria, where Moscow intervened to prop up Assad during the civil war in 2015.",
    "The Tartus Naval Base has been the lynchpin for Russia’s operations in the Mediterranean Sea and across Africa.",
    "It is the only naval base in the region that the Kremlin independently controls and has been its main “replenishment and repair” centre.",
    "Analysts have said that the Kremlin had also maintained a “well-armed naval squadron” at Tartus.",
    "Built by the Soviet Union in 1971, Putin expanded Tartus in 2015 after his intervention in Syria to challenge the West in Africa, where he has since encouraged a series of coups by client rebel commanders and deployed mercenaries.",
    "The Khmeimim Air Base played an important role in defeating rebels in 2015.",
    "Russian forces launched carpet bombing missions from the base, killing thousands of civilians and destroying rebel positions.",
    "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
    "—... Representational image of chickens.",
    "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
  ],
  "topics": {
    "Environment": 0.8549975156784058,
    "Crime": 0.8497360348701477,
    "Conflict": 0.8332105875015259,
    "Diplomacy": 0.8207410573959351,
    "Energy": 0.8120914697647095,
    "Health": 0.8115986585617065,
    "Politics": 0.789254367351532,
    "Military": 0.7518534660339355,
    "Economy": 0.7497844696044922,
    "Technology": 0.7213936448097229,
    "Transport": 0.6867989897727966,
    "Elections": 0.6491652131080627,
    "Culture": 0.6006453037261963,
    "Education": 0.28261587023735046
  },
  "sentiment": {
    "positive": 0.32,
    "negative": 0.68,
    "neutral": 0.0
  }
}