{
  "title": "Early indications suggest Azerbaijan plane possibly downed by Russia: White House",
  "published_date": null,
  "url": "https://www.thenews.com.pk/latest/1266104-early-indications-suggest-azerbaijan-plane-possible-downed-by-russia-white-house",
  "original_language": "en",
  "cleaned_sentences": [
    "The United States has seen early indications suggesting that the Azerbaijan Airlines jet that crashed in Kazakhstan this week was possibly brought down by Russian air defense systems, the White House said on Friday, adding that Washington had offered assistance to the investigation into the crash.",
    "\"We [...] have seen some early indications that would certainly point to the possibility that this jet was brought down by Russian air defense systems,\" White House spokesperson John Kirby told reporters on a call.",
    "\"There's an ongoing investigation right now,\" involving Kazakhstan and Azerbaijan, Kirby said.",
    "\"We have offered our assistance to that investigation, should they need it.\"",
    "The jet crashed near the Kazakh city of Aktau on Wednesday, killing 38 of the 67 people on board, after attempting to land at its destination in the Russian city of Grozny and then diverting far off course across the Caspian Sea.",
    "Azerbaijan Airlines said it had suspended flights to 10 Russian airports and that preliminary results suggested the crash of Baku-Grozny flight J2-8243 was \"due to physical and technical external interference\".",
    "The head of Russia's civil aviation agency, Dmitry Yadrov, said in an earlier statement that \"the situation on this day and at these hours in the area of Grozny airport was very complex\".",
    "\"Ukrainian attack drones at this time were making terrorist attacks on civilian infrastructure in the cities of Grozny and Vladikavkaz,\" Yadrov said, referring to a nearby city.",
    "He said the Azeri pilot made \"two attempts to land the plane in Grozny that were unsuccessful\" in \"thick fog\".",
    "\"The pilot was offered other airports.",
    "He took the decision to go to Aktau airport,\" he added.",
    "The Kremlin earlier Friday declined to comment on the deadly crash.",
    "\"Until the conclusions of the investigation, we do not consider we have the right to make any comments and we will not do so,\" Kremlin spokesman Dmitry Peskov told reporters.",
    "Some aviation and military experts have pointed to signs of shrapnel damage on the plane wreckage as evidence it was hit by air defence systems.",
    "An Azerbaijan pro-government website, Caliber, and several other media have cited unnamed Azerbaijani officials as saying they believed a Russian missile fired from a Pantsir-S1 air defence system caused the crash.",
    "Ukrainian President Volodymyr Zelensky has called for a \"thorough investigation\" and also pointed to Russian involvement.",
    "\"Every loss of life deserves a thorough investigation to establish the truth.",
    "We can see how the clear visual evidence at the crash site points to Russia's responsibility for the tragedy,\" he said in a post on social media.",
    "A Russian survivor, Subkhonkul Rakhimov, told state broadcaster RT that an \"explosion\" appeared to happen outside the plane as it attempted to land in Grozny in fog, causing shrapnel to penetrate inside.",
    "\"I wouldn't say it was inside the plane because the skin of the fuselage near where I was sitting flew off,\" he said.",
    "\"I grabbed a life jacket and saw there was a hole in it — it was pierced by shrapnel.\"",
    "Azerbaijan's President Ilham Aliyev said on Friday that he had phoned his Kazakh counterpart Kassym-Jomart Tokayev, with both pledging that the \"causes of the crash would be fully examined\", according to a statement from Baku.",
    "Contacted by AFP, Azerbaijani government officials did not respond to questions about the possible causes of the crash.",
    "But Rasim Musabekov, an Azerbaijani lawmaker and member of the parliament's international relations committee, urged Russia to apologise for the incident.",
    "\"They have to accept this, punish those to blame, promise that such a thing will not happen again, express regrets and readiness to pay compensation,\" Musabekov told AFP.",
    "He suggested the plane was not allowed to land at Grozny or a nearby Russian airport — instead being \"sent far away\" across the Caspian Sea to Kazakhstan — in an attempt to \"cover up a crime.\"",
    "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
  ],
  "topics": {
    "Technology": 0.9385435581207275,
    "Environment": 0.9344054460525513,
    "Diplomacy": 0.8954417705535889,
    "Energy": 0.886417031288147,
    "Transport": 0.8842330574989319,
    "Conflict": 0.8815116286277771,
    "Politics": 0.8795958757400513,
    "Health": 0.8768513798713684,
    "Education": 0.8323789834976196,
    "Culture": 0.8301750421524048,
    "Economy": 0.8251643776893616,
    "Military": 0.794384241104126,
    "Crime": 0.7865920066833496,
    "Elections": 0.7347034811973572
  },
  "sentiment": {
    "positive": 0.111,
    "negative": 0.889,
    "neutral": 0.0
  }
}