{
  "title": "Pak-Russia IGC meeting discusses cooperation in energy sector",
  "published_date": null,
  "url": "https://www.thenews.com.pk/print/1260780-pak-russia-igc-meeting-discusses-cooperation-in-energy-sector",
  "original_language": "en",
  "cleaned_sentences": [
    "ISLAMABAD: The collaboration in gas infrastructure development, oil field services, oil and LNG trade was widely discussed during the Inter-Governmental Commission (IGC) meeting held in Moscow on December 2-4, 2024, though no MoU was signed on energy cooperation.",
    "However, Pakistan and Russia have agreed that the Pakistan Stream Gas Pipeline Project (PSGP) will be considered in terms of a comprehensive infrastructure program, which is economically viable for sustainable gas infrastructure development of Pakistan with ensuring affordable gas supplies.",
    "“The IGC meeting was informed that Pakistan has initiated a detailed study regarding the energy demand and supply along with the infrastructure requirements and, to this effect, the results of study will be shared with the Russian side on completion by third quarter of 2025.” “Both the countries agreed to continue negotiations on this matter within the related Joint Working Group,” reveals the protocol signed by Sardar Awais Ahmad Khan Leghari, Minister for Energy (Power Division) of Pakistan, and Sergei Tsivilev, Minister of Energy of the Russian Federation, after the 9th IGC meeting held in Moscow on December 4, 2024.",
    "Both sides also agreed to facilitate dialogue among the commercial banks of Russian Federation and Pakistan to explore the possibility to establish correspondent relationship through interbank consultations.",
    "Both noted the successful development of the process of oil supplies to Pakistan under IGC, implemented by the Russian-nominated company Operational Services Center JSC.",
    "The sides expressed their satisfactory opinion on the feasibility of maintaining the status of a nominated company in the supply of oil and petroleum products for Operational Services Center JSC and continued further deliberations on procurement of oil under this arrangement.",
    "The sides noted the interest of Gazprom Neft PJSC in cooperating with Pakistani oil and gas companies (OGDCL, PPL and MPCL) in the field of oilfield services, including those through an integrated service model.",
    "Both the countries agreed to discuss possible ways of cooperation by the second quarter of 2025.",
    "Autonomous Non-Commercial Organization Institute of Oil and Gas Technological Initiatives (INTI) showed interest in establishing a dialogue with oil and gas companies (such as OGDCL, HDIP, Sui companies) and relevant ministries and departments of Pakistan on the issue of presenting and recognizing INTI standards to facilitate access of Russian oil and gas equipment to the local market.",
    "The sides agreed to hold online meetings between the companies in the first quarter of 2025 with a view to potentially entering MoUs on further cooperation.",
    "The sides were informed about the interest of Gazprom PJSC to investigate opportunities of LNG supplies from Portovaya LNG plant (the existing LNG production complex near the Portovaya compressor station in the Leningrad Region) to Pakistan.",
    "The Russian side noted the interest of PJSC NOVATEK in developing cooperation with Pakistani partners in the gas sector and ready to discuss LNG supplies with them as well as participation in integrated gas projects in Pakistan.",
    "The sides expressed their interest in organizing long-term LNG supplies from the project of “Gas processing complex within Ust-Luga ethane-rich gas processing cluster” to Pakistan.",
    "The Pakistani side informed that a detailed study has been initiated regarding the assessment of energy demand and supply.",
    "Based on the outcome of the study, the Pakistani side will be in a better position to decide on the purchase of LNG.",
    "The Pakistani side will share the results of the study on completion by third quarter of 2025.",
    "The sides supported the negotiations between RusChemAlliance (project operator) and Pakistan LNG Limited (PLL) and signing of long-term agreement for LNG supplies from the Project to Pakistan, taking into consideration the results of the study.",
    "The Pakistani side presented the investment opportunities for oil and gas exploration in offshore Pakistan.",
    "The Russian side requested to share technical details in order to develop dialogue on this matter.",
    "The details of offshore opportunities were shared and a follow up meeting was held with Zarubezhneft JSC and Pakistani E&P companies, part of the delegation.",
    "Further engagement on offshore exploration and onshore mature fields was agreed between Zarubezhneft JSC and OGDCL, PPL and MPCL.",
    "The Russian side noted the interest of Rosgeo JSC in enhancing cooperation in the field of geology and diversification of the mineral resource base of the Islamic Republic of Pakistan.",
    "Russia showed interest in diversifying exports of coal and coal chemicals products through supplies to Pakistan and handed over to the Pakistani side a list of issues for detailed consideration of the issue.",
    "By the second quarter of 2025, the Pakistani side will send the Russian side answers to the requested information, including a list of potential Pakistani customers and (or) consumers of coal and coal chemistry products, in order to establish a direct dialogue with relevant Russian companies.",
    "Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
  ],
  "topics": {
    "Diplomacy": 0.7364971041679382,
    "Culture": 0.6106376647949219,
    "Technology": 0.6032418012619019,
    "Economy": 0.5886757373809814,
    "Politics": 0.5707290172576904,
    "Energy": 0.5634953379631042,
    "Environment": 0.5171718001365662,
    "Transport": 0.46938556432724,
    "Conflict": 0.4497106671333313,
    "Military": 0.42326459288597107,
    "Elections": 0.41423872113227844,
    "Education": 0.406801700592041,
    "Health": 0.32748639583587646,
    "Crime": 0.3230138123035431
  },
  "sentiment": {
    "positive": 0.88,
    "negative": 0.12,
    "neutral": 0.0
  }
}