{
  "title": "Zelensky agradece a Costa preparação de novas sanções a Moscovo",
  "published_date": null,
  "url": "https://www.noticiasaominuto.com/mundo/2787972/zelensky-agradece-a-costa-preparacao-de-novas-sancoes-a-moscovo",
  "original_language": "pt",
  "cleaned_sentences": [
    "\"The pressure on Russia should increase if it does not accept a complete and unconditional ceasefire,\" Zelensky wrote in a message on the X network where he copes with Costa at the European Political Community meeting (CEP), held today in the capital of Albanian.",
    "The Ukrainian President thanked the Costa for the EU preparations for the 17th joint package of sanctions against Russia since the beginning of the war and is expected to be announced on Tuesday.",
    "\"We hope it will be directed against everything that finances the Russian war machine: banks, oil, energy, metallurgy, and the ghost fleet,\" Zelensky said, referring to the ships that Russia uses to escape the sanctions in force over its energy exports.",
    "Zelensky and Costa also discussed Ukraine's efforts to be integrated into the EU.",
    "I Held a Meeting with the President of the European Council @eucopresident, António Costa, and the President of the European Commission, Ursula @vonderleyen.",
    "- Volodymyr Zelensky / володимир зеленсььий (@zelenskyua) May 16, 2025 I Infomed Them on Tose's Negotiations in Istanbul.",
    "Pressure on Russia Must Increase if it Does Not Add to a Full And… Pic.twitter.com/4JVKVWYF1E Following the Tyran meeting, French President Emmanuel Macron said European countries continue to prepare new sanctions against Russia in coordination with the United States, if Moscow continues to refuse a ceasefire in Ukraine.",
    "\"What remains relevant is (...) the only concrete proposal that was made is that of an unconditional ceasefire\" to Ukraine, defended from Tyran, after unsuccessful discussions on this subject in Istanbul.",
    "After less than two hours of meeting, Russian and Ukrainian negotiators announced an exchange of 1,000 prisoners on each side and discussed the possibility of a ceasefire and a meeting between Putin and Zelensky, but still without agreement.",
    "\"We continue (...) prepare new sanctions in coordination with the United States of America if there is no positive response,\" said Macron.",
    "The Ukrainian delegation expects \"in the next few hours\" a response to the requests to Moscow, said the French President, indicating that European leaders will also keep new talks with Donald Trump.",
    "The US leader \"intends to maintain discussions with the Russian side to clarify what happened,\" he added, mentioning possible \"telephone contacts\" initially with Vladimir Putin.",
    "Macron's statements appear after a joint call with Zelensky and the heads of government of Germany, the United Kingdom and Poland with Donald Trump.",
    "\"Ukraine is ready to take action as soon as possible to achieve real peace, and it is important that the world maintain a strong position,\" Zelensky said on social networks after joint call.",
    "The Ukrainian President reiterated that Ukraine's position is to maintain pressure on Russia until \"he is ready to end the war,\" adding that \"if the Russians reject a complete and unconditional ceasefire and the end of the murders,\" they deserve strong sanctions.",
    "Following the joint phone call with Trump, European leaders indicated that Russia's position in ceasefire negotiations with Ukraine is unacceptable and intend to coordinate a response to the new steps, which may include the aggravation of sanctions on Moscow.",
    "In his statements today, the French President also considered that George Simion, an ultra -nationalist Euro -centered, winning Romanian presidential elections, the consequences for neighboring Moldova could be \"very harmful\", warning of increased Russian pressure in the region.",
    "\"It is obvious to everyone that if the pro-Russian and Antieropeu candidate wins, the consequences for neighboring Moldova can be very harmful,\" Macron said, alluding to the separatist region of transnistria under Moscow's threat.",
    "Read also: Zelensky and European leaders talk to Trump after negotiations in Türkiye"
  ],
  "topics": {
    "Elections": 0.986049473285675,
    "Politics": 0.9770370125770569,
    "Energy": 0.9751805663108826,
    "Conflict": 0.9692267775535583,
    "Diplomacy": 0.945957601070404,
    "Culture": 0.9331749081611633,
    "Economy": 0.9247989654541016,
    "Technology": 0.8868257999420166,
    "Health": 0.8648686408996582,
    "Transport": 0.8527968525886536,
    "Military": 0.8506093621253967,
    "Environment": 0.8503344058990479,
    "Education": 0.7427594661712646,
    "Crime": 0.5422559380531311
  },
  "sentiment": {
    "positive": 0.368,
    "negative": 0.632,
    "neutral": 0.0
  }
}