{
  "title": "Zelensky responde a Putin: \"30h fazem manchetes. 30 dias oportunidades\"",
  "published_date": null,
  "url": "https://www.noticiasaominuto.com/mundo/2770647/zelensky-responde-a-putin-30h-fazem-manchetes-30-dias-oportunidades",
  "original_language": "pt",
  "cleaned_sentences": [
    "Ukraine President Volodymyr Zelensky proposes this Saturday to widen the truce proposed by Vladimir Putin, who provided the attacks to be suspended until Sunday, May 20.",
    "\"If the ceasefire is really effective, Ukraine proposes to extend it beyond Easter Day, April 20th.",
    "This is what will reveal the true intentions of Russia-because 30 hours are enough to make headlines, but not for genuine confidence creation measures.",
    "Thirty days could give peace,\" said Zelensky, in a post shared on social network X (former Twitter).",
    "The Ukrainian head of state said, however, that despite the advertised truce, the Russian attacks remained on some combat fronts, which he did to whom Kyiv \"did not trust the words of Moscow.\"",
    "\"We know very well how Moscow manipulates and we are prepared for everything,\" he wrote.",
    "The proposed corresponding for Full and Unconditional 30 Days Ceasefire has gone unanswed by Russia for 39 days.",
    "The United States Made this proposals, Ukraine Responed Positively, But Russia Ignored it.",
    "- Volodymyr Zelensky / володимир зеленсььий (@zelenskyua) April 19, 2025 If russia is now suddenly ready to truly engage in a format of full and… Zelensky also points out that he is awaiting information from Commander Oleksandr Syrskyi on operations in areas that continued to be affected by attacks even after the truce came into force (16 hours in Lisbon).",
    "On the social network, Zelensky also pointed to his finger to Moscow, noting that Russia let the proposal made by the United States, which reported a break in the conflict for 30 days.",
    "\"The corresponding proposal of a total and unconditional ceasefire of 30 days was unanswered by Russia for 39 days.",
    "The United States made this proposal, Ukraine responded positively, but Russia ignored it,\" he criticized.",
    "Zelensky also assured that Russia's actions would have response \"in Spain\" and that Kyiv would act accordingly: \"Silence in response to silence, defensive attacks in response to attacks.\"",
    "[News Updated at 8:13 pm] Also read: TRUCE?",
    "Zelensky accuses Putin of \"playing with people's lives\""
  ],
  "topics": {
    "Conflict": 0.9788609743118286,
    "Politics": 0.9569427967071533,
    "Military": 0.8704760074615479,
    "Diplomacy": 0.8415552973747253,
    "Culture": 0.8357988595962524,
    "Economy": 0.7784661054611206,
    "Environment": 0.7085889577865601,
    "Energy": 0.7002373933792114,
    "Health": 0.6957646608352661,
    "Technology": 0.6885931491851807,
    "Transport": 0.6563301682472229,
    "Crime": 0.6280210018157959,
    "Education": 0.5180206298828125,
    "Elections": 0.3966177999973297
  },
  "sentiment": {
    "positive": 0.2,
    "negative": 0.8,
    "neutral": 0.0
  }
}