{
  "title": "'A Mais Breve História da Rússia' de José Milhazes é adaptada para BD",
  "published_date": null,
  "url": "https://www.noticiasaominuto.com/cultura/2786068/a-mais-breve-historia-da-russia-de-jose-milhazes-e-adaptada-para-bd",
  "original_language": "pt",
  "cleaned_sentences": [
    "To edit on the 20th, 'The Brief History of Russia (in BD)' adapts a book that José Milhazes published in 2022, with a historical synthesis, which has extended from the origin of Slavic peoples to the Russian Federation (1991), through various aspects of the empire and the power of Soviets in the twentieth century.",
    "When the book came out in 2022, José Milhazes told Lusa that he decided to write it to make known the history of a country that is \"determining for the destinations of Europe - and Russia is a European country - and to understand the positions of Russian leaders.\"",
    "\"I have not written this book for people who already know everything, I wrote this book to people who want to know more about Russia.",
    "It is not an academic work, it is written in accessible language, but it is a historical work because I throw the facts about the history of the country,\" the author explained.",
    "The new BD edition was adapted by writer and former Journalist Dulce Garcia and designer Joana Afonso, author of, among others, 'The Ball' and 'Beasty of Isa', and other literary adaptations, namely 'Auto da Inferno', by Gil Vicente, with João Lameiras, and 'Maria Moisés', by Camilo Castelo Branco.",
    "According to ASA, the new comic book edition has an additional chapter, entitled 'The New World Order', with reference to the Russian military invasion of Ukraine, in February 2022, \"where Ukraine's presidents, Volodymyr Zelensky, Donald Trump, and Russia, Vladimir Putin.",
    "José Milhazes, journalist, historian and translator, who has lived more than three decades in Russia, is the author of works such as 'Angola - The Principle of the End of the Soviet Union' (2009), 'The Saga of the Portuguese in Russia' (2011), 'My Adventures in Soviets' (2017) or 'The Brief History of Ukraine' (2023).",
    "The comic book 'The Brief History in Russia' will be presented on May 28 at the Colombo FNAC in Lisbon and on June 7 at the Lisbon Book Fair.",
    "Also read: Spanish Eduardo Mendoza wins Princess of Asturias Award 2025"
  ],
  "topics": {
    "Politics": 0.7756147980690002,
    "Culture": 0.6351927518844604,
    "Economy": 0.4835379719734192,
    "Conflict": 0.46635156869888306,
    "Military": 0.4595763683319092,
    "Energy": 0.3774257004261017,
    "Environment": 0.35112735629081726,
    "Health": 0.3337582051753998,
    "Diplomacy": 0.33353251218795776,
    "Transport": 0.3068636357784271,
    "Crime": 0.297002911567688,
    "Technology": 0.28663212060928345,
    "Education": 0.2630019783973694,
    "Elections": 0.14050747454166412
  },
  "sentiment": {
    "positive": 0.778,
    "negative": 0.222,
    "neutral": 0.0
  }
}