{
  "title": "Páscoa na Ucrânia: Zelensky apela à esperança e acusa Rússia de falso cessar-fogo",
  "published_date": null,
  "url": "https://sicnoticias.pt/especiais/guerra-russia-ucrania/2025-04-20-pascoa-na-ucrania-zelensky-apela-a-esperanca-e-acusa-russia-de-falso-cessar-fogo-adf51297",
  "original_language": "pt",
  "cleaned_sentences": [
    "President Volodymyr Zelensky appealed to Ukrainians on Sunday not to lose hope that peace will return to Ukraine in a message to mark Easter.",
    "Dressed in a traditional vyshyvanka Ukrainian shirt and standing in front of Kiev's main church, Santa Sofia Cathedral Zelensky secured in a video released on social networks that Ukraine will never lose faith.",
    "\"As hard as we are, we do not lose faith, because this faith is in others, in those who are by your side.",
    "In Ukrainian men, Ukrainian women.",
    "The faith that evil can have his time, but God will have his day.\"",
    "In the message, the Ukrainian President also accused Russia of creating a false appearance of ceasefire in Easter, having continued to bombard and attack drone attacks at night.",
    "\"On Easter morning, we can say that the Russian army is trying to create a general impression of a ceasefire, but in some places it does not abandon individual attempts to advance and inflict losses to Ukraine.\"",
    "The complaint of Volodymyr Zelensky comes after Russian President Vladimir Putin, ordered on Saturday to his troops to make a ceasefire in Ukraine at Orthodox Easter until 22:00 Sunday (Lisbon time) and urged Kiev to do the same.",
    "Despite a Russian promise, the attacks continued Despite the Russian promise of respite, the attacks will not have been suspended.",
    "The sirens sounded in several Ukrainian cities.",
    "Throughout the Kiev region, including the city, the beeps that indicate possible bombing were very audible.",
    "In Kharkiv, the second largest city in the country, the scenario was similar and the sirens sounded at night.",
    "Because of the sirens of possible Russian air strikes, Kiev residents were forced to spend night inside a church.",
    "The faithful came together to celebrate the Sabbath Paschal Vigil.",
    "The first part of the ceremony was held outdoors, with a procession through the gardens of the São Miguel Monastery, in the center of the Ukrainian capital.",
    "But from midnight, and because of the Collection Touch, everyone had to go to the church to continue the ceremony.",
    "They could only go out to dawn this Sunday.",
    "Ukraine proposes to prolong the truce for 30 days Despite Putin's statement, Zelensky said the Ukrainian forces reported 59 cases of Russian bombing and five units attacks in various areas along the front line, as well as dozens of drone attacks.",
    "The Ukrainian President argued that Russia must fully respect the conditions of the ceasefire and reiterate Ukraine's proposal to extend the truce for 30 days, from midnight this Sunday.",
    "Zelensky stated that the proposal \"continues on the table\" and that Ukraine will act according to \"the current situation on the ground.\"",
    "Russia accuses Kiev of violating respite with night attacks in Donetsk The Russian Ministry of Defense accused Ukraine on Sunday of attacking his positions in the Donetsk region at night, violating the 30 -hour Easter truce declared on Saturday by Moscow and accepted by Kiev.",
    "\"Despite the announcement of the Easter truce, the Ukrainian units tried to attack Russian positions in the areas of Sukhaya Balka and Bogatyr, in the Popular Republic of Donetsk, at night, but these attacks were repelled,\" the Russian Ministry of Defense announced, referring to the villages located in the eastern part of the Donetsk region controlled by Russia.",
    "The information published in the Telegram Social Network, and cited by international agencies, also indicates that Kiev launched 48 drones, one of which was targeted by the attached Crimea peninsula.",
    "Vladimir Putin announced the temporary ceasefire by invoking humanitarian reasons, but did not give details about how the ceasefire would be controlled or covered the ongoing air attacks or land battles, which unfold 24 hours a day.",
    "The announcement of the ceasefire was made after the president of the United States, Donald Trump, said on Friday that negotiations between Ukraine and Russia are \"reaching a critical point\" and that neither side is \"playing\" with him in his effort to end the three-year war."
  ],
  "topics": {
    "Culture": 0.8207459449768066,
    "Conflict": 0.7681386470794678,
    "Health": 0.6633430123329163,
    "Economy": 0.6481022834777832,
    "Military": 0.6347023248672485,
    "Politics": 0.6029294729232788,
    "Technology": 0.512672483921051,
    "Environment": 0.47714677453041077,
    "Energy": 0.3512705862522125,
    "Transport": 0.31690260767936707,
    "Education": 0.26374873518943787,
    "Crime": 0.2586820125579834,
    "Diplomacy": 0.19454221427440643,
    "Elections": 0.1390964835882187
  },
  "sentiment": {
    "positive": 0.48,
    "negative": 0.52,
    "neutral": 0.0
  }
}