{
  "title": "Rússia sem medo de sanções ocidentais",
  "published_date": null,
  "url": "https://eco.sapo.pt/2025/05/13/russia-sem-medo-de-sancoes-ocidentais/",
  "original_language": "pt",
  "cleaned_sentences": [
    "Russia without fear of western sanctions \"There is no need to be afraid.",
    "Those who start to be afraid loses quickly,\" said the Russian leader.",
    "Russian President Vladimir Putin said on Tuesday that \"there is no need to fear\" Western sanctions due to war in Ukraine, however, that Russia must be prepared to reduce its effects.",
    "\"There is no need to be afraid.",
    "Anyone who is starting to be afraid loses quickly,\" the Kremlin leader said at a meeting with members of a business organization after a group of western countries threatened Moscow with new sanctions to refuse to suspend combat in Ukraine.",
    "Vladimir Putin has recommended, however, that one should “understand what can happen” as a result of Western restrictions.",
    "“We have to be prepared for any movement that our potential future opponents can do,” he insisted.",
    "The Russian leader made these statements after threats from the UK leaders, Germany, France, and Poland on the imposition of new and harsh sanctions on Russia if Kremlin refuses a one-month ceasefire in Ukraine.",
    "The new German Chancellor, Friedrich Merz, reiterated that if there is no progress this week towards a lasting ceasefire in Ukraine, new European sanctions against Russia will be imposed, and it has confident that it will be possible to guarantee the support of all European Union Member States (EU) to achieve this goal.",
    "Merz noted that the 17th European Sanction Package has already been formulated and awaited approval in June, while Germany and other countries will defend additional punitive measures against Moscow if there is no progress this week.",
    "Kremlin, in turn, rejected ultimatum from European countries and stressed that it would be unacceptable to talk to Moscow in this context.",
    "Putin said on Saturday that he was ready for direct conversations with the Ukrainian party on Thursday in Istanbul, Turkey, but continues without confirming his presence.",
    "This Tuesday, Ukrainian President Volodymyr Zelensky asked Western allies to adopt the \"heavier\" sanctions ever if the Russian leader refuses his presence at the scheduled meeting for Turkey.",
    "The absence of Vladimir Putin in Istanbul will be the \"definitive sign\" that Moscow does not want to stop the war nor is willing to negotiate, Zelensky warned.",
    "At the same time, Vladimir Putin said on Tuesday that between 50,000 and 60,000 people join “voluntarily” to the fighting in Ukraine every month, claiming that this number contrasts with Ukrainian attempts to recruit military personnel “like dogs”.",
    "According to the Kremlin leader, while Ukraine practices a “forced mobilization” in Russia “between 50,000 and 60,000 young people voluntarily enlist each month.",
    "Kremlin has always stated that it does not have to resort to mass mobilizations such as that led to the recruitment of 300,000 people in September 2022, although Russian troops have been reinforced in recent years with convicted mercenaries or prisoners in search of some kind of benefit in their penalties, as well as the contingent of North Korean military personnel.",
    "Russian authorities have not provided a clear number of casualties since the beginning of the Ukraine invasion in February 2022.",
    "Ukrainians claim that the number of casualties among the Russian forces surrounds the 950,000 military personnel killed or injured.",
    "According to information released by a project from British television station BBC and the Independent Russian agency Russian media, elaborated from verifiable data, at least 107,000 Russian military personnel have died from the beginning of the conflict until May 5, but the estimated value increases to 165,000 if the levels related to excessive mortality among men.",
    "Last December, Zelensky indicated that 43,000 Ukrainian military personnel died until that date and another 370,000 were injured, but the real numbers could be much higher.",
    "Ukraine has been counted on financially and weapons for Western allies since Russia invaded the country on February 24, 2022.",
    "Kiev's allies have also decreed sanctions on key key sectors of the Russian economy to try to reduce Moscow's ability to fund Ukraine's war effort.",
    "Subscribe to Eco Premium The moment information is more important than ever, supporting independent and rigorous journalism.",
    "Subscribe to Eco Premium and have access to exclusive news, the opinion it tells, to the reports and specials that show the other side of the story.",
    "This signature is a way of supporting Eco and its journalists.",
    "Our counterpart is independent, rigorous and credible journalism."
  ],
  "topics": {
    "Conflict": 0.9817948341369629,
    "Economy": 0.9335345029830933,
    "Diplomacy": 0.9228420853614807,
    "Politics": 0.9156150817871094,
    "Culture": 0.9142767786979675,
    "Elections": 0.9082094430923462,
    "Health": 0.8880083560943604,
    "Technology": 0.8719167709350586,
    "Energy": 0.848527193069458,
    "Military": 0.8232095837593079,
    "Environment": 0.8193063139915466,
    "Transport": 0.7435729503631592,
    "Education": 0.7327010035514832,
    "Crime": 0.5506927371025085
  },
  "sentiment": {
    "positive": 0.333,
    "negative": 0.667,
    "neutral": 0.0
  }
}