{
  "title": "Delegação russa já está na Turquia (mas sem Putin). O que fará Zelensky?",
  "published_date": null,
  "url": "https://www.noticiasaominuto.com/mundo/2786471/delegacao-russa-ja-esta-na-turqia-mas-sem-putin-o-que-fara-zelensky",
  "original_language": "pt",
  "cleaned_sentences": [
    "Ukraine and Russia are sitting on Thursday to the table to discuss the future of the conflict between the two countries.",
    "Volodymyr Zelensky challenged the Russian President and being present at the meeting, but Putin decided to send only one delegation in representation of the country.",
    "It is recalled that the Ukrainian President had warned that his position at the meeting would depend on who would be present.",
    "That said, doubts are thicked about the direction that relations between the two countries will take.",
    "\"I am waiting to see whoever arrives from Russia.",
    "Then I will decide what measures Ukraine will take.",
    "Signs in the media are not yet convincing,\" Zelensky said.",
    "There is also an unknown about how this meeting will happen, and is even uncertain, so far, the hours it will begin.",
    "Russia will have announced this morning that the conversations would start at 10am [8 hours in Portugal], information that was refuted by Ukraine.",
    "Russian delegation has already arrived in Istanbul According to the BBC, the Russian entourage elected to represent Russia has arrived in the Turkish city, confirming the absence of the country's leader.",
    "The entourage is composed by presidential advisor Vladimir Medinsky, Russian Foreign Minister Mikhail Galuzin, Deputy Defense Minister Alexandre Fomin, and the head of the Main Directorate of Russian Armed Forces, Igor Kostyukov.",
    "Although absent, Vladimir Putin will have met with this delegation on Wednesday to prepare the negotiations that take place today.",
    "The same publication states that Zelensky is not expected to be present also and should send a team of negotiators.",
    "Zelensky meets Erdogan and only then decides next steps Ukraine President Volodymyr Zelensky should find himself in Ankara with Turkish homologist, Recep Tayyip Erdogan, and will only decide on the \"next steps\" in negotiations with Russia, Source Ukrainian said.",
    "So far, Russia and Ukraine have kept the suspense about the format of peace conversations in Istanbul, the place of the last meeting of the two belligerents three years ago.",
    "The Ukrainian leader reiterated that the decision on ceasefire and the future of war is in the hands of Moscow.",
    "\"Ukraine is ready to participate in any negotiation format, and we are not afraid of meetings,\" he said.",
    "Trump also canceled Ida but ... can still head to Türkiye However, also Donald Trump, who had shown himself available to go to Türkiye if Putin were, said he would no longer go.",
    "However, this morning, you will have shown available to change your ideas and travel to the country in the conversations this Friday, if you watch positive developments in peace negotiations.",
    "Speaking to Qatar, as part of a four -day trip through the Middle East, the US President said he hoped Russia and Ukraine do \"something\" because this war \"has to end.\"",
    "\"We liked to see the war end and I think we have a possibility of it happening,\" he said.",
    "More than three years after the start of the Russian invasion of Ukraine, Kyiv and Moscow reported this week conversations of direct peace in Türkiye, the former since the spring of 2022.",
    "Kyiv, its European allies and Washington want a total and unconditional ceasefire of 30 days before any negotiation.",
    "On Saturday, Putin \"did not exclude\" the possibility of a truce being discussed in the conversations, but stressed that these discussions should focus on the \"deep causes of conflict.\"",
    "Prior to that, Moscow had shown reluctant to accept a prolonged ceasefire, considering that he would allow Kyiv to strengthen himself, receiving Western weapons, while the Russian army has the lead in the front line.",
    "Kremlin has maintained its maximalist demands: the \"demilitarization\" of Ukraine, which would be equivalent to its surrender, and its resignation to adhere to NATO.",
    "It also claims the annexation of four southern and east regions of Ukraine that partially controls, as well as the Crimea Peninsula, attached in 2014.",
    "These requirements are unacceptable for Kyiv, which for months asks for \"solid\" security guarantees, through adherence to the NATO or the sending of an international military contingent, to dissuade Moscow from a new invasion.",
    "Read also: Unfortunate expectations: Putin and Trump do not go to Türkiye for negotiations"
  ],
  "topics": {
    "Politics": 0.9579467177391052,
    "Conflict": 0.955417811870575,
    "Environment": 0.920650064945221,
    "Diplomacy": 0.895277202129364,
    "Culture": 0.8858007788658142,
    "Technology": 0.8016812205314636,
    "Economy": 0.7906923890113831,
    "Military": 0.7663409113883972,
    "Health": 0.747542679309845,
    "Transport": 0.7224154472351074,
    "Crime": 0.7154175043106079,
    "Energy": 0.7064731121063232,
    "Education": 0.6943295001983643,
    "Elections": 0.5986576080322266
  },
  "sentiment": {
    "positive": 0.414,
    "negative": 0.586,
    "neutral": 0.0
  }
}