{
  "title": "VIDEO Televiziunea Russia Today foloseşte Crăciunul ca obiect de propagandă împotriva Uniunii Europene / Un video arată că europenii au petrecut 2021 în abundenţă, 2022 în beznă, iar în 2023 îşi mănân",
  "published_date": null,
  "url": "https://www.g4media.ro/televiziunea-russia-today-foloseste-craciunul-ca-obiect-de-propaganda-impotriva-uniunii-europene-un-video-arata-ca-europenii-au-petrecut-2021-in-abundenta-2022-in-bezna-iar-in-2023-isi-mananca-ani.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Video TV Russia Today uses Christmas as a propaganda object against the European Union / a video shows that Europeans spent 2021 in abundance, 2022 in the dark, and in 2023 they eat their pets Moscow takes advantage of the holidays at the end of the year to broadcast an anti-European propaganda message, through an advertising broadcast by the Russia Today (RT) post, according to which the Europeans spent 2021 in abundance, in 2022 they made the holidays in the dark, and in 2023 they will be forced to eat their pets.",
    "This promotional clip, broadcast for the first time in Europe by the journalist Francis SCAR from BBC Monitoring, a warning is desired the address of European citizens regarding the energy consequences of Ukraine's support by the European Union (EU), in the context of the Russian war launched by Kremlin takes ten months.",
    "In the first sequence - a scene from 2021, a family celebrates Christmas, and a little girl receives a gift that carries a butterfly.",
    "The following year, in the same period, the girl's father is forced to build a system to turn the hamster wheel into the generator, to illuminate the Christmas tree.",
    "In the last sequence, in 2023, the family obviously lives in the greatest poverty and cold.",
    "The father finds the hamster's butterfly in the soup, which suggests that his wife had to cook the pet to survive.",
    "\"Merry Christmas\" Anti -Muru \"!",
    "If your press does not tell you everything, RT is available with a VPN,\" writes at the end of the clip.",
    "Russia Today's broadcast (RT) is prohibited in EU Member States since the beginning of the Russian invasion on February 24.",
    "\"Russia does not even try to dissimulate its economic blackmail,\" the correspondent France 24, Dave Keating, reacts, like military historian Cédric Mas.",
    "The EU is energetically blackmailed by Moscow, an important world gas supplier, targeted by European sanctions since the beginning of the Ukraine war and threatening to disturb, as reprisals, the supply of natural gas, eventually cut it.",
    "At the beginning of December, Russian President Vladimir Putin threatened the West to \"reduce the production\" of Russian oil, \"so necessary\", a few days after the EU, G7 and Australia were capped the price of Russian oil at $ 60, in order to limit the income obtained by Moscow to finance its military offensive.",
    "Europeans seek to buy natural gas, in larger quantity, from other suppliers in the world, such as Norway, Qatar or Algeria, after their American ally has recently announced that it cannot significantly increase their liquefied natural gas exports (GNL) due to limited production capacity.",
    "The risk of energy shortage affects several EU member states, which have urged citizens to reduce consumption this winter, such as Germany and Eastern European countries, highly dependent on Russian natural gas.",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Energy": 0.9437083601951599,
    "Conflict": 0.8239766359329224,
    "Politics": 0.7482801675796509,
    "Economy": 0.643659234046936,
    "Military": 0.6331652402877808,
    "Culture": 0.6244112253189087,
    "Technology": 0.5662108063697815,
    "Health": 0.4468452036380768,
    "Environment": 0.4075862467288971,
    "Transport": 0.34619998931884766,
    "Diplomacy": 0.2071554809808731,
    "Education": 0.13482484221458435,
    "Crime": 0.12415040284395218,
    "Elections": 0.12110861390829086
  },
  "sentiment": {
    "positive": 0.133,
    "negative": 0.867,
    "neutral": 0.0
  }
}