{
  "title": "VIDEO Diana Șoșoacă, discurs halucinant pentru Russia Today: 'Interzisă din nou pentru că ei nu sunt pregătiți pentru mine'",
  "published_date": null,
  "url": "https://www.stiripesurse.ro/video-diana-osoaca-discurs-halucinant-pentru-russia-today-intrezisa-din-nou-pentru-ca-ei-nu-sunt-pregatiti-pentru-mine_3617371.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Diana Şoșoaca does not miss any opportunity to make a show.",
    "The same thing happened in the intervention he had at Russia Today, the television financed by the Kremlin.",
    "She complained that she was not left again to apply after the CCR rejected her candidacy.",
    "The president of S.O.S appeared dressed in black, saying that it is in mourning because in \"Romania has affected democracy\".",
    "\"First of all, I want to tell you that I wear a mourning costume, because in Romania we have no democracy, democracy is dead.",
    "So now I mourn ... and I expect the Constitutional Court to tell me that I am forbidden again, because they are not prepared for me because I am little, because I love Russia, because I have not written to Romania, Democracy, \"said shock.",
    "Serious statements followed by Ukraine followed.",
    "Then he said he would go to Brussels where he wants to resign Von Der Leyen, the president of the European Commission and Roberta Metsola, the President of the European Parliament.",
    "They asked for its prohibition.",
    "\"This morning I received many phones from Ukrainian people who told me that the Romanian women will be killed, cut our heads and rape us in the group and cut us into pieces.",
    "This is the thanks that we receive for all the help.",
    "And they told me that they will kill us as in 1945,\" it was not Russia. \"",
    "The Constitutional Court rejected the appeals regarding the candidates of Diana Şoşoaca The RCC rejected, on Monday, the appeal filed by Diana Şoşoaca towards the BEC decision.",
    "This is after a few days ago BEC rejected the candidacy of the president of S.O.S, after considering the CCR decision of 2024.",
    "On the same day the CCR rejected, with unanimous votes, the appeal to the BEC decision of March 15, 2025 regarding the registration of George Simion's candidacy The Communicated Communicated of the Constitutional Court: \"Following deliberations, the Constitutional Court rejected the appeals formulated, as follows: By majority of votes, in regard to: -Decision no.32D of March 15, 2025 regarding the registration of the independent candidate of Mr. Banu-Muscel John-Ion and the electoral sign in the elections for the President of Romania of 2025; -the decision of the Central Electoral Bureau no.34D/15.03.2025 regarding the rejection of the registration of Mrs. Diana Iovanovici-Şoșoacă and his electoral sign in the elections for the President of Romania from 2025; Unanimously votes in regard to: -Decision of the Central Electoral Bureau no.31D/15.03.2025 regarding the registration of Mr. Simion George-Nicolae and his electoral sign in the elections for the President of Romania from 2025.",
    "The decisions are final and communicate to the Central Electoral Bureau.",
    "The arguments retained in motivating the solutions pronounced by the plenary of the Constitutional Court will be presented in the decisions, which will be published in the Official Gazette of Romania, Part I."
  ],
  "topics": {
    "Politics": 0.8848218321800232,
    "Conflict": 0.8501261472702026,
    "Elections": 0.7964058518409729,
    "Culture": 0.4573158621788025,
    "Diplomacy": 0.4572138488292694,
    "Economy": 0.2748776376247406,
    "Energy": 0.27211782336235046,
    "Health": 0.267253041267395,
    "Military": 0.22667421400547028,
    "Technology": 0.21837902069091797,
    "Crime": 0.21013467013835907,
    "Transport": 0.19961988925933838,
    "Environment": 0.13064953684806824,
    "Education": 0.08292051404714584
  },
  "sentiment": {
    "positive": 0.235,
    "negative": 0.765,
    "neutral": 0.0
  }
}