{
  "title": "„Un Tsunami Radioactiv îi Va șterge De Pe Fața Pământului”. Noi Amenințări Cu Atacuri Nucleare La Televiziunea De Stat Din Rusia",
  "published_date": null,
  "url": "https://www.libertatea.ro/stiri/vladimir-soloviov-prezentatori-rusia-1-ameninta-marea-britanie-si-franta-cu-atacuri-nucleare-4846640",
  "original_language": "ro",
  "cleaned_sentences": [
    "The prominent prominent war of state television, considered one of the main propagandists of the regime, threatened the United Kingdom and France, in two separate shows, \"Evening with Vladimir Soloviov\" and \"Sunday evening with Vladimir Soloviov\".",
    "Julia Davis distributed fragments from these shows on the X platform, the former Twitter.",
    "\"The British will have been eradicated by nuclear blows\" In the first show, after the political scientist Vladimir Kornilov said that the British newspaper The Daily Telegraph has written openly that the Russian people are responsible for the war and should be tried, Soloviov replied that \"no one will be tried after the war, until then, the British will have been eradicated by nuclear blows.\"",
    "Soloviov then asked rhetorically: \"Who to judge us?",
    "The country that until then will be buried under a radioactive wave?\".",
    "Kornilov replied that he hopes that \"a nuclear war will not be reached.\"",
    "\"It will not be a war, the radioactive tsunamo will delete it from the face of the earth,\" Soloviov continued.",
    "Meanwhile in Russia: Vladimir Solovyov Assured Fellow Propagandists That of The Will Be Trried After the War Is Over, Because by Then, The British Will Have Been Eradicated Through Nuclear Strikes.Https: //t.co/bc65ctql73 - Julia Davis (@juliadavisnews) March 31, 2024 The mayor of Paris, \"a Nazi beast\" In the second show, Soloviov criticized Anne Hidalgo, the mayor of Paris, after she said that the Russian and Belarusi athletes \"are not welcome at the Olympics in the capital of France.\"",
    "\"I want to remind this ugly Nazi beast that today it is 210 years since the entry of the Russian army in Paris.",
    "Both then and now, we are not very interested if you are happy to see us.",
    "Whenever we have to destroy you, we will do it,\" said Soloviov.",
    "So Paris, don't you want to meet our athletes?",
    "Welcome, then, to our hypersonics!",
    "Quick, reliable and unpleasant!",
    "” Vladimir Soloviov: Meanwhile in Russia: Easter Would be incomplete without Vladimir Solovyov's Nuclear Threats to France.",
    "- Julia Davis (@juliadavisnews) March 31, 2024 The idea that Russia could hit NATO countries in response to the help and weapons they offered to Ukraine in the ongoing war was supported by Soloviov and many other Russian officials, since the beginning of the invasion, in February 2022.",
    "Last year, Soloviov also threatened Romania Putin said, in September 2022, that Russia is ready to use nuclear weapons to defend its \"territorial integrity\", declaring that \"this is not a cacealma\".",
    "More recently, in February, he warned during his annual speech on the state of the Moscow nation that \"strategic nuclear forces are prepared.\"",
    "Among other things, Soloviov was the one who said, last summer, that, in his opinion, Romania should disappear under the attack of tactical nuclear blows, if Ukrainian pilots will train on the F-16 aircraft.",
    "Photo: Profimedia Sfantul_ Cuvios_Pafnutie • 04.04.2024, 22:32 UK has about 225 nuclear focoa, of which 40 always unfolded.",
    "Can Soloviev tell us (and our dear \"nationalist pacifists\") what effects would 40 nuclear missiles have on the Mother Russia?",
    "Or you mention that the English would be so scared of the terrifying power of the invincible Russia that they would choose to die quietly, that they would not get a little upset and do something even worse, or 2.",
    "Super multimiga S-500 system will bring any ballistic missile, exactly as it does and S-400 with the rest of the rockets and aircraft.",
    "That's why I hit the Ukrainians of refineries and factories with ultra-aircraft that barely reach 200 km/h ... Vudejea • 04.04.2024, 19:03 :)) Those words about which freedom is from 2022 :))) They moderated my post, I asked what the hell they became?",
    ":)) I no longer ask :)) Vudejea • 04.04.2024, 18:32 *** This comment was moderate for: vulgar or offensive language."
  ],
  "topics": {
    "Military": 0.32408443093299866,
    "Technology": 0.2896692752838135,
    "Conflict": 0.2742416262626648,
    "Energy": 0.25535109639167786,
    "Diplomacy": 0.1883116066455841,
    "Environment": 0.18656517565250397,
    "Health": 0.1738874912261963,
    "Politics": 0.15434272587299347,
    "Transport": 0.1479051560163498,
    "Economy": 0.1383722424507141,
    "Culture": 0.13026192784309387,
    "Elections": 0.0931418240070343,
    "Education": 0.061632830649614334,
    "Crime": 0.05222838744521141
  },
  "sentiment": {
    "positive": 0.28,
    "negative": 0.72,
    "neutral": 0.0
  }
}