{
  "title": "Propagandistul șef al Kremlinului vrea eliminarea “coloniștilor germani, anglo-saxoni și evrei” din Ucraina",
  "published_date": null,
  "url": "https://www.g4media.ro/propagandistul-sef-al-kremlinului-vrea-eliminarea-colonistilor-germani-anglo-saxoni-si-evrei-din-ucraina.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "The chief propagandist of the Kremlin wants to eliminate the \"German, Anglo-Saxon and Jews\" in Ukraine In a post on Twitter the editorial director of the Russia Riddle site, Anton Barbașin distributes a comment made by Vladimir Soloviov on Telegram, in which the presenter of the popular show on Sunday evening with Vladimir Soloviov, broadcast by the public TV channel Rossiya 1, launches in a Diatriba against Ukraine.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - \"Russia's main propagandist, Vladimir Soloviov, transmits a message that helps to clarify what is already obvious.",
    "Russia leads a war to occupy Ukraine and eliminate Ukrainian statehood,\" releasing it from German, Anglo-Saxon and Jewish, \"Barbașin writes.",
    "Soloviov is known for the strident support for the war triggered by President Vladimir Putin against Ukraine and in his shows he often collides false information and conspiracy theories in support of his propaganda.",
    "The comment is similar to an editorial published last month by the official Russian Novosti (Meanwhile) agency in which another Kremlin propagandist, Timofei Sergheițev, said not only the dismantling by the Russia of the Ukrainian state, but also eradicating the Ukrainian identity through the Brutal methods, which included a large number of people.",
    "In the speech on the day of launching the aggression against Ukraine, President Putin claimed that one of the reasons for the \"special operation\" would be the \"denazification\" of the Ukrainian state.",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Conflict": 0.8635984063148499,
    "Politics": 0.7468143701553345,
    "Technology": 0.6836274266242981,
    "Military": 0.6220465302467346,
    "Culture": 0.58469557762146,
    "Economy": 0.574515700340271,
    "Transport": 0.4900703728199005,
    "Energy": 0.35396209359169006,
    "Health": 0.35105010867118835,
    "Crime": 0.3494364023208618,
    "Environment": 0.27235931158065796,
    "Education": 0.22971084713935852,
    "Elections": 0.2264869511127472,
    "Diplomacy": 0.1961943656206131
  },
  "sentiment": {
    "positive": 0.125,
    "negative": 0.875,
    "neutral": 0.0
  }
}