{
  "title": "Propaganda Rusească: Clip De Crăciun în Care Europenii Trăiesc Deja în Beznă, Iar în 2023 își Vor Mânca Animalele De Companie, De Foame",
  "published_date": null,
  "url": "https://www.libertatea.ro/stiri/derapaj-de-craciun-intr-un-clip-al-televiziunii-russia-today-europenii-sunt-aratati-in-bezna-in-2022-iar-in-2023-isi-mananca-animalele-de-companie-4392164",
  "original_language": "ro",
  "cleaned_sentences": [
    "Moscow takes advantage of the holidays at the end of the year to broadcast an anti-European propaganda message, according to which the Europeans spent 2021 in abundance, in 2022 they made the holidays, and in 2023 they will eat their pets.",
    "The clip, for the first time distributed in Europe by the journalist Francis SCAR from BBC Monitoring, is intended to a warning to European citizens regarding the energy consequences of supporting Ukraine by the European Union (EU), in the context of the war delanged by Kremlin has already lasts for more than ten months.",
    "\"Merry Christmas\" Antiuses \"!\"",
    "In the first sequence - a scene from 2021, a family celebrates Christmas, and a little girl receives a gift that carries a butterfly.",
    "The following year, also during the holidays, the girl's father is forced to build a system to turn the hamster wheel into the generator, to illuminate the Christmas tree.",
    "In the last sequence, the one that depicts the year 2023, the family obviously lives in the greatest poverty and cold.",
    "The father finds the hamster's butterfly in the soup, which suggests that his wife had to cook the pet to survive.",
    "Oh Dear… 🤦♂️ - Francis Scarr (@francis_scarr) December 23, 2022 Russian State Broadcaster Rt Has a Christmas Message for Europeans Pic.Twitter.com/xsgymlnlft \"Merry Christmas\" Anti -Muru \"!",
    "If your press does not tell you everything, RT is available with a VPN,\" writes at the end of the clip.",
    "The broadcast of the Russia Today was banned in EU member states after the Russian invasion in Ukraine began on February 24.",
    "Energy, Russia's main domain on EU \"Russia does not even try to dissimulate its economic blackmail,\" the correspondent France 24, Dave Keating, reacted, as well as military historian Cédric Mas.",
    "The EU is energetically blackmailed by Moscow, an important world gas supplier, which is targeted by harsh European sanctions since the war in Ukraine began and threatening to disturb, in response, the supply of natural gas, possibly even interrupts it, notes BFMTV.",
    "At the beginning of December, President Vladimir Putin threatened the West with the \"reduction of Russian oil production\", \"so necessary\", a few days after the EU, G7 and Australia were caught the price of Russian crude oil at $ 60 barrel, in order to limit the income obtained by Moscow, so that Russia has no more to finance.",
    "Europeans seek to buy natural gas, in larger quantity, from other suppliers in the world, such as Norway, Qatar or Algeria, after recently announced that they cannot significantly increase their liquefied natural gas exports (GNL), due to the limited production capacity.",
    "The risk of energy shortage affects several EU member states, such as Germany and Eastern European countries, highly dependent on Russian natural gas, which have urged their citizens to reduce their consumption this winter.",
    "Follows LiveText Freedom with the latest Ukraine War information See results presidential elections, tour 1 - 4 May 2025, according to the BEC!",
    "Ivryernest • 26.12.2022, 00:10 \"Energy, Russia's main domain on EU.\"",
    "Confiscation of the assets of the Russians from abroad, the main EU blackmail field on Russia.",
    "Tran • 25.12.2022, 23:23 I read the French comments on YouTube when they saw the material.",
    "They had fun, they praised the idea and then they concluded that this is waiting for us.",
    "They break them from the Ukrainians.",
    "seaman651 • 26.12.2022, 11:43 Tran • 25.12.2022, 23:23 I read the French comments on YouTube when they saw the material.",
    "They had fun, they praised the idea and then they concluded that this is waiting for us.",
    "They break them from the Ukrainians.",
    "Ruzzi politicians are desperate, no one needs their resources, buy from others.",
    "Would send gas without asking for the EU.",
    "The Chinese have also started to understand that they will not be better associated with Putler, the Indians do not have much ... Слава україні!",
    "seaman651 • 26.12.2022, 11:40 Tran • 25.12.2022, 23:23 I read the French comments on YouTube when they saw the material.",
    "They had fun, they praised the idea and then they concluded that this is waiting for us.",
    "They break them from the Ukrainians.",
    "Just as they break themselves from the blackmail of the Russians.",
    "Or anyone else on the planet.",
    "Ulrich • 25.12.2022, 22:25 Okay.",
    "We eat our hamsters, but in no case are they invited.",
    "We talk over 50 years, when they will be allowed to go out somewhere in that country garbage."
  ],
  "topics": {
    "Transport": 0.7671460509300232,
    "Diplomacy": 0.7546944618225098,
    "Environment": 0.7545603513717651,
    "Technology": 0.7478063106536865,
    "Energy": 0.7381821870803833,
    "Politics": 0.735845685005188,
    "Conflict": 0.708002507686615,
    "Culture": 0.7054445743560791,
    "Economy": 0.6760066747665405,
    "Military": 0.6364045143127441,
    "Health": 0.6258487105369568,
    "Elections": 0.5584167838096619,
    "Crime": 0.48640522360801697,
    "Education": 0.43484392762184143
  },
  "sentiment": {
    "positive": 0.371,
    "negative": 0.629,
    "neutral": 0.0
  }
}