{
  "title": "Producătorul francez de anvelope Michelin a anunțat că şi-a vândut operaţiunile din Rusia",
  "published_date": null,
  "url": "https://www.g4media.ro/producatorul-francez-de-anvelope-michelin-a-anuntat-ca-si-a-vandut-operatiunile-din-rusia.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "The French tire manufacturer Michelin has announced that it has sold its operations in Russia The French tire manufacturer Michelin announced on Friday the sale of his activities in Russia, made up of Russia Tyre Manufacturing Company and Camso Cis, to the local distributor of Power International Tires, reports Reuters, quoted by Agerpres.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - The French group, present on the Romanian market, did not reveal details about the value of the transaction, but stated that the agreement, approved by the Russian authorities, will allow the preservation of 250 jobs, mainly at the Michelin factory in Davydovo.",
    "The factory that Michelin inaugurated in 2004 in Davydovo, near Moscow, currently has 750 employees and produces up to two million tires per year, mainly for the Russian market, but also for some countries in northern Europe.",
    "Last year, sales in Russia represented 2% of Michelin sales and 1% of global tire production for cars.",
    "Michelin said on Friday that it was impossible for every employee to be transferred to Power International Tires and, therefore, to those who want to leave the company will be allowed to do so \"in good conditions\".",
    "The French company was present in Russia since 1997 and became the first international tire company that opened its own production factory in this country in 2004.",
    "Last year it announced that it suspends its industrial activity in Russia and exports in this country as a result of Moscow's invasion.",
    "The tire industry was strongly hit by the Western sanctions imposed on Russia, which stopped its supply of critical raw materials and led to the closure of the factories that supplied customers outside Russia.",
    "In April this year, Michelin announced that the cessation of his activities in Russia led to a 25% decrease in sales volumes in the first quarter.",
    "The Michelin group, which has 123,000 worldwide employees, started its activity in Romania in August 2001.",
    "Currently, Michelin has about 4,000 employees, three factories-two in Zalău and one in Floresti-and a commercial network.",
    "Since 2005, Romania has become a regional center for the commercial operations of the Michelin Group in Albania, Bulgaria, Croatia, Bosnia, Macedonia, Montenegro and Serbia.",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Technology": 0.6238595247268677,
    "Economy": 0.5922903418540955,
    "Culture": 0.5846347808837891,
    "Conflict": 0.5722174048423767,
    "Transport": 0.5115512013435364,
    "Environment": 0.44864144921302795,
    "Energy": 0.4250831604003906,
    "Politics": 0.4019015431404114,
    "Diplomacy": 0.3655228912830353,
    "Health": 0.3492604196071625,
    "Education": 0.28605756163597107,
    "Elections": 0.2850951552391052,
    "Military": 0.27500811219215393,
    "Crime": 0.19087350368499756
  },
  "sentiment": {
    "positive": 0.429,
    "negative": 0.571,
    "neutral": 0.0
  }
}