{
  "title": "Ucraina Cere Interzicerea Televiziunii Russia Today în întreaga Lume. Postul Este Deja Blocat La Nivel UE",
  "published_date": null,
  "url": "https://www.libertatea.ro/stiri/ucraina-cere-interzicerea-russia-today-4323085",
  "original_language": "ro",
  "cleaned_sentences": [
    "The call was accompanied by a clip, widely distributed on social networks, in which the radio director of the channel, Anton Krasovski, incites a series of violent crimes against the Ukrainians.",
    "\"They should have been drowned in Tisina,\" Krasovski reacted, referring to the Tisa river, which passes through Transcarpathia.",
    "\"Those children had simply drowned, drowned!",
    "As an alternative, they could have been put in huts and burns,\" alluding to the fact that many houses are built in the area.",
    "Krasovski also laughed at the reports that Russian soldiers would have raped Ukrainian women during the invasion.",
    "Governments which style no banned rt must watch this excerpt.",
    "This is what you side with if you allow rt to operate in your countryies.",
    "Aggressive genocide in incitement (We will put this person on trial for it), which has noothing to do with freedom of speech.",
    "- Dmyro Kuleba (@dmytrokuleba) October 23, 2022 \"You ban RT throughout the world!",
    "\", It was the call made immediately by Ukraine's Foreign Minister Dimitro Kuleba.",
    "\"Governments who have not yet banned RT have to follow this fragment,\" Kuleba wrote on Twitter.",
    "\"This is on the side with which you will allow RT to operate in your countries.",
    "Instigation to aggressive genocide (we will judge this person for it), who has nothing to do with freedom of expression,\" added Kuleba.",
    "Constantly accused of repeating the propaganda of the Russian state, the RT channel has been blocked in most Western countries since February 24, when President Vladimir Putin has sent troops to Ukraine.",
    "Many commentators have argued that misinformation and propaganda such as the types commonly shared on the RT form a central part of Russia's war effort and, therefore, should not be covered by the freedom of the press.",
    "Many foreign journalists left Russia, and a number of foreign media institutions suspended their activity in this country after the Moscow authorities introduced prison penalties for the spread of \"false news\" about the Russian army."
  ],
  "topics": {
    "Conflict": 0.8723474740982056,
    "Politics": 0.8297260999679565,
    "Culture": 0.7202736735343933,
    "Crime": 0.6797438859939575,
    "Economy": 0.5964841246604919,
    "Military": 0.5844594836235046,
    "Diplomacy": 0.5609340667724609,
    "Technology": 0.47531816363334656,
    "Energy": 0.3532216548919678,
    "Health": 0.3511374294757843,
    "Transport": 0.3472704291343689,
    "Environment": 0.22348013520240784,
    "Elections": 0.1200888380408287,
    "Education": 0.036557648330926895
  },
  "sentiment": {
    "positive": 0.312,
    "negative": 0.688,
    "neutral": 0.0
  }
}