{
  "title": "Ucraina cere interzicerea globală a postului Russia Today, controlat de statul rus",
  "published_date": null,
  "url": "https://www.g4media.ro/ucraina-cere-interzicerea-globala-a-postului-russia-today-controlat-de-statul-rus.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Ukraine requires the global prohibition of the Russia Today post, controlled by the Russian state Ukraine on Sunday cataloged the RT (Russia Today) television station on Sunday, controlled by the Russian state, as a genocide instigator after a presenter said that Ukrainian children who saw the Russians as occupants under the Soviet Union should have been drowned, Agerpres reports.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - In a broadcast broadcast last week, RT Anton Krasovski presenter said those children criticizing Russia should have been \"thrown directly into a river with powerful currents.\"",
    "Krasovski-a pro-war commentator at the Russian television channel, which was sanctioned by the European Union-commented on a story of the Russian science-fiction author Sergei Lukianenko about the moment he visited Ukraine for the first time, when the children told him that they had a better life if Moscow had not occupied them.",
    "\"They should have been drowned in Tisina,\" Krasovski reacted, referring to the Tisza river passing through Transcarpathia.",
    "\"Those children simply had to be drowned, drowning!\"",
    "He said, adding: \"As an alternative, they could have been put in huts and burns,\" alluding to the fact that many houses are built in the area.",
    "In a brief fragment of the interview that was distributed on Social Media, Krasovski laughed at the reports that Russian soldiers would have raped elderly Ukrainian women.",
    "\"Governments who have not yet banned RT have to see this fragment,\" the Ukrainian Minister Dmitro Kuleba on Sunday reacted, in a Twitter post, which contains a link with this fragment from the RT interview.",
    "\"The aggressive incitement to genocide (we will sue this person for this) has nothing to do with freedom of expression.",
    "You ban with the world!",
    "\", Urged the Ukrainian minister.",
    "The Russian state television, strongly controlled by the Kremlin, was a vocal supporter of Russia's invasion in Ukraine.",
    "The presenters have currently rejected reports on war crimes committed by Russian forces, and many of them used antenna times to ask Russian President Vladimir Putin to adopt an even more aggressive approach.",
    "The Kremlin denies that his forces had committed war crimes in Ukraine, notes Reuters.",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Conflict": 0.7760884165763855,
    "Crime": 0.7666906714439392,
    "Technology": 0.5644156336784363,
    "Economy": 0.5350638628005981,
    "Politics": 0.5276269912719727,
    "Culture": 0.5234875679016113,
    "Military": 0.5103236436843872,
    "Transport": 0.40080392360687256,
    "Health": 0.28580400347709656,
    "Diplomacy": 0.264413446187973,
    "Elections": 0.24121303856372833,
    "Environment": 0.2387397587299347,
    "Energy": 0.17605912685394287,
    "Education": 0.14019125699996948
  },
  "sentiment": {
    "positive": 0.188,
    "negative": 0.812,
    "neutral": 0.0
  }
}