{
  "title": "Antony Blinken denunţă activităţile destabilizatoare promovate în lume de Russia Today",
  "published_date": null,
  "url": "https://www.g4media.ro/antony-blinken-denunta-activitatile-destabilizatoare-in-lume-ale-canalelor-russia-today.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Antony Blinken denounces the destabilizing activities promoted in the world by Russia Today US Secretary of State Antony Blinken denounced the illicit destabilization activities in the world of the media Russia Today, stressing that it has become a \"branch\" of Russian information, AFP reports.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - \"We know that RT has cyber capacities and has engaged in secret operations to influence information and purchase of military material,\" the Blinken Press told the media group RT, especially in the Republic of Moldova.",
    "About ten days ago, the American authorities revealed a number of measures, including criminal prosecution and sanctions, in particular aimed at the Russian press to respond to interference in the United States elections and attribute to Russia.",
    "The State Department then imposed visa restrictions on the media group, Rossia Segodnia, as well as other branches of this company.",
    "On Friday, Washington mainly addressed the destabilizing activities of the media group in other parts of the world.",
    "Among the activities cited, the Russian government has integrated in the spring \"within the RT an entity with cyber-operative capacities, related to Russian intelligence services\".",
    "\"This entity focused mainly on influencing operations and information worldwide,\" the State Department said, stating that RT leaders were up to date.",
    "Russia Today (RT) is a Russian television based in Moscow.",
    "RT is the trademark of \"TV-Novosti\", a non-profit autonomous organization, founded by the Russian Novosti news agency on April 6, 2005.",
    "During the Economic Crisis of December 2008, the Russian government, led by Prime Minister Vladimir Putin, included ANO \"TV-Novosti\" on the list of the main organizations of strategic importance of Russia.",
    "RT is the most watched information channel on YouTube.",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Elections": 0.6497809886932373,
    "Conflict": 0.5625346899032593,
    "Politics": 0.43395617604255676,
    "Technology": 0.41953182220458984,
    "Culture": 0.34066832065582275,
    "Diplomacy": 0.31202197074890137,
    "Economy": 0.2949568033218384,
    "Transport": 0.2933894991874695,
    "Military": 0.25504428148269653,
    "Crime": 0.22812607884407043,
    "Health": 0.17847636342048645,
    "Environment": 0.1352870762348175,
    "Education": 0.13253983855247498,
    "Energy": 0.09872975945472717
  },
  "sentiment": {
    "positive": 0.538,
    "negative": 0.462,
    "neutral": 0.0
  }
}