{
  "title": "Expert militar rus: Ungaria va trebui „în următoarele luni” să aleagă între „afirmarea controlului asupra teritoriilor sale istorice” din Ucraina și „salvarea celor 150.000 de maghiari din Transcarpat",
  "published_date": null,
  "url": "https://www.g4media.ro/expert-militar-rus-ungaria-va-trebui-in-urmatoarele-luni-sa-aleaga-intre-afirmarea-controlului-asupra-teritoriilor-sale-istorice-din-ucraina-si-salvarea-celor-150-000-de-maghiari-din-transc.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Russian military expert: Hungary will have \"in the coming months\" to choose between \"asserting control over its historical territories\" in Ukraine and \"saving the 150,000 Hungarians from Transcarpatia Russian military expert Igor Korotchenko said, at the public television station Russia 1, that Hungary will have to \"choose between\" asserting control over its historical territories \"and\" saving the 150,000 Hungarians from Transcarpathia \".",
    "He praised Viktor Orban because he \"acted with nobility\" on this issue.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - Russian Military Punit Igor Korotchenko Says Hungary Will \"In the Coming Months\" Have to Make a Choice About \"Asserting Control over Historical Lands\" in Ukraine and \"Rescing the 150,000 Transcarpathian Hungarians\" He praises Viktor Orban for \"Acting Nobly\" on the Issue pic.twitter.com/2qohcphlvk - Francis Scarr (@francis_scarr) July 29, 2022 Context Viktor Orban criticized on Saturday in Tusnad, the EU strategy on the Ukraine war, saying that Europe needs a new strategy, because the sanctions against Moscow have not worked.",
    "Orban has repeatedly stated that Hungary (which depends massively on Russian gas n.red) is not willing to support EU embargos or limitations on Russian gas imports, as this would undermine its economy.",
    "In his Romanian speech, the leader from Budapest also claimed that the Western strategy in Ukraine was built on four pillars: - The first that Ukraine can win a war against Russia with NATO weapons, - the sanctions would weaken Russia and destabilize its leadership, - sanctions would hurt Russia more than Europe - The world would align in support of Europe.",
    "Orban claimed that this strategy failed, because governments in Europe collapse according to the \"Domino\" model, energy prices have increased and now a new strategy is needed.",
    "\"We are in a car that has holes in all four wheels: it is absolutely clear that the war cannot be won this way,\" Orban told his supporters.",
    "He insisted that Ukraine will never win the war in this way \"simply because the Russian army has an asymmetrical domination.\"",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Energy": 0.894474446773529,
    "Economy": 0.8714772462844849,
    "Politics": 0.8523861765861511,
    "Military": 0.8232718110084534,
    "Conflict": 0.7824059128761292,
    "Technology": 0.7263373136520386,
    "Culture": 0.648544430732727,
    "Transport": 0.5891056656837463,
    "Environment": 0.4476073682308197,
    "Health": 0.39928683638572693,
    "Diplomacy": 0.39509472250938416,
    "Elections": 0.37494978308677673,
    "Education": 0.30709749460220337,
    "Crime": 0.18359333276748657
  },
  "sentiment": {
    "positive": 0.1,
    "negative": 0.9,
    "neutral": 0.0
  }
}