{
  "title": "Analist politic la televiziunea de stat a Rusiei: ”Aș bombarda România, nu Polonia. Știți de ce? Pentru că au devenit prea aroganți”",
  "published_date": null,
  "url": "https://www.g4media.ro/analist-politic-la-televiziunea-de-stat-a-rusiei-as-bombarda-romania-nu-polonia-stiti-de-ce-pentru-ca-au-devenit-prea-aroganti.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Political analyst on Russia's state television: \"I would bomb Romania, not Poland.",
    "Because they have become too arrogant\" Russian political analyst Dmitri Evstafiev suggested in a program on Russia 1 state television, that Moscow should bomb Romania.",
    "Professor at the Moscow School of Economics, Evstafiev was invited by Vladimir Soloviov, considered to be a Kremlin's gorges, in a show in which the moderator and guests frequently launch threats to Ukraine, but also to its allies, including Romania or the Western European States.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - \"I am starting to agree with Vladimir Rudolfovici (Soloviov).",
    "But I would not bomb Poland now.",
    "I have not yet negotiated with them,\" said Evstafiev, according to a fragment of debate, posted on X, the former Twitter.",
    "\"I would hit the Romanians.",
    "They became too arrogant,\" the political schedule continued.",
    "\"The Romanians obviously started to behave arrogant.",
    "I would put the Romanians in their place.",
    "Gaza is now bombarded.",
    "I would carefully hit some Romanian military bases through which the military aid, ammunition and all the others are sent (to Ukraine, n.r.",
    "Solovyov's Guest, Political Scientist Russian/Propagandist Evstafiev, Said That He'd Bomb Romania.",
    "He Also Wants to Bomb Poland, But Later.",
    "Putin's Puppets Will Say Russia Posăs no Three to Europe, but in reality, Ukrainians Protect Nato Today Fighting a War Tomorrow.",
    "pic.twitter.com/d53lii46yn - Victoria (@victorialog) November 14, 2023 Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Politics": 0.987694263458252,
    "Conflict": 0.8940938115119934,
    "Military": 0.8632970452308655,
    "Economy": 0.8209035396575928,
    "Transport": 0.4598935544490814,
    "Culture": 0.4410105347633362,
    "Energy": 0.39431458711624146,
    "Technology": 0.3440075218677521,
    "Health": 0.3226620852947235,
    "Crime": 0.25378087162971497,
    "Environment": 0.1988331377506256,
    "Elections": 0.1877574473619461,
    "Education": 0.17224478721618652,
    "Diplomacy": 0.14633162319660187
  },
  "sentiment": {
    "positive": 0.294,
    "negative": 0.706,
    "neutral": 0.0
  }
}