{
  "title": "VIDEO Prezentatorul Russia Today care a cerut înecarea sau arderea copiilor ucraineni care cred că Rusia este un stat ocupant a fost concediat",
  "published_date": null,
  "url": "https://www.g4media.ro/video-prezentatorul-russia-today-care-a-cerut-inecarea-sau-arderea-copiilor-ucraineni-care-cred-ca-rusia-este-un-stat-ocupant-a-fost-concediat.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Video Russia Today presenter who asked for the drowning or burning of Ukrainian children who believe that Russia is an occupant state has been fired The Russian state channel Russia Today (RT) fired TV presenter Anton Krasovsky, after he said that Ukrainian children should be drowned, who believe that the territory of Ukraine is occupied by Russia, according to the Ukrainian publication.",
    "Meanwhile on Russia’s state-funded RT, director of broadcasting Anton Krasovsky suggests drowning or burning Ukrainian children, makes hideous comments about the rapes by Russian soldiers in Ukraine, says Ukraine should not exist and Ukrainians who resist Russia should be Shot.",
    "pic.twitter.com/bgiabnok4v - Julia Davis (@juliadavisnews) October 23, 2022 \"I put an end to our collaboration, because neither I nor the rest of the RT team can even help that any of us is able to share such nonsense.",
    "A surprise, what I can say,\" Margarita Simonyan, the editor-in-chief of RT, on Telegram.",
    "At the same time, Simonyan had stated that \"it is hard to believe that Krasovski was honestly believed that children should be drowned.\"",
    "She qualified Krasovsky's statement as \"wild and disgusting\", but \"maybe Anton will explain by what kind of temporary madness\" she has become such statements.",
    "In a conversation with the Russian writer Sergei Lukyannko, Anton Krasnovky, RT presenter and the RT-language version broadcasting director, had proposed to drown Ukrainian children who believe that the Russian occupation is under Russian occupation.",
    "Lukyannko said he visited Ukraine when he was a child, in 1980, and that Ukrainian children speaking Russian told him that Ukraine was occupied by \"Muskali\".",
    "\"Those [children] should have been drowned in Tysyna, where the duck floats [allusion to the Ukrainian folk song Plyne Pocha Po Tysyni, or a drift duck along Tysyne-n.r.].",
    "Strong, ”the presenter proposed.",
    "Krasovsky also said that the children \"should be thickened in the Carpathians and to be set on fire.\"",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Conflict": 0.733137845993042,
    "Politics": 0.5896340608596802,
    "Technology": 0.48826509714126587,
    "Culture": 0.42778003215789795,
    "Military": 0.3767102360725403,
    "Economy": 0.3625982999801636,
    "Health": 0.30191904306411743,
    "Education": 0.25053274631500244,
    "Elections": 0.22511990368366241,
    "Environment": 0.21251095831394196,
    "Energy": 0.19828593730926514,
    "Transport": 0.19091129302978516,
    "Diplomacy": 0.17476379871368408,
    "Crime": 0.17165525257587433
  },
  "sentiment": {
    "positive": 0.167,
    "negative": 0.833,
    "neutral": 0.0
  }
}