{
  "title": "Șeful Russia Today: În curând va începe foametea și vor veni să fie iar prieteni cu noi (Video)",
  "published_date": null,
  "url": "https://www.stiripesurse.ro/eful-russia-today-in-curand-va-incepe-foametea-si-vor-veni-sa-fie-iar-prieteni-cu-noi_2437355.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Chief Russia Today, Margarita Simonian, said the West will come to realize that it is impossible not to be friends with Russia, because it will start hunger.",
    "Margarita Simonian said, during a speech at the St. Petersburg Economic Forum, Russian people began to say that \"all our hope is in hunger.\"",
    "\"Now the hunger will begin and they will raise the sanctions and they will be friends with us, because they will realize that it is impossible not to be friends with us,\" said Margarita Simonian.",
    "\"The Famine Will Start Now and The Will Lift the Sanctions and Be Friends With US, Because they Will Realizes that is impossible to be Friends With US,\" - Said Kremlin Propagandist Margarita Simonyan Dury the Petersburg Economic Forum.",
    "#Stoprusia pic.twitter.com/48f1dhnfac - Ukraineworld (@ukraine_world) June 20, 2022 Thus, Margarita Simonian is based on the fact that the embargo on Russian oil and the other sanctions packages will have boomerang effect on the West.",
    "In other news, the United States and the European Union have asked Russia to open Ukrainian ports to allow millions of cereals stored there, thus contributing to the eating world crisis.",
    "Currently, \"Russia blocks at least 20 million tons of Ukrainian cereals to reach the world markets,\" said Josep Borrell, who asked Moscow to reopen the ports under the Russian block.",
    "The Ukrainians have repeatedly stated that the Russians were stealing cereal crops.",
    "Several cereal ships loaded by the Russians in the port of Sevastopol arrived in Syria.",
    "At the same time, the head of the office of the Ukrainian president, Andrii Yrmak, said that Russia is trying to repeat Holodomor, also called Ukrainian genocide, a hunger in Soviet Ukraine from 1932 to 1933, millions of people under the Soviet regime.",
    "\"The Russians bombard the Ukrainian fields with incendiary bombs.",
    "Those who create the global food crisis are trying to rebuild Holodomor.\"",
    "Simonian leads the Russia Today television since 2005 when she was appointed to the position of editor-in-chief although she was only 25 years old.",
    "The European Union has imposed sanctions against Margarita Simonian since the end of February as part of the Kremlin propagandists sanctioning package.",
    "The EU forbade Russian Propaganda channels Russia Today and Sputnik on February 27, 3 days after Vladimir Putin ordered the invasion of Ukraine."
  ],
  "topics": {
    "Politics": 0.9099118113517761,
    "Conflict": 0.895624577999115,
    "Economy": 0.7704877257347107,
    "Culture": 0.7109417915344238,
    "Military": 0.6861570477485657,
    "Health": 0.6470895409584045,
    "Transport": 0.5999784469604492,
    "Energy": 0.5964441299438477,
    "Environment": 0.520118236541748,
    "Technology": 0.484215646982193,
    "Diplomacy": 0.4095497727394104,
    "Elections": 0.37012913823127747,
    "Crime": 0.30216455459594727,
    "Education": 0.27494168281555176
  },
  "sentiment": {
    "positive": 0.2,
    "negative": 0.8,
    "neutral": 0.0
  }
}