{
  "title": "Presa rusă, despre retragerea forţelor ruseşti din Lyman: Inamicul a folosit atât artilerie de fabricaţie occidentală, cât şi informaţii din ţările alianţei nord-atlantice",
  "published_date": null,
  "url": "https://www.g4media.ro/presa-rusa-despre-retragerea-fortelor-rusesti-din-lyman-inamicul-a-folosit-atat-artilerie-de-fabricatie-occidentala-cat-si-informatii-din-tarile-aliantei-nord-atlantice.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "The Russian press, about the withdrawal of the Russian forces from Lyman: the enemy used both Western manufacturing artillery and information from the countries of the North Atlantic Alliance The Russian Russia-24 state press reported that the reason for Russia's withdrawal from Lyman was that \"the enemy used both Western manufacturing artillery and information from the North Atlantic Alliance countries,\" news.ro, citing CNN.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - The Russian forces withdrew from Lyman, a strategic city for his operations in the east of the country, the Russian Ministry of Defense announced on Saturday, just one day after Moscow's annexation, declared illegally by the West.",
    "\"In connection with the creation of an circle threat, the Allied troops were withdrawn from the Krasny Liman settlement to more advantageous lines,\" the Ministry said on Telegram, using the Russian name of Lyman.",
    "The Russian Russia-24 state press reported that the reason for Russia's withdrawal was that \"the enemy used both Western manufacturing artillery and information from the countries of the North Atlantic Alliance.\"",
    "The withdrawal marks the most significant gain of Ukraine from its successful counter-offensive in the North-East region last month.",
    "Russia's announcement comes just hours after the Ukrainian forces said they had surrounded Russian troops in the city, which are in the Kramatorsk district of Donetsk.",
    "Ukrainian forces said on Saturday that they entered Stavky, a neighboring village with Lyman, according to Serhii Cherevatyi, the military spokesman for the eastern group of Ukrainian forces.",
    "\"The Russian group in the Lyman area is surrounded.",
    "Yampil, Novoselivka, Shandryholove, Drocksheve and Stavky settlements are released.",
    "Stabilization measures are underway,\" Cherevityi said on a TV conference on Saturday morning.",
    "\"Lyman's release is important, because it is another step towards the release of the Ukrainian donbas.",
    "This is an opportunity to go further to Kreminna and Severodonetsk.",
    "Therefore, it is very important from a psychological point of view,\" he said.",
    "Cherevatyi said that the actions of Ukrainian troops set the tone to \"break the course of these hostilities.\"",
    "Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Conflict": 0.9028695225715637,
    "Technology": 0.8944665193557739,
    "Politics": 0.8834930658340454,
    "Culture": 0.882003664970398,
    "Military": 0.8819963932037354,
    "Health": 0.8469441533088684,
    "Economy": 0.8162432909011841,
    "Transport": 0.7934123873710632,
    "Energy": 0.791290283203125,
    "Environment": 0.789505660533905,
    "Elections": 0.7709058523178101,
    "Diplomacy": 0.7670946717262268,
    "Education": 0.7097672820091248,
    "Crime": 0.5717939138412476
  },
  "sentiment": {
    "positive": 0.438,
    "negative": 0.562,
    "neutral": 0.0
  }
}