{
  "title": "„Păpușa De Fier A Lui Putin”, Margarita Simonian, Acuzată Că încercă Să Influențeze Alegerile Americane Din 2024. A Fost Sancționată De SUA",
  "published_date": null,
  "url": "https://www.libertatea.ro/stiri/papusa-de-fier-a-lui-putin-margarita-simonian-incerca-sa-influenteze-alegerile-americane-din-2024-si-a-fost-sanctionata-de-statele-unite-5006144",
  "original_language": "ro",
  "cleaned_sentences": [
    "The US Treasury Department has announced sanctions against the RT, accusing Moscow of attempts to influence presidential elections.",
    "Ten people and two organizations are targeted by sanctions.",
    "The media group Rossiia Segodnia and five branches, including RT and Sputnik, have been sanctioned.",
    "The restrictions were also imposed against the editor-in-chief of the RT, Margarita Simonian, and against two of his deputies, Elizaveta Brodskaia and Anton Anisimov.",
    "Also, on the list of sanctions is the deputy chief of the Information A broadcast Service Andrei Kiiașko, the Digital Media Project Manager Konstantin Kalașnikov and the employee of the Digital Media Project Department Elena Afanasieva.",
    "The above are accused of secretly recruited influential people of social media to influence public opinion in the US and to spread pro-Kremlin messages.",
    "The State Department has imposed visa restrictions and provided rewards for information about foreign interference in elections.",
    "The Russia Today media group and its US branches must report on employees and properties.",
    "Ano dialog and its general manager, Vladimir Tabak, were also sanctioned.",
    "The US Treasury has said that \"Russian government actors have long used a variety of instruments, such as generative artificial intelligence, deepfakes and misinformation, in an attempt to undermine confidence in the United States electoral processes.\"",
    "The US Department of Justice has accused two RT employees, Konstantin Kalașnikov and Elena Afanasieva, of violating the Law on foreign agents and money laundering.",
    "They spent almost $ 10 million for the publication of propaganda videos and misinformation on social networks.",
    "Margarita Simonian reacted on her Telegram channel: \"Yes, well!",
    "I woke up,\" she wrote.",
    "According to CNN, on September 4, the United States was to accuse Russia of attempting to influence the 2024 presidential elections.",
    "Simonian is already sanctioned by the European Union, the United Kingdom and other Western countries because of the Russian invasion in Ukraine.",
    "However, so far, the United States has not imposed sanctions against it.",
    "FBI, writes News.ro, has asked the court permission to confiscate 32 internet fields that the US government states that they are involved in efforts of \"malicious foreign influence\", including attempts to undermine public support for Ukraine in the war with Russia.",
    "RT replied by ridiculing the accusations.",
    "\"Three things are safe in life: death, taxes and RT interference in US elections,\" said the television station sarcastically.",
    "The Department of Justice has previously warned that Russia remains a threat to the presidential elections.",
    "US officials have said that Russia has not changed its preferences for previous US presidential elections, indicating that Moscow favors Trump.",
    "Previous assessments of US intelligence services found that Moscow tried to help Trump in 2016, when he defeated Democrat Hillary Clinton, and in 2020, when he lost in front of Democrat Joe Biden.",
    "Moscow denied the accusations.",
    "Lisa Monaco, the second official as a rank in the Department of Justice, said last month that Russian President Vladimir Putin and his powers have increasingly sophisticated techniques, aiming at specific groups of voters and those in the states where the electoral is fierce.",
    "In July, the Department of Justice said he had interrupted a Russian campaign on Social Media, with links to the RT, which secretly spread pro-Kremlin messages.",
    "Last month, the FBI searched the homes of two Americans who had connections with the Russian state press - the former weapons inspector of the United Nations Scott Ritter and Dimitri Simes, a 2016's Trump Campaign counselor.",
    "The US government has also accused Iran of trying to influence future elections through cyber operations against Trump and Harris campaigns.",
    "The Trump Campaign said Iran is behind his internal documents to the American media.",
    "American intelligence agencies have evaluated that China does not intend to intervene in the presidential race to favor a candidate.",
    "However, Reuters reported on Tuesday that an operation on social media related to Beijing denigrates American politicians and sends split messages before elections, claiming that it is about American voters.",
    "Catalin08 • 05.09.2024, 10:15 I remember what the late Prigojin said about Russian propaganda, as the Russians have already conquered the entire planet, several times.",
    "The level of propaganda in Russia is in the field of absurd ... Bony • 05.09.2024, 07:00 Probably the RT audience is huge in the USA, such sanctions were needed ..."
  ],
  "topics": {
    "Conflict": 0.815447211265564,
    "Politics": 0.78141188621521,
    "Culture": 0.773072361946106,
    "Elections": 0.7597842216491699,
    "Environment": 0.7465300559997559,
    "Transport": 0.729625403881073,
    "Energy": 0.7020658850669861,
    "Economy": 0.6958141326904297,
    "Technology": 0.6895967125892639,
    "Crime": 0.6447949409484863,
    "Health": 0.6303167343139648,
    "Education": 0.5828098058700562,
    "Military": 0.5487634539604187,
    "Diplomacy": 0.5197762250900269
  },
  "sentiment": {
    "positive": 0.242,
    "negative": 0.758,
    "neutral": 0.0
  }
}