{
  "title": "VIDEO Propagandă rusă cu secera și ciocanul, statuia lui Lenin, votcă și ”no cancel culture”: Time to move to Russia",
  "published_date": null,
  "url": "https://www.g4media.ro/video-propaganda-rusa-cu-secera-si-ciocanul-statuia-lui-lenin-votca-si-no-cancel-culture-time-to-move-to-russia-dont-delay-winter-is-comming.html",
  "original_language": "ro",
  "cleaned_sentences": [
    "Russian propaganda video with the sickle and hammer, Lenin's statue, vodka and \"no Cancel culture\": Time to Move to Russia / Don't Delay ... Winter Is Coming Russian propaganda boasts in a video dedicated to Russia with \"beautiful women\", but the sequence is illustrated with two little girls running in the field, with vodka, with traditional Christianity and with a warning: it is time to move to Russia.",
    "Don't delay ... winter is coming.",
    "Click here to redirect 3.5% of tax - online, free and simple.",
    "Watch the latest G4Media video productions - The article continues below - The video begins with the symbol of communism, the harvest and the hammer and the statue of Lenin.",
    "\"Cheap energy and water, no Cancel Culture, the economy can withstand thousands of sanctions\" are other slogans through which Russia tries to trolley the West.",
    "\"This is how Russia tries to attract people to go to live there.",
    "It's not a satire,\" writes a commentator on Twitter.",
    "This is How #russia 🇷🇺 is Trying to Attract People to Go and Live There.",
    "'Not satire.pic.twitter.com/c9vmgacixj - David Patrikarakos (@dpatrikarakos) July 29, 2022 Donate monthly to support the G4Media project Donate the desired amount to support the G4Media project LAW CONT: RO89RZBR0000060019874867 Open to Raiffeisen Bank"
  ],
  "topics": {
    "Politics": 0.8039929270744324,
    "Conflict": 0.7527324557304382,
    "Energy": 0.6642245054244995,
    "Economy": 0.5907272100448608,
    "Culture": 0.574269711971283,
    "Transport": 0.5090732574462891,
    "Environment": 0.46276891231536865,
    "Crime": 0.44669589400291443,
    "Technology": 0.4317900240421295,
    "Military": 0.40265434980392456,
    "Health": 0.3198579251766205,
    "Diplomacy": 0.30398473143577576,
    "Education": 0.20367605984210968,
    "Elections": 0.08973178267478943
  },
  "sentiment": {
    "positive": 0.111,
    "negative": 0.889,
    "neutral": 0.0
  }
}