{
  "title": "\"Миссис Россия-2024\" стала мать троих детей из Петербурга",
  "published_date": null,
  "url": "https://ria.ru/20240812/missis-1965700080.html",
  "original_language": "ru",
  "cleaned_sentences": [
    "13:38 12.08.2024 (Updated: 15:20 12.08.2024) Mrs. Russia - 2024 became the mother of three children from St. Petersburg In the competition \"Mrs. Russia 2024\" the mother of three children Rozhnev from St. Petersburg won Lyudmila Rozhneva.",
    "Archive photo Read Ria.ru c Moscow, Aug 12 - RIA Novosti.",
    "The winner of the Mrs. Russia-2024 contest was the mother of three children Lyudmila Rozhnev from St. Petersburg, RIA Novosti was told in the press service of the competition.",
    "\"He is 40 years old, she has three children.",
    "Lyudmila was born in the Kazakh SSR.",
    "She had a childhood and graduated from a school in the Caucasus.",
    "She entered St. Petersburg University of Industrial Technology and Design,\" the release says.",
    "Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 1 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 2 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 3 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 4 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 5 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 1 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 2 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 3 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 4 out of 5 Lyudmila Rozhneva from St. Petersburg, who became the winner of the contest \"Mrs. Russia-2024\" 5 out of 5 The second prize is the title of MRS. Russia Globe-received 35-year-old Daria Zakharova from Nizhny Novgorod.",
    "As specified in the press service, she will go to represent Russia among 80 countries of the world at the Mrs. Globe contest-2024 / Mrs. Globe 2024. \"",
    "The first vice ministry was Evgenia Morozova from Pskov, the second-Galina Pashkova from Stavropol.",
    "The Grand Prix of the competition was received by another representative of Pskova Kristina Larchenko.",
    "The title \"Mrs. Russia Classic - 2024\" was awarded Kristina Volskaya from Samara.",
    "The final of the 26th National Beauty Competition for Married Women \"Mrs. Russia-2024\" was held in the large concert hall of the Moscow Folklore Center.",
    "This year, the competition set a record for the number of many children: out of 39 finalists from all over 13 - many children.",
    "In addition, several wives of participants in a special military operation entered the final."
  ],
  "topics": {
    "Culture": 0.9378096461296082,
    "Environment": 0.8838312029838562,
    "Economy": 0.8264045119285583,
    "Technology": 0.778506338596344,
    "Health": 0.7610447406768799,
    "Politics": 0.7511129975318909,
    "Energy": 0.5882534980773926,
    "Military": 0.5830434560775757,
    "Crime": 0.5746639370918274,
    "Elections": 0.5205340385437012,
    "Transport": 0.4628663957118988,
    "Conflict": 0.4085042178630829,
    "Education": 0.3547924757003784,
    "Diplomacy": 0.07238312065601349
  },
  "sentiment": {
    "positive": 0.867,
    "negative": 0.133,
    "neutral": 0.0
  }
}