{
  "title": "Viktigt att hålla Russia Today utanför EU",
  "published_date": null,
  "url": "https://www.gp.se/kultur/kultur/viktigt-att-h%C3%A5lla-russia-today-utanf%C3%B6r-eu-1.66929932",
  "original_language": "sv",
  "cleaned_sentences": [
    "The state-controlled Russian TV channel RT, formerly Russia Today, is aimed with the help of English-language program leaders to an international audience.",
    "You can describe the channel as an attempt by Putin's side to counteract the dominance of CNN and BBC, or you can call the news broadcasts for what they are, the Russian government's megaphone in the world, or perhaps even rather: a kind of nigeria letter.",
    "Admittedly, the journalists formulate without breaking, but the content has obviously been created in consultation with Putin's propaganda apparatus to get viewers to buy shares in the colorful potemkin sculpture.",
    "The Russian military is said to have received a warm reception from the Ukrainian people, which is due to the fact that the Russian intervention is of the softer kind, the military shows great restraint to protect the civilian population and all Ukrainians who close the weapons are promised a humane and respectful treatment.",
    "In recent personal portraits and mini -documentaries, ordinary Russians in Luhansk and Donetsk may talk about their suffering for eight long years of alleged Ukrainian aggression.",
    "Anyone born under a stone certainly has nothing to object.",
    "In recent personal portraits and mini -documentaries, ordinary Russians in Luhansk and Donetsk may talk about their suffering for eight long years of alleged Ukrainian aggression.",
    "When the war, sorry: \"The operation\", began on Thursday, a visibly troubled woman was interviewed who was said to have moved into Russia to save herself from the Ukrainians.",
    "She was very grateful for the Russian effort and the direct translation in English was warm and empathetic.",
    "To give the shine of objectivity, two Ukrainians from Kiev were then interviewed who had heard bangs \"at a distance\" during the night.",
    "How did these Ukrainian experience the situation?",
    "It was difficult to get hold of, because at first they did not appear in the picture.",
    "Instead, a sound chart rolled across the screen as to be a matter of secret recordings.",
    "The empathic translator who had just given voice to the Russian refugee had been replaced by a computer: a monotonous robotic voice was laid as an dehumanizing audio filter over the Ukrainians' accounts.",
    "The foolish propaganda is easy to shake your head.",
    "The same goes for the screwed up and conspiracy theoretically oriented debate program \"Crosstalk\", whose program leader and guests despite the program name are in agreement on just about everything, and who praise each other for their many good points: that the US and NATO are the biggest hypocrites ever.",
    "What Russia is currently trying to overstate the world's population can just as well be described as flyers released from high altitude.",
    "But as with the Nigeri letter, the ability is a large part of the fraud.",
    "It plays an important function as it quickly sells away those who look through the bluff and turns off the programs.",
    "This means that the hosts can in peace and quiet devote themselves to the remaining viewers.",
    "Whether they define themselves as right or left, they then get their \"critical\" worldview confirmed, which they can spread on in social media.",
    "This is where RT's articles, elements and perspectives are given a shimmer of impartiality, since they are visible in the flow along with links from more serious media such as BBC or SVT.",
    "The company also produces programs on everything from racism and inequality in the United States to vaccine criticism, so it is also not impossible that they achieve success with what must currently be described as a massive impact campaign.",
    "It is understandable that first Germany and then Poland decided to block RT's broadcasts and that the EU and Youtube quickly followed suit.",
    "At the time of writing, it is no longer possible to reach RT or the other state international channel, Sputnik Europe, via the Internet.",
    "But since prohibition and blockage raise questions about freedom of press and expression, even when it comes to counteracting obvious propaganda, it is still unclear what effect this will have.",
    "The already saved \"critics\" in social media have been given a new ammunition to use in the information war, by pretending that the threat to freedom of expression is greater in democratic countries than in Russia.",
    "Did I say Nigeria letter?",
    "What Russia is currently trying to overstate the world's population can just as well be described as flyers released from high altitude.",
    "The purpose is to reduce resistance of the enemy and create sympathy with the war -rich regime in Moscow.",
    "It's up to everyone not to be fooled.",
    "Sign up for our newsletter GP's cultural editorial tips on this week's snack ice creams, events and guides you to Gothenburg's cultural life.",
    "To sign up for the newsletter you need a digital account, which is free of charge and gives you several benefits.",
    "Follow the instructions and sign up for the newsletter here."
  ],
  "topics": {
    "Culture": 0.8735318779945374,
    "Health": 0.842829167842865,
    "Politics": 0.8336881995201111,
    "Energy": 0.8320053219795227,
    "Conflict": 0.8079609274864197,
    "Environment": 0.7797722816467285,
    "Technology": 0.7526047229766846,
    "Diplomacy": 0.7492337226867676,
    "Elections": 0.7152817845344543,
    "Economy": 0.673072099685669,
    "Education": 0.6604592800140381,
    "Military": 0.626211941242218,
    "Transport": 0.6256862878799438,
    "Crime": 0.562542736530304
  },
  "sentiment": {
    "positive": 0.412,
    "negative": 0.588,
    "neutral": 0.0
  }
}