{
  "title": "Det stinker om Alfa Laval",
  "published_date": null,
  "url": "https://www.smp.se/ledare/det-stinker-om-alfa-laval-c2eeb49d/",
  "original_language": "sv",
  "cleaned_sentences": [
    "Leader Svenska Dagbladet refers to several international institutes that map companies that still have operations in Russia.",
    "Alfa Laval is not the only Swedish shame.",
    "According to the research group Leave-Russia, thirteen Swedish companies take blood money in the country.",
    "But most of course are giants with headquarters elsewhere.",
    "Several of them, such as Astra Zeneca, explain that their products are needed in Russia, for humanitarian reasons.",
    "Of course, this is a sweeping reason.",
    "These companies are not driven by human love.",
    "And to the extent that you want to distinguish between regime and population, it is clear by this time that Russians have no major problems with the war as long as they themselves are not called.",
    "Advertisement Advertisement Several companies also delay themselves for fear that their Russian assets will otherwise be confiscated by the Russian state.",
    "It is a realistic concern, but at the same time also the worst moral argument.",
    "If you make the decision to invest in an autocratic country, you have to stand.",
    "The fact that the development in such a country can quickly go to a legal situation for a company is not a strange thing.",
    "If you choose to invest in a country that is not a rule of law, you have made a conscious risk assessment.",
    "Then just bite into the sour apple.",
    "According to the research group Leave-Russia, thirteen Swedish companies take blood money in the country.",
    "Exactly the same situation also prevails for the Western companies that have invested in China.",
    "In that case, it is clear that a Russian situation may arise and the regime begins first foreign operations.",
    "No boards have coverage in order to start over the accident that has pulled over them.",
    "Is so foolish that you invest in China - or not withdraw now while time is - you have to blame yourself.",
    "Just German companies invest symptomatically with their government's eager approval in China.",
    "Symptomatic because the same government is sadly unwilling to assist Ukraine with military resources.",
    "In Ukrainian Kyiv Post, the Serbian security policy expert Dr. Orhan is drawn a review of how patiently Russia has spun a network of loyalty around the German establishment for several years: Advertisement Advertisement \"Berlin's Restraint Towards Ukraine is a Consequence of Russia's Long-Term Subversive Actions in Germany… .but this is also related to German Expectations that in some post-war arrangements, it will will be on again again.\"",
    "It is serious on several levels.",
    "If the EU's largest state consciously or does not signal that one would most like to see a return to normal relationships with Russia, why would Western business interests not impress on this and cling to their Russian positions so it goes?",
    "Ultimately, it is a question of which attraction is strongest: the greed and cynicism of the big companies or the moral of the public."
  ],
  "topics": {
    "Conflict": 0.9702349901199341,
    "Culture": 0.936999499797821,
    "Politics": 0.9365074038505554,
    "Economy": 0.9312841296195984,
    "Health": 0.8335887789726257,
    "Technology": 0.7884984016418457,
    "Military": 0.7871779799461365,
    "Transport": 0.7621203064918518,
    "Environment": 0.7261303067207336,
    "Diplomacy": 0.6680577397346497,
    "Energy": 0.6665300130844116,
    "Education": 0.6423120498657227,
    "Elections": 0.5468512177467346,
    "Crime": 0.5095019340515137
  },
  "sentiment": {
    "positive": 0.36,
    "negative": 0.64,
    "neutral": 0.0
  }
}