{
  "title": "Ukraine reportedly fires UK Storm Shadow missiles into Russia for first time",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/ukraine-fires-uk-storm-shadow-missiles-into-russia-media-says",
  "original_language": "en",
  "cleaned_sentences": [
    "LONDON - Ukraine has fired UK-supplied Storm Shadow missiles into Russia for the first time, British media reported on Nov 20, after being given the green light from London.",
    "Several missiles were launched against at least one Russian military target, the Financial Times said, citing an unidentified Western official.",
    "The Times said government sources had confirmed the use of the long-range missiles for the first time.",
    "The Guardian said Britain had given Ukraine permission to use the missiles in Russia in response to Moscow’s deployment of North Korean troops on the border.",
    "The strikes were also widely reported by Russian war correspondents on Telegram and confirmed by an official on condition of anonymity.",
    "A spokesperson for Ukraine’s General Staff said he had no information.",
    "Russian pro-Kremlin military bloggers wrote that around a dozen Storm Shadow missiles were fired on a target in the Kursk border region, which is partially held by Ukrainian forces.",
    "Ukrainian media posted aerial video footage from a drone showing a series of explosions at what appears to be a country estate, naming the location as Maryino, where the presidential administration has a sanatorium.",
    "Ukrainian media reported the strikes could have targeted an underground military command centre.",
    "Neither Moscow nor Kyiv have officially confirmed the missile attack or the use of Storm Shadows.",
    "A spokesperson for British Prime Minister Keir Starmer declined to comment.",
    "Britain had previously allowed Ukraine to use Storm Shadows, which have a range in excess of 250km, within Ukrainian territory.",
    "The reported attack came after Washington this week said it had cleared Ukraine to use its ATACMS against military targets inside Russia – a long-standing Ukrainian request.",
    "Russia said on Nov 19 that the missiles had been used to target a military facility in the Bryansk border region.",
    "The reported strikes came as Moscow looks to retaliate against Ukraine for firing US-supplied long-range missiles on Russian territory for the first time and with the Kremlin accusing outgoing US President Joe Biden of dragging out the war.",
    "Russia has ramped up deadly missile strikes in recent days, targeting residential areas and Ukraine’s energy grid.",
    "Air alerts blare out across the country daily.",
    "The United States said on Nov 20 morning that it was shutting its Kyiv office to the public after having received “specific information of a potential significant air attack”.",
    "Canada, Greece, Hungary, Italy and Spain – all Nato members – followed suit.",
    "The US embassy said on Nov 20 evening that it would reopen on Nov 21, after having “temporarily modified operations” due to a warning of a “potential imminent air attack”.",
    "The French embassy remained open but urged its citizens to be cautious.",
    "The Kremlin said it had no comment.",
    "Strikes a ‘daily reality’ Ukrainian officials criticised the rare move and called on its allies not to spread yet more fear among Ukrainian society.",
    "“We remind you that the threat of strikes by the aggressor state has unfortunately been a daily reality for Ukrainians for over 1,000 days,” Ukraine’s foreign ministry posted on social media.",
    "Air alert sirens sounded in Kyiv on Nov 20 and the authorities said falling debris from an intercepted drone attack in the morning caused minor damage.",
    "President Volodymyr Zelensky said in his evening address that the “panic messages that were reposted” on social media “only helps Russia”.",
    "Nerves are already frayed in Kyiv after almost three years of war, and Donald Trump’s victory in the US presidential election has injected fresh uncertainty.",
    "The Republican has repeatedly criticised US support for Ukraine and claimed he could broker a ceasefire within hours – comments that have triggered fears in Kyiv and Europe about Ukraine’s ability to withstand the Russian attacks without American support.",
    "Both Ukraine and Russia are jockeying for upper hand on the battlefield before Trump re-enters the White House in January.",
    "Anticipating Trump administration Trump, who has said he will end the war, without saying how, has criticised the billions of dollars in aid for Ukraine under the Biden administration.",
    "The warring sides believe he is likely to push for peace talks – not known to have been held since the war's earliest months – and are trying to attain strong positions before negotiations.",
    "Russia on Nov 20 accused Mr Biden of prolonging the war by stepping up weapons deliveries to Kyiv in his final weeks in office.",
    "“If you look at the trends of the outgoing US administration, they are fully committed to continuing the war in Ukraine and are doing everything they can to do so,” Kremlin spokesman Dmitry Peskov said.",
    "Mr Peskov was responding to the US saying it would soon provide Ukraine with anti-personnel land mines.",
    "This decision has prompted criticism from charities over the long-term risk to civilians, but Mr Zelensky said in his evening address that landmines were “very important... to stop Russian assaults”.",
    "US Defence Secretary Lloyd Austin said on Nov 20 that Russian forces “lead with dismounted forces” rather than tanks, and landmines “can help slow down that effort”.",
    "Western countries say the arrival of more than 10,000 North Korean troops to fight for Russia in recent weeks was an escalation that merited a response.",
    "The war is at a volatile juncture, with nearly a fifth of Ukrainian territory in Russian hands, North Korean troops deployed in Russia’s Kursk region and doubts over the future of Western aid under Trump, whose nominees for administration posts include sceptics of support for Kyiv.",
    "‘Big mistake’ World leaders have taken note of the stepped-up American support for Kyiv.",
    "Turkey’s President Recep Tayyip Erdogan, a Nato ally of the US, said on Nov 20 that the decision to allow Kyiv to use the powerful long-range missiles was a “big mistake”.",
    "“This step by Biden will not only escalate the conflict, but will lead to a greater reaction from Russia,” Mr Erdogan, who sees himself as a possible mediator, told journalists.",
    "Moscow has struck a defiant tone, pledging retribution and continuing its advance on the front lines.",
    "Its forces claimed on Nov 20 to have captured the village of Illinka, close to the strategic hub of Kurakhove in the eastern Donetsk region.",
    "The Kremlin also rejected as “absurd” and “laughable” suggestions it was involved in the cutting of two telecommunications cables running under the Baltic Sea.",
    "European officials have said they suspect “sabotage” and “hybrid warfare” linked to Russia’s invasion of Ukraine.",
    "Despite increased speculation of possible talks to end the conflict, there is no sign of Mr Zelensky or Russian President Vladimir Putin being anywhere close to converging on a possible deal.",
    "AFP, REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Conflict": 0.43160536885261536,
    "Technology": 0.25175660848617554,
    "Culture": 0.23862290382385254,
    "Diplomacy": 0.22796009480953217,
    "Politics": 0.2256704717874527,
    "Economy": 0.19630712270736694,
    "Transport": 0.19090132415294647,
    "Military": 0.18153470754623413,
    "Energy": 0.1627361923456192,
    "Environment": 0.1476537436246872,
    "Elections": 0.12035702913999557,
    "Crime": 0.1116233617067337,
    "Education": 0.09692635387182236,
    "Health": 0.08276841044425964
  },
  "sentiment": {
    "positive": 0.234,
    "negative": 0.766,
    "neutral": 0.0
  }
}