{
  "title": "Bogged down in Ukraine, Russia pays a price in Syria",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/middle-east/bogged-down-in-ukraine-russia-pays-a-price-in-syria",
  "original_language": "en",
  "cleaned_sentences": [
    "BERLIN – Lines of Russian troops in desert khaki greeted President Vladimir Putin in Syria in 2017.",
    "Declaring that Moscow had accomplished its mission in Syria’s civil war, Mr Putin pledged that Russia was there to stay.",
    "“If the terrorists raise their heads again,” he said on the tarmac of a Russian airbase, “we will deal unprecedented strikes unlike anything they have seen”.",
    "But over the past two weeks, as rebels whom Russia called terrorists swept across Syria aiming to topple one of Moscow’s closest allies, President Bashar al-Assad, those “unprecedented” strikes were nowhere to be seen.",
    "Instead, with Mr Assad’s ouster on Dec 8, Mr Putin has suffered one of the biggest geopolitical setbacks of his quarter-century in power.",
    "He took that blow, analysts said, in large part because his military is bogged down in Ukraine.",
    "“Our involvement over there had a cost,” a Moscow-based analyst focusing on the Middle East, Mr Anton Mardasov, said, referring to Russia’s war in Ukraine.",
    "“The cost was Syria.” By Dec 8, Russia had been reduced from kingmaker to bystander.",
    "Its Foreign Ministry issued a statement of “extreme concern” about “the dramatic events” and announced that Mr Assad had left the country.",
    "Kremlin spokesman Dmitry Peskov told Russian news agencies that he had nothing to add.",
    "Mr Putin has said nothing about Syria in recent weeks.",
    "The extent of the fallout for Russia of Mr Assad’s removal is still to be determined.",
    "The key question, analysts said, is whether Russia manages to strike an agreement with Syria’s new government to hold on to its Tartus naval base and its Hmeimim airbase, where Mr Putin delivered that victory speech in 2017.",
    "Mr Mardasov said he was unsure whether Moscow would be able to strike such a deal, given that Russia used those bases for overwhelming air strikes against Syria’s opposition after the Kremlin intervened in Syria’s civil war in 2015.",
    "Losing the Syrian bases would thwart some of Mr Putin’s ambitions to re-establish Russia as a world power, since they are crucial to the Kremlin’s ability to flex its muscles in places as far away as West Africa.",
    "“Syria is their only real foothold in the Middle East and the Mediterranean,” said Dr Eugene Rumer, director of the Russia and Eurasia programme at the Carnegie Endowment for International Peace in Washington.",
    "The rebel victory, he said, has become “part of the price they are paying for the war in Ukraine”.",
    "The Kremlin is also likely to bear a broader cost to its image.",
    "In Mr Putin’s widening conflict with the West, he has been trying to position Russia as a decisive, reliable leader of a global coalition against what he calls American hegemony.",
    "“What good is Russia as a partner if it cannot save its oldest client in the Middle East from a ragtag band of militias?” Dr Rumer asked.",
    "“Besides the operational setback, it is also a diplomatic and reputational blow.” Just a few years ago, Syria stood out as the biggest symbol of Russia’s resurgence on the world stage.",
    "Its sweeping, bloody air strikes bombed opposition groups into submission and turned the fighting in Mr Assad’s favour, sending the message that Russia was prepared to use overwhelming force to stand by its allies and assert its own interests.",
    "The United States, by contrast, was increasingly seen in the region as an unreliable power that was disengaging from the Middle East.",
    "And after Mr Assad’s grip on authority seemed secure, Russia used its Syrian bases as a staging point to compete for influence with the West in African countries like Libya, Mali and the Central African Republic.",
    "But after Mr Putin invaded Ukraine in 2022, Syria plummeted on the Kremlin’s priority list.",
    "Russia’s bases in Syria became known as places where commanders who had failed in Ukraine were put out to pasture, and as a draw for soldiers hoping to avoid the trenches of Ukraine.",
    "The focus on Ukraine left Russia flat-footed when the new rebel offensive began in Syria.",
    "Russia launched strikes against the Syrian rebels, but with far less intensity than at the height of its intervention in the civil war.",
    "A US official said Washington believed that this was because many Russian aircraft had been pulled out of Syria for operations in Ukraine.",
    "Warplanes that Russia may have otherwise sent to reprise the brutal bombing campaigns were instead committed to Ukraine.",
    "Warships that Russia might have dispatched from the Black Sea were unable to transit into the Mediterranean because of a treaty that allows Turkey to close its straits to the navy of a nation at war.",
    "And a once-fearsome Russian mercenary force, the Wagner Group, had its Syrian operations dissolved in 2023 after its leader Yevgeny Prigozhin staged a failed mutiny against Russian military chiefs.",
    "“The priorities totally changed,” said Mr Denis Korotkov, a Russian journalist who was among the first to document the Wagner group.",
    "“There was no time for Syria.” Russia’s support of the Assad regime dated back to the Soviet Union’s backing of Mr Assad’s father, president Hafez Assad, in the 1970s.",
    "Now, Russia appears to be turning to diplomacy to try to salvage its footprint in Syria.",
    "Russian Foreign Minister Sergei Lavrov held talks with his Iranian and Turkish counterparts in Qatar on Dec 7, and Mr Putin has spoken by phone with the leaders of those two countries in recent days.",
    "In a sign that Moscow could seek accommodation with Syria’s new powers, Russian state television on Dec 8 appeared to soften the language it used to refer to the forces that toppled Mr Assad.",
    "On the night of Dec 7, state television broadcasts referred to them as “terrorists” or “militants” backed by foreign powers.",
    "By the morning of Dec 8, Russian state media had started calling them “armed opposition” or “armed groups”.",
    "Russia’s best hope, analysts say, may be to negotiate with Turkey – which backs some of the rebel groups – to help it maintain its Syrian bases.",
    "But it is far from clear that Turkey would have the power or influence to persuade the rebels to accept such a deal.",
    "NYTIMES Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Diplomacy": 0.6333000063896179,
    "Conflict": 0.47901639342308044,
    "Environment": 0.4354730546474457,
    "Technology": 0.42625051736831665,
    "Politics": 0.40836596488952637,
    "Economy": 0.34855595231056213,
    "Energy": 0.32965579628944397,
    "Military": 0.32141655683517456,
    "Education": 0.3049435019493103,
    "Culture": 0.30312034487724304,
    "Transport": 0.24749232828617096,
    "Elections": 0.17612315714359283,
    "Health": 0.15769395232200623,
    "Crime": 0.14249040186405182
  },
  "sentiment": {
    "positive": 0.238,
    "negative": 0.762,
    "neutral": 0.0
  }
}