{
  "title": "Zelensky says Ukraine will observe Easter truce, accuses Russia of breaches",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-says-russian-artillery-fire-goes-on-despite-ceasefire-proclamation",
  "original_language": "en",
  "cleaned_sentences": [
    "KYIV - Ukraine will abide by an Easter truce, President Volodymyr Zelensky said, hours after Vladimir Putin ordered Russian troops to pause all combat activity until 2100 GMT on April 20 (5am on April 21 in Singapore).",
    "The 30-hour truce would be the most significant pause in the fighting throughout the three-year conflict.",
    "But just hours after the order was meant to have come into effect, air-raid sirens sounded in the Ukrainian capital and Mr Zelensky accused Russia of having maintained its artillery fire and assaults on the frontline.",
    "Also on April 19, Russia and Ukraine held a large exchange of prisoners, with each side saying it had handed back more than 240 captured fighters.",
    "The order to halt all combat over the Easter weekend came after months of efforts by US President Donald Trump to get Moscow and Kyiv to agree a ceasefire.",
    "On Friday, Washington even threatened to withdraw from talks if no progress was made.",
    "Mr Putin announced the Easter truce in televised comments during a meeting with the Russian chief of the general staff Valery Gerasimov.",
    "Mr Zelensky responded by saying Ukraine would follow suit, and proposed extending the truce beyond April 20.",
    "But the Ukrainian leader also accused Russia of having already broken its promises.",
    "“If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly – mirroring Russia’s actions,” Mr Zelensky said on April 19, in a post on X.",
    "“Russian assault operations continue on several front-line sectors, and Russian artillery fire has not subsided,” he said.",
    "Ukraine’s Kherson governor reported several Russian drone attacks after Mr Putin’s order was supposed to have come into force at 6pm.",
    "‘Give peace a chance’ Ukraine’s air force issued air-raid warnings across several regions in eastern Ukraine on April 19 evening, also while the ceasefire was supposed to be in effect.",
    "Ukraine’s air force said on social media there was a “ballistic missile threat” and official air-raid maps indicated alerts issued for the Kharkiv, Donetsk, Zaporizhzhia and Dnipropetrovsk regions.",
    "“Therefore, there is no trust in words coming from Moscow,” Mr Zelensky said.",
    "“We know all too well how Moscow manipulates, and we are prepared for anything.",
    "Ukraine’s Defence Forces will act rationally – responding in kind.",
    "Every Russian strike will be met with an appropriate response,” he added.",
    "Mr Putin had said the truce for the Easter holiday celebrated on April 20 was motivated by “humanitarian reasons”.",
    "While he expected Ukraine to comply, he said that Russian troops “must be ready to resist possible breaches of the truce and provocations by the enemy”.",
    "Mr Zelensky in a social media post wrote: “If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly – mirroring Russia’s actions.” He added: “If a complete ceasefire truly takes hold, Ukraine proposes extending it beyond the Easter day of April 20.” He proposed that “30 days could give peace a chance”, while pointing out that Mr Putin had earlier rejected a proposed 30-day full and unconditional ceasefire.",
    "Ukraine had accepted that offer.",
    "Mr Trump is pushing to end the three-year war, but on April 18 threatened to ditch his efforts to broker a ceasefire if he did not see meaningful progress soon.",
    "Attacks continue “The fighting is ongoing, and Russian attacks continue,” Ukraine’s military command, the Chief of Staff, reported April 19 evening.",
    "“In some areas on the frontline, Russian artillery continues to be heard, despite the promise of silence from the Russian leader.",
    "Russian drones are being used.",
    "It is quieter in some areas.” Soldiers in the eastern Ukrainian city of Kramatorsk close to the front line earlier greeted the truce announcement with scepticism.",
    "Mr Putin “might do it to give some hope or to show his humanity”, said Dmitry, a 40-year-old soldier.",
    "“But either way, of course, we don’t trust (Russia).” Mr Putin said the latest truce proposal would show “how sincere is the Kyiv’s regime’s readiness, its desire and ability to observe agreements and participate in a process of peace talks”.",
    "Russia launched its full-scale invasion of neighbouring Ukraine in February 2022.",
    "Previous attempts at holding ceasefires for Easter in April 2022 and Orthodox Christmas in January 2023 were not implemented after both sides failed to agree on them.",
    "Captives swopped “For millions of Ukrainians, Easter is one of the most important holidays.",
    "And millions of Ukrainians will go to church,” said Mr Zelensky in his evening address.",
    "“Over the years of this full-scale war, Russian attacks have destroyed or damaged more than 600 churches, prayer houses and places of worship.” In Kramatorsk, one soldier Vladislav, 22, said: “I feel like it’s going to start again after a while, and it’s going to go on and on.” On the streets of Moscow, Mr Yevgeny Pavlov, 58, said he did not think Russia should give Ukraine a breather.",
    "“There is no need to give them respite.",
    "If we press, it means we should press to the end,” he told AFP.",
    "Earlier on April 19, Ukraine and Russia said they had each returned 246 soldiers being held as prisoners of war in a swop mediated by the United Arab Emirates.",
    "Mr Zelensky said the total number of returned POWs now stood at 4,552.",
    "The UAE’s foreign ministry said 31 wounded Ukrainians and 15 wounded Russians were also exchanged.",
    "The UAE said it was committed to “finding a peaceful solution” to the conflict and “mitigating the humanitarian impacts”.",
    "Russia said it had retaken the penultimate village still under Ukrainian control in its Kursk frontier region.",
    "Kyiv had hoped to use its hold on the region as a bargaining chip in the talks.",
    "AFP Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Diplomacy": 0.748595654964447,
    "Energy": 0.7410362362861633,
    "Conflict": 0.7400908470153809,
    "Military": 0.7314359545707703,
    "Elections": 0.6926119327545166,
    "Culture": 0.6855528354644775,
    "Economy": 0.6829178929328918,
    "Environment": 0.6432264447212219,
    "Politics": 0.6353737711906433,
    "Health": 0.6006167531013489,
    "Transport": 0.585904598236084,
    "Technology": 0.5702533721923828,
    "Crime": 0.5418487787246704,
    "Education": 0.4763444662094116
  },
  "sentiment": {
    "positive": 0.349,
    "negative": 0.651,
    "neutral": 0.0
  }
}