{
  "title": "Ukraine hits Russia with US ATACMS missiles for first time on war’s 1,000th day",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/ukraine-hits-russia-with-us-atacms-missiles-for-first-time-on-wars-1000th-day",
  "original_language": "en",
  "cleaned_sentences": [
    "KYIV - Ukraine used US ATACMS missiles to strike Russian territory on Nov 19, taking advantage of newly granted permission from the outgoing administration of US President Joe Biden on the war’s 1,000th day.",
    "Russia said its forces shot down five of six missiles fired at a military facility in the Bryansk region.",
    "Debris of one hit the facility, starting a fire that was swiftly put out and caused no casualties or damage, it said.",
    "Ukraine said it struck a Russian arms depot about 110km inside Russia, an attack that caused secondary explosions.",
    "Ukraine’s military did not publicly specify the weapons used, but a Ukrainian government source and a US official confirmed it had used ATACMS.",
    "A US official said Russia intercepted two of eight missiles and that the strike was at an ammunition supply point.",
    "Mr Biden gave approval this week for Ukraine to use ATACMS, the longest-range missiles Washington has supplied, for such attacks inside Russia.",
    "Russian Foreign Minister Sergei Lavrov said the use of ATACMS was a clear signal the West wanted to escalate the conflict.",
    "Moscow has said such weapons cannot be used without direct US operational support and their use would make Washington a direct combatant in the war, prompting Russian retaliation.",
    "The attack took place as Ukraine marked 1,000 days of war, with a fifth of its territory in Russian hands and doubts about the future of Western support as President-elect Donald Trump heads back to the White House.",
    "At the United Nations in New York, Ukraine’s UN ambassador, Mr Sergiy Kyslytsya, read a statement from his country and 42 others and the European Union, rejecting Russia’s “attempted illegal annexation” of Ukrainian territory and demanding immediate withdrawal.",
    "“One thousand days is a tragic reminder of the need to remain resolute in ensuring... that international law prevails, not just in Ukraine, but wherever it is challenged,” he said.",
    "Military experts say using the US missiles can help Ukraine defend a pocket of captured Russian territory in the Kursk region as a bargaining chip, but was not likely to have a decisive impact on the 33-month-old war, in part as the move comes far too late.",
    "The missile’s range of up to 300km is much shorter than that of some Moscow has used to strike Ukraine, including its hypersonic Kinzhal weapon with a reported range of up to 2,000km.",
    "On Nov 19, Russian President Vladimir Putin signed a new nuclear doctrine that appeared intended as a warning to Washington.",
    "It lowers the threshold under which Russia might use atomic weapons to include responding to attacks that threaten its territorial integrity.",
    "Washington said the update to the nuclear doctrine was no surprise and rejected “more of the same irresponsible rhetoric from Russia”.",
    "Mr Zelensky said the step showed Mr Putin had no interest in peace: “Especially on this day... they presented (a) nuclear weapons strategy.",
    "They didn’t present (a) peace strategy.",
    "Putin wants war.” The Pentagon said the US State Department has approved another potential US$100 million (S$133 million) sale of military equipment and services to Ukraine, while Denmark said it was making a new donation of about US$138 million for development of Ukraine’s arms industry.",
    "Trump criticisms of aid Trump has criticised the scale of US aid to Kyiv and said he will end the war quickly, without saying how.",
    "Both sides appear to anticipate his return in two months will be accompanied by a push for peace talks, which are not known to have taken place since the war’s early months.",
    "The warring sides have been escalating to try to secure a stronger position at any negotiations.",
    "Mr Zelensky says Kyiv must do everything for the war to end diplomatically in 2025.",
    "“At this stage of the war, it is being decided who will prevail.",
    "Whether us over the enemy, or the enemy over us Ukrainians... and Europeans.",
    "And everyone in the world who wants to live freely and not be subject to a dictator,” he told parliament.",
    "Dozens of civilians and soldiers gathered for a moment’s silence at a candle-lit commemoration in the evening in Kyiv.",
    "“My life has been turned upside down.",
    "There is no life for me.",
    "I only want victory and to return home.",
    "I am grateful to all the men defending our country,” said Yuliia, from the city of Mariupol, was captured by Russia in 2022.",
    "UN spokesman Stephane Dujarric cited data from the UN Human Rights Office that more than 12,000 civilians had been killed and nearly 27,000 injured in Ukraine over the past 1,000 days, with more than 2,400 child casualties.",
    "Over six million Ukrainians live as refugees abroad, and the population has fallen by a quarter since Mr Putin ordered the invasion that began Europe’s biggest conflict since World War II.",
    "Military losses are huge, although casualty figures remain secret.",
    "Public Western estimates based on intelligence reports say hundreds of thousands have been wounded or killed on each side.",
    "In the first year after the invasion, Ukrainian troops pushed Russian forces back from the outskirts of Kyiv and recaptured territory.",
    "Since then, relentless trench warfare has ground eastern Ukrainian cities to dust.",
    "In a move described in the West as an escalation, Russia has deployed 11,000 North Korean troops, some of whom Kyiv says have clashed with Ukrainian forces in Kursk.",
    "Mr Zelensky said Pyongyang could send 100,000 soldiers.",
    "Russia for its part continues to advance slowly in eastern Ukraine, and said it captured another settlement on Nov 19.",
    "With winter setting in, Moscow on Nov 17 renewed its aerial assault on Ukraine’s power system, launching the biggest barrage since August.",
    "There has been no public narrowing of negotiating positions.",
    "Kyiv demands a full Russian withdrawal from all occupied territory and Western security guarantees comparable to membership in Nato’s mutual defence treaty to prevent future Russian attacks.",
    "Moscow says Ukraine must drop all ambitions to join Nato and withdraw all troops from provinces Russia says it has annexed since its invasion.",
    "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Diplomacy": 0.9425864219665527,
    "Technology": 0.8798410892486572,
    "Military": 0.8784928321838379,
    "Conflict": 0.8634828329086304,
    "Energy": 0.8595443964004517,
    "Politics": 0.8512014150619507,
    "Economy": 0.8491780757904053,
    "Transport": 0.8242489695549011,
    "Health": 0.7775838971138,
    "Elections": 0.7749515771865845,
    "Culture": 0.7664229273796082,
    "Environment": 0.7455409169197083,
    "Education": 0.7445081472396851,
    "Crime": 0.6563436388969421
  },
  "sentiment": {
    "positive": 0.283,
    "negative": 0.717,
    "neutral": 0.0
  }
}