{
  "title": "US seems more than happy to satisfy Russia’s aspirations at talks in Saudi Arabia",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/middle-east/us-seems-more-than-happy-to-satisfy-russias-aspirations-at-talks-in-saudi-arabia",
  "original_language": "en",
  "cleaned_sentences": [
    "LONDON – Russia emerged as the clear winner from talks held between US and Russian officials in the Saudi capital of Riyadh on Feb 18.",
    "The first public diplomatic encounter between the two powers in three years was convened to end the war in Ukraine.",
    "But in Riyadh, the American delegation – composed of Secretary of State Marco Rubio, National Security Adviser Mike Waltz and Mr Steve Witkoff, the US President’s special envoy and golf buddy – dangled before the Russians the much broader prospect of productive cooperation in geopolitics and, above all, economic investments.",
    "Therefore, it was hardly surprising that the usually glum-looking Russian Foreign Minister Sergey Lavrov, who has led his country’s diplomacy for more than two decades, was beaming broadly at the end of the talks in Saudi Arabia.",
    "Mr Lavrov said that “the atmosphere was exceedingly positive” and referred to the US negotiators as “positive individuals”.",
    "US President Donald Trump agreed to negotiations over the war in Ukraine after a Feb 12 phone call with Russian President Vladimir Putin.",
    "This generated a storm of protests from European governments, who were not consulted before the launch of Mr Trump’s initiative and argued that no settlement of the Ukraine conflict was feasible without Ukrainians sitting at the negotiation table.",
    "American officials dismissed such concerns as premature and exaggerated.",
    "They said that the talks in Riyadh were preliminary, just feelers to determine the Russian position.",
    "But right from the start, Moscow was careful to present its renewed links with the US as more than just a discussion over Ukraine.",
    "“The main thing is to begin a real normalisation of relations between us and Washington,” said Mr Yuri Ushakov, a former Russian ambassador to the US and one of Mr Putin’s closest foreign policy aides, who also attended the talks in Riyadh.",
    "There are two reasons why the Russians are eager to cast their talks with the US in a broader perspective.",
    "The first is that the Russians have already obtained the main concessions on Ukraine they wanted from the US.",
    "Even before the Riyadh talks started, Mr Trump announced that he sought an immediate ceasefire in Ukraine almost regardless of the conditions, that Russia would be allowed to keep the estimated 20 per cent of Ukraine’s territory it currently occupies, and that Ukraine would not benefit from any future US security guarantees.",
    "Russia’s diplomats were initially expected to fight hard for such concessions.",
    "Instead, they received them on a plate, and the Russians now want more.",
    "The second explanation for Russia’s growing aspirations is that Mr Putin has long sought to recover his country’s status as a global power.",
    "Therefore, any agreement with the US that boosts Russia in this direction is welcome.",
    "In Riyadh, the US negotiators seemed more than happy to satisfy Russia’s aspirations.",
    "They agreed, for instance, that one of the two countries’ priorities is to remove the restrictions placed on each other’s diplomatic missions.",
    "These restrictions started in March 2018 when none other than Mr Trump was in the White House and when the US, together with its allies, expelled a large number of Russian diplomats in response to a botched attempt by Mr Putin’s agents to poison Russian defectors living in the English city of Salisbury.",
    "Since then, Russia and the US have imposed caps on embassies in each other’s capitals and have closed several consulates.",
    "In Riyadh, however, Russian and US negotiators agreed to “establish a consultation mechanism to address irritants” in their bilateral relationship “with the objective of taking steps necessary to normalise the operation of our respective diplomatic missions”, according to the official communique.",
    "More importantly, Mr Rubio stated that the two sides laid “the groundwork for future cooperation on matters of mutual geopolitical interest and historic economic and investment opportunities”.",
    "All of this is music to Moscow’s ears, so Russia responded almost immediately by tightening its demands on Ukraine.",
    "Soon after the talks in Riyadh concluded, Russia’s Foreign Ministry spokeswoman Maria Zakharova raised what appeared to be a new condition: Russia was demanding “not just a pledge” to deny Ukraine any future Western security guarantees, but a formal withdrawal of previous plans to admit Ukraine into the Nato military alliance.",
    "And Mr Lavrov upped the stakes even further by specifying that Russia will not accept the presence of any Western troops on Ukraine’s soil under any guise.",
    "“The deployment of troops from the same Nato countries, but under a different flag – European Union or their national flags – changes nothing.",
    "Of course, this is unacceptable for us,” Mr Lavrov said.",
    "Such preconditions amount to an apparent demand that Ukraine should be abandoned to Russia’s mercies.",
    "To make matters worse, Mr Trump subsequently appeared to accept Russia’s propaganda narrative about Ukraine.",
    "In a press conference soon after the Riyadh talks concluded, Mr Trump falsely claimed that Ukraine, rather than Russia, started the current war, which began in February 2022.",
    "“You should have never started it,” the US President said, pretending to address Ukrainian President Volodymyr Zelensky.",
    "Mr Trump also called for fresh elections in Ukraine, claiming – yet again, falsely – that Mr Zelensky’s domestic popularity is “down at 4 per cent approval rating”.",
    "This is a Russian claim that the US President also appears to share, notwithstanding the latest opinion polls inside Ukraine, which indicate that Mr Zelensky’s popularity stands at 50 per cent.",
    "European governments are alarmed by rumours that Mr Trump is even prepared to discuss a withdrawal of some American troops from Europe in return for a broader deal with Russia.",
    "US officials scrambled to reassure their European allies as the Riyadh talks ended.",
    "The allies “are consulted literally almost every day”, said Mr Waltz.",
    "And Mr Rubio phoned key European foreign ministers to brief them about the talks with Russia.",
    "However, Europeans are not reassured.",
    "French President Emmanuel Macron’s call for another summit of European leaders on Feb 19 – the second such gathering this week – indicates their alarm.",
    "“Russia will try to divide us.",
    "Let’s not walk into their traps.",
    "By working together with the US, we can achieve a just and lasting peace – on Ukraine’s terms,” urged Ms Kaja Kallas, the EU’s top diplomat.",
    "Few believe that Washington is listening to her appeal.",
    "- Jonathan Eyal is based in London and Brussels and writes on global political and security issues.",
    "Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Environment": 0.7493407726287842,
    "Culture": 0.7115485668182373,
    "Diplomacy": 0.7094320058822632,
    "Conflict": 0.6908264756202698,
    "Politics": 0.6758337020874023,
    "Energy": 0.6431188583374023,
    "Economy": 0.6418734788894653,
    "Technology": 0.5876829624176025,
    "Transport": 0.5701324939727783,
    "Military": 0.5582001209259033,
    "Education": 0.5387477874755859,
    "Health": 0.4843917787075043,
    "Crime": 0.2909976840019226,
    "Elections": 0.21749374270439148
  },
  "sentiment": {
    "positive": 0.404,
    "negative": 0.596,
    "neutral": 0.0
  }
}