{
  "title": "Russia launches intercontinental ballistic missile in attack on Ukraine, Kyiv says",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/russia-launches-intercontinental-ballistic-missile-in-attack-on-ukraine-kyiv-says",
  "original_language": "en",
  "cleaned_sentences": [
    "KYIV – Russia fired an intercontinental ballistic missile (ICBM) during an attack on the Ukrainian city of Dnipro on Nov 21, Kyiv’s air force said, in what would be the first use in war of a weapon designed to deliver long-distance nuclear strikes.",
    "The launch, if confirmed, highlights rapidly rising tensions in the 33-month-old Russia-Ukraine war after Kyiv fired US and British missiles at targets inside Russia this week despite warnings by Moscow that it would see such action as a major escalation.",
    "Security experts said it would be the first military use of an ICBM.",
    "The missiles are strategic weapons designed to deliver nuclear warheads and are an important part of Russia’s nuclear deterrent.",
    "“Today, there was a new Russian missile.",
    "All the characteristics – speed, altitude – are (of an) intercontinental ballistic (missile).",
    "An expert (investigation) is currently under way,” Ukrainian President Volodymyr Zelensky said in a video statement.",
    "The Ukrainian Air Force said the missile was fired from the Russian region of Astrakhan, more than 700km from Dnipro in central-eastern Ukraine.",
    "It did not specify what kind of warhead the missile had or what type of missile it was.",
    "There was no suggestion it was nuclear-armed.",
    "Asked about the air force’s statement, Kremlin spokesman Dmitry Peskov told reporters to contact Russian military for comment.",
    "During a weekly briefing, Russia’s Foreign Ministry spokeswoman Maria Zakharova received a phone call in which she was told by an unidentified man not to comment, video footage showed.",
    "Ukrainska Pravda, a Kyiv-based media outlet, cited anonymous sources saying the missile was an RS-26 Rubezh, a solid-fuelled ICBM with a range of 5,800km, according to the Arms Control Association.",
    "The RS-26 was first successfully tested in 2012, and is estimated to be 12m long and weigh 36 tonnes, according to the Centre for Strategic and International Studies (CSIS).",
    "It said the RS-26 can carry an 800kg nuclear warhead.",
    "The RS-26 is classified as an ICBM under a nuclear arms reduction treaty between the US and Russia, but it can be seen as an intermediate-range ballistic missile when used with heavier payloads at ranges below 5,500km, CSIS said.",
    "The Russian missile attack targeted enterprises and critical infrastructure in the central-eastern city of Dnipro, the air force said.",
    "Ukraine’s air force did not say what the ICBM targeted or whether it had caused any damage, but regional governor Serhiy Lysak said the missile attack damaged an industrial enterprise and set off fires in Dnipro.",
    "Two people were hurt.",
    "Russia also fired a Kinzhal hypersonic missile and seven Kh-101 cruise missiles, six of which were shot down, the Ukrainian Air Force said.",
    "‘Totally unprecedented’ The Nato military alliance did not immediately respond to a request for comment.",
    "The US European Command said it had nothing on the reported use of an ICBM and referred questions to the US Department of Defence.",
    "“If true, this will be totally unprecedented and the first actual military use of ICBM.",
    "Not that it makes a lot of sense given their price and precision,” Mr Andrey Baklitskiy, of the UN Institute for Disarmament Research, posted on X. German security expert Ulrich Kuehn posted: “It looks as if Russia has today used an intercontinental ballistic missile in a war for the first time in history, against the civilian target Dnipro.” Some military experts said the ICBM launch, if confirmed, could be seen as an act of deterrence by Moscow following Kyiv’s strikes into Russia with Western weapons this week.",
    "“An ICBM launch can certainly be seen as a threatening gesture, potentially in response to the lifting of restrictions on ATACMS and Storm Shadow.",
    "It’s a means of deterrence,” said a European military source.",
    "Russian war correspondents on Telegram and an official speaking on condition of anonymity said Kyiv fired British Storm Shadow cruise missiles into Russia’s Kursk region bordering Ukraine on Nov 20.",
    "Russia’s Defence Ministry, in its daily report of events over the previous 24 hours on Nov 21, said air defences had shot down two British Storm Shadow cruise missiles but did not say where.",
    "Britain had previously let Ukraine use Storm Shadows within Ukrainian territory.",
    "Ukraine also fired US ATACMS missiles into Russia on Nov 19 after US President Joe Biden gave the all-clear to use such missiles, two months before he leaves office and Donald Trump returns to the White House.",
    "Russian President Vladimir Putin on Nov 19 lowered the threshold for a nuclear strike in response to a broader range of conventional attacks.",
    "Trump has said he will end the war, without saying how, and criticised billions of dollars in aid for Ukraine under Mr Biden.",
    "The warring sides believe Trump is likely to push for peace talks – not known to have been held since the war’s earliest months – and are trying to attain strong positions before negotiations.",
    "Moscow has said the use of Western weapons to strike Russian territory far from the border would be a major escalation in the conflict.",
    "Kyiv says it needs the capability to defend itself by hitting Russian rear bases used to support Moscow’s February 2022 invasion.",
    "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Culture": 0.8999911546707153,
    "Diplomacy": 0.8906188607215881,
    "Conflict": 0.8871784806251526,
    "Politics": 0.8863133788108826,
    "Military": 0.8672405481338501,
    "Energy": 0.8556434512138367,
    "Environment": 0.8347648978233337,
    "Technology": 0.8197343349456787,
    "Economy": 0.8073335289955139,
    "Transport": 0.7496628761291504,
    "Education": 0.7430217266082764,
    "Crime": 0.7400020360946655,
    "Health": 0.7319322824478149,
    "Elections": 0.6858144402503967
  },
  "sentiment": {
    "positive": 0.194,
    "negative": 0.806,
    "neutral": 0.0
  }
}