{
  "title": "Ukraine accepts US proposal for 30-day ceasefire in war with Russia",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/ukraine-agrees-to-accept-immediate-30-day-ceasefire-us-ukraine-statement",
  "original_language": "en",
  "cleaned_sentences": [
    "JEDDAH, Saudi Arabia – The United States agreed on March 11 to resume military aid and intelligence sharing with Ukraine after talks where Kyiv said it would accept a US proposal for a 30-day ceasefire in its conflict with Russia, the countries said in a joint statement.",
    "US Secretary of State Marco Rubio said the US would now take the offer to Russia, and that the ball is in Moscow’s court.",
    "“The President wanted this war to end yesterday...",
    "So our hope is that the Russians will answer ‘yes’ as quickly as possible, so we can get to the second phase of this, which is real negotiations,” Mr Rubio told reporters, referring to US President Donald Trump, after more than eight hours of talks in Jeddah.",
    "The Kremlin launched a full-scale invasion of Ukraine three years ago, and Russia, which has been making advances, now holds around a fifth of Ukraine’s territory, including Crimea, which it claims to have annexed in 2014.",
    "Mr Rubio said Washington wanted a full agreement with both Russia and Ukraine “as soon as possible”.",
    "“Every day that goes by, this war continues, people die, people are bombed, people are hurt on both sides of this conflict,” he said.",
    "How Moscow would respond was far from certain.",
    "Russian President Vladimir Putin has said he is open to discussing a peace deal.",
    "But he has ruled out territorial concessions, and has said Ukraine must withdraw fully from four Ukrainian regions claimed and partly controlled by Russia.",
    "Ukrainian President Volodymyr Zelensky, who was in Saudi Arabia but did not participate in the talks, said the ceasefire was a “positive proposal” that covers the front line in the conflict, not just fighting by air and sea.",
    "In Saudi Arabia, the US and Ukraine also said they agreed to conclude as soon as possible a comprehensive agreement for developing Ukraine’s critical mineral resources, a deal that has been in the works for weeks and was thrown into limbo by an acrimonious White House meeting between the Republican US president and Mr Zelensky last week.",
    "A top aide to Mr Zelensky said options for security guarantees to Ukraine were discussed with US officials.",
    "The aide did not detail the options.",
    "Security guarantees have been one of Kyiv’s key aims, and some European countries have expressed willingness to explore sending peacekeepers.",
    "Mr Rubio said the plan will be delivered to the Russians through multiple channels.",
    "Mr Trump’s national security adviser, Mr Mike Waltz, told reporters that he would be talking to his Russian counterpart in the coming days.",
    "In the joint statement, Ukraine reiterated that European partners should be involved in the peace process.",
    "Nato Secretary-General Mark Rutte will be at the White House on March 13.",
    "Upended alliance Under Mr Trump, Kyiv’s one-time staunchest ally Washington has upended its policy on the war and piled pressure on Ukraine.",
    "Mr Waltz said the initial resumption of military assistance for Ukraine would entail equipment from US stockpiles.",
    "This was approved by former US president Joe Biden, using so-called Presidential Drawdown Authority, before he left office, and stopped by Mr Trump after the acrimonious White House meeting.",
    "As the diplomacy plays out, Ukraine’s battlefield positions have been under heavy pressure, particularly in Russia’s Kursk region where Moscow’s forces have launched a push to flush out Kyiv’s troops, which had been trying to hold a patch of land as a bargaining chip.",
    "Ukraine overnight launched its biggest drone attack on Moscow and the surrounding region yet, showing that Kyiv can also land major blows after a steady stream of Russian missile and drone attacks, one of which killed 14 people on March 8.",
    "The attack, in which 337 drones were downed over Russia, killed at least three employees of a meat warehouse and caused a short shutdown at Moscow’s four airports, Russian officials said.",
    "Ukraine said its drones struck an oil refinery near Moscow and a facility in Russia’s Oryol region, while Hungary said crude oil shipments via Russia’s Druzhba pipeline were suspended following the attack.",
    "US and Russian officials met in the Saudi capital in February in a rare encounter between the former Cold War foes.",
    "The discussions were focused largely on restoring ties after a near-total freeze on official contact under Mr Biden, Mr Trump’s Democratic predecessor.",
    "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Conflict": 0.8518009185791016,
    "Diplomacy": 0.8416337370872498,
    "Culture": 0.7572300434112549,
    "Military": 0.751080334186554,
    "Technology": 0.7294067144393921,
    "Environment": 0.7063249945640564,
    "Politics": 0.705741286277771,
    "Transport": 0.6788902282714844,
    "Economy": 0.6731760501861572,
    "Crime": 0.6634480357170105,
    "Health": 0.6520697474479675,
    "Elections": 0.6515583992004395,
    "Energy": 0.642802894115448,
    "Education": 0.565796434879303
  },
  "sentiment": {
    "positive": 0.414,
    "negative": 0.586,
    "neutral": 0.0
  }
}