{
  "title": "Major risks loom as Trump upends US’ Russia policy",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/united-states/major-risks-loom-as-trump-upends-us-russia-policy",
  "original_language": "en",
  "cleaned_sentences": [
    "WASHINGTON - When Russian President Vladimir Putin launched his invasion of Ukraine nearly three years ago, then US president Joe Biden took a firm stand in solidarity with Kyiv, forged a bulwark of European allies and set veteran advisers to the task of isolating Moscow economically and diplomatically.",
    "Washington’s approach changed dramatically with a Feb 18 initial meeting between US and Russian negotiators.",
    "The officials met just a month after Mr Donald Trump returned to the White House, with Ukraine and Nato partners sidelined by a relatively inexperienced team of Trump aides, and Mr Putin granted concessions even before the talks got under way.",
    "Mr Trump’s rush to impose an end to Russia’s war in Ukraine has stoked fears of a peace deal with Mr Putin that could undermine Kyiv and Europe’s security and alter the geopolitical landscape.",
    "“The really worrying fact is that Trump has taken Russia from pariah to prize partner in the time span of just a few days.",
    "That comes at a price,” said Mr Brett Bruen, a former foreign policy adviser in the Obama administration.",
    "The talks in Riyadh, the first time the US and Russia have met to discuss the deadliest conflict in Europe since World War II, yielded agreement to form negotiating teams for future meetings and work to restore the normal functioning of each other’s diplomatic missions, reflecting a thawing of long-frozen relations.",
    "Even before the talks, European politicians accused Mr Trump of handing free concessions to Moscow last week by ruling out Nato membership for Ukraine and saying it was an illusion for Kyiv to believe it could win back the 20 per cent of its territory now under Russian control.",
    "Some critics condemned Mr Trump for what they said amounted to appeasement.",
    "Major players excluded Ukraine’s exclusion from the meeting on Feb 18 marked a sharp departure from Mr Biden and Nato’s mantra of “nothing about Ukraine without Ukraine”.",
    "Kyiv has said it will not accept any deal imposed without its consent.",
    "And the absence of European representatives added to US allies’ anxieties about whether Mr Trump might be willing to give up too much for little from Mr Putin.",
    "That helped spur European governments to discuss the possibility of contributing peacekeepers to back any deal on Ukraine.",
    "Mr Trump told reporters on Feb 18 he would not object to such a deployment, though Russian Foreign Minister Sergei Lavrov said Moscow would not accept Nato troops there, signaling that Russia may resist any major compromise.",
    "There was no immediate sign that Russian officials had offered any concessions in the meeting.",
    "The encounter saw Mr Lavrov and Kremlin foreign policy aide Yuri Ushakov – two veterans who have spent a combined 34 years in their current roles – negotiate with three Trump aides in their first month on the job – Secretary of State Marco Rubio, national security adviser Mike Waltz and Trump envoy Steve Witkoff.",
    "“The American team has almost no experience in high-level international negotiation, no regional expertise on Ukraine and Russia, and no relevant foreign language knowledge,” Dr Timothy Snyder, a Yale University professor and Russia expert, wrote on X.",
    "“Not true of the Russians, to put it mildly.” Mr Bruen described it as “amateur hour” for Mr Trump’s national security apparatus.",
    "A Trump administration official said Washington could not help foster a lasting peace with the same lack of engagement that has allowed the death and destruction in Ukraine to continue.",
    "“President Trump has built a strong team that is already demonstrating his peace through strength agenda in action,” said Mr Brian Hughes, spokesman for the White House National Security Council.",
    "Mr Trump said he was more confident after the talks and he would probably meet with Mr Putin before the end of the month.",
    "He has praised Mr Putin in the past and commended him for a conciliatory attitude after their phone call last week.",
    "“Russia wants to do something,” Mr Trump told reporters in Palm Beach, Florida, on Feb 18.",
    "He brushed aside Ukraine’s concern about being left out of the meeting and said Kyiv should have entered talks much earlier.",
    "Mr Rubio said earlier that no one was being frozen out and any solution must be acceptable to all parties.",
    "But there was no immediate word on how Ukraine might be allowed to join.",
    "Ukrainian President Volodymyr Zelensky postponed a visit to Saudi Arabia planned for Feb 19 because of what sources familiar with the matter said was to avoid giving “legitimacy” to the US-Russia talks.",
    "He drew the Trump administration’s ire last weekend when he said a draft minerals deal with Washington did not contain the security provisions that Kyiv needed.",
    "Three sources said the US had proposed taking ownership of 50 per cent of Ukraine's critical minerals, apparently in compensation for vital US military aid, a demand some Trump critics have likened to extortion.",
    "‘Russia won round one’ Dr Emma Ashford, senior fellow at Stimson Centre think tank in Washington, said the Trump administration may have been justified in keeping the talks limited for now.",
    "“It’s certainly not ideal that Ukraine was not in the room, though I believe they’ll be at future such meetings,” she said.",
    "“But the administration is probably right that including a variety of European partners in the room might make for too many voices and make any progress more difficult.” Still, Democrat Jake Auchincloss, who is a co-chair of the House of Representatives’ Ukraine caucus, said Russia had won round one.",
    "“The Kremlin has been normalised in bilateral diplomacy that excludes Ukraine and Nato, and they gave up nothing to get that,” he told Reuters.",
    "Three Western intelligence officials told Reuters they have seen no new evidence that suggests Mr Putin’s goals have changed, saying he intends to hold all the territory his forces have taken with the long-term aim of expanding his reach inside Europe.",
    "“Putin will not stop at Ukraine,” Mr Darius Jauniskis, director of Lithuania’s State Security Department, told Reuters.",
    "“Is there a sincere desire to end the war?",
    "I don’t think so.” Mr Trump’s fellow Republican, Mr Roger Wicker, chairman of the Senate Armed Services Committee, agreed Mr Putin could not be trusted in Ukraine talks.",
    "“Putin is a war criminal,” Mr Wicker told CNN.",
    "When asked about Mr Trump’s comment that he believes Mr Putin wants peace, Mr Wicker added: “What we can trust the Russians to do, is to do anything to their advantage, to take temporary steps.” REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Politics": 0.8654004335403442,
    "Economy": 0.8596577048301697,
    "Energy": 0.8497113585472107,
    "Transport": 0.8341877460479736,
    "Environment": 0.8313600420951843,
    "Conflict": 0.8093627095222473,
    "Diplomacy": 0.8012925386428833,
    "Education": 0.7873157858848572,
    "Culture": 0.7854107618331909,
    "Elections": 0.7807236909866333,
    "Military": 0.7435160279273987,
    "Technology": 0.671901524066925,
    "Health": 0.6646583676338196,
    "Crime": 0.6538309454917908
  },
  "sentiment": {
    "positive": 0.308,
    "negative": 0.692,
    "neutral": 0.0
  }
}