{
  "title": "‘Black hole’ Russian sub spotted in Philippine waters as Moscow reminds US: We’re everywhere",
  "published_date": null,
  "url": "https://www.straitstimes.com/asia/se-asia/black-hole-russian-sub-spotted-in-philippine-waters-as-moscow-reminds-us-were-everywhere",
  "original_language": "en",
  "cleaned_sentences": [
    "One of Russia’s stealthiest submarines has been spotted cruising in waters claimed by the Philippines.",
    "This incident could be Russia signalling to the US that it is prepared to help China amid an escalating stand-off in the South China Sea, one analyst said.",
    "Philippine President Ferdinand Marcos Jr said in a news conference on Dec 2 that the submarine’s presence in his nation’s exclusive economic zone (EEZ) is very concerning.",
    "“Any intrusion into the West Philippine Sea, of our EEZ, of our baselines, is very worrisome,” he said.",
    "The Philippine Daily Inquirer reported on Dec 2 that the Russian Navy’s Ufa attack submarine was spotted after it surfaced 148km west of Mindoro province on Nov 28.",
    "The Philippine Navy said in a statement that it sent the guided missile frigate BRP Jose Rizal to track the submarine as it made its way – while remaining surfaced – outside Philippine waters.",
    "Philippine Navy spokesman Rear-Admiral Roy Vincent Trinidad said the frigate communicated with the Ufa to ascertain its identity and intention.",
    "“The Russian vessel stated it was awaiting improved weather conditions before proceeding to Vladivostok,” he said.",
    "The Russian state-run Tass news agency had reported that the submarine, together with rescue tug Alatau, were operating in the South China Sea after stopping at the RMN Kota Kinabalu Naval Base in Malaysia on Nov 23 for a port visit and to hold exercises.",
    "It was due to return to the Russian Pacific Fleet’s submarine base at the Kamchatka peninsula in Russia’s Far East, it said.",
    "Rear-Adm Trinidad said the incident was not alarming.",
    "“But we were surprised because this is a very unique submarine,” he told Agence France-Presse.",
    "Stealthiest subs The Ufa is one of six Project 636.3 attack submarines dubbed as “black holes” for their reputation as among the stealthiest in Russia’s submarine fleet.",
    "It is a Kilo-class submarine powered by a hybrid diesel and electric engine, upgraded to make it even more quiet when cruising underwater.",
    "It is armed with Kalibr cruise missiles that have been used in Russia’s war in Ukraine.",
    "The Ufa was commissioned in 2022 and initially used to patrol the Baltic Sea.",
    "Tass reported in October that the submarine was deployed from the Baltic to the Pacific to shore up Russia’s naval fleet in the Far East.",
    "That a submarine known for stealth will surface in contested waters may be Russia’s way of telling the US that it, too, is a player in waters far from its shores, and where its allies are locked in territorial disputes, an analyst said.",
    "“Maybe this is a signal from the Russians… They may have intentionally surfaced the sub to say, ‘We’re just here’,” Dr Eduardo Araral, an associate professor at the National University of Singapore, told The Straits Times.",
    "He said it could be the Russians telling the Americans, “if you threaten us, we can threaten you back”.",
    "Dr Araral, who has advised the Philippine government on public policies, said it is also not surprising that Russian submarines are now operating in the South China Sea, as Russia has been stepping up its participation in war drills with its Pacific allies.",
    "“Russia is a close friend of China.",
    "So if China invites them (for a military exercise), they will come and join,” he said.",
    "Tit-for-tat Russia and China held massive naval and air drills in September – dubbed Ocean-2024 – involving more than 400 warships, at least 120 aircraft and some 90,000 troops.",
    "Analysts say these drills were meant to push back against efforts by the US and its allies in the Indo-Pacific region to deepen and expand their security ties as a check to China’s aspirations.",
    "“Russia wants to demonstrate that they can engage in a full-scale war with Ukraine while deploying resources to the Indo-Pacific region, and China wants to show that they can deepen its relationship with Russia and cause problems in the region, primarily in the South China Sea but also around Japan,” Dr Stephen Nagy, a regional security expert at the International Christian University in Japan, told Voice Of America in September.",
    "The Philippines – a long-time US ally – has figured in increasingly confrontational skirmishes with China since Mr Marcos became President in 2022 and took a more muscular approach against Beijing than his predecessor did.",
    "China’s coast guard ships have been swarming and colliding with Philippine resupply ships, chasing or boarding them, and sinking fishing boats.",
    "In the latest incident, a Chinese military helicopter was seen on Nov 28 aggressively flying over a group of Philippine fishing boats off Iroquis reef in the Spratly archipelago in the South China Sea.",
    "The reef has become the latest flashpoint stirring up clashes between Manila and Beijing, as China’s seaborne militia have been spotted swarming around it in what security analysts suggest is a sign that China is preparing to build another island fortress on it.",
    "Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Diplomacy": 0.9907569885253906,
    "Conflict": 0.9901908040046692,
    "Politics": 0.9896788001060486,
    "Energy": 0.9881722927093506,
    "Economy": 0.9838261604309082,
    "Environment": 0.9830962419509888,
    "Education": 0.9813463687896729,
    "Culture": 0.9800214767456055,
    "Technology": 0.9797008633613586,
    "Military": 0.9796682000160217,
    "Transport": 0.9709098935127258,
    "Crime": 0.9640927910804749,
    "Elections": 0.9581195712089539,
    "Health": 0.9567796587944031
  },
  "sentiment": {
    "positive": 0.387,
    "negative": 0.613,
    "neutral": 0.0
  }
}