{
  "title": "Syrian rebels sweep into Aleppo, Russia conducts strikes in support of Assad",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/middle-east/russia-says-air-force-strikes-rebels-in-support-of-syrian-army-agencies-report",
  "original_language": "en",
  "cleaned_sentences": [
    "MOSCOW – The Syrian army said on Nov 30 that dozens of its soldiers had been killed in a major attack led by Islamist Hayat Tahrir al-Sham rebels who swept into the city of Aleppo, forcing the army to redeploy in the biggest challenge to President Bashar al-Assad in years.",
    "Russia’s Defence Ministry said its air force had carried out strikes on Syrian rebels in support of the country’s army, Russian news agencies reported.",
    "The strikes followed what was the boldest rebel assault for years in a civil war where front lines had largely been frozen since 2020.",
    "Hayat Tahrir al-Sham, or HTS, once known as the Nusra Front, is designated a terrorist group by the US, Russia, Turkey and other states.",
    "Mr Assad is a close Moscow ally.",
    "A spokesperson for the US State Department said earlier that the US was monitoring the situation.",
    "The war – which has killed hundreds of thousands of people and displaced many millions – has ground on since 2011 with no formal end, although most major fighting halted years ago after Iran and Russia helped Mr Assad’s government win control of most land and all major cities.",
    "Aleppo had been firmly held by the government since a 2016 victory there, one of the war’s major turning points, when Russian-backed Syrian forces besieged and laid waste to rebel-held eastern areas of what had been the country’s largest city.",
    "“I am a son of Aleppo and was displaced from it eight years ago, in 2016.",
    "Thank God, we just returned.",
    "It is an indescribable feeling,” said Mr Ali Jumaa, a rebel fighter, in TV footage filmed inside the city.",
    "Acknowledging the rebel advance, the Syrian army command said insurgents had entered much of Aleppo.",
    "After the army said it was preparing a counter-attack, air strikes targeted rebel gatherings and convoys in the city, the pro-Damascus newspaper al-Watan reported.",
    "One strike caused casualties in Aleppo’s Basel square, a resident told Reuters.",
    "The state-run Russian Centre for the Reconciliation of the Enemy Parties in Syria said missile and bomb strikes against the rebels had targeted “militant concentrations, command posts, depots and artillery positions” in Aleppo and Idlib provinces.",
    "It claimed about 300 rebel fighters had been killed in the attacks.",
    "Overnight, images from Aleppo showed a group of rebel fighters gathered in the city’s Saadallah al-Jabiri Square, with a billboard of Mr Assad looming behind them.",
    "Images filmed on Nov 30 showed people posing for photos on a toppled statue of Mr Bassel al-Assad, late brother of the president.",
    "Fighters zipped around the city in trucks and milled around in the streets.",
    "A man waved a Syrian opposition flag as he stood near Aleppo’s historic citadel.",
    "The Syrian military command said militants had attacked in large numbers and from multiple directions, prompting “our armed forces to carry out a redeployment operation aimed at strengthening the defence lines in order to absorb the attack, preserve the lives of civilians and soldiers”.",
    "The rebels also took control of Aleppo airport, according to a statement by their operations room and a security source.",
    "Two rebel sources also said the insurgents had captured the city of Maarat al-Numan in Idlib province, bringing all of that area under their control.",
    "The fighting revives the long-simmering Syrian conflict as the wider region is roiled by wars in Gaza and Lebanon, where a truce between Israel and the Iran-backed Lebanese group Hezbollah took effect on Nov 27.",
    "With Mr Assad backed by Russia and Iran, and Turkey supporting some of the rebels in the north-west where it maintains troops, the offensive has brought into focus the conflict’s knotted geopolitics.",
    "Fighting in the north-west had largely abated since Turkey and Russia reached a de-escalation agreement in 2020.",
    "Russian, Turkish ministers talk Russian Foreign Minister Sergei Lavrov held a phone call with his Turkish counterpart Hakan Fidan discussing the situation in Syria, Russia’s Foreign Ministry said on Nov 30.",
    "“Both sides expressed serious concerns at the dangerous development of the situation,” the ministry said.",
    "They agreed it was necessary to coordinate joint actions to stabilise the situation in the country.",
    "Turkish security officials had said on Nov 28 that Ankara had prevented operations, which opposition groups wanted to organise, in order to avoid further tensions in the region.",
    "Iranian Foreign Minister Abbas Araghchi told Mr Lavrov in a phone call that the rebel attacks were part of an Israeli-US plan to destabilise the region, Iranian state media said.",
    "The Syrian Civil Defence – a rescue service operating in opposition-held parts of Syria – said in a post on social media platform X that Syrian government and Russian aircraft carried out air strikes on residential neighbourhoods in rebel-held Idlib, killing four civilians and wounding six others.",
    "Two Syrian military sources said Russia has promised Damascus extra military aid that would start arriving in the next 72 hours.",
    "The Kurdish People’s Protection Units (YPG), which spearhead the US-backed Syrian Democratic Forces that control much of north-eastern and eastern Syria and have long had a foothold in Aleppo, widened their control in the city as government troops left, a senior YPG source said.",
    "Mr Mustafa Abdul Jaber, a commander in the Jaish al-Izza rebel brigade, said the rebels’ speedy advance had been helped by a lack of Iran-backed manpower to support the government in the broader Aleppo province.",
    "Iran’s allies in the region have suffered a series of blows at the hands of Israel as the Gaza war has expanded through the Middle East.",
    "The opposition fighters have said the campaign was in response to stepped-up strikes in recent weeks against civilians by the Russian and Syrian air forces on areas of Idlib province, and to pre-empt any attacks by the Syrian army.",
    "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Diplomacy": 0.5970063209533691,
    "Politics": 0.5799660086631775,
    "Conflict": 0.5443571209907532,
    "Environment": 0.39475637674331665,
    "Culture": 0.3732168674468994,
    "Technology": 0.3627018630504608,
    "Military": 0.3593357801437378,
    "Energy": 0.3030925393104553,
    "Transport": 0.27614936232566833,
    "Economy": 0.26334211230278015,
    "Education": 0.23538202047348022,
    "Elections": 0.2227194905281067,
    "Crime": 0.21115349233150482,
    "Health": 0.1831510066986084
  },
  "sentiment": {
    "positive": 0.184,
    "negative": 0.816,
    "neutral": 0.0
  }
}