{
  "title": "Russia’s Putin hints at strikes on West in ‘global’ Ukraine war",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/putin-says-russia-fired-hypersonic-ballistic-missile-at-ukraine-in-warning-to-the-west",
  "original_language": "en",
  "cleaned_sentences": [
    "MOSCOW - Russian President Vladimir Putin said on Nov 21 that the conflict in Ukraine had characteristics of a “global” war and did not rule out strikes on Western countries.",
    "The Kremlin strongman spoke out after a day of frayed nerves, with Russia test-firing a new-generation intermediate-range missile at Ukraine – which Mr Putin hinted was capable of unleashing a nuclear payload.",
    "Ukraine’s President Volodymyr Zelensky branded the strike a major ramping up of the “scale and brutality” of the war by a “crazy neighbour”, while Kyiv’s main backer US said that Russia was to blame for escalating the conflict “at every turn”.",
    "Intermediate-range missiles typically have a reach of up to 5,500km – enough to make good on Mr Putin’s threat of striking the West.",
    "In a defiant address to the nation, Russia’s president railed at Ukraine’s allies granting permission for Kyiv to use Western-supplied weapons to strike targets on Russian territory, warning of retaliation.",
    "In recent days, Ukraine has fired US and UK-supplied missiles at Russian territory for the first time, escalating already sky-high tensions in the brutal nearly three-year-long conflict.",
    "“We consider ourselves entitled to use our weapons against the military facilities of those countries that allow their weapons to be used against our facilities,” Mr Putin said.",
    "He said the US-sent Army Tactical Missile System (ATACMS) and British Storm Shadow payloads were shot down by Moscow’s air defences, adding: “The goals that the enemy obviously set were not achieved”.",
    "Kremlin spokesman Dmitri Peskov did, however, say Moscow informed Washington of the missile’s launch half an hour before it was fired through an automatic nuclear de-escalation hotline, in remarks cited in state media.",
    "He earlier said Russia was doing everything to avoid an atomic conflict, having updated its nuclear doctrine this week.",
    "White House spokeswoman Karine Jean-Pierre told reporters that Washington saw no need to modify the US’ own nuclear posture in response.",
    "Nato spokesperson Farah Dakhlallah said Russia’s use of the missile would “neither change the course of the conflict nor deter” the US-led defence alliance from backing Kyiv.",
    "‘Reckless behaviour’ Ukraine had earlier accused Russia of firing an intercontinental ballistic missile (ICBM) for the first time in history, a claim later downplayed by Washington.",
    "Ukrainian’s air force said Moscow had launched the missile as part of a barrage towards Dnipro, where the local authorities said an infrastructure facility was hit, and two civilians were wounded.",
    "Mr Putin said that Russia had carried out “testing in combat conditions” of one of its newest missile systems named Oreshnik.",
    "Criticising the global response to the strike – “final proof that Russia definitely does not want peace” – Mr Zelensky warned that other countries could become targets for Mr Putin too.",
    "“It is necessary to urge Russia to a true peace, which is possible only through force,” the Ukrainian leader said in his evening address.",
    "“Otherwise, there will be relentless Russian strikes, threats and destabilisation, and not only against Ukraine.” The attack on Dnipro comes just days after several foreign embassies shuttered temporarily in the Ukrainian capital, citing the threat of a large-scale strike.",
    "“It is another example of reckless behaviour from Russia,” a spokesman for British Prime Minister Keir Starmer told reporters.",
    "The spokesman for UN Secretary-General Antonio Guterres, Mr Stephane Dujarric, said the new missile’s deployment was “another concerning and worrying development”, warning the war was “going in the wrong direction”.",
    "Yet a US official played down the threat, saying on condition of anonymity that Russia “likely possesses only a handful of these” experimental missiles.",
    "UK ‘directly involved’ The head of the Dnipropetrovsk region where the city of Dnipro is located said the Russian aerial bombardment damaged a rehabilitation centre and several homes, as well as an industrial enterprise.",
    "“Two people were wounded – a 57-year-old man was treated on the scene and a 42-year-old woman was hospitalised,” said the official, Mr Sergiy Lysak.",
    "Russia and Ukraine have escalated their use of long-range missiles in recent days since Washington gave Kyiv permission to use its ATACMS against military targets inside Russia, a long-standing Ukrainian request.",
    "British media, meanwhile, reported on Nov 20 that Kyiv had launched UK-supplied Storm Shadow missiles at targets in Russia after being given the green light from London.",
    "With ranges of 300km and 250km respectively, both missile systems’ reach is far dwarfed by the experimental intermediate-range system fired by Russia.",
    "Russia’s envoy to London on Nov 21 said that meant Britain was “now directly involved” in the Ukraine war, with Mr Andrei Kelin telling Sky News “this firing cannot happen” without UK and Nato support.",
    "But the White House’s Ms Jean-Pierre countered that it was Russia who was behind the rising tensions, pointing to the reported deployment of thousands of North Korean troops to help Moscow fight off a Ukrainian offensive in Russia’s border Kursk region.",
    "“The escalation at every turn is coming from Russia,” she said, adding that the United States had warned Moscow against involving “another country in another part of the world” – referring to Pyongyang.",
    "Kyiv in retreat The defence ministry in Moscow said on Nov 21 its air-defence systems had downed two Storm Shadows, without saying whether they had come down on Russian territory or in occupied Ukraine.",
    "The missile escalation is coming at a critical moment on the ground for Ukraine, as its defences buckle under Russian pressure across the sprawling front line.",
    "Russia claimed deeper advances in the war-battered Donetsk region, announcing on Nov 21 that its forces had captured another village close to Kurakhove, closing in on the town after months of steady advances.",
    "Moscow’s defence ministry said Russian forces had taken the small village of Dalne, 5km south of Kurakhove.",
    "Mr Lysak, the governor of the Dnipropetrovsk region, said that 26 people had been wounded in another strike on the town of Kryvyi Rih, where Mr Zelensky was born.",
    "AFP Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Conflict": 0.8688781261444092,
    "Diplomacy": 0.8550705909729004,
    "Politics": 0.8397872447967529,
    "Economy": 0.8373376727104187,
    "Energy": 0.8195550441741943,
    "Technology": 0.7872800230979919,
    "Environment": 0.7693288922309875,
    "Military": 0.7668691277503967,
    "Culture": 0.7489094138145447,
    "Transport": 0.7011530995368958,
    "Crime": 0.6306230425834656,
    "Education": 0.619964599609375,
    "Health": 0.6138495206832886,
    "Elections": 0.5487008094787598
  },
  "sentiment": {
    "positive": 0.229,
    "negative": 0.771,
    "neutral": 0.0
  }
}