{
  "title": "Trump calls Ukraine’s Zelensky a ‘dictator’ as he hits back at ‘disinformation’ criticism",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/trump-brands-ukraines-zelensky-a-dictator",
  "original_language": "en",
  "cleaned_sentences": [
    "MIAMI – US President Donald Trump called Ukrainian leader Volodymyr Zelensky a “dictator” on Feb 19, widening a personal rift with major implications for efforts to end the conflict triggered by Russia’s invasion three years ago.",
    "The US had provided funding and arms to Ukraine, but in an abrupt policy shift since coming to power, Mr Trump has opened talks with Moscow.",
    "“A dictator without elections, Zelensky better move fast, or he is not going to have a country left,” Mr Trump wrote on his Truth Social platform of the Ukrainian leader, whose five-year term expired in 2024.",
    "Martial law introduced following Russia’s invasion of Ukraine in February 2022 bans a wartime election.",
    "The Constitution says the president serves until a newly elected one takes office.",
    "Mr Trump’s comments have spurred some, though not all of Ukraine’s opposition figures to speak out and rally around Mr Zelensky despite seeing him as a political opponent.",
    "Former prime minister Yulia Tymoshenko said Mr Zelensky was Ukraine’s legitimate leader until someone else was elected and that it was “impossible and immoral” to hold elections during the war, as the military would not be able to take part.",
    "She said on Facebook: “Only Ukrainians have the right to decide when and under what conditions they should change their government.",
    "Today, there are no such conditions!” On Feb 19, Mr Trump said his Treasury Secretary Scott Bessent was treated “rudely” during an official visit to Kyiv.",
    "He also accused Mr Zelensky of “sleeping” and failing to make a deal.",
    "Mr Bessent was dispatched to Kyiv on Feb 12 to discuss with Mr Zelensky granting Washington access to rare earth minerals in return for security support.",
    "“Scott Bessent actually went there and was treated rather rudely, because essentially, they told him ‘no’,” Mr Trump told reporters on Air Force One.",
    "“And Zelensky was sleeping and unavailable to meet him.” Mr Bessent “travelled many hours on the train, which is a dangerous trip, and we’re talking about the Secretary of the Treasury”, Mr Trump said.",
    "“He went there to get a document signed, and when he got there, he came back empty,” he added.",
    "“They wouldn’t sign the document.” Mr Bessent said Mr Zelensky assured him ahead of the Munich Security Conference that took place between Feb 14 and Feb 16 that Ukraine would sign a US$500 billion (S$668.6 billion) deal handing over rights to Ukrainian minerals but has not signed yet.",
    "On Feb 18, Mr Trump held a press conference in which he criticised Mr Zelensky, repeated several Kremlin narratives about the conflict and called for an end to the war.",
    "Mr Zelensky in turn accused Mr Trump of succumbing to Russian “disinformation” – including the US President blaming Kyiv for having “started” the war and echoing Kremlin questions over the Ukrainian leader’s legitimacy.",
    "“He refuses to have elections, is very low in Ukrainian polls, and the only thing he was good at was playing (former US president Joe) Biden ‘like a fiddle’,” Mr Trump said in his Truth Social post of Mr Zelensky.",
    "“In the meantime, we are successfully negotiating an end to the war with Russia, something all admit only ‘Trump’, and the Trump administration, can do,” he added.",
    "Mr Trump said he hoped for a ceasefire between Russia and Ukraine soon.",
    "Mr Zelensky was elected in 2019 for a five-year term but has remained leader under martial law imposed following the Russian invasion.",
    "His popularity has eroded, but the percentage of Ukrainians who trust him has never dipped below 50 per cent since the conflict started, according to the Kyiv International Institute of Sociology.",
    "Mr Trump’s invective drew shock from Europe, where German Chancellor Olaf Scholz said it was “wrong and dangerous” to call Mr Zelensky a dictator.",
    "‘Doublethink’ Mr Trump has long held his party in lockstep, but moderate Republicans swiftly pushed back against his attack on Mr Zelensky.",
    "“(Russian President Vladimir) Putin started this war.",
    "Putin committed war crimes.",
    "Putin is the dictator who murdered his opponents.",
    "The EU nations have contributed more to Ukraine.",
    "Zelensky polls over 50 per cent.",
    "Ukraine wants to be part of the West, Putin hates the West,” Representative Don Bacon, from Nebraska, wrote on social media platform X on Feb 19.",
    "“I don’t accept George Orwell’s doublethink,” he added, referring to the author of the dystopian novel 1984.",
    "Under Mr Biden, the US lauded Mr Zelensky as a hero and hammered Moscow with sanctions as Ukraine battled against advancing Russian troops.",
    "New York Republican Mike Lawler said Mr Putin demanding an election in Ukraine was “both comical and self-serving”.",
    "He said on X: “Vladimir Putin is a vile dictator and thug, who has worked in a concerted effort with China and Iran to undermine and destabilise the United States, Europe, Israel and the free world.",
    "He is not our friend, nor our ally.” Senator Lindsey Graham, Mr Trump’s staunch ally, meanwhile, threaded the needle carefully, writing that he blames Mr Putin “above all others” for the war – but adding on X that he still saw the US President as Ukraine’s “best hope”.",
    "Former vice-president Mike Pence, who broke with Mr Trump after his supporters stormed the US Capitol in 2021 in a bid to overturn his 2020 election loss to Mr Biden, also issued a rare public rebuke.",
    "“Mr President, Ukraine did not ‘start’ this war.",
    "Russia launched an unprovoked and brutal invasion, claiming hundreds of thousands of lives,” he wrote on X. Moscow buoyed Moscow has been buoyed by US-Russia talks in Saudi Arabia on Feb 18 on ending the war in Ukraine and Mr Trump’s attacks on Mr Zelensky.",
    "The talks “made the first step to restore work in various areas of mutual interests”, Mr Putin told journalists while visiting a drone manufacturing plant in his native St Petersburg.",
    "Kyiv was not invited to the Riyadh talks, as Moscow and Washington moved to sideline both Ukraine and Europe.",
    "Mr Putin said the US allies “only have themselves to blame for what’s happening”, suggesting they were paying the price for opposing Mr Trump’s return to the White House.",
    "Tensions between Mr Zelensky and Mr Trump over the new US position on the war had been building for weeks, before bursting into the open.",
    "But Mr Zelensky sought to take a positive approach ahead of meeting Mr Trump’s special envoy for Ukraine, Mr Keith Kellogg, in Kyiv on Feb 20, saying that “it is very important for us that the meeting and our work with America in general be constructive”.",
    "After their meeting, Mr Zelensky’s office said their joint news conference was cancelled at the request of the US, the RBC-Ukraine outlet reported.",
    "Russia, which for years has railed against the US military presence in Europe, wants a reorganisation of the continent’s security framework as part of any deal to end the Ukraine fighting.",
    "Mr Putin on Feb 19 said Russia and the US needed to work with each other if talks were to be successful.",
    "“It is impossible to solve many issues, including the Ukrainian crisis, without increasing the level of trust between Russia and the United States,” he said.",
    "AFP, BLOOMBERG, REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Conflict": 0.7102525234222412,
    "Diplomacy": 0.5665455460548401,
    "Crime": 0.478303998708725,
    "Energy": 0.398339182138443,
    "Military": 0.3874194920063019,
    "Politics": 0.3609510064125061,
    "Economy": 0.35972145199775696,
    "Transport": 0.35847148299217224,
    "Culture": 0.3299861550331116,
    "Technology": 0.32379668951034546,
    "Environment": 0.2913987934589386,
    "Elections": 0.2706882357597351,
    "Health": 0.23926331102848053,
    "Education": 0.22050052881240845
  },
  "sentiment": {
    "positive": 0.292,
    "negative": 0.708,
    "neutral": 0.0
  }
}