{
  "title": "Russia says Ukraine fired first US-long range missiles",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/russia-says-ukraine-attacked-border-region-with-us-made-long-range-missiles",
  "original_language": "en",
  "cleaned_sentences": [
    "MOSCOW - Russia said on Nov 19 that Ukraine had fired US-supplied long-range missiles into its territory for the first time since Washington authorised such strikes as President Vladimir Putin issued a nuclear threat on the 1,000th day of the war.",
    "A senior Ukrainian official confirmed to AFP that its military had used Army Tactical Missile System (ATACMS) missiles to strike inside Russian territory.",
    "“The attack on the Bryansk region was carried out by ATACMS missiles,” the source told AFP, without adding details.",
    "Ukrainian President Volodymyr Zelensky separately declined to comment during a press conference in Kyiv.",
    "Russian Foreign Minister Sergei Lavrov, speaking at a Group of 20 press conference in Brazil, said the strike marked a “new phase of the Western war” against Moscow, and vowed to react “accordingly”.",
    "The grim 1,000th day anniversary opened with a Russian strike in the eastern Ukrainian region of Sumy that gutted a Soviet-era residential building and killed at least 12 people, including a child.",
    "Mr Zelensky published images of rescuers hauling bodies from the debris and called on Kyiv’s allies to “force” the Kremlin into peace.",
    "The Foreign Ministry released an anniversary statement calling on allies to ramp up military support to bring about a “sustainable” end to the war.",
    "“Ukraine will never submit to the occupiers, and the Russian military will be punished for violating international law,” the ministry said.",
    "“We need peace through strength, not appeasement,” it added, referring to growing calls for Kyiv to sit down at the negotiating table with Moscow to end the war.",
    "The Kremlin also vowed to defeat Ukraine.",
    "“The military operation against Kyiv continues... and will be completed,” Kremlin spokesman Dmitry Peskov told reporters, using Russia’s preferred language for its invasion.",
    "Nuclear sabre-rattling Washington this week said it had cleared Ukraine to use long-range ATACMS weapons against military targets inside Russia – a longstanding Ukrainian request.",
    "Russia’s military said: “At 3.25am (local time), the enemy struck a site in the Bryansk region with six ballistic missiles.",
    "According to confirmed data, US-made ATACMS tactical missiles were used.” Moscow has said the use of Western weapons against its internationally recognised territory would make the US a direct participant in the conflict and pledged an “appropriate and palpable response”.",
    "The strike confirmation came shortly after Mr Putin signed a decree on Nov 19 which enables Russia to use nuclear weapons against non-nuclear states such as Ukraine if they are supported by nuclear powers.",
    "The new nuclear doctrine allows Moscow to unleash a nuclear response in the event of a “massive” air attack, even if it is only with conventional weapons.",
    "Mr Peskov said this was “necessary to bring our principles in line with the current situation”.",
    "Deadly strike on Sumy Russia has stepped up strikes on Ukraine in recent days as its troops advance in the east of the country.",
    "One overnight Russian attack hit a dormitory in the town of Glukhiv, which had a pre-war population of around 30,000 people and lies just 10km from the Kursk region in Russia, where Ukrainian troops captured territory in a major ground offensive in August.",
    "The drone attack killed 12 people, including a child, the emergency services said.",
    "In total, Kyiv said Russia had launched 87 drones over Ukraine during the night and that 51 were shot down.",
    "The strike on Sumy comes just days after another Russian aerial bombardment in the border region killed 12 people and wounded 84.",
    "A separate missile strike on Nov 18 on Odesa in southern Ukraine left 10 dead and 55 wounded.",
    "US President-elect Donald Trump has vowed to cut US assistance to Ukraine and bring about a swift end to the war, without detailing how he would do so.",
    "A group of European foreign ministers meeting in Warsaw on Nov 19 discussed stepping up aid to Ukraine if US support wanes.",
    "“I note with appreciation the readiness of the largest European Union countries to assume the burden of military and financial support for Ukraine in the context of a possible reduction in US involvement,” Polish Foreign Minister Radoslaw Sikorski said after the talks.",
    "Direct threat to the West Ukrainian forces have steadily lost ground in the Kursk region and have warned that Russia has amassed about 50,000 troops, including North Korean forces, to wrest back the region.",
    "The anniversary of Russia’s invasion – launched on Feb 24, 2022 – comes at a perilous time for Ukrainian forces across the front, particularly near the war-battered cities of Kupiansk and Pokrovsk.",
    "Nato chief Mark Rutte warned on Nov 19 that Mr Putin must not be allowed to prevail.",
    "“Why is this so crucial that Putin will not get his way?",
    "Because you will have an emboldened Russia on our border... and I’m absolutely convinced it will not stop there,” Mr Rutte said in Brussels.",
    "“It is then posing a direct threat to all of us in the West,” he said.",
    "The EU’s outgoing top diplomat Josep Borrell also pressed member states to align with Washington in allowing Kyiv to strike inside Russia using donated long-range missiles.",
    "“It is fully in accordance with international law,” he said.",
    "AFP Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Conflict": 0.9069207310676575,
    "Diplomacy": 0.9038048386573792,
    "Politics": 0.8706197142601013,
    "Military": 0.8404896855354309,
    "Economy": 0.8211911916732788,
    "Energy": 0.8189769387245178,
    "Culture": 0.7899305820465088,
    "Technology": 0.7817017436027527,
    "Crime": 0.7573269605636597,
    "Environment": 0.7409987449645996,
    "Transport": 0.7340998649597168,
    "Education": 0.6557855606079102,
    "Elections": 0.6521309614181519,
    "Health": 0.6235219836235046
  },
  "sentiment": {
    "positive": 0.333,
    "negative": 0.667,
    "neutral": 0.0
  }
}