{
  "title": "S’pore-based TikToker gets 11½ years’ jail and caning for raping woman he met on Tinder",
  "published_date": null,
  "url": "https://www.straitstimes.com/singapore/courts-crime/spore-based-tiktoker-gets-111-2-years-jail-and-caning-for-raping-woman-he-met-on-tinder",
  "original_language": "en",
  "cleaned_sentences": [
    "SINGAPORE - A TikToker and former scriptwriter-actor with local YouTube comedy channel Wah!Banana was sentenced to 11½ years’ jail and 12 strokes of the cane on May 19 for raping a woman he had met on the dating app Tinder.",
    "Lev Panfilov, a 29-year-old Singapore permanent resident originally from Russia, was earlier found guilty by the High Court of two counts of rape, one count of sexual assault by penetration, and one count of outrage of modesty.",
    "The assault took place on Jan 12, 2021, in Panfilov’s bedroom after he invited the woman back to the flat he shared with flatmates to work on her script.",
    "The woman, who was then 30 years old, had worked as an actress and model and was trying to branch out into comedy writing.",
    "Deputy Public Prosecutor Sheldon Lim sought 14 years’ jail and 16 strokes of the cane.",
    "In written submissions, the prosecution said Panfilov lacked remorse, as he had prolonged his trial unnecessarily by subjecting the woman to a marathon 13 days of cross-examination.",
    "The prosecution noted that Panfilov had tried to leave Singapore midway through the trial, without any permission being granted by the court.",
    "On Dec 9, 2023, he was stopped at the entrance to the departure hall of Changi Airport Terminal 1, as he was trying to use his new Russian passport to pass through to board his flight.",
    "As a result, Panfilov, who was on bail up to that point, was arrested and remanded in custody.",
    "He had applied for and obtained the new passport without the knowledge of the investigating officer.",
    "Lawyer Sameer Melber who, together with Mr Manoj Nandwani, now acts for Panfilov, asked for 10 years and five months’ jail and six strokes of the cane.",
    "Mr Sameer said the sequence of events shows there was no element of premeditation on the part of his client, and that the woman had ended up in Panfilov’s bed of her own volition.",
    "The lawyer said his client intends to get married later in 2025 and also pursue his education in prison.",
    "During the trial, which began in May 2023, the woman and Panfilov presented different accounts of the incident.",
    "The two had matched on Tinder and later moved their chat to WhatsApp before arranging to meet in person at a restaurant in Robertson Quay.",
    "She testified that his Tinder profile had stated he was either a writer or scriptwriter, and that she had hoped to get some advice on scriptwriting from him.",
    "At the restaurant, she opened her laptop and started working on her script with him.",
    "She said that after waiters came round to ask if they had any last orders, Panfilov suggested continuing working on the script at his place, and she agreed.",
    "The two went to the flat separately – Panfilov rode his motorcycle and the woman took a Grab car.",
    "At his flat, he ushered her into his bedroom.",
    "They sat on his bed as they talked about comedic characters and watched videos of various comedians.",
    "She said she sat on his bed because the room was otherwise rather cluttered.",
    "The woman said he suddenly leaned in and kissed her on her lips, but she told him “no” and gathered her things to leave.",
    "But he sexually assaulted her and raped her on his bed, she said.",
    "On Jan 16, 2021, still in pain from the assault, she saw a doctor, who advised her to make a police report.",
    "The same day, she went to a neighbourhood police centre and spoke to several police officers but left without lodging a report.",
    "Around midnight on Jan 18, 2021, she finally told her mother what had happened.",
    "Her mother took her to KK Women’s and Children’s Hospital, and a police report was lodged.",
    "Panfilov did not deny that he had sex with the woman but said the encounter was consensual.",
    "He said she had made the first advances – laughing at his jokes, tapping on his leg and stroking his thigh.",
    "After they had sex, he asked for her address and booked a car on the Gojek app for her to get home.",
    "He said he later messaged her, asking if she had reached home safely, and she replied that all was good.",
    "He said he subsequently did not reply to her because her interest in morbid jokes was not in line with his sense of humour.",
    "On March 21, Justice Pang Khang Chau found the woman to be an unusually convincing witness who gave a detailed and textured account that was internally and externally consistent.",
    "The judge accepted that she had explanations for the issues raised by the defence.",
    "On the other hand, Justice Pang found that Panfilov was not a credible witness and that his testimony did not help in casting reasonable doubts on the prosecution’s case.",
    "The judge said there were significant inconsistencies between what Panfilov said to police officers, what he said in his video-recorded interviews and what he said in court.",
    "Panfilov will be appealing against his conviction and sentence.",
    "Join ST's WhatsApp Channel and get the latest news and must-reads."
  ],
  "topics": {
    "Conflict": 0.902182936668396,
    "Environment": 0.8099961876869202,
    "Energy": 0.7845280766487122,
    "Diplomacy": 0.7721805572509766,
    "Culture": 0.7648345232009888,
    "Economy": 0.7413990497589111,
    "Technology": 0.7209816575050354,
    "Transport": 0.6667405962944031,
    "Politics": 0.6637207865715027,
    "Crime": 0.650958776473999,
    "Elections": 0.6231610178947449,
    "Health": 0.6161673069000244,
    "Education": 0.6142175197601318,
    "Military": 0.472798615694046
  },
  "sentiment": {
    "positive": 0.282,
    "negative": 0.718,
    "neutral": 0.0
  }
}