{
  "title": "Kremlin vows ‘response’ if Ukraine fires US missiles into Russia",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/europe/kremlin-vows-response-if-ukraine-fires-us-missiles-into-russia",
  "original_language": "en",
  "cleaned_sentences": [
    "ODESA, Ukraine - The Kremlin on Nov 18 accused US President Joe Biden of escalating the 1,000-day-old war in Ukraine, promising a “palpable” response to any use of US long-range missiles by Ukraine to strike targets inside Russia.",
    "Mr Biden, who in January hands over the White House to Donald Trump, a sceptic of US support for Ukraine, called at a Group of 20 (G-20) summit – attended by Russia’s foreign minister – for support for Ukraine’s sovereignty.",
    "The missile dispute raged as Moscow unleashed a second missile attack in two days on the Ukrainian Black Sea city of Odesa, killing 10 people and wounding 55, authorities said.",
    "Ukraine’s Foreign Minister Andriy Sybiga said the US decision to allow the use of Army Tactical Missile Systems (ATACMS) could be a “game changer”.",
    "Kyiv has long sought authorisation to use ATACMS against military targets inside Russia as its troops face some of the most intense pressure since Russia launched its offensive in February 2022.",
    "Russia’s aerial bombardments have levelled entire districts near the front line and decimated energy facilities across Ukraine.",
    "“The longer Ukraine can strike, the shorter the war will be,” Mr Sybiga told reporters ahead of a UN Security Council meeting to mark 1,000 days since Russia’s full invasion.",
    "“It could have very positive impact on the situation on the battlefield.” But Kremlin spokesman Dmitry Peskov said “it’s obvious that the outgoing administration in Washington intends... to continue fuelling the fire and provoke a further escalation of tensions”.",
    "Speaking at the G-20 summit in Brazil, Mr Biden said: “The United States strongly supports Ukraine’s sovereignty and territorial integrity.",
    "Everyone around this table in my view should as well.” A US official told AFP the major policy shift on the missiles was in response to Russia’s deployment of thousands of North Korean troops in its campaign.",
    "‘Direct US involvement’ Mr Peskov said President Vladimir Putin had clearly expressed Moscow’s position in September when he declared that using the missiles would put Nato “at war” with Russia.",
    "Mr Putin said then that if Ukraine attacked Russia with long-range missiles, Moscow would “take the appropriate decisions” – a point the foreign ministry echoed on Nov 18.",
    "“Kyiv’s use of long-range missiles to attack our territory would represent the direct involvement of the United States and its satellites in hostilities against Russia,” the ministry said in a statement, vowing an “appropriate and palpable” response.",
    "Washington’s decision comes amid growing concerns over reports North Korea has deployed upwards of 10,000 troops to Russia to be sent into combat against Ukraine.",
    "US Principal Deputy National Security Adviser Jon Finer said Washington had been clear it would formulate a response to the Kremlin’s decision to deploy “a foreign country’s forces” in Russia.",
    "Zelensky visits frontline Russia, which has made rapid gains in Donetsk over recent weeks, claimed the capture of another village in the eastern region.",
    "The Donetsk regional governor said three people had been killed and two wounded in Russian attacks on the towns of Siversk and Kostyantynivka.",
    "President Volodymyr Zelensky said he visited two key frontline cities – Pokrovsk and Kupiansk.",
    "Pokrovsk is an important Ukrainian garrison city in the Donetsk region that Russian forces have been targeting, while Russian troops briefly entered Kupiansk last week and remain close to the outskirts.",
    "“This is a tense area,” Mr Zelensky said at Pokrovsk, thanking Ukrainian forces for ensuring that the wider Donbas territory was not “completely occupied by Russia”.",
    "Mr Biden’s decision to allow Ukraine to use US missiles to strike inside Russia could prompt European allies to also review their stance.",
    "Britain’s Prime Minister Keir Starmer refused to be drawn on the issue at the G-20.",
    "A senior Ukrainian presidency official expressed frustration over the time taken to get approval, however, saying the decision was “needed a year ago”.",
    "The international chemical weapons watchdog said meanwhile that it had found banned CS riot gas in shell and soil samples provided by Ukraine from the conflict zone.",
    "The presence of the gas violated a convention on the use of toxic weapons.",
    "Russia and Ukraine have accused each other of using chemical weapons, while Britain and the United States also charge Moscow with using banned toxic agents against Ukrainian troops.",
    "Ukrainian engineers meanwhile were still repairing damaged facilities from a Russian missile and drone barrage a day earlier.",
    "Prime Minister Denys Shmygal said around 220,000 consumers were without electricity in the Odesa and Dnipropetrovsk regions.",
    "AFP Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Politics": 0.8649440407752991,
    "Diplomacy": 0.8535731434822083,
    "Conflict": 0.8265552520751953,
    "Military": 0.8093504905700684,
    "Elections": 0.7766680121421814,
    "Education": 0.7740235924720764,
    "Technology": 0.7707224488258362,
    "Culture": 0.7571147680282593,
    "Energy": 0.7548772692680359,
    "Environment": 0.7432053089141846,
    "Health": 0.7382294535636902,
    "Transport": 0.735053539276123,
    "Economy": 0.7127510905265808,
    "Crime": 0.6934695839881897
  },
  "sentiment": {
    "positive": 0.379,
    "negative": 0.621,
    "neutral": 0.0
  }
}