{
  "title": "Trump says Russia and Ukraine to start ceasefire talks ‘immediately’",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/united-states/after-putin-call-trump-says-russia-ukraine-talks-to-begin-immediately",
  "original_language": "en",
  "cleaned_sentences": [
    "WASHINGTON – US President Donald Trump spoke with President Vladimir Putin on May 19 and said Russia and Ukraine will immediately start negotiations towards a ceasefire, but the Kremlin said reaching an agreement would take time and Mr Trump indicated he was not ready to join Europe with fresh sanctions to pressure Moscow.",
    "In a social media post, Mr Trump said he relayed the plan to Ukrainian President Volodymyr Zelensky as well as the leaders of the European Union, France, Italy, Germany and Finland in a group call following his session with Mr Putin.",
    "“Russia and Ukraine will immediately start negotiations towards a ceasefire and, more importantly, an end to the war,” Mr Trump said, adding later at the White House that he thought “some progress is being made”.",
    "European leaders decided to increase pressure on Russia through sanctions after Mr Trump briefed them on his call with Mr Putin, German Chancellor Friedrich Merz said in a post on social media platform X late on May 19.",
    "Mr Trump did not appear ready to follow that move.",
    "When asked why he had not imposed fresh sanctions to push Moscow into a peace deal as he has threatened, Mr Trump told reporters: “Well because I think there’s a chance of getting something done, and if you do that, you can also make it much worse.",
    "But there could be a time where that’s going to happen.” Mr Trump said there were “some big egos involved”.",
    "Without progress, “I’m just going to back away”, he said, repeating a warning that he could abandon the process.",
    "“This is not my war.” After speaking to Mr Trump, Mr Putin said efforts to end the war were “generally on the right track” and that Moscow was ready to work with Ukraine on a potential peace deal.",
    "“We have agreed with the President of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” he told reporters near the Black Sea resort of Sochi.",
    "European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce.",
    "The Russian leader has resisted that, insisting that conditions be met first.",
    "Kremlin aide Yuri Ushakov said Mr Trump and Mr Putin did not discuss a timeline for a ceasefire but did discuss trading nine Russians for nine Americans in a prisoner swop.",
    "He said the US leader called prospects for ties between Moscow and Washington “impressive”.",
    "Russian state news agencies cited Kremlin spokesman Dmitry Peskov as saying that Moscow and Kyiv faced “complex contacts” to develop a unified text of a peace and ceasefire memorandum.",
    "“There are no deadlines and there cannot be any.",
    "It is clear that everyone wants to do this as quickly as possible, but, of course, the devil is in the details,” the RIA agency quoted him as saying.",
    "Former Swedish prime minister Carl Bildt said on X that the call with Mr Trump was “undoubtedly a win for Putin”.",
    "The Russian leader “deflected the call for an… immediate ceasefire and instead can continue military operations at the same time as he puts pressure on at the negotiating table”.",
    "High-level meeting After speaking with Mr Trump, Mr Zelensky said Kyiv and its partners might seek a high-level meeting among Ukraine, Russia, the US, European Union countries and Britain as part of a push to end the war.",
    "He said he hoped this could happen soon and be hosted by Turkey, the Vatican or Switzerland.",
    "It was not immediately clear if this would be part of the negotiations Mr Trump said would start immediately.",
    "Mr Trump said Pope Leo had expressed interest in hosting the negotiations at the Vatican.",
    "The Vatican did not immediately respond to a request for comment.",
    "One person familiar with Mr Trump’s call with the Ukrainian and European leaders said participants were “shocked” that the US leader did not want to push Mr Putin with sanctions.",
    "In a post on X, European Commission president Ursula von der Leyen said the conversation with Mr Trump was “good” and it was “important that the US stays engaged”.",
    "Ukraine and its supporters have accused Russia of failing to negotiate in good faith, doing the minimum needed to keep Mr Trump from applying new pressure on its economy.",
    "Prodded by Mr Trump, delegates from the warring countries met last week in Istanbul for the first time since 2022, in the early months of Russia’s invasion of Ukraine, but those talks failed to produce a truce.",
    "Prospects for progress dimmed after Mr Putin spurned Mr Zelensky’s proposal they meet face to face in Istanbul, and Mr Trump said there would be no movement unless he and Mr Putin met.",
    "Mr Putin, whose forces control a fifth of Ukraine and are advancing, has stood firm on his conditions for ending the war.",
    "He said the memorandum Russia and Ukraine would work on about a future peace accord would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.",
    "Mr Putin said: “The main thing for us is to eliminate the root causes of this crisis.",
    "“We just need to determine the most effective ways to move towards peace.” REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Politics": 0.8950043320655823,
    "Conflict": 0.8883295059204102,
    "Diplomacy": 0.8762734532356262,
    "Environment": 0.8578265309333801,
    "Energy": 0.854621946811676,
    "Transport": 0.851128101348877,
    "Culture": 0.8137483596801758,
    "Military": 0.8044365048408508,
    "Economy": 0.7929015159606934,
    "Technology": 0.7831432223320007,
    "Elections": 0.7334984540939331,
    "Education": 0.7271541357040405,
    "Health": 0.6624833941459656,
    "Crime": 0.6152217388153076
  },
  "sentiment": {
    "positive": 0.364,
    "negative": 0.636,
    "neutral": 0.0
  }
}