{
  "title": "Biden allows Ukraine to use US arms to strike inside Russia",
  "published_date": null,
  "url": "https://www.straitstimes.com/world/united-states/biden-allows-ukraine-to-use-us-arms-to-strike-inside-russia",
  "original_language": "en",
  "cleaned_sentences": [
    "WASHINGTON - US President Joe Biden's administration has allowed Ukraine to use US-made weapons to strike deep into Russia, two US officials and a source familiar with the decision said on Nov 17, in a significant reversal of Washington's policy in the Ukraine-Russia conflict.",
    "Ukraine plans to conduct its first long-range attacks in the coming days, the sources said, without revealing details due to operational security concerns.",
    "The move comes two months before President-elect Donald Trump takes office on Jan 20 and follows months of pleas by Ukrainian President Volodymyr Zelensky to allow Ukraine's military to use US weapons to hit Russian military targets far from its border.",
    "The change comes largely in response to Russia's deployment of North Korean ground troops to supplement its own forces, a development that has caused alarm in Washington and Kyiv, a US official and a source familiar with the decision said.",
    "The White House and the State Department declined to comment.",
    "The Ukrainian Foreign Ministry and president's office did not immediately respond to requests for comment.",
    "Russia has warned that it would see a move to loosen the limits on Ukraine's use of US weapons as a major escalation.",
    "Mr Vladimir Dzhabarov, first deputy head of the Russian Upper House’s international affairs committee, said Washington’s decision to let Kyiv strike deep into Russia could lead to “World War III”.",
    "“The West has decided on such a level of escalation that it could end with the Ukrainian statehood in complete ruins by morning,” Mr Andrei Klishas, a senior member of the Federation Council, Russia’s Upper Chamber of Parliament, said on the Telegram messaging app.",
    "Ukraine's first deep strikes are likely to be carried out using ATACMS rockets, which have a range of up to 306km, according to the sources.",
    "While some US officials have expressed scepticism that allowing long-range strikes will change the war's overall trajectory, the decision could help Ukraine at a moment when Russian forces are making gains and possibly put Kyiv in a better negotiating position when and if ceasefire talks happen.",
    "It is not clear if Trump will reverse Mr Biden's decision when he takes office.",
    "Trump has long criticised the scale of US financial and military aid to Ukraine and has vowed to end the war quickly, without explaining how.",
    "A Trump spokesperson did not immediately respond to a request for comment.",
    "But one of Trump's closest foreign policy advisers, Mr Richard Grenell, criticised the decision.",
    "\"Escalating the wars before he leaves office,\" Mr Grenell said, in an X post responding to the news.",
    "Some congressional Republicans had urged Mr Biden to loosen the rules on how Ukraine can use US-provided weapons.",
    "Since Trump's Nov 5 victory, senior Biden administration officials have repeatedly said they would use the remaining time to ensure Ukraine can fight effectively next year or negotiate peace with Russia from a \"position of strength\".",
    "‘Way too late’ The US believes more than 10,000 North Korean soldiers have been sent to eastern Russia and that most of them have moved to the Kursk region and have begun to engage in combat operations.",
    "Russia is advancing at its fastest rate since 2022 despite taking heavy losses, and Ukraine said it had clashed with some of those North Korean troops deployed to Kursk.",
    "Stretched by personnel shortages, Ukrainian forces have lost some of the ground they captured in an August incursion into Kursk that Zelensky said could serve as a bargaining chip.",
    "\"Removing targeting restrictions will allow the Ukrainians to stop fighting with one hand tied behind their back,\" Mr Alex Plitsas, senior non-resident fellow at the Atlantic Council, said.",
    "\"However, like everything else, I believe history will say the decision came way too late.",
    "Just like the ATACMS, Himars, Bradley Fighting Vehicles, Abrams Tanks and F-16.",
    "They were all needed much sooner,\" he added.",
    "Despite Mr Zelensky's pleas, the White House had been reluctant to allow US-supplied weapons to be used to strike targets deep inside Russia for fear this could escalate the conflict.",
    "Republican US Representative Mike Turner, who chairs the House Intelligence Committee, said in a statement that Mr Biden’s decision was long overdue and that there were still too many restrictions on Ukraine.",
    "But he added: “This first step will put pressure on Vladimir Putin as President-elect Trump returns to the White House and works to end this war.” Kyiv's other allies have been supplying weapons but with restrictions on how and when they can be used inside Russia, out of concern such strikes could prompt retaliation that draws Nato countries into the war or provokes a nuclear conflict.",
    "Polish Foreign Minister Radoslaw Sikorski also called the move a response to North Korea's involvement.",
    "\"President Biden responded to the entry of North Korean troops into the war and the massive Russian missile strike in a language that V. Putin understands – by removing restrictions on Ukraine's use of Western missiles,\" Mr Sikorski said on X. REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you."
  ],
  "topics": {
    "Politics": 0.867548942565918,
    "Culture": 0.85039222240448,
    "Diplomacy": 0.8405665159225464,
    "Conflict": 0.803440272808075,
    "Transport": 0.7637627720832825,
    "Economy": 0.7630515694618225,
    "Technology": 0.7597063779830933,
    "Military": 0.735809326171875,
    "Elections": 0.7338540554046631,
    "Energy": 0.7075173854827881,
    "Education": 0.6945742964744568,
    "Environment": 0.653342604637146,
    "Health": 0.6248356103897095,
    "Crime": 0.5255290269851685
  },
  "sentiment": {
    "positive": 0.233,
    "negative": 0.767,
    "neutral": 0.0
  }
}