{
  "title": "Trump says Russia will ‘immediately’ work toward a ceasefire with Ukraine after phone call. But Putin seems unmoved",
  "published_date": null,
  "url": "https://edition.cnn.com/2025/05/19/politics/trump-putin-call-ukraine-russia",
  "original_language": "en",
  "cleaned_sentences": [
    "For President Donald Trump, Monday’s phone call with Russian leader Vladimir Putin amounted to a major occasion — meant to ascertain his counterpart’s willingness to bring the conflict in Ukraine to an end.",
    "“I said when are we going to end this, Vladimir?” Trump recounted later to reporters.",
    "“I said when are we going to end this bloodshed, this bloodbath?” For Putin, it seemed to be a much less momentous event.",
    "Unlike Trump, who conducted the two-hour conversation from the Oval Office and previewed the call ahead of time in all capital letters on social media, Putin did not clear his schedule.",
    "He phoned in from a school for gifted children in the Black Sea resort of Sochi, squeezing in Trump amid a tour of the facilities.",
    "Afterward, it was evident each man viewed the call with differing levels of consequence.",
    "“If I thought that President Putin did not want to get this over with, I wouldn’t even be talking about it.",
    "I’d just pull out,” Trump said.",
    "“I think he’s had enough.” While Trump proclaimed in an optimistic social media post that the call “went very well” and that Russia and Ukraine had agreed to “immediately start negotiations toward a Ceasefire,” Putin made clear in his own comments he wasn’t budging from his maximalist demands to end the violence.",
    "Without any major progress toward an immediate ceasefire, Trump sought to emphasize what he described as an excellent “tone and spirit” shared with the Kremlin leader.",
    "Putin, meanwhile, described the call as “meaningful and frank.” The divergent assessments of the leaders’ third phone conversation this year seemed to underscore the struggles Trump is facing in bringing about an end to the three-year war, which he described this week as a “bloodbath.” Even as Ukraine has agreed to an immediate 30-day ceasefire, Putin has refused, leading to questions among Trump’s aides about whether Moscow is simply stringing Trump along — something the president himself has previously suggested.",
    "But Trump didn’t appear to hold that view after the call, telling reporters Monday afternoon that he believes Putin is interested in peace.",
    "“I do,” Trump said at an unrelated White House event, without expanding further.",
    "Yet later in the day, he suggested he would step away if Putin didn’t make good on his pledge to end the war.",
    "“Very big egos involved.",
    "I tell you, big egos involved, but I think something’s going to happen,” Trump said.",
    "“And if it doesn’t, I just back away and they’re going to have to keep going.” Yet Putin has only ramped up drone and missile attacks on Ukraine, including this weekend on its capital, Kyiv.",
    "Trump has previously criticized those assaults as counterproductive but made no mention of the latest attack as he recounted his call with Putin.",
    "Although Trump seemed confident after Monday’s conversation that the two countries would reach a resolution, there was little to indicate anything had changed in Putin’s approach.",
    "Trump told reporters ahead of the call that he and Putin must meet soon to discuss a resolution to the conflict, but there was no mention in either side’s readout of a forthcoming summit.",
    "And despite Trump’s repeated assertions that only he could end the war, he said Monday that negotiating the conditions for a ceasefire would be left to Ukraine and Russia, apparently backing away from any direct mediating role.",
    "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump wrote on Truth Social.",
    "Ahead of Monday’s call, Trump spoke with European leaders Sunday evening about ways to pressure Moscow into agreeing to a ceasefire.",
    "That included applying new sanctions “if Russia failed to engage seriously,” according to British Prime Minister Keir Starmer.",
    "Trump did not mention new sanctions after the call, however, and instead pointed to potential economic incentives if the war concludes.",
    "“Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree.",
    "There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
    "Its potential is UNLIMITED,” Trump wrote.",
    "He also said that Ukraine “can be a great beneficiary on Trade.” Trump said he informed various leaders about the contents of the call, including Ukrainian President Volodymyr Zelensky, President of the European Commission Ursula von der Leyen, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz and Finnish President Alexander Stubb.",
    "“The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations.",
    "Let the process begin!” Trump added.",
    "Zelensky spoke to Trump twice Monday, once shortly before the US leader spoke with Putin, and once after, the Ukrainian president told reporters at a press briefing Monday evening.",
    "In the phone call after Trump spoke with Putin, European leaders discussed the need for more sanctions on Moscow.",
    "Zelensky said the US still needs to be “pressured” to agree to implement further sanctions.",
    "The Ukrainian leader said discussions would take place about the future location of a next round of talks — which would be aimed first at achieving a ceasefire.",
    "Turkey, Switzerland and the Vatican were among the possible locations, he said.",
    "Before the call, Trump had expressed increasing frustration with the Russian president’s refusal to strike a peace deal with Ukraine.",
    "White House press secretary Karoline Leavitt said shortly ahead of the conversation on Monday that Trump has “grown weary and frustrated with both sides of the conflict,” adding that his goal “is to see a ceasefire and to see this conflict come to an end.” This headline and story have been updated with additional developments.",
    "CNN’s Kit Maher and Donald Judd contributed to this report."
  ],
  "topics": {
    "Conflict": 0.07687658071517944,
    "Diplomacy": 0.06414472311735153,
    "Military": 0.04903446137905121,
    "Economy": 0.04138268902897835,
    "Politics": 0.04046286642551422,
    "Energy": 0.03620682656764984,
    "Technology": 0.03493903577327728,
    "Transport": 0.03275664523243904,
    "Environment": 0.030520297586917877,
    "Culture": 0.030434500426054,
    "Crime": 0.02999930828809738,
    "Elections": 0.026894988492131233,
    "Education": 0.02270919643342495,
    "Health": 0.022507501766085625
  },
  "sentiment": {
    "positive": 0.436,
    "negative": 0.564,
    "neutral": 0.0
  }
}