{
  "title": "Trump wraps up call with Russia's Putin, says cease-fire talks to start 'immediately'",
  "published_date": null,
  "url": "https://nypost.com/2025/05/19/us-news/trump-wraps-up-call-with-russias-putin-who-says-moscow-ready-to-work-with-kyiv/",
  "original_language": "en",
  "cleaned_sentences": [
    "Trump wraps up call with Russia’s Putin, says cease-fire talks to start ‘immediately’ WASHINGTON — Russian President Vladimir Putin doubled down Monday on not accepting a cease-fire in his 39-month-old war on Ukraine following a two-hour call with President Trump — saying that Moscow was not ready for peace until the “root cause” of the “crisis” is addressed.",
    "“Russia is ready to work with Kyiv on a memorandum on a future peace treaty which could include issues of a cease-fire and principles for resolving the conflict,” Putin said following the call, his first contact with Trump since Russian and Ukrainian negotiators agreed Friday to trade proposals to halt Europe’s bloodiest conflict since the Second World War.",
    "However, the 72-year-old added, there is a “need to work out the most effective paths toward peace” that would be suitable to “all sides.” The eventual peace agreement, Putin said, could “include a possible cease-fire for a certain period of time if appropriate agreements are reached.” Trump, 78, put a happy spin on the call, announcing on announcing on Truth Social that “[t]he tone and spirit of the conversation were excellent” and that “Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.” The president’s statement notably stressed that Russia wants to resume major economic activity with the US — and made no mention of secondary sanctions, which Trump has previously mused about slapping on the Kremlin.",
    "Sen. Lindsey Graham (R-SC) is intending to introduce a widely-supported Senate bill that would put secondary sanctions on any country buying Russian oil, gas or natural gas, among other products.",
    "“Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree,” Trump said.",
    "The 78-year-old added that he had relayed details of his talk with Putin to Ukrainian President Volodymyr Zelensky, along with “Ursula von der Leyen, President of the European Commission, President Emmanuel Macron, of France, Prime Minister Giorgia Meloni, of Italy, Chancellor Friedrich Merz, of Germany, and President Alexander Stubb, of Finland.” “The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations,” Trump concluded.",
    "“Let the process begin!” Trump later told reporters in the Oval Office that talks at the seat of the Roman Catholic Church “could help” some of the “anger” that exists between Russia and Ukraine.",
    "Zelensky, 47, stressed that Ukraine is ready for a “full and unconditional cease-fire” immediately, and that the world should pressure Russia to do the same.",
    "The Ukrainian leader revealed that Trump spoke to him first, then called Putin, and then had a shared call with the European leaders.",
    "“I reaffirmed to President Trump that Ukraine is ready for a full and unconditional ceasefire, as has spoken about, particularly the United States,” Zelensky wrote on X.",
    "“It is important not to dilute this proposal.",
    "If the Russians are not ready to stop the killings, there must be stronger sanctions.",
    "Pressure on Russia will push it toward real peace – this is obvious to everyone around the world.” Zelensky added that he would be ready to meet Putin in Turkey, Switzerland, the Vatican, or any other location, he said.",
    "“If Russia refuses to stop the killings, refuses to release prisoners of war and hostages, if Putin puts forward unrealistic demands, this will mean that Russia continues to drag out the war, and deserves that Europe, America, and the world act accordingly, including with further sanctions,” he argued.",
    "“Russia must end the war it started, and it can begin doing so any day.",
    "Ukraine has always been ready for peace.” Ukraine has said previously it would agree to a cease-fire immediately, while Putin has insisted that there are considerations that need to be discussed first — like halting more US aid to the war-torn country.",
    "“Putin is continuing to conflate the negotiations needed to reach a cease-fire agreement with those needed to reach a peace settlement in order to drive confusion in the West and falsely paint Ukraine as intransigent,” Kateryna Stepanenko, Russia analyst at the Institute for the Study of War, told The Post.",
    "“By rejecting the full cease-fire that Ukraine and the US proposed, the Kremlin is laying the groundwork to make even more demands of Ukraine and the United States,”Stepanenko added.",
    "“A prolonged peace negotiation process without a cease-fire will allow Russia to continue its war effort in Ukraine, and the Kremlin may try to leverage the peace talks as a way to extract additional concessions beyond its original war aims.” Putin described the conversation with Trump as “frank and meaningful,” adding that he was thankful for the US president’s initiative to have direct talks with both belligerent leaders.",
    "Russia’s “position on the whole is known,” Putin added, a reference to his baseless claims in 2022 that Moscow was invading Ukraine to “de-Nazify” the country and save Russian-speaking residents of Ukraine from oppression by Kyiv.",
    "Ukrainian and Russian officials met face-to-face on Friday in Turkey for the first time in more than three years, opting to hold talks despite Putin declining to attend.",
    "The two sides agreed to exchange 1,000 prisoners of war from each side and pledged to return to the negotiating table with cease-fire ideas.",
    "Earlier Monday, Vice President JD Vance told reporters on Air Force Two that the Trump administration wanted to see if Putin was “serious about negotiating peace” — and was “more than open to walking away” if he wasn’t.",
    "“The president has been very clear,” Vance said.",
    "“There’s a bit of an impasse here, and I think the president’s going to say to President Putin, ‘Look, are you serious, are you real about this?",
    "'” Without serious movement, the veep said, the Trump administration will describe the conflict as “Joe Biden’s war” — and will stop trying to mediate.",
    "“It’s not our war,” Vance said.",
    "“We’re going to try to end it, but if we can’t end it, we are eventually going to say, ‘That was worth a try, but we’re not doing it anymore.",
    "'” In the Oval Office Monday evening, Trump reiterated to reporters that “it’s not our war” and insisted that “I’ll just back away” if nothing happens.",
    "Trump added that he thought Putin wanted to end his invasion, saying: “I think he’s had enough.” “If I thought Putin did not want to get this over with, I wouldn’t even be talking about it, because I’d just pull out,” he added.",
    "Trump also said he has a red line in his head that would cause him to walk away, but wouldn’t reveal what it was.",
    "Going into Monday’s phone call, the Kremlin indicated that Putin also had a hard line from which he would negotiate.",
    "“The conversation is important, taking into account the negotiations held [Friday] in Istanbul,” Kremlin spokesperson Dmitry Peskov told reporters ahead of the conversation, per the Russian news agency TASS.",
    "“As for the talks, we have already said everything we could, we underscored the basic points.” Russian Foreign Ministry Spokeswoman Maria Zakharova specifically said Putin was committed to the plan he proposed on June 14, 2024,.",
    "Those conditions included Ukraine withdrawing all troops from the eastern Donbas region, committing to never joining NATO, and remaining non-aligned and non-nuclear while allowing the Russian language to be taught in schools — as well as the lifting of all Western sanctions on Moscow."
  ],
  "topics": {
    "Conflict": 0.40489041805267334,
    "Diplomacy": 0.3883422315120697,
    "Transport": 0.3822952210903168,
    "Energy": 0.3574710190296173,
    "Politics": 0.3561645448207855,
    "Culture": 0.3144688606262207,
    "Economy": 0.3142370581626892,
    "Crime": 0.3074977695941925,
    "Military": 0.2981218099594116,
    "Environment": 0.27906277775764465,
    "Health": 0.22912739217281342,
    "Elections": 0.22698038816452026,
    "Technology": 0.20515044033527374,
    "Education": 0.1316738873720169
  },
  "sentiment": {
    "positive": 0.543,
    "negative": 0.457,
    "neutral": 0.0
  }
}