{
  "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
  "published_date": null,
  "url": "https://abc7.com/post/trump-putin-phone-call-leaders-us-russia-speak-more-2-hours-amid-hopes-ceasefire-progress-ukraine/16471078/",
  "original_language": "en",
  "cleaned_sentences": [
    "WASHINGTON -- President Donald Trump said Monday that Russia and Ukraine will \"immediately\" begin ceasefire negotiations after what he described as an \"excellent\" call with Russian President Vladimir Putin that lasted more than two hours.",
    "Trump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.",
    "\"The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,\" Trump said in a social media post.",
    "The conversations came after the White House said the U.S. leader has grown \"frustrated\" with both leaders over the continuing war in Ukraine.",
    "After the call, Putin said Russia was ready to continue discussing an end to the fighting, but he indicated there was no major breakthrough in what he termed a \"very informative and very frank\" conversation with Trump.",
    "Putin said the warring countries should \"find compromises that would suit all parties.\"",
    "\"At the same time, I would like to note that, in general, Russia's position is clear.",
    "The main thing for us is to eliminate the root causes of this crisis,\" the Russian president said.",
    "Trump has struggled to end a war that began with Russia's invasion in February 2022.",
    "That makes these conversations a serious test of his reputation as a deal maker after having claimed he would quickly settle the conflict once he was back in the White House, if not even before he took office.",
    "Trump expressed his hopes for a \"productive day\" Monday - and a ceasefire - in a social media post over the weekend.",
    "His effort will also include calls to NATO leaders.",
    "But ahead of the call, Vice President JD Vance said Trump is \"more than open\" to walking away from trying to end the war if he feels Putin isn't serious about negotiation.",
    "\"He's grown weary and frustrated with both sides of the conflict,\" White House press secretary Karoline Leavitt told reporters Monday ahead of the call.",
    "\"He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.\"",
    "The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
    "\"I'd say we're more than open to walking away,\" Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
    "Vance said Trump has been clear that the U.S. \"is not going to spin its wheels here.",
    "We want to see outcomes.\"",
    "Trump's \"sensibilities are that he's got to get on the phone with President Putin, and that is going to clear up some of the logjam and get us to the place that we need to get to,\" said Trump's envoy, Steve Witkoff.",
    "\"I think it's going to be a very successful call.\"",
    "Still, there are fears that Trump has an affinity for Putin that could put Ukraine at a disadvantage with any agreements engineered by the U.S. government.",
    "Bridget Brink said she resigned last month as the U.S. ambassador to Ukraine \"because the policy since the beginning of the administration was to put pressure on the victim Ukraine, rather than on the aggressor, Russia.\"",
    "Brink said the sign that she needed to depart was an Oval Office meeting in February where Trump and his team openly berated Zelenskyy for not being sufficiently deferential to them.",
    "\"I believe that peace at any price is not peace at all,\" Brink said.",
    "\"It's appeasement, and as we know from history, appeasement only leads to more war.\"",
    "Trump's frustration about the war had been building before his post Saturday on Truth Social about the coming calls.",
    "Trump said his discussion with Putin would focus on stopping the \"bloodbath\" of the war.",
    "It also will cover trade, a sign that Trump might be seeking to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
    "Trump's hope, according to the post, is that \"a war that should have never happened will end.\"",
    "Vance said Trump would press Putin on whether he was serious about negotiating an end to the conflict, saying Trump doesn't believe he is and that Trump may wash his hands of trying to end the war.",
    "\"It takes two to tango,\" Vance said, adding that \"if Russia is not willing to do that, then we're eventually just going to have to say, this is not our war.",
    "It's Joe Biden's war, it's Vladimir Putin's war.\"",
    "His treasury secretary, Scott Bessent, said Sunday on NBC's \"Meet the Press\" that Trump had made it clear that a failure by Putin to negotiate \"in good faith\" could lead to additional sanctions against Russia.",
    "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
    "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
    "Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
    "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
    "Those talks ended Friday after less than two hours, without a ceasefire in place.",
    "Still, both countries committed to exchange 1,000 prisoners of war each, with Ukraine's intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
    "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
    "\"He and I will meet, and I think we'll solve it or maybe not,\" Trump told reporters after boarding Air Force One.",
    "\"At least we'll know.",
    "And if we don't solve it, it'll be very interesting.\"",
    "Zelenskyy met with Vance and Secretary of State Marco Rubio in Rome on Sunday, as well as European leaders, intensifying his efforts before the Monday calls.",
    "The Ukrainian president said on the social media site X that during his talks with the American officials, they discussed the negotiations in Turkey and that \"the Russians sent a low level delegation of non-decision-makers.\"",
    "He also said he stressed that Ukraine is engaged in \"real diplomacy\" to have a ceasefire.",
    "\"We have also touched upon the need for sanctions against Russia, bilateral trade, defense cooperation, battlefield situation and upcoming prisoners exchange,\" Zelenskyy said.",
    "\"Pressure is needed against Russia until they are eager to stop the war.\"",
    "The German government said Chancellor Friedrich Merz and French, British and Italian leaders spoke with Trump late Sunday about the situation in Ukraine and his upcoming call with Putin.",
    "A brief statement gave no details of the conversation, but said the plan is for the exchange to be continued directly after the Trump-Putin call.",
    "Witkoff spoke Sunday on ABC's \"This Week\" and Brink appeared on CBS' \"Face the Nation.\""
  ],
  "topics": {
    "Transport": 0.8332321643829346,
    "Diplomacy": 0.7824293971061707,
    "Conflict": 0.7589353322982788,
    "Environment": 0.7112143039703369,
    "Economy": 0.6470118761062622,
    "Politics": 0.6435453295707703,
    "Energy": 0.5952280759811401,
    "Culture": 0.5895251631736755,
    "Education": 0.5711649656295776,
    "Military": 0.5087946057319641,
    "Technology": 0.41483360528945923,
    "Health": 0.36620575189590454,
    "Crime": 0.34006068110466003,
    "Elections": 0.33286145329475403
  },
  "sentiment": {
    "positive": 0.442,
    "negative": 0.558,
    "neutral": 0.0
  }
}