{
  "title": "Trump, Putin agree to immediate talks for end of war between Ukraine, Russia",
  "published_date": null,
  "url": "https://www.upi.com/Top_News/US/2025/05/19/Trump-Putin-call/8541747641430/",
  "original_language": "en",
  "cleaned_sentences": [
    "May 19 (UPI) -- After a two-hour phone call with Russian President Vladimir Putin, U.S. President Donald Trump said Monday cease-fire negotiations to end the war in Ukraine will start immediately.",
    "Trump posted on Truth Social that he believed the call went \"very well.\"",
    "After the conversation, Trump said, he also spoke with Ukrainian President Volodymyr Zelensky, as well as European Union President Ursula von der Leyen, France's President Emmanuel Macron, Germany's Chancellor Friedrich Merz, and Finland's President Alexander Stubb.",
    "U.S. Secretary of State Marco Rubio joined in on the call with Trump and Putin while flying back from Rome, where he attended Pope Leo XIV's inauguration.",
    "Related \"Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War,\" the president wrote.",
    "\"The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of.\"",
    "Trump also said the \"Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations.",
    "Let the process begin!\"",
    "Zelensky, however, suggested Turkey or Switzerland as possible sites.",
    "Neither Putin nor Trump discussed a timeframe for a possible ceasefire, Kremlin presidential aide Yury Ushakov said.",
    "\"No, they didn't discuss that, although Trump naturally emphasized his interest in reaching some agreement as soon as possible,\" Ushakov said.",
    "At the Rose Garden, Trump told reporters and others: \"I said, 'When are we going to end this bloodshed, this blood bath?'",
    "It's a blood bath, and I do believe he wants to end it.\"",
    "Zelensky also is calling for further sanctions on the Russian banking and energy sectors.",
    "Trump said later Monday that he will not increase sanctions on Russia because \"there's a chance of getting something done.\"",
    "Putin said that he is willing to work on a \"memorandum on a possible future peace agreement\" with Ukraine.",
    "Speaking to journalists in Sochi, he did not elaborate on what that would look like.",
    "\"The U.S. president expressed his position on the cessation of hostilities, cease-fire, and from my end, I have emphasized that Russia stands for peaceful resolution of the Ukrainian crisis,\" according to a report by Russian state-run TASS.",
    "\"We just need to outline the most effective routes of moving towards peace.",
    "\"Russia's position is clear: The main thing for us is to eliminate the root causes of this crisis.\"",
    "Trump said he believes Putin wants peace.",
    "\"It's a terrible situation going on over there -- 5,000 young people every single week are being killed, so hopefully we did something,\" Trump said.",
    "\"We also spoke to the heads of most of the European nations, and we're trying to get that whole thing wrapped up.",
    "What a shame that it ever started in the first place.\"",
    "Russia invaded Ukraine in February 2023, and so far $66.5 billion in U.S. military aid has gone to the European nation.",
    "Other nations have also assisted.",
    "North Korea has sent troops to assist Russia.",
    "While campaigning for president the second time, Trump said he would end the war 24 hours after entering office.",
    "Trump had considered going to negotiations between Russia and Ukraine in Istanbul, Turkey, after his trip to the Middle East.",
    "Putin and Zelensky were initially supposed to negotiate directly but the Russian president didn't show up.",
    "Instead, lower-level officials met.",
    "It would have been the first high-level meeting since spring 2022 in Turkey after the war began.",
    "A prisoner exchange agreement was reached during the Istanbul meeting.",
    "Russian presidential aide Vladimir Medinsky, who led the Russian delegation at the talks, said he was satisfied with the negotiations' outcome.",
    "Russia said it will only sign a truce if Ukraine effectively surrenders, NBC reported.",
    "Ukraine said that is unacceptable.",
    "Ukrainian Foreign Minister Andrii Sybiha said the Istanbul meeting highlighted a \"stark difference\" between Moscow and Kyiv.",
    "\"Ukraine is forward-looking, focused on the full and immediate ceasefire to kickstart the real peace process,\" he posted on X on Monday.",
    "\"To the contrary, Russia is completely focused on the past, rejecting the cease-fire and instead talking constantly about the 2022 Istanbul meetings, attempting to make the same absurd demands as three years ago.\"",
    "State Department spokesperson Tammy Bruce said Rubio welcomed a prisoner exchange agreement reached during the Istanbul meeting and emphasized Trump's call for an immediate cease-fire.",
    "Trump told reporters of the peace effort last week: \"Nothing's going to happen until Putin and I get together, okay?\"",
    "U.S. Vice President JD Vance said Monday the United States is \"more than open to walking away\" from negotiations.",
    "\"We realize there's a bit of an impasse here,\" Vance told reporters , \"and I think the president's going to say to President Putin, 'Look, are you serious?",
    "Are you real about this?",
    "Because the proposal from the United States has always been, look, there are a lot of economic benefits to thawing relations between Russia and the rest of the world, but you're not going to get those benefits you keep on killing a lot of it is lot of innocent people.'\"",
    "The Trump administration has said Ukraine will have to forgo NATO membership and concede territory occupied by Russia.",
    "Zelensky said Ukraine won't withdraw troops from its own territories.",
    "\"If Russia sets conditions for the withdrawal of our troops from our land, it means that they do not want a ceasefire and they do not want the war to end,\" Zelensky told reporters.",
    "Ukraine wants security from the United States and other nations after the war ends.",
    "The U.S. has signed a deal to acquire rare mineral rights in Ukraine.",
    "Kyiv and its European backers are still pushing for a full 30-day ceasefire.",
    "European leaders spoke on Sunday ahead of the Putin-Trump call.",
    "A statement from Prime Minister Keir Starmer said he, along with the leaders of Italy, France and Germany, \"discussed the need for an unconditional cease-fire and for President Putin to take peace talks seriously.\"",
    "\"They also discussed the use of sanctions if Russia failed to engage seriously in a cease-fire and peace talks,\" 10 Downing Street said.",
    "French President Emmanuel Macron confirmed the quad-nation talks.",
    "\"Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional cease-fire proposed by President Trump and backed by Ukraine and Europe,\" the French president said on X. Italian Prime Minister Giorgia Meloni said they all support Trump's efforts for \"a just and lasting peace in Ukraine.\"",
    "Overnight Sunday, Russia launched dozens of drones at several Ukrainian cities.",
    "The Armed Forces of Ukraine said in a statement it \"neutralized\" 76 of the Iran-made Shahed-type drones, shooting down 41 of them.",
    "The other 35 were lost due to electronic warfare.",
    "From Saturday night into Sunday, Russia launched 273 drones at Ukraine, of which 88 were shot down and 128 lost, it said.",
    "The Washington-based Institute for the Study of War said the attack marked \"the largest single drone strike of the war.\""
  ],
  "topics": {
    "Politics": 0.952569842338562,
    "Conflict": 0.918103039264679,
    "Diplomacy": 0.9014469981193542,
    "Environment": 0.8999415636062622,
    "Culture": 0.8796167969703674,
    "Economy": 0.8713605403900146,
    "Education": 0.870957612991333,
    "Military": 0.8601772785186768,
    "Health": 0.8553975820541382,
    "Elections": 0.8430386185646057,
    "Technology": 0.82807457447052,
    "Energy": 0.804916501045227,
    "Transport": 0.7959420084953308,
    "Crime": 0.6968470811843872
  },
  "sentiment": {
    "positive": 0.475,
    "negative": 0.525,
    "neutral": 0.0
  }
}