{
  "title": "Trump administration live updates: Trump says Russia-Ukraine ceasefire talks to begin 'immediately'",
  "published_date": null,
  "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-putin-zelenskyy-biden-tariffs-doge-live-updates-rcna207451",
  "original_language": "en",
  "cleaned_sentences": [
    "What to know today - President Donald Trump said after his call with Russian President Vladimir Putin that Russia and Ukraine would \"immediately\" begin negotiating a potential ceasefire deal, though he seemed to back away from his comment Friday that the two leaders would need to meet in person.",
    "- The Supreme Court allowed the Trump administration to revoke legal protections for hundreds of thousands of Venezuelans, which could pave the way for their deportations.",
    "- The Justice Department tonight said it is charging Rep. LaMonica McIver, D-N.J., with assaulting law enforcement over an incident at an Immigration and Customs Enforcement detention center in Newark.",
    "Congressional Democrats called the charge politically motivated.",
    "- Former President Joe Biden thanked supporters on social media this morning following his cancer diagnosis, his first comment on his illness since it was announced yesterday.",
    "Coverage of this live blog has ended.",
    "For the latest news, click here.",
    "FBI leaders under pressure from MAGA voters to act on their corruption claims For years, Kash Patel and Dan Bongino have said the Biden administration and corrupt “deep state” actors “weaponized” the FBI against Trump.",
    "They accused the bureau of covering up what it knew about pipe bombs placed before the Jan. 6 attack.",
    "They suggested that FBI operatives helped ignite the Capitol riot.",
    "They said FBI agents committed crimes and tried to “overthrow” Trump.",
    "When Patel and Bongino did that, they weren’t just saying they disagreed with FBI investigative or prosecution decisions.",
    "They were accusing people of federal crimes.",
    "It would be illegal to investigate and prosecute someone because you didn’t like their political beliefs, which is what they are saying happened.",
    "And there is no evidence to support that.",
    "Now that the two men lead the FBI, Director Patel and Deputy Director Bongino find themselves in an awkward position.",
    "Large numbers of Trump supporters still believe all those things, and some are publicly asking: Why haven’t Bongino and Patel exposed the “truth” about the “deep state” they promised?",
    "Why isn’t the Trump administration arresting and prosecuting the people Patel labeled “government gangsters”?",
    "Senate advances a major crypto regulation bill on a bipartisan vote Reporting from Washington The Senate advanced a major cryptocurrency regulation bill today on a bipartisan vote two weeks after every Senate Democrat united to block it.",
    "The procedural vote on the GENIUS Act — which would establish the first regulatory framework for issuers of stablecoins, digital tokens pegged to fiat currencies like the U.S. dollar — was 66-32.",
    "Sixteen Democrats voted with the majority of Senate Republicans to advance the bill.",
    "Two Republicans, Sens.",
    "Rand Paul of Kentucky and Jerry Moran of Kansas, voted against it.",
    "The bill needed to cross the 60-vote threshold to advance to final passage in the Senate, where Republicans hold a three-seat majority.",
    "Senate confirms Trump-pardoned Charles Kushner as ambassador to France The Senate voted 51-45 tonight to confirm real estate developer Charles Kushner to be U.S. ambassador to France.",
    "Kushner is the father of Trump’s son-in-law Jared Kushner, who was a White House adviser during Trump’s first term.",
    "Trump pardoned Charles Kushner in 2020.",
    "He had pleaded guilty and was sentenced in 2005 in connection with federal charges of filing false tax returns, witness tampering and making illegal campaign donations.",
    "Democratic Sen. Cory Booker of New Jersey joined most Republicans in voting for Kushner's nomination.",
    "Republican Sen. Lisa Murkowski of Alaska voted against him.",
    "Justice Department releases full audio of Biden's interview with special counsel Robert Hur The Justice Department today filed a copy of the audio from special counsel Robert Hur’s interviews with then-President Joe Biden.",
    "NBC News and other news organizations had sued the Justice Department for the audio.",
    "The Justice Department released audio from the two days of interviews in 2023 — Oct. 8 and Oct. 9. justice.gov/storage/Biden-interview-with-Hur-part-2-October-9th.mp3Audio clips released last week confirmed memory lapses that White House officials denied at the time.",
    "At one point in the interviews, Biden struggled to remember the year his oldest son died.",
    "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility The Justice Department said it filed charges today against Rep. LaMonica McIver, D-N.J., alleging she assaulted law enforcement this month at an Immigration and Customs Enforcement facility in Newark.",
    "The acting U.S. attorney for New Jersey, Alina Habba, made the announcement on X, where she accused McIver of “assaulting, impeding and interfering with law enforcement.” McIver called the charges “purely political” in a statement and said she looks forward “to the truth being laid out clearly in court.” “Earlier this month, I joined my colleagues to inspect the treatment of ICE detainees at Delaney Hall in my district.",
    "We were fulfilling our lawful oversight responsibilities, as members of Congress have done many times before, and our visit should have been peaceful and short.",
    "Instead, ICE agents created an unnecessary and unsafe confrontation when they chose to arrest Mayor Baraka,” she said.",
    "Justice Department says it's investigating Chicago's mayor after his remarks about hiring Black officials The Justice Department’s Civil Rights Division said in a letter on social media today that it was opening up an investigation into the city of Chicago after Mayor Brandon Johnson made comments yesterday highlighting prominent Black officials in his administration.",
    "Assistant Attorney General Harmeet Dhillon wrote in the letter to Johnson that she had “authorized an investigation” into whether Chicago is “engaged in a pattern or practice of discrimination” following Johnson’s comments at the Apostolic Church of God.",
    "“If these kind of hiring decisions are being made for top-level positions in your administration, then it begs the question of whether such decisions are also being made for lower-level positions,” Dhillon wrote.",
    "The mayor's office did not immediately respond to a request for comment this evening.",
    "The Civil Rights Division has undergone a major transformation since Dhillon took over during Trump's second term, with one official calling an onslaught of departures “a complete bloodbath.” Trump allies shift from well-wishes to suggesting Biden hid his cancer diagnosis An initial wave of bipartisan sympathy for Joe Biden’s cancer diagnosis has started to ebb, giving way to suggestions from Trump’s allies that the former president’s inner circle masked his condition while he was in office to create an illusion that he was still up to the job.",
    "In a social media post yesterday showing a picture of Biden with the caption “Politics aside, we wish him a speedy recovery,” the president’s eldest son, Don Trump Jr., wrote, “Agreed 100%.” By today, he had posted a darker message: “Everyone was in on the coverup!",
    "Who was running the country?",
    "We need accountability!” President Trump and his MAGA movement have long charged that Biden was too enfeebled to serve and that a coterie of loyalists propped him up to hide the harsh reality from voters, an accusation his team has denied.",
    "Trump says he asked Putin to meet with him Speaking to reporters in the Oval Office this afternoon, Trump was asked whether he had asked Putin to meet with him.",
    "I talked to him about it,\" Trump said, adding that he asked Putin, \"When are we going to end this, Vladimir?\"",
    "Trump did not say whether Putin agreed to meet with him.",
    "Putin, who recently called for peace negotiations with Ukraine, did not take part in talks last week in Turkey.",
    "Rep. Lauren Underwood passes on Illinois Senate bid Rep. Lauren Underwood, D-Ill., announced today she would not join the race to replace outgoing Democratic Sen. Dick Durbin.",
    "In a statement on X, Underwood said she believed the most “powerful way” to combat the Trump administration's policies, including any plans to cut Medicaid, was to remain in the House and work to help Democrats take control of it in next year's midterm elections.",
    "Underwood said she would continue with recruiting efforts for the Democratic Congressional Campaign Committee.",
    "The race for Durbin's seat in deep-blue Illinois has already drawn a crowded Democratic primary.",
    "JB Pritzker has backed his lieutenant governor, Juliana Stratton, raising questions over whether it was a warning sign to keep other Democrats from competing.",
    "Two members of Congress, Reps. Robin Kelly and Raja Krishnamoorthi, have also launched campaigns.",
    "Trump expected to attend House Republican meeting tomorrow Trump is expected to appear in person at tomorrow morning’s House Republican Conference meeting, two sources with knowledge of the meeting’s agenda told NBC News.",
    "House Speaker Mike Johnson, R-La., aims to pass a massive bill for Trump's agenda this week.",
    "There are still major disagreements within the GOP conference over a host of issues, including cuts to Medicaid, reforms to the state and local tax deduction and the future of green energy tax credits passed under the Biden administration’s Inflation Reduction Act.",
    "The House Budget Committee advanced the legislation late last night after a group of conservatives had blocked it two days earlier.",
    "Those four Republicans voted \"present\" yesterday to allow the bill to move forward but with a warning sign that they want changes made to it.",
    "Trump has accused House Republicans who have voiced their displeasure with the package of being “grandstanders.” Punchbowl News was first to report Trump's expected appearance at tomorrow's meeting.",
    "Trump signs bill cracking down on explicit deepfakes Trump signed legislation today that will ban the nonconsensual online publication of sexually explicit images and videos that are both authentic and computer-generated.",
    "The “Take it Down Act” makes publishing such content illegal and would subject violators to mandatory restitution and criminal penalties, such as prison, fines or both.",
    "The law also subjects to criminal penalties people who make threats to publish the intimate visual depictions, some of which are created using artificial intelligence.",
    "President von der Leyen thanks Trump for Putin call while stressing the U.S. ‘stays engaged’ European Commission President Ursula von der Leyen said on X that Trump briefed her and several other European leaders on his call with Trump.",
    "Also on the call were Zelenskyy, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, Finnish President Alexander Stubb and German Chancellor Friedrich Merz.",
    "Von der Leyen thanked Trump for his efforts to bring a ceasefire while stressing that it is \"important\" that the United States \"stays engaged\" in talks and for Europe to stand behind Zelenskyy.",
    "Putin says his call with Trump was 'very informative and very open' Putin praised his conversation with Trump as \"very informative and very open.\"",
    "He said he thanked Trump for \"the U.S. support in resuming direct negotiations between Russia and Ukraine regarding the possible conclusion of a peace agreement.\"",
    "\"We agreed with the president of the United States that Russia would propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace treaty — with the definition of a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement, and so on,\" Putin said.",
    "Trump says Russia and Ukraine to 'immediately start negotiations' over ceasefire Trump said on Truth Social that his two-hour phone call with Putin went \"very well,\" adding that Russia and Ukraine \"will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.\"",
    "\"The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,\" the post continued.",
    "He said the negotiations would begin \"immediately.\"",
    "There have been previous efforts to bring the two sides together for talks, which did not result in a peace deal.",
    "Putin had called for peace talks with Ukraine, but he ultimately skipped the negotiations last week.",
    "Trump said the \"tone and spirit of the conversation were excellent,\" saying Putin wanted to work towards \"largescale TRADE\" after the war.",
    "\"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
    "Its potential is UNLIMITED,\" the post said.",
    "\"Likewise, Ukraine can be a great beneficiary on Trade, in the process of rebuilding its Country.\"",
    "Trump said he spoke to Zelenskyy and various European leaders after his conversation with Putin.",
    "He also said the Vatican expressed interest in hosting negotiations.",
    "Judge strikes down DOGE takeover of the U.S. Institute of Peace A federal district judge tossed out the takeover of the U.S. Institute of Peace by the Trump administration and the Department of Government Efficiency, declaring today that actions by “illegitimately-installed leaders” were “unlawful” and had to be declared “null and void.” U.S. District Judge Beryl Howell ruled that “the removal of USIP’s president, his replacement by officials affiliated with DOGE, the termination of nearly all of USIP’s staff, and the transfer of USIP property to the General Services Administration” were “effectuated by illegitimately-installed leaders who lacked legal authority to take these actions, which must therefore be declared null and void.” Bob Menendez co-defendants report to prison Two New Jersey businessmen who were convicted of bribing former Sen. Bob Menendez, D-N.J., reported to prison today.",
    "Fred Daibes reported to Federal Correctional Institution, Fairton, this morning to begin serving his 84-month sentence, according to a Bureau of Prisons spokesperson.",
    "Wael Hana, who was sentenced to 97 months, also surrendered at the same location to begin serving his time, said his attorney, Larry Lustberg.",
    "Daibes was convicted of giving Menendez gold bars and cash in a wide-ranging bribery scheme.",
    "Hana was convicted of giving bribes to Menendez, then head of the powerful Senate Foreign Relations Committee, in exchange for help securing a monopoly on a halal meat export business with Egypt.",
    "Menendez is expected to report to Federal Correctional Institution, Schuylkill, in Pennsylvania, on June 17.",
    "His wife, Nadine Menendez, who was convicted in a separate trial, is scheduled to be sentenced in the bribery case on Sept. 11.",
    "Supreme Court allows Trump to revoke protected status for thousands of Venezuelans The Supreme Court gave the Trump administration the green light today to revoke special legal protections for thousands of Venezuelan immigrants, which could pave the way for them to be deported.",
    "The high court granted an emergency application filed by the administration, meaning officials can move forward with reversing a decision made at the tail end of the Biden administration to extend protections for more than 300,000 Venezuelans under the federal Temporary Protected Status program.",
    "Britain's King Charles writes to Biden after his cancer diagnosis King Charles wrote to Biden following the former president's cancer diagnosis, Buckingham Palace said.",
    "Charles was diagnosed with cancer in February 2024, and the palace has kept much of the information about his condition private.",
    "The U.K.’s Press Association previously reported Charles’ message to Biden.",
    "Trump takes on Walmart over tariff price hikes Trump has put the spotlight on one of the largest U.S. retailers over whether prices are about to start ticking up due to the sizable tariffs that he has unilaterally enacted.",
    "Walmart has indicated that consumers will soon start seeing higher costs as Trump’s tariffs have begun to take effect.",
    "And retailers broadly have tried to warn consumers about impending price hikes.",
    "But the president has sought to aggressively counter those warnings, instead putting the blame for costs increases on U.S. companies and China, which still faces tariffs totaling more than 40% across the board on its exports to the U.S. Trump has said he’ll call CEOs over the issue — something he has already done with Amazon founder Jeff Bezos.",
    "CBS News chief steps down amid tensions over Trump lawsuit The president and CEO of CBS News said this morning that she is stepping down, marking another top departure from the organization within the past month as it contends with a $20 billion lawsuit from Trump and a high-profile merger.",
    "Wendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been “a privilege and joy,” but that the past few months had been “challenging.” Oncologist says Biden's cancer has likely been growing for years Dr. Ezekiel Emanuel, an oncologist who served on the Biden transition's Covid advisory board, said on MSNBC's \"Morning Joe\" that Biden's cancer has likely been growing for years.",
    "\"He's had this for many years, maybe even a decade, growing there and spreading,\" said the doctor, who is not a member of Biden's medical team.",
    "Emanuel said \"it's a little surprising\" that health records released during Biden's presidency did not show that he had had a prostate screening.",
    "He added that while tests of prostate-specific antigen levels in the blood often aren't done after age 70, Biden has been in public life a long time, and other presidents have had the test.",
    "\"It's a little surprising to many of us oncologists that he wasn't diagnosed earlier,\" he said.",
    "Emanuel said only a small percentage of people get diagnosed with prostate cancer as advanced as Biden's.",
    "The doctor said that the cancer is unlikely to be cured, though many treatments are available and the former president could \"live a long time.\"",
    "Pressed by host Joe Scarborough on whether Emanuel believed Biden has had cancer for several years, Emanuel said, \"Oh, more than several years.\"",
    "\"He did not develop it in that last hundred, 200 days,\" Emanuel added.",
    "\"He had it while he was president.",
    "He probably had it at the start of his presidency in 2021.",
    "Yes, I don't think there's any disagreement about that.\"",
    "Scalise: GOP bill will begin Medicaid work requirements in ‘early 2027’ House Majority Leader Steve Scalise, R-La., said on CNBC today that Republicans will revise their party-line domestic policy bill to trigger Medicaid work requirements earlier than the 2029 date they were eyeing in the existing legislation.",
    "“We’re coming to a much earlier date, early 2027, that we’re going to put in the bill in the Rules Committee this week,” he said.",
    "“So you’re going to see a much earlier date, giving Dr. [Mehmet] Oz the time he needs to implement the changes, but moving that date up dramatically.” Asked if he’ll lose any moderate Republican votes by moving up that date, Scalise said only that GOP leaders are “talking to all those members” about it, but that “everybody knew this was something that we were working on.” Trump invited the pope to the White House, Karoline Leavitt says In his meeting with Pope Leo XIV, Vice President JD Vance passed along a letter from Trump and the first lady extending “their warm wishes” to the Catholic leader and inviting him to the White House, the president's press secretary, Karoline Leavitt, told reporters at a news briefing this morning.",
    "Vance says the U.S. is 'more than open to walking away' from Russia-Ukraine talks Vance told reporters that he expects Trump will ask Putin whether he is serious about pursuing peace when the two world leaders talk this morning.",
    "\"The talks have been proceeding for a little while.",
    "We realize there's a bit of an impasse here,\" Vance said.",
    "\"And I think the president is going to say to President Putin, look, 'Are you serious?",
    "Are you real about this?'\"",
    "The vice president also emphasized that the U.S. is \"more than open to walking away\" from peace talks between the two countries.",
    "\"The United States is not going to spin its wheels here.",
    "We want to see outcomes,\" Vance said.",
    "He said that he was not sure Putin has a strategy for ending the war and that while Trump is willing to work through a history of mistrust between Russia and the West, \"that takes two to tango.\"",
    "\"We're going to try to end it, but if we can't end it, we're eventually going to say, 'You know what?",
    "That was worth a try, but we're not doing it anymore,'\" Vance said, referring to the war in Ukraine.",
    "Reaching a peace deal in Ukraine was a key campaign promise for Trump, though he said last month that his claim he could end the war on day one of his presidency was \"an exaggeration.\"",
    "Vance says Biden's cancer diagnosis casts doubt on whether he was healthy enough for the presidency Vice President JD Vance told reporters that he hopes Biden makes a full recovery after his cancer diagnosis Friday while continuing to cast doubt on whether he had been capable of serving as president.",
    "\"It sounds pretty serious, but hopefully he makes the right recovery,\" Vance told reporters.",
    "\"I will say whether the right time to have this conversation is now or at some point in the future.",
    "We really do need to be honest about whether the former president was capable of doing the job.\"",
    "The vice president said he did not think Biden \"was able to do a good job for the American people,\" not because of the former president's political views, but \"because I don't think that he was in good enough health.\"",
    "\"This is serious stuff, and this is the guy who carries around the nuclear football for the world's largest nuclear arsenal,\" Vance said.",
    "\"This is not child's play.",
    "And we can pray for good health, but also recognize that if you're not in good enough health to do the job, you shouldn't be doing the job.\"",
    "Lawmakers plan to meet in the wee hours Wednesday to consider Trump's agenda bill It may be a sleepless week for some lawmakers on the Hill.",
    "The House Rules Committee scheduled a meeting for 1 a.m. Wednesday to consider the Republican reconciliation package, which is comprised of many of the Trump administration's priorities.",
    "The meeting will mark the next crucial step for the legislation as lawmakers consider potential changes to the bill.",
    "By meeting overnight, the Rules Committee will have time during the day to process and debate changes to the package.",
    "House Speaker Mike Johnson, R-La., said yesterday that he wants to \"get this vote done by Thursday.\"",
    "Trump set to push Putin to end the ‘bloodbath’ in Ukraine in high-stakes phone call Trump is set to speak today with his Russian counterpart, Vladimir Putin, in what he said is an attempt to stop the “bloodbath” of the war in Ukraine.",
    "Trump said the call would be taking place at 10 a.m. — although he did not specify whether this was on Eastern Daylight Time or in another time zone.",
    "He said he would also be speaking with Ukrainian President Volodymyr Zelenskyy, as well as members of NATO.",
    "Trump to sign bill criminalizing explicit deepfakes and attend Kennedy Center board dinner Trump and first lady Melania Trump will participate in a bill signing this afternoon in the White House Rose Garden.",
    "Trump is set to sign the “Take It Down Act,” a bipartisan bill that targets explicit AI-generated deepfakes, which the first lady supported.",
    "Later in the day, the president will participate in a law enforcement event in the Oval Office and then join a Kennedy Center board dinner at the White House.",
    "Trump removed several Kennedy Center board members in February, replacing them with allies and installing himself as chairman of the organization.",
    "Since then, dozens of Kennedy Center employees have been fired, and Trump has set out on a mission to change the center’s programming.",
    "Key House committee advances Trump agenda bill after appeasing conservatives The House Budget Committee advanced Trump’s multitrillion-dollar domestic policy package last night, two days after a group of conservatives voted to reject it.",
    "The vote was 17-16 along party lines, with the four Republicans who opposed the bill in committee Friday voting “present.” The outcome is a positive sign for the massive party-line bill after a significant setback Friday, but it will still need changes before it secures the votes to pass the full House.",
    "And if it does, it will face plenty of challenges in the Senate, where Republicans have made it clear it won’t pass without major changes.",
    "Biden thanks supporters after his cancer diagnosis Biden thanked people this morning for their support following his prostate cancer diagnosis, his first comment on his illness since it was announced yesterday.",
    "\"Cancer touches us all.",
    "Like so many of you, Jill and I have learned that we are strongest in the broken places,\" Biden said in a post on X.",
    "\"Thank you for lifting us up with love and support.\"",
    "The post was accompanied by a picture of Biden with former first lady Jill Biden and their cat.",
    "The former president is smiling, while the former first lady wore a subdued expression as she held their pet.",
    "Biden diagnosed with aggressive form of prostate cancer Biden has been diagnosed with prostate cancer, his personal office announced yesterday.",
    "“Last week, President Joe Biden was seen for a new finding of a prostate nodule after experiencing increasing urinary symptoms,” his personal office said in a statement.",
    "“On Friday he was diagnosed with prostate cancer, characterized by a Gleason score of 9 (Grade Group 5) with metastasis to the bone.” Former Vice President Kamala Harris said she and former second gentleman Doug Emhoff are keeping the Bidens “in our hearts and prayers.” Former President Barack Obama said he is praying “for a fast and full recovery” and credited Biden for spearheading efforts to reduce cancer deaths.",
    "New Jersey Democrats vow to fight Trump in final gubernatorial debate The top Democratic candidates running for governor in New Jersey faced off in their final debate last night before next month’s primary, in which they vowed to take on Trump and laid out why they are best positioned to win in November.",
    "What to expect from Trump's call with Putin Trump said in a Truth Social post Saturday that the content of his discussion with Putin will be “stopping the ‘bloodbath.’” “Hopefully it will be a productive day, a ceasefire will take place, and this very violent war, a war that should have never happened, will end,” he wrote.",
    "Trump said he would speak with Zelenskyy and various members of NATO after his call with Putin.",
    "U.S. Special Envoy Steve Witkoff said on “ABC This Week” yesterday that the call is likely to “clear up some of the logjam” on Russia-Ukraine ceasefire talks, which he predicted would be “successful.” Treasury Secretary Scott Bessent, meanwhile, said on NBC’s “Meet The Press” that Trump has made clear that the U.S. “will not hesitate to up the Russia sanctions along with our European partners” if Putin does not negotiate in good faith."
  ],
  "topics": {
    "Conflict": 0.8895036578178406,
    "Politics": 0.8462221622467041,
    "Culture": 0.8042144179344177,
    "Technology": 0.7961187362670898,
    "Economy": 0.7960138916969299,
    "Environment": 0.7731220126152039,
    "Crime": 0.7667320370674133,
    "Diplomacy": 0.7666643261909485,
    "Transport": 0.7627046704292297,
    "Health": 0.7510455846786499,
    "Energy": 0.7327458262443542,
    "Elections": 0.7037485241889954,
    "Education": 0.692092776298523,
    "Military": 0.5710169672966003
  },
  "sentiment": {
    "positive": 0.368,
    "negative": 0.632,
    "neutral": 0.0
  }
}