{
  "title": "European leaders, Trump agree that Russia's position on talks unacceptable",
  "published_date": null,
  "url": "https://www.nydailynews.com/2025/05/16/eruope-trump-putin-ceasefire-position/",
  "original_language": "en",
  "cleaned_sentences": [
    "By LLAZAR SEMINI and LORNE COOK, Associated Press TIRANA, Albania (AP) — European leaders have agreed with U.S. President Donald Trump that Russia’s position in ceasefire talks with Ukraine is unacceptable and they intend to coordinate a response, U.K. Prime Minister Keir Starmer said on Friday.",
    "Starmer spoke from Albania’s capital, Tirana, where leaders of dozens of European countries were gathered for the European Political Community, or EPC, summit attended by Ukrainian President Volodymyr Zelenskyy.",
    "“We just had a meeting with President Zelensky and then a phone call with President Trump to discuss the developments in the negotiations today, and the Russian position is clearly unacceptable,” Starmer told reporters.",
    "“As a result of that meeting with President Zelensky, under discussion with President Trump, we are now closely aligning and coordinating our responses and will continue to do so,” he said.",
    "He said that the decision with Trump was also agreed on with the leaders of France, Germany and Poland.",
    "Russia and Ukraine held their first first direct peace talks since the early weeks of Moscow’s full-scale invasion, which began on Feb. 24, 2022.",
    "The latest Russia-Ukraine talks were held in Turkey on Friday, but they ended after less than two hours, according to the Turkish Foreign Ministry and a Ukrainian official.",
    "Kyiv accused the Kremlin of introducing new “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory, according to the official, who spoke to The Associated Press on condition of anonymity because he wasn’t authorized to make official statements.",
    "Earlier, Zelenskyy had said that Ukraine is committed to ending the war, but urged dozens of European leaders to ramp up sanctions if Russian President Vladimir Putin continues to play for time in talks aimed at securing a truce.",
    "“Ukraine is ready to take all realistic steps to end this war,” Zelenskyy told leaders at the European summit.",
    "But he warned: “If it turns out that the Russian delegation really is just theatrical and can’t deliver any results today, the world must respond.” That reaction, he said, should include “sanctions against Russia’s energy sector and banks.” Starmer backed his call, saying in a summit speech that “Russia is dragging its feet and playing games.” “We must be prepared to follow through because if Russia won’t come to the negotiating table, Putin must pay the price,” he said.",
    "European leaders criticize Putin’s decision not to met Zelenskyy Zelenskyy’s remarks came after Putin declined to attend face-to-face talks.",
    "“I think Putin made a mistake by sending a low-level delegation,” NATO Secretary-General Mark Rutte said as he arrived for the summit under a steady drizzle.",
    "“The ball is clearly in his part of the field now, in his court.",
    "He has to be serious about wanting peace.” European Union foreign policy chief Kaja Kallas said that Putin was “playing games, which shows that they are not serious about peace.” European Commission President Ursula von der Leyen said that it was clear that “President Zelenskyy was ready to meet but President Putin never showed up, and this shows his true belief.",
    "So we will increase the pressure.” Von der Leyen said that the EU is preparing a new package of sanctions.",
    "She said that the measures will target the shadow fleet of aging cargo vessels that Russia is using to bypass international sanctions and the Nord Stream pipeline consortium.",
    "Russia’s financial sector would also be targeted, she said.",
    "EU envoys have been working on the new sanctions package for several weeks, and the bloc’s foreign ministers could enact them as soon as Tuesday.",
    "Italian Premier Giorgia Meloni stressed that efforts to reach a deal on Ukraine must continue.",
    "“I think … that we must not throw in the towel.",
    "I think we must insist, we must insist for an unconditional ceasefire and a serious peace agreement that includes guarantees of security for Ukraine,” she said.",
    "Summit a chance for bilateral meetings The theme of the summit in Tirana was “New Europe in a new world: unity — cooperation — joint action.” The gathering of leaders from about 50 nations and organizations was also addressing ways to improve the continent’s competitiveness and tackle unauthorized migration.",
    "But the summit best serves as a setting for leaders to meet bilaterally, or in small groups, to weigh in on major security issues.",
    "The inaugural summit in Prague in 2022 saw the leaders of Azerbaijan and Armenia holding rare talks in an effort to ease tensions between the longtime adversaries.",
    "The last summit, hosted by Hungarian Prime Minister Viktor Orbán, an ardent supporter of Trump, was dominated by the concerns and opportunities that might arise in the wake of Trump’s reelection.",
    "The leaders arrived in Tirana’s central Skanderbeg Square on a rainy morning and were greeted by a brief performance by dancers in folk costumes before heading into the temporary conference hall, set up at the foot of a monument to Albania’s national hero Gjergj Kastrioti Skenderbeu, or Skanderbeg, who fought against the Ottoman Empire.",
    "Albania hosts a major summit days after election The summit comes after the governing Socialist Party of the host, Prime Minister Edi Rama, won Albania’s May 11 parliamentary election, attracting voters who support the country’s long and somewhat uphill effort to join the EU.",
    "The vote secured a fourth term for Rama.",
    "The prime minister said that the summit is a point of pride for Albania, and an “inspiration and motivation to continue further on.” His Socialist Party says it can deliver EU membership in five years.",
    "The EPC forum is Macron’s brainchild, and was backed by former German Chancellor Olaf Scholz, aiming to boost security and prosperity across the continent.",
    "But critics claimed it was an attempt by them to put the brakes on EU enlargement.",
    "The 2022 inaugural summit involved the EU’s 27 member countries, aspiring partners in the Balkans and Eastern Europe, as well as neighbors like the U.K. — the only country to have left the EU — and Turkey.",
    "Russia is the one major European power not invited, along with Belarus, its neighbor and supporter in the war with Ukraine.",
    "The next meeting will take place in Denmark later this year.",
    "Lorne Cook reported from Brussels."
  ],
  "topics": {
    "Diplomacy": 0.8369666934013367,
    "Conflict": 0.8229187726974487,
    "Environment": 0.7181414365768433,
    "Energy": 0.7136533260345459,
    "Culture": 0.6949427723884583,
    "Politics": 0.6927627921104431,
    "Transport": 0.6914699077606201,
    "Economy": 0.6472362279891968,
    "Education": 0.6187732815742493,
    "Technology": 0.6046315431594849,
    "Military": 0.600185751914978,
    "Health": 0.5560619235038757,
    "Elections": 0.5521957874298096,
    "Crime": 0.4090496599674225
  },
  "sentiment": {
    "positive": 0.556,
    "negative": 0.444,
    "neutral": 0.0
  }
}