{
  "title": "Ukraine and Russia exchange hundreds of prisoners, part of the biggest swap of the war",
  "published_date": null,
  "url": "https://edition.cnn.com/2025/05/23/europe/ukraine-and-russia-biggest-prisoner-exchange-war-intl",
  "original_language": "en",
  "cleaned_sentences": [
    "Russia and Ukraine have completed the first phase of what is expected to be the biggest prisoner exchange since the start of the war, with almost 800 people released on Friday.",
    "The swap started on Friday and will continue on Saturday and Sunday, with Kyiv and Moscow expected to swap 2,000 people – 1,000 from each side.",
    "The agreement to release 1,000 prisoners on each side was the only significant outcome of the meeting between Kyiv and Moscow in Istanbul last week, which marked the first time the two sides have met directly since soon after Russia’s full-scale unprovoked invasion of Ukraine in February 2022.",
    "“We are bringing our people home,” Ukraine’s President Volodymyr Zelensky said on X, adding that 390 people arrived back to Ukraine on Friday.",
    "He said the group included 270 military and 120 civilians.",
    "The Ukrainian Coordination Center for Treatment of Prisoners of War said three women and 387 men were among those released on Friday.",
    "The Russian Ministry of Defense said in a statement that “270 Russian servicemen and 120 civilians” were returned to Russia.",
    "It said the civilians were captured by Ukrainian troops in Kursk, the Russian region to which Ukraine launched a surprise incursion last summer.",
    "Russia has since reclaimed most of the territory.",
    "However, Zelensky said later that the Russian civilians returned by Ukraine were “Russian saboteurs and collaborators” who were arrested by Ukrainian law enforcement officers.",
    "As in previous exchanges, the released prisoners were brought to a meeting place in several buses after being released by Russia at the Ukrainian border.",
    "Many were given Ukrainian flags and bracelets in Ukrainian colours at the border.",
    "Photos and videos released by the Ukrainian government showed dozens of men wearing military fatigues, most of them with their heads shaved, posing wrapped in flags.",
    "Several of the released men could be seen speaking to their loved ones over the phone, some breaking into tears as they hear the voices on the other side.",
    "One video showed people from villages along the route of the convoy coming out with flags, greeting the returnees.",
    "“I feel joy because I’m home, that’s all.",
    "I’m happy for you, for us, that we came… we prayed and asked for this to happen,” Vasyl Gulyach, who spent two and a half years in captivity, told CNN.",
    "CNN also spoke to Anton Kobylnyk, a 29-year-old who spent over three years in captivity.",
    "“I am yours, I received your letter,” he told his girlfriend Yulia on the phone.",
    "“What you have done, waiting for me for these 37 months, is a very great feat on your part and an invaluable contribution to our relationship,” he told her.",
    "At the same time, Russian soldiers who have been taken prisoner by Ukraine were handed over to Russian authorities at the border.",
    "On the Ukrainian side, dozens of people waited for hours to greet the returnees at a meeting place in Chernihiv region in northern Ukraine, many hoping to see their family members among those being brought back.",
    "Many brought Ukrainian flags and photographs of their loved ones – in case any of the returnees would recognize them and give them information about their whereabouts.",
    "As they waited, air raid sirens sounded across Ukraine, indicating that a Russian attack could be imminent.",
    "Thousands of Ukrainian civilians have been snatched by Russian authorities in occupied Ukraine and deported into Russia where they have been held without charge or trial.",
    "Their status is complicated – because they have been detained illegally, Ukraine sees them as civilian hostages.",
    "Russia has, in some cases, claimed that they should be recognized as prisoners of war – something Kyiv has been reluctant to do because it could put civilians living in occupied areas of Ukraine at risk of being arbitrarily detained.",
    "Agreement struck at the Istanbul meeting Ukrainian and Russian authorities were not expected to publicly state that it was taking place until after it had been completed.",
    "However, US President Donald Trump broke that convention on Friday, announcing the swap on social media as it was unfolding.",
    "The Istanbul meeting was initially proposed by Russian President Vladimir Putin in response to a ceasefire-or-sanctions ultimatum given to Moscow by Kyiv’s European allies – which many saw as a clear attempt by the Kremlin leader to distract and delay.",
    "But while the return of hundreds of Ukrainian detainees will come as a huge relief to their families and loved ones, it remains somewhat underwhelming as the only tangible outcome of the highly touted meeting.",
    "In his daily address, Zelensky said Friday’s prisoner exchange was the “only significant result” of last week’s meeting in Turkey, adding that Russia was blocking “everything else.” Prisoner swaps have been happening regularly, most recently earlier this month.",
    "The Ukrainian Coordination Center for Treatment of Prisoners of War said the exchange on May 7, which saw more than 200 Ukrainian service members return home, was the fifth swap this year and the 64th since the beginning of Russia’s full-scale invasion.",
    "The department said at the time that at 4,757 Ukrainian citizens have been released since March 2022.",
    "Ukraine and its allies demanded that Russia agree to an immediate and unconditional ceasefire in Istanbul, but that did not happen.",
    "Kyiv also offered direct talks between Zelensky and his Russian counterpart Vladimir Putin."
  ],
  "topics": {
    "Diplomacy": 0.5278832912445068,
    "Conflict": 0.41943246126174927,
    "Culture": 0.3504268229007721,
    "Energy": 0.31371384859085083,
    "Economy": 0.3076836168766022,
    "Environment": 0.30339643359184265,
    "Politics": 0.29333585500717163,
    "Technology": 0.2928045988082886,
    "Transport": 0.21395546197891235,
    "Military": 0.17982950806617737,
    "Crime": 0.13816173374652863,
    "Health": 0.1072995662689209,
    "Education": 0.09679624438285828,
    "Elections": 0.07222344726324081
  },
  "sentiment": {
    "positive": 0.361,
    "negative": 0.639,
    "neutral": 0.0
  }
}