{
  "title": "Putin skips out on the direct Ukraine peace talks that he suggested",
  "published_date": null,
  "url": "https://www.nbcnews.com/world/ukraine/putin-trump-zelenskyy-ukraine-russia-peace-turkey-istanbul-ankara-rcna206961",
  "original_language": "en",
  "cleaned_sentences": [
    "ISTANBUL — High-stakes peace talks Thursday between Russia and Ukraine that were called for by Vladimir Putin hit speed bumps as the Kremlin confirmed he would be skipping the negotiations and President Donald Trump added that \"nothing\" would happen unless he and his Russian counterpart attended.",
    "Uncertainty over the start date, location and whether either side would even participate made for chaotic scenes in the Turkish capital, Ankara, as well as in Antalya and Istanbul — where some 200 journalists and crew were massed outside the Ottoman-era Dolmabahçe Palace with no clear idea of when talks would get underway.",
    "The talks were later postponed for Friday.",
    "The build-up to Thursday's talks had included a back and forth between Kyiv, Moscow and the Trump administration which hinted at the possibility of a three-way meeting involving Trump, Putin and Ukrainian President Volodymyr Zelenskyy.",
    "That did not ultimately materialize.",
    "While speaking to reporters on Air Force One en route to the United Arab Emirates, Trump was asked about the level of the delegation Russia sent to Turkey.",
    "“Look, nothing’s going to happen until Putin and I get together, OK?” he said, adding that Putin did not lead the delegation because Trump had chosen not to attend.",
    "“He wasn’t going if I wasn’t there.” Later on Thursday, Secretary of State Marco Rubio said that he would meet with the Ukrainian delegation in Istanbul on Friday.",
    "Echoing Trump's comments, he reaffirmed that the involvement of both Trump and Putin would be \"the only way we're going to have a breakthrough\" in the war.",
    "Rubio said the U.S. will decide on a timeline for a possible meeting between Trump and Putin after the Friday talks, adding that the president is willing to “stick with” the process as long as it takes to achieve peace.",
    "Prior to Rubio's comments, Kremlin spokesperson Dmitry Peskov had told CNN “no,” when asked whether Putin would be attending talks in Turkey, and had separately said at the time that there were “no preparations” for talks between Putin and Trump in the coming days.",
    "Putin made the suggestion for negotiations “without any preconditions” after Ukrainian allies, including Germany, France and Britain presented an ultimatum to Moscow to either accept the ceasefire proposal or face additional sanctions.",
    "The Russian leader's no-show is expected to further antagonize the White House, which has markedly changed its tone over the war in the past weeks.",
    "After his historic Oval Office shouting match with Zelenskyy, Vice President JD Vance has shifted to accusing Moscow of “asking for too much” in the bilateral peace talks senior Trump administration officials have held with Russia in recent weeks.",
    "That is partly because Trump’s major gripe with Ukraine — that American taxpayers have mostly funded its defense — was soothed after the two nations struck a minerals deal that would go some way to repaying American military aid.",
    "Zelenskyy has also presented himself as compliant, backing Trump’s calls for an immediate 30-day ceasefire between Ukraine and Russia.",
    "Trump has said he is “always considering” additional sanctions against Russia if he believes Moscow is blocking the peace process, with officials also suggesting secondary sanctions on the buyers of Russian oil.",
    "After heeding Trump’s calls to accept Putin’s initial suggestion of talks Sunday, Zelenskyy landed Thursday in Ankara.",
    "Before a planned meeting with Turkish President Recep Tayyip Erdogan, Zelenskyy said he would meet with a broader Turkish delegation, as well as American diplomats.",
    "“The level of the Russian delegation is not officially known to me yet, but from what we see — it looks like not a serious level,” Zelenskyy said, using a Ukrainian word meaning \"sham\" or \"theatrical.\"",
    "“We must understand the level of the Russian delegation and what mandate they have — whether they are even capable of making any decisions on their own,” he added, “because we all know who actually makes decisions in Russia.” That was instead of joining the talks initially planned for Istanbul, after the Kremlin indicated late Wednesday that rather than Putin, or even Foreign Minister Sergei Lavrov, it was instead sending a relatively junior team headed by Kremlin aide Vladimir Medinsky and Deputy Foreign Minister Mikhail Galuzin.",
    "While the Kremlin's last-minute naming of a junior team has done little to dispel Ukrainian and European allegations that Putin is not taking Trump's peace-brokering attempts seriously, the Russian delegation that arrived Thursday in Istanbul was “ready for serious work,” the Russian Foreign Ministry's Maria Zakharova said at a news briefing the same day.",
    "Ukraine responded to the scaling-down of the talks by vascillating over whether it would even send a delegation to Istanbul, as Kyiv and Moscow appeared to disagree over the start time of talks.",
    "While Russian media initially reported a 10 a.m. local time start (3 a.m.",
    "ET) at the Dolmabahçe Palace, that shifted to midday and then after 5 p.m, before being postponed to Friday.",
    "Further illustrating the confusion in Istanbul, American personnel were seen late Thursday morning still appearing to prepare a venue for a U.S. delegation to use as a base, with officials huddled in urgent meetings and two security staff arriving with a German shepherd dog.",
    "Keir Simmons and Natasha Lebedeva reported from Istanbul, and Mithil Aggarwal from Hong Kong."
  ],
  "topics": {
    "Diplomacy": 0.95818692445755,
    "Conflict": 0.9480116963386536,
    "Politics": 0.9474511742591858,
    "Environment": 0.9204406142234802,
    "Culture": 0.905925452709198,
    "Technology": 0.8988915085792542,
    "Transport": 0.8849432468414307,
    "Energy": 0.8809777498245239,
    "Elections": 0.8606812357902527,
    "Economy": 0.8490250706672668,
    "Military": 0.8413649797439575,
    "Education": 0.8285598158836365,
    "Health": 0.8075211048126221,
    "Crime": 0.7381543517112732
  },
  "sentiment": {
    "positive": 0.333,
    "negative": 0.667,
    "neutral": 0.0
  }
}