{
  "title": "Rubio says U.S. will find out if Russia is \"tapping us along\" soon amid push for ceasefire in Ukraine",
  "published_date": null,
  "url": "https://www.cbsnews.com/news/rubio-says-u-s-will-find-out-if-russia-is-tapping-us-along-soon-amid-push-for-ceasefire-ukraine/",
  "original_language": "en",
  "cleaned_sentences": [
    "Rubio says U.S. will find out if Russia is \"tapping us along\" soon amid push for ceasefire in Ukraine Secretary of State Marco Rubio spoke on the phone Saturday with his Russian counterpart, Sergey Lavrov, to get a readout on the latest talks, as the U.S. tries to determine whether Russia is \"tapping us along\" in efforts to end the war in Ukraine.",
    "\"We talked about a variety of things,\" Rubio told \"Face the Nation with Margaret Brennan\" in an interview airing Sunday.",
    "\"I wanted to get his readout on his view of how the talks went yesterday.",
    "They were not a complete waste of time.\"",
    "The phone call between the countries' top diplomats occurred a day after Moscow and Kyiv held the first direct talks in three years.",
    "Russian President Vladimir Putin spurned Ukrainian President Volodymyr Zelenskyy's offer to meet face-to-face in Turkey after he proposed direct negotiations and instead sent a lower-level delegation.",
    "The talks in Istanbul Friday broke up after fewer than two hours without a ceasefire, although both sides agreed on exchanging 1,000 prisoners of war each.",
    "The United States — along with its European allies — have been pushing Russia and Ukraine for an end to the three-year war.",
    "President Trump, who has expressed frustration with the stalled talks and threatened to stiffen American sanctions unless progress is made toward a peace deal, said Saturday he will be speaking with Putin by phone Monday.",
    "That call will be followed by one with Zelenskyy, Mr. Trump said.",
    "\"Are they tapping us along?",
    "Well, that's what we're trying to find out,\" Rubio told Brennan when asked if Russia and Ukraine are seeking to talk to \"buy time.\"",
    "\"We'll find out pretty soon.\"",
    "He added, \"On the one hand, we're trying to achieve peace and end a very bloody, costly and destructive war.",
    "So, there's some element of patience that is required.",
    "On the other hand, we don't have time to waste.",
    "There are a lot of other things happening in the world that we also need to be paying attention to.\"",
    "The secretary of state said he believes the only way that these talks will move forward is if Mr. Trump and Putin meet in person.",
    "He said Mr. Trump has publicly offered to meet one-on-one.",
    "\"The mechanics of setting that kind of meeting up would require a little bit of work, so I can't say that's being planned as we speak in terms of picking a site and a date,\" Rubio said.",
    "\"But the president wants to do it.",
    "He wants to do it as soon as feasible.\"",
    "The Vatican has made a \"very generous offer\" to host any peace talks.",
    "Rubio, who is in Rome to attend the Mass for the inauguration of Pope Leo XIV Sunday, said the Vatican would be a place that \"all parties would feel comfortable.\"",
    "Leo, who was elected as the first U.S.-born pope on May 8, took up Pope Francis' call for peace in Ukraine in his first Sunday noon blessing as pope.",
    "He appealed for all sides to do whatever possible to reach \"an authentic, just and lasting peace.\""
  ],
  "topics": {
    "Culture": 0.9589197635650635,
    "Conflict": 0.952140748500824,
    "Politics": 0.9373436570167542,
    "Diplomacy": 0.9231069684028625,
    "Technology": 0.9073272347450256,
    "Economy": 0.9036774039268494,
    "Health": 0.8890469670295715,
    "Energy": 0.8842877745628357,
    "Military": 0.8727830648422241,
    "Transport": 0.8667383790016174,
    "Environment": 0.8653573393821716,
    "Elections": 0.8231693506240845,
    "Crime": 0.8041322231292725,
    "Education": 0.7729855179786682
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}