{
  "title": "GOP congressman confirms Hegseth ordered pause in cyber operations against Russia, despite Pentagon denial",
  "published_date": null,
  "url": "https://www.cbsnews.com/news/gop-congressman-don-bacon-hegseth-ordered-pause-cyber-operations-against-russia/",
  "original_language": "en",
  "cleaned_sentences": [
    "GOP congressman confirms Hegseth ordered pause in cyber operations against Russia, despite Pentagon denial Washington — Republican Rep. Don Bacon of Nebraska said the U.S. government halted cyber operations against Russia for one day in February as President Trump was trying to negotiate an end to the Russia-Ukraine war, confirming CBS News reporting at the time and undercutting statements of denial from the Defense Department.",
    "\"I actually dug into this whole matter.",
    "I just want to address it: It was a one-day pause, which is typical for negotiations,\" said Bacon, chair of the House Armed Services cyber subcommittee, during a hearing on Capitol Hill on Friday.",
    "\"That's just about as much as I can say.",
    "It was a one-day pause.\"",
    "In March, multiple U.S. officials told CBS News that Defense Secretary Pete Hegseth had issued a directive to U.S. Cyber Command to pause cyber operations against Russia, including those that were the most provocative.",
    "At the time, the duration of the pause was unknown.",
    "In response to reports about the pause, the Pentagon's rapid response team posted on March 4 on X that Hegseth \"has neither canceled nor delayed any cyber operations directed against malicious Russian targets and there has been no stand-down order whatsoever from that priority.\"",
    "Two sources familiar with Hegseth's order said the pause directive lacked specificity.",
    "It's not clear how the order about planning was interpreted.",
    "Multiple officials also told CBS News in March that strategizing for future operations was never paused and that U.S. cyber policy on Russia \"is very much intact\" and remains at the same level, one of the officials said.",
    "Bacon's remarks are the first on-the-record acknowledgment of the directive's existence, which was first reported in February by The Record, a cybersecurity news publication.",
    "It's not uncommon for certain military operations to be paused during sensitive negotiations between countries.",
    "Both Democratic and Republican administrations have halted operations to prevent U.S. intentions from being misconstrued and to keep diplomacy on track.",
    "In addition to the Pentagon's statement on X, the Trump administration stonewalled inquiries on the matter and continued to deny any pause was ordered.",
    "A senior U.S. defense official at the Defense Department declined to answer questions from CBS News at the time when asked about the reported pause.",
    "In Friday's House hearing, the statement from DOD Rapid Response was called out by Army veteran and Democratic Rep. Eugene Vindman, who accused the Pentagon of lying about the pause directive.",
    "\"What I would like to do is basically point out that that statement by DOD Rapid Response was an outright lie,\" said the Virginia congressman.",
    "\"It was at least misleading.",
    "And that is not what the American people deserve, and that will be something that I intend to follow up with the secretary when he actually shows up.\"",
    "The Pentagon created the DOD Rapid Response account in February, and it is overseen by conservative podcaster and Army veteran Graham Allen, who is now the Pentagon's digital media director.",
    "The account commonly attacks news publications and posts comments criticizing reporting about Hegseth and the Defense Department.",
    "The X account has omitted context from its statements, touting an increase in U.S. military recruiting numbers between February 2024 through February 2025, even though much of the period showing improved recruitment numbers occurred during the Biden administration, as CBS News' Confirmed team found.",
    "Trump administration officials have promised to run \"the most transparent Defense Department in history,\" but to date, the Pentagon has held just one formal briefing.",
    "Instead of regular press engagements, the Pentagon's modus operandi for official Defense Department communications is often to bypass legacy news media outlets and attack their reporting.",
    "Questions to the Pentagon were referred to U.S. Cyber Command, which told CBS News Friday that \"due to operational security concerns, we do not comment nor discuss cyber intelligence, plans, or operations.\""
  ],
  "topics": {
    "Diplomacy": 0.9963132739067078,
    "Politics": 0.8657117486000061,
    "Military": 0.8652551174163818,
    "Technology": 0.8168058395385742,
    "Conflict": 0.8134462237358093,
    "Culture": 0.7922338247299194,
    "Energy": 0.7157976627349854,
    "Economy": 0.7036259770393372,
    "Health": 0.6633909344673157,
    "Transport": 0.6595474481582642,
    "Crime": 0.6499822735786438,
    "Elections": 0.6411518454551697,
    "Environment": 0.6101759076118469,
    "Education": 0.3964157700538635
  },
  "sentiment": {
    "positive": 0.077,
    "negative": 0.923,
    "neutral": 0.0
  }
}