{
  "title": "Russia-Ukraine peace talks end after less than 2 hours",
  "published_date": null,
  "url": "https://www.nydailynews.com/2025/05/16/russia-ukraine-peace-talks-turkey/",
  "original_language": "en",
  "cleaned_sentences": [
    "By HANNA ARHIROVA, ANDREW WILKS and LORNE COOK, Associated Press ISTANBUL, Turkey (AP) — The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the fighting.",
    "Ukrainian President Volodymyr Zelenskyy said he discussed the results of the talks with U.S. President Donald Trump and the leaders of France, Germany, the U.K. and Poland.",
    "In a post on X from a European leadership meeting in Albania, he urged “tough sanctions” against Moscow if it rejects “a full and unconditional ceasefire and an end to killings.” At the brief Istanbul talks, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, according to the heads of both delegations, in what would be their biggest such swap.",
    "Both sides also discussed a ceasefire and a meeting between their heads of state, according to chief Ukrainian delegate, Defense Minister Rustem Umerov.",
    "Russian presidential aide Vladimir Medinsky, who headed Moscow’s delegation, said both sides agreed to provide each other with detailed ceasefire proposals and Ukraine requested the heads of state meeting, which Russia took under consideration.",
    "During the talks, a senior Ukrainian official said Russia introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
    "The official, who was not authorized to make official statements, spoke to The Associated Press on the condition of anonymity.",
    "The proposal had not been previously discussed, the official said.",
    "The Ukrainian side reiterated it remained focused on achieving real progress — an immediate ceasefire and a pathway to substantive diplomacy — “just like the U.S., European partners, and other countries proposed,” the official added.",
    "The two sides sat opposite each other at a U-shaped table in the Dolmabahce Palace but remained far apart in their conditions for ending the war.",
    "Trump, who has pressed both Moscow and Kyiv for an end to the conflict, said a meeting between himself and Russian President Vladimir Putin would happen “as soon as we can set it up.” “I think it’s time for us to just do it,” Trump told reporters in Abu Dhabi as he wrapped up a trip to the Middle East.",
    "Turkish Foreign Minister Hakan Fidan opened the talks by urging the delegates “to take advantage of this opportunity,” adding that it was “critically important that the ceasefire happens as soon as possible.” In a social media post afterward, Fidan described the POW swap as a “confidence-building measure” and said the parties had agreed in principle to meet again.",
    "Zelenskyy was in Tirana, Albania, with leaders of 47 European countries to discuss security, defense and democratic standards against the backdrop of the war.",
    "He met with French President Immanuel Macron, German Chancellor Friedrich Merz, U.K. Prime Minister Keir Starmer and Polish Prime Minister Donald Tusk.",
    "“Pressure on Russia must be maintained until Russia is ready to end the war,” Zelenskyy said on X, posting a photo of five leaders during the call, the second for the group since May 10.",
    "Diplomatic maneuvering Both countries engaged in diplomatic maneuvering this week as they tried to show Trump that they are eager to negotiate, although he has expressed frustration over the slow progress and threatened to punish foot-dragging.",
    "On Thursday, Putin spurned an offer by Zelenskyy to meet face-to-face in Turkey.",
    "Zelenskyy accused Moscow of not making a serious effort to end the war by sending a low-level delegation.",
    "Ukraine has accepted a U.S. and European proposal for a full, 30-day ceasefire, but Putin has effectively rejected it by imposing far-reaching conditions.",
    "Commenting on a possible Trump-Putin meeting, Kremlin spokesman Dmitry Peskov appeared to indicate that momentum for such a summit is building.",
    "He told reporters that top-level talks were “certainly needed,” but added that preparing a summit would take time.",
    "Fighting continues in Ukraine Russian forces, meanwhile, are preparing a fresh military offensive, Ukrainian government and Western military analysts say.",
    "A Friday morning drone attack on the northeastern Ukrainian city of Kupiansk killed a 55-year-old woman and wounded four men, said Oleh Syniehubov, head of the Kharkiv Regional Military Administration.. Russia’s invasion has killed more than 12,000 Ukrainian civilians, the U.N. says, and razed towns and villages.",
    "Tens of thousands of Ukrainian soldiers have died, and likely a larger number of Russian troops, officials and analysts say.",
    "On the battlefield, one Ukrainian soldier said he wasn’t hopeful that the talks would bring a swift end to the war.",
    "“I don’t think they will agree on anything concrete, because summer is the best time for war,” he said, using only the call sign “Corsair,” in accordance with the rules of the Ukrainian military.",
    "“The enemy is trying to constantly escalate the situation.” But he told AP that many of his comrades “believe that by the end of the year there will be peace, albeit an unstable one, but peace.” Before the talks, Ukrainian officials met with national security advisers from the U.S., France, Germany and the U.K. to coordinate positions, the senior Ukrainian official told AP.",
    "The U.S. team was led by retired Lt. Gen. Keith Kellogg, Trump’s special envoy to Ukraine and Russia, while Umerov and presidential office chief Andriy Yermak represented Ukraine, the official said.",
    "A three-way meeting between Turkey, the U.S. and Ukraine also took place, Turkish Foreign Ministry officials said.",
    "The U.S. side included Secretary of State Marco Rubio as well as Kellogg.",
    "On Thursday, Rubio said “we don’t have high expectations of what will happen” at the Russia-Ukraine talks.",
    "He said he believed a breakthrough was only possible is a meeting between Trump and Putin.",
    "Cook reported from Brussels.",
    "Associated Press writer Aamer Madhani in Dubai, United Arab Emirates, contributed."
  ],
  "topics": {
    "Conflict": 0.9252365231513977,
    "Diplomacy": 0.9028263688087463,
    "Energy": 0.8862330913543701,
    "Environment": 0.8849982023239136,
    "Military": 0.8621224164962769,
    "Technology": 0.8577272891998291,
    "Transport": 0.8232503533363342,
    "Economy": 0.8202177882194519,
    "Culture": 0.8000584244728088,
    "Crime": 0.7680416107177734,
    "Education": 0.741777241230011,
    "Health": 0.6956380009651184,
    "Politics": 0.6874101758003235,
    "Elections": 0.6409080028533936
  },
  "sentiment": {
    "positive": 0.382,
    "negative": 0.618,
    "neutral": 0.0
  }
}