{
  "title": "Trump and Putin discuss Ukraine war in high-stakes call",
  "published_date": null,
  "url": "https://www.bostonglobe.com/2025/05/19/world/trump-putin-discuss-ukraine-war-high-stakes-call/",
  "original_language": "en",
  "cleaned_sentences": [
    "BERLIN — President Vladimir Putin revealed no breakthroughs after a two-hour call with President Trump on Monday, telling reporters he was ready to negotiate a peace deal with Ukraine but repeating his demand for broad concessions before Russia stops fighting.",
    "Putin said he had told Trump that Russia was “ready to work with the Ukrainian side on a memorandum on a possible future peace agreement.” Putin said the conversation, the third known call between the presidents since Trump returned to the White House in January, was “very meaningful and quite frank.” But the Russian president made it clear that he was not budging from his basic resistance to an immediate cease-fire if it is not accompanied by concessions to Russia.",
    "At the end of his three-minute statement, Putin repeated his mantra that a peace deal needs to “remove the root causes of this crisis,” a reference to Russia’s demand for wide-ranging influence over Ukraine.",
    "“Russia is also in favor of a peaceful resolution to the Ukraine crisis,” Putin said in his brief statement to reporters in Sochi, Russia.",
    "“We just need to identify the most effective ways of moving toward peace.” Advertisement Shortly after Putin’s statement, Trump offered a more optimistic take on the call in a social media post, saying it “went very well,” and that Russia and Ukraine would “immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.” Putin said his aides might disclose more details of the call later in the day.",
    "He spoke to reporters at a center for gifted children that he was visiting Monday and where he held the call with Trump.",
    "Advertisement The call was highly anticipated, coming amid growing impatience in the Trump administration with Putin’s refusal to agree to an immediate cease-fire, despite Ukraine’s readiness to do so.",
    "Trump took office in January promising to bring a swift end to fighting in Ukraine, but soon encountered the deep and seemingly irreconcilable differences between the warring countries.",
    "Trump has turned to a combination of threats and inducements — most of them unfulfilled — to get Russia and Ukraine stop fighting.",
    "But both sides believe time is on their side.",
    "In his dealings with Trump, Putin has tried to appease the US president by appearing to negotiate peace, but without offering any meaningful concessions to Ukraine.",
    "Given his repeated claims that Russia has the means to obtain all its goals in the war, making concessions might risk making Putin look weak.",
    "On Monday, Vice President JD Vance questioned Putin’s position.",
    "“I’m not sure that Vladimir Putin has a strategy himself for how to unwind the war,” Vance told reporters on Air Force Two.",
    "“He’s got a million men under arms; he’s reengineered his entire economy.",
    "What used to be manufacturing facilities making products for people to use in their civilian life, they’re now making tank shells and artillery shells and drones.” The inherent contradictions of Putin’s strategy were on display over the weekend.",
    "In an apparent show of strength, Russia unleashed deadly drone strikes on civilian targets in Ukraine on Saturday and Sunday, even though Trump has criticized such attacks as counterproductive.",
    "On Saturday, Russian attacks killed at least 14 Ukrainian civilians.",
    "On Sunday, at least one civilian died after Russia targeted Kyiv, Ukraine, with one of the largest drone attacks of the war.",
    "Advertisement Trump has not commented on the latest attacks.",
    "In late April, however, he issued a rare rebuke of Putin for launching a similar attack.",
    "“I am not happy with the Russian strikes on KYIV.",
    "Not necessary, and very bad timing,” Trump wrote.",
    "“Vladimir, STOP!” Trump said in his post on Truth Social that after speaking to Putin on Monday he subsequently spoke to President Volodymyr Zelensky of Ukraine and his European allies.",
    "Prime Minister Keir Starmer of Britain said in a statement that he spoke with leaders of the United States, Italy, France, and Germany on Sunday night to discuss forcing Russia to accept an unconditional cease-fire, and the use of new sanctions “if Russia failed to engage seriously.” Ukraine and its European allies have been demanding that Russia accept an unconditional 30-day cease-fire before beginning peace negotiations.",
    "Putin has demanded the opposite, saying that negotiations over what he calls the “root causes” of the war must take place before his forces, who are on the offensive in Ukraine, lay down arms.",
    "Trump in effect had sided with Putin.",
    "Last week he publicly told Zelensky to start talks with Russia, precipitating a series of events that led to the meeting in Istanbul.",
    "The Kremlin doubled down on its insistence for negotiations before any cease-fire, hours before the call Monday, tempering expectations of a breakthrough.",
    "“There’s meticulous and perhaps, in some areas, prolonged work ahead,” Peskov told reporters, referring to a diplomatic solution to the war.",
    "Vance suggested that Trump on Monday may offer Putin economic incentives to accept some concessions on Ukraine, and move the peace talks forward.",
    "Advertisement Trump also focused on trade after the call.",
    "“Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree,” he wrote on Truth Social.",
    "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
    "Its potential is UNLIMITED.” This article originally appeared in The New York Times."
  ],
  "topics": {
    "Diplomacy": 0.9640253186225891,
    "Politics": 0.9523535370826721,
    "Conflict": 0.9305822849273682,
    "Economy": 0.9251736402511597,
    "Energy": 0.9183842539787292,
    "Culture": 0.916757345199585,
    "Environment": 0.9090498089790344,
    "Elections": 0.8939648866653442,
    "Transport": 0.8811058402061462,
    "Military": 0.8696132302284241,
    "Technology": 0.8510754108428955,
    "Education": 0.8388295769691467,
    "Crime": 0.8372129797935486,
    "Health": 0.8152024745941162
  },
  "sentiment": {
    "positive": 0.371,
    "negative": 0.629,
    "neutral": 0.0
  }
}