{
  "title": "Rookie Robert Shwartzman claims Indianapolis 500 pole",
  "published_date": null,
  "url": "https://www.bostonglobe.com/2025/05/18/sports/robert-shwartzman-indianapolis-500-pole/",
  "original_language": "en",
  "cleaned_sentences": [
    "INDIANAPOLIS — A rookie driver for a brand new team won the pole for the Indianapolis 500 on a strange day at Indianapolis Motor Speedway, where Team Penske was disqualified before the final two rounds of qualifying.",
    "Robert Shwartzman, a 25-year-old with dual nationality in Israel and Russia, became the first Indy 500 rookie to qualify on the pole since 1983 when he did it for Prema Racing with a four-lap average of 232.790 miles per hour.",
    "The last rookie to qualify on the Indy 500 pole was Teo Fabi.",
    "Coincidentally, he was an Italian — just like Prema, which also was founded in ’83.",
    "Prema is established in Europe and races in the Formula 2 series.",
    "It made its IndyCar debut this season.",
    "Shwartzman was born in Tel Aviv, Israel, and raised in Saint Petersburg, Russia.",
    "He began racing go-karts when he was 4 years old, and eventually, his budding career in motorsports took him to Italy and elsewhere in Europe.",
    "He initially raced under the Russian flag until the start of the war with Ukraine, when he changed to the Israeli, making him the first driver from Israel to make “The Greatest Spectacle in Racing.” He made an impassioned plea for peace in the Middle East, where Israel has been at war with Hamas-led Palestinian groups since 2023, and Eastern Europe, where Ukrainian President Volodymyr Zelenskyy met with top US officials Sunday ahead of a phone call Monday between President Donald Trump and Russian President Vladimir Putin aimed at ending their war.",
    "Advertisement “I just want peace in the world,” Shwartzman said.",
    "“I want people to be good, and I don’t want the separation of countries, saying, ‘This is bad country.",
    "This is good country.’ There is no bad or good.",
    "We’re all human beings, and we just have to support each other.",
    "We need to find ways to, let’s say, negotiate things.",
    "Find ways to agree on things, you know?",
    "Because from my experience, there is always, you know, a gold medal, I’m calling it — like, there’s always the right path.” Advertisement Prema is the first team making its debut in the Indy 500 to land on the pole since Mayer Motor Racing put Tom Sneva there in 1984.",
    "Shwartzman, who has never before raced on an oval, was mobbed by a sea of red-clad team members as soon as his pole-winning run became official.",
    "“Honestly it feels like I’m dreaming.",
    "I just had it in my dreams when I was going how would it feel to do such a good job in quali,” he said.",
    "It’s the main race of the year.",
    "Honestly it feels unbelievable.” Shwartzman had been pursuing a career in Formula 1 and was part of the Ferrari development program, as well as its reserve driver from 2021 until the end of last season — when Prema nabbed him for its two-car team.",
    "He was the fourth of six drivers to make their qualifying attempt and took the pole from Takuma Sato of Rahal Letterman Lanigan.",
    "He still had to wait for Pato O’Ward of McLaren and Felix Rosenqvist of Meyer Shank Racing to make their runs, and he nervously watched from pit lane.",
    "O’Ward went first and landed in the third spot.",
    "Rosenqvist dropped to fifth, sandwiched in the second row between Chip Ganassi Racing teammates Scott Dixon and Alex Palou.",
    "It was a strange finishing order as the Ganassi cars were expected to battle each other for the top starting spot in next Sunday’s race.",
    "Advertisement “Rookie on pole with Shwartzman — how wild does that get?",
    "I didn’t see that coming at all,” said 2008 winner Dixon.",
    "The pole was wide open for the taking first when Team Penske was disqualified from qualifying for an illegal modification on the cars of two-time defending Indy 500 winner Josef Newgarden and Will Power, and Scott McLaughlin destroyed his car in a Sunday morning crash during practice.",
    "The three Penske drivers all started on the front row last year, but will be 10th, 11th, and 12th in the fourth row together next weekend.",
    "That put the odds in Ganassi’s favor, but they had a surprising drop in speed from Saturday to Sunday.",
    "So then Sato, in his first race in nearly a year, sat atop the scoring pylon until Shwartzman’s shocking run.",
    "“I don’t even know what to say.",
    "The car felt amazing,” he said, ”Coming here for my first oval race, I couldn’t even expect to be in this position.",
    "Big thanks to everyone.",
    "Big thanks to the fans cheering for me.",
    "It’s unbelievable.” Shwartzman’s engineer is Eric Leichtle, who spent a season with Team Penske as the engineer for Newgarden in 2022.",
    "Leichtle left motorsports and spent the past two years working for SpaceX as a senior structures engineer."
  ],
  "topics": {
    "Environment": 0.98393315076828,
    "Culture": 0.9808615446090698,
    "Economy": 0.9738076329231262,
    "Conflict": 0.96722012758255,
    "Technology": 0.9657490849494934,
    "Transport": 0.9651795029640198,
    "Education": 0.964850127696991,
    "Elections": 0.9646077752113342,
    "Politics": 0.9637046456336975,
    "Diplomacy": 0.9601573348045349,
    "Health": 0.9543520212173462,
    "Energy": 0.9485716819763184,
    "Military": 0.9457114338874817,
    "Crime": 0.9290276169776917
  },
  "sentiment": {
    "positive": 0.632,
    "negative": 0.368,
    "neutral": 0.0
  }
}