{
  "title": "Rubio and other top NATO diplomats meet in Turkey ahead of possible Ukraine-Russia talks",
  "published_date": null,
  "url": "https://www.clickondetroit.com/news/world/2025/05/15/rubio-and-other-top-nato-diplomats-meet-in-turkey-ahead-of-possible-ukraine-russia-talks/",
  "original_language": "en",
  "cleaned_sentences": [
    "ANTALYA – NATO foreign ministers on Thursday debated an American demand to massively ramp up defense investment as the United States focuses on security challenges outside of Europe.",
    "At talks in Antalya, NATO Secretary-General Mark Rutte said more investment and military equipment are needed to deal with threats posed by Russia and terrorism but also by China, which has become the focus of U.S. concern.",
    "Recommended Videos “When it comes to the core defense spending, we need to do much, much more,” Rutte told reporters.",
    "He underlined that once Russia's war in Ukraine is over, Moscow could reconstitute its armed forces within three years to five years.",
    "U.S. Secretary of State Marco Rubio said “the alliance is only as strong as its weakest link.” He insisted that the U.S. demand for allies to invest 5% of their gross domestic product on defense over the next seven years is about “spending money on the capabilities that are needed for the threats of the 21st century.” The debate on defense spending is heating up before the summit of President Donald Trump and his NATO counterparts in the Netherlands on June 24-25.",
    "That gathering will set the course for future European security, including that of Ukraine.",
    "Further to that, Russian and Ukrainian delegations plan to hold their first direct peace talks in three years in Istanbul, even as Russian President Vladimir Putin spurned Ukrainian President Volodymyr Zelenskyy’s offer to meet face to face.",
    "Rubio said he would confer Friday in Istanbul with Turkish Foreign Minister Hakan Fidan and the Ukrainian delegation.",
    "He said the Russian delegation would be meeting with other members of the U.S. team and he hoped all the sides could come together.",
    "In other diplomacy, Rubio met with Syrian Foreign Minister Asaad al-Shaibani on the sidelines of the NATO meeting, underscoring support for lifting U.S. sanctions and welcoming Syria's “calls for peace with Israel,” the State Department said.",
    "NATO members consider defense spending plan The NATO sessions focused on a new spending plan in the works.",
    "As Russia’s war on Ukraine entered its second year, NATO leaders agreed in 2023 to spend at least 2% of gross domestic product on national defense budgets.",
    "So far, 22 of the 32 member countries have done so.",
    "The new plan is for all allies to aim for 3.5% of GDP on their defense budgets by 2032, plus an extra 1.5% on potentially defense-related things like infrastructure — roads, bridges, airports and seaports.",
    "While the two figures add up to 5%, factoring in infrastructure and cybersecurity would change the basis on which NATO traditionally calculates defense spending.",
    "The seven-year time frame is also short by the alliance’s usual standards.",
    "Rutte refused to confirm the numbers but acknowledged the importance of including infrastructure.",
    "It’s difficult to see how many members would reach a new 3.5% goal.",
    "Belgium, Canada, Croatia, Italy, Luxembourg, Montenegro, Portugal, Slovenia and Spain are not even spending 2% yet, though Spain expects to reach that goal this year, a year past the deadline.",
    "The U.S. demand would require investment at an unprecedented scale.",
    "But Trump has cast doubt over whether the U.S. would defend allies that spend too little — an incentive to do more, even as European allies realize that they must match the threat posed by Russia.",
    "A push for Europe to ensure its security Europe-wide, industry leaders and experts have pointed out challenges the continent must overcome to be a truly self-sufficient military power, chiefly its decades-long reliance on the U.S. as well as its fragmented defense industry.",
    "“There is a lot at stake for us,” Lithuanian Foreign Minister Kęstutis Budrys said.",
    "He urged NATO partners to meet the investment goals faster than the 2032 target \"because we see the tempo and the speed, how Russia generates its forces now as we speak.” British Foreign Secretary David Lammy said his country should reach 2.5% by 2027, and then 3% by the next U.K. elections planned for 2029.",
    "“It’s hugely important that we recommit to Europe’s defense and that we step up alongside our U.S. partners in this challenging geopolitical moment where there are so many precious across the world, and particularly in the Indo-Pacific,” he said.",
    "As an organization, NATO plays no direct security role in Asia, and it's unclear what demands the Trump administration might make of the allies as it turns its attention to China.",
    "The last NATO security operation outside the Euro-Atlantic area, its 18-year stay in Afghanistan, ended in chaos.",
    "Asked whether the next summit communique will underline that Russia still poses the greatest threat to NATO allies, Rutte said, \"We will see what is the best way to play that.” Questions also hang over the way the leaders will frame NATO's commitment to Ukraine.",
    "The war has dominated recent summits, with envoys struggling to find language that would further anchor the country to the alliance without actually allowing it to join.",
    "But this year, Washington has taken Ukraine's membership off the table.",
    "Trump has shown impatience with Zelenskyy and remains unclear whether the Ukrainian leader will be invited to the June meeting in The Hague.",
    "___ Cook reported from Brussels, and Fraser from Ankara, Turkey."
  ],
  "topics": {
    "Diplomacy": 0.9676575064659119,
    "Politics": 0.9657282829284668,
    "Military": 0.9490112066268921,
    "Economy": 0.9356482625007629,
    "Culture": 0.9220366477966309,
    "Conflict": 0.9202924966812134,
    "Elections": 0.9200358390808105,
    "Technology": 0.914510190486908,
    "Transport": 0.9130234122276306,
    "Energy": 0.9026807546615601,
    "Environment": 0.8905225992202759,
    "Education": 0.8802745342254639,
    "Health": 0.8685992360115051,
    "Crime": 0.7294368147850037
  },
  "sentiment": {
    "positive": 0.438,
    "negative": 0.562,
    "neutral": 0.0
  }
}