{
  "title": "Trump backs off meeting with Putin, calls for direct Ukraine-Russia talks",
  "published_date": null,
  "url": "https://www.nbcnews.com/world/russia/trump-set-implore-putin-end-bloodbath-ukraine-high-stakes-phone-call-rcna207612",
  "original_language": "en",
  "cleaned_sentences": [
    "President Donald Trump spoke with both Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy and other leaders in separate calls Monday, in an attempt to stop the “bloodbath” of the war in Ukraine.",
    "But the president’s outreach was inconclusive, and there was little sign of a breakthrough.",
    "Russia and Ukraine would hold direct talks on a ceasefire “immediately,” Trump said afterward in a post on his social network Truth Social, but it was unclear what form those talks would take or when they would happen.",
    "The Vatican, Trump said, has expressed interest in hosting the negotiations.",
    "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” he said.",
    "Trump’s call with Putin lasted more than two hours and “was very informative and very open,” Putin told Russian state media.",
    "Speaking to reporters in the Oval Office Monday afternoon, Trump said he had asked Putin to meet with him, but did not say whether Putin had agreed.",
    "Trump said little about his conversation with Zelenskyy, with whom he spoke first, other than to say that he had informed Zelenskyy and the leaders of other NATO countries of the negotiations.",
    "White House officials declined to offer any further details.",
    "Trump spoke with Zelenskyy twice on Monday, according to Zelenskyy, once one-on-one, before Trump’s call with Putin, and again during a conference call with the Ukrainian and NATO leaders.",
    "“I reaffirmed to President Trump that Ukraine is ready for a full and unconditional ceasefire,” Zelenskyy tweeted.",
    "“If the Russians are not ready to stop the killings, there must be stronger sanctions,” he wrote.",
    "“Pressure on Russia will push it toward real peace — this is obvious to everyone around the world.” In a Monday interview with NBC News in Rome, where he was received by Pope Leo XIV, Vice President JD Vance said, “We talked about a couple of what I would call the president’s major peace initiatives with the pope.",
    "We talked a lot about what’s going on in Israel and Gaza.",
    "We talked a lot about the Russia-Ukraine situation.",
    "It’s hard to predict the future, but I do think that, not just the pope, but the entire Vatican, has expressed a desire to be, you know, really helpful, and to work together on facilitating, hopefully, a peace deal coming together.",
    "Can’t predict the future, but that was very meaningful, and I think will hopefully bear fruit for the country.” Meanwhile, Putin’s spokesperson Dmitry Peskov said before the call that Russia “highly values” and is “grateful to the American side.” In a briefing with journalists, he said that if the U.S. can “help to achieve our goals through peaceful means, then this is indeed preferable.” Peskov was also asked about the chance of Trump and Putin meeting in person, a possibility the American president floated on Friday.",
    "“It will largely depend on what they themselves decide,” Peskov said.",
    "The meeting “needs to be worked out” by the two leaders in terms of dates and other details, he added.",
    "Ahead of the much anticipated Trump-Putin call, leaders from Britain, France, Germany and Italy said they spoke Sunday with Trump.",
    "The British government said in a statement that it was urging “Putin to take peace talks seriously.” Those leaders “also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks,” the statement said — something Trump has previously threatened.",
    "“Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe,” French President Emmanuel Macron said on X. Trump has been widely criticized for appearing to offer concessions to Russia while demanding sacrifices from Ukraine.",
    "Those voices were joined last week by former U.S.",
    "Ambassador to Ukraine Bridget Brink, who gave details of why she stepped down last month.",
    "“The policy since the beginning of the Trump administration has been to put pressure on the victim, Ukraine, rather than on the aggressor, Russia,” she wrote in an opinion piece Friday for the Detroit Free Press.",
    "“Peace at any price is not peace at all ― it is appeasement,” she said, adding that “we must show leadership in the face of aggression, not weakness or complicity.” While the diplomatic activity carries on, the violence in Ukraine continues.",
    "Russia has continued its near-nightly drone and missile attacks on Ukrainian civilians, more than three years after it launched a full-scale invasion and tried to seize Kyiv.",
    "On Sunday, Russia shelled residential neighborhoods of the eastern Ukrainian city of Kherson, killing a 75-year-old woman and injuring two other people, the city council posted on the Telegram messaging site.",
    "As well as being widely blamed for launching an unprovoked war, Russia is condemned across the West for the highly repressive and authoritarian state fashioned by Putin's Kremlin.",
    "On Monday, the Russian Prosecutor General’s Office labeled one of those critics, Amnesty International, as an \"undesirable organization\" and effectively banned it.",
    "The authority accused the London-based human rights watchdog of being \"Russophobic,\" trying to prolong the war, wanting to \"justify the crimes of Ukrainian neo-Nazis\" and its staffers of supporting \"extremist organizations.\"",
    "Trump, who has often spoken warmly of Putin, rarely if ever mentions these human rights concerns.",
    "Trump said in a Truth Social post on Saturday that he would be speaking with Putin at 10 a.m. Monday with the purpose of “stopping the ‘bloodbath’ that is killing, on average, more than 5,000 Russian and Ukrainian soldiers a week.” NBC News has not independently verified the numbers that Trump cited.",
    "Apparently referring both to his planned call with Putin and his slated talks with Zelenskyy and other European leaders, Trump added that “hopefully it will be a productive day, a ceasefire will take place, and this very violent war, a war that should have never happened, will end.” Despite promising on multiple occasions to end the war in 24 hours of taking office, Trump has since found the reality much different since beginning his second term.",
    "U.S.-brokered negotiations saw Russia and Ukrainian delegations meet in person in Istanbul last week for the first time since the early days of the war.",
    "However, the demands of the two sides remain far apart, with Russia saying it will only agree to a truce if Ukraine effectively surrenders.",
    "Ukraine has said these demands are unacceptable."
  ],
  "topics": {
    "Conflict": 0.7282013297080994,
    "Politics": 0.719478964805603,
    "Energy": 0.658511757850647,
    "Diplomacy": 0.6115176677703857,
    "Economy": 0.5963441729545593,
    "Transport": 0.5573107600212097,
    "Environment": 0.5556394457817078,
    "Technology": 0.5548621416091919,
    "Military": 0.5513156056404114,
    "Culture": 0.5478933453559875,
    "Elections": 0.5422704815864563,
    "Health": 0.5182536244392395,
    "Crime": 0.47882312536239624,
    "Education": 0.4495377838611603
  },
  "sentiment": {
    "positive": 0.405,
    "negative": 0.595,
    "neutral": 0.0
  }
}