{
  "title": "Trump phone calls with Putin, Zelensky hope to make progress in Russia-Ukraine war",
  "published_date": null,
  "url": "https://nypost.com/2025/05/19/us-news/trump-phone-calls-with-putin-zelensky-hope-to-make-progress-in-russia-ukraine-war/",
  "original_language": "en",
  "cleaned_sentences": [
    "Trump hopes for ceasefire progress in Russia-Ukraine war in Monday calls with Putin and Zelensky President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelensky will make progress toward a ceasefire in the war in Ukraine.",
    "Trump expressed his hopes for a “productive day” Monday — and a ceasefire — in a social media post over the weekend.",
    "His effort will also include calls to NATO leaders.",
    "Trump has struggled to end a war that began with Russia’s invasion in February 2022, and that makes these conversations a serious test of his reputation as a dealmaker after having claimed he would quickly settle the conflict once he was back in the White House, if not even before he took office.",
    "The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
    "“His sensibilities are that he’s got to get on the phone with President Putin, and that is going to clear up some of the logjam and get us to the place that we need to get to,” said Trump’s envoy, Steve Witkoff.",
    "“I think it’s going to be a very successful call.” Still, there are fears that Trump has an affinity for Putin that could put Ukraine at a disadvantage with any agreements engineered by the US government.",
    "Bridget Brink said she resigned last month as the US ambassador to Ukraine “because the policy since the beginning of the administration was to put pressure on the victim Ukraine, rather than on the aggressor, Russia.” Brink said the sign that she needed to depart was an Oval Office meeting in February where Trump and his team openly berated Zelensky for not being sufficiently deferential to them.",
    "“I believe that peace at any price is not peace at all,” Brink said.",
    "“It’s appeasement and as we know from history, appeasement only leads to more war.” Trump’s frustration about the war had been building before his post Saturday on Truth Social about the coming calls, which he said would begin first with Putin at 10 a.m. Monday.",
    "Trump said his discussion with Putin would focus on stopping the “bloodbath” of the war.",
    "It also will cover trade, a sign that Trump might be seeking to use financial incentives to broker some kind of agreement after Russia’s invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow’s ability to grow.",
    "Trump’s hope, according to the post, is that “a war that should have never happened will end.” His treasury secretary, Scott Bessent, said Sunday on NBC’s “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
    "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia’s oil revenues, due to concerns that doing so would increase US prices.",
    "The United States sought to cap Russia’s oil revenues while preserving the country’s petroleum exports to limit the damage from the inflation that the war produced.",
    "Putin recently rejected an offer by Zelensky to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
    "Those talks ended on Friday after less than two hours, without a ceasefire in place.",
    "Still, both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
    "While wrapping up his four-day trip to the Middle East, Trump said on Friday that Putin had not gone to Turkey because Trump himself wasn’t there.",
    "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
    "“At least we’ll know.",
    "And if we don’t solve it, it’ll be very interesting.” Zelensky met with Trump’s vice president, JD Vance, and top diplomat, Secretary of State Marco Rubio, in Rome on Sunday, as well as European leaders, intensifying his efforts before the Monday calls.",
    "The Ukrainian president said on the social media site X that during his talks with the American officials, they discussed the negotiations in Turkey and that “the Russians sent a low level delegation of non-decision-makers.” He also said he stressed that Ukraine is engaged in ”real diplomacy” to have a ceasefire.",
    "“We have also touched upon the need for sanctions against Russia, bilateral trade, defense cooperation, battlefield situation and upcoming prisoners exchange,” Zelensky said.",
    "“Pressure is needed against Russia until they are eager to stop the war.” The German government said Chancellor Friedrich Merz and French, British and Italian leaders spoke with Trump late Sunday about the situation in Ukraine and his upcoming call with Putin.",
    "A brief statement gave no details of the conversation, but said the plan is for the exchange to be continued directly after the Trump-Putin call.",
    "In a post on X about the conversation, French President Emmanuel Macron said that Putin on Monday “must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe.” The push came as the Kremlin launched its largest drone barrage against Ukraine since the start of the full-scale invasion in 2022, firing a total of 273 exploding drones and decoys, Ukraine’s air force said Sunday.",
    "The attacks targeted the country’s Kyiv, Dnipropetrovsk and Donetsk regions.",
    "Witkoff spoke Sunday on ABC’s “This Week” and Brink appeared on CBS’ “Face the Nation.”"
  ],
  "topics": {
    "Politics": 0.9800782799720764,
    "Diplomacy": 0.9756930470466614,
    "Transport": 0.9681333303451538,
    "Environment": 0.9620600342750549,
    "Conflict": 0.9594413042068481,
    "Culture": 0.9531342387199402,
    "Economy": 0.9509651064872742,
    "Education": 0.949172854423523,
    "Elections": 0.9450782537460327,
    "Health": 0.944101870059967,
    "Technology": 0.9371731877326965,
    "Military": 0.9328362941741943,
    "Energy": 0.926186203956604,
    "Crime": 0.9077655673027039
  },
  "sentiment": {
    "positive": 0.379,
    "negative": 0.621,
    "neutral": 0.0
  }
}