{
  "title": "Harvard researcher charged with trying to smuggle frog embryos into United States",
  "published_date": null,
  "url": "https://www.boston.com/news/crime/2025/05/14/harvard-researcher-petrova-charged-with-trying-to-smuggle-frog-embryos-into-united-states/",
  "original_language": "en",
  "cleaned_sentences": [
    "Sign up for the Today newsletter Get everything you need to know to start your day, delivered right to your inbox every morning.",
    "BOSTON (AP) — A Russian-born scientist and Harvard University researcher, who was already facing deportation back to Russia, was charged Wednesday with trying to smuggle frog embryos into the country.",
    "Kseniia Petrova, 30, was sent to a U.S. Immigration and Customs Enforcement facility in Louisiana after her February arrest.",
    "She continues to await a judge’s decision on whether she will be deported to Russia, where she fears she will be imprisoned or worse.",
    "A hearing on her case was held Wednesday in Vermont.",
    "But in the case’s latest twist, federal prosecutors charged her with one count of smuggling goods into the United States.",
    "It says she was taken into custody Wednesday.",
    "If convicted, Petrova faces a sentence of up to 20 years in prison and a fine of up to $250,000.",
    "A lawyer for Petrova could not be reached for comment.",
    "It is unclear if she is being moved from the ICE facility.",
    "Petrova had been vacationing in France, where she stopped at a lab specializing in splicing superfine sections of frog embryos and obtained a package of samples to be used for research.",
    "As she passed through a U.S. Customs and Border Protection checkpoint in Boston Logan International Airport, Petrova was questioned about the samples.",
    "Petrova told The Associated Press in an interview last month that she didn’t realize the items needed to be declared and was not trying to sneak in anything.",
    "After an interrogation, Petrova was told her visa was being cancelled.",
    "“The truth is on my side,” said Petrova, who spoke with the AP in a video call from the Louisiana ICE detention center in Monroe.",
    "The Department of Homeland Security said in a statement on the social platform X that Petrova was detained after “lying to federal officers about carrying substances into the country.” They allege messages on her phone “revealed she planned to smuggle the materials through customs without declaring them.” Federal prosecutors said Petrova was stopped by Customs and Border Protection agents after a law enforcement canine alerted them to her checked duffle bag.",
    "Upon inspection, the frog embryos were discovered in a foam box.",
    "She initially denied carrying any biological material in her checked baggage, prosecutors said, but later acknowledged it.",
    "Petrova’s boss and mentor, Leon Peshkin, said in an interview last month that the samples were not in any way dangerous or biohazardous.",
    "“I don’t think she did anything wrong,” Peshkin told the AP.",
    "“But even if she did, at most she should have gotten a warning or maybe a fine of up to $500.” Harvard said in a statement that the university “continues to monitor the situation.” Petrova told the AP that she left her country to avoid conflict or possible political repression.",
    "She fled after Russia invaded Ukraine in February 2022, marking the start of a bloody three-year war.",
    "“If I go back, I am afraid I will be imprisoned because of my political position and my position against war,” Petrova said.",
    "Petrova’s case is being closely watched by the scientific community, with some fearing it could impact recruiting and retaining foreign scientists at U.S. universities.",
    "“I think that there is a wrong perception that foreign scientists are somehow privileged to be in the United States.",
    "I feel it’s the opposite,” Peshkin said.",
    "“Foreign scientists come here with gifts … they are highly skilled experts who are in demand.",
    "They enrich the American scientific community.” Get everything you need to know to start your day, delivered right to your inbox every morning.",
    "Stay up to date with everything Boston.",
    "Receive the latest news and breaking updates, straight from our newsroom to your inbox."
  ],
  "topics": {
    "Conflict": 0.9662511944770813,
    "Politics": 0.9652464389801025,
    "Education": 0.9504576921463013,
    "Culture": 0.9238685369491577,
    "Economy": 0.9136747717857361,
    "Diplomacy": 0.8901078701019287,
    "Energy": 0.8895368576049805,
    "Health": 0.8782520294189453,
    "Technology": 0.8753179311752319,
    "Transport": 0.8234767913818359,
    "Elections": 0.8001735210418701,
    "Environment": 0.7695665955543518,
    "Military": 0.5875370502471924,
    "Crime": 0.4885030686855316
  },
  "sentiment": {
    "positive": 0.233,
    "negative": 0.767,
    "neutral": 0.0
  }
}