{
  "title": "Ukraine-Russia talks to open in Istanbul without Putin, Kremlin confirms",
  "published_date": null,
  "url": "https://abc7.com/post/ukraine-russia-talks-open-istanbul-putin-kremlin-confirms/16423567/",
  "original_language": "en",
  "cleaned_sentences": [
    "Ukrainian and Russian representatives will meet in Istanbul, Turkey, on Thursday, for their first meeting since the opening weeks of Moscow's 3-year-old invasion of its neighbor.",
    "Russian President Vladimir Putin will not attend Thursday's talks, despite an invitation from Ukrainian President Volodymyr Zelenskyy for a face-to-face meeting between the two leaders.",
    "Kremlin spokesperson Dmitry Peskov confirmed to journalists on Thursday that the Russian leader would not be taking part.",
    "President Donald Trump cast doubt on the potential for success in comments aboard Air Force One on Thursday, despite having this week repeatedly suggested a breakthrough was possible.",
    "\"Nothing's going to happen until Putin and I get together, okay?\"",
    "Trump said, after it became clear the Russian leader would not attend the talks in Istanbul.",
    "\"And obviously he wasn't going to go,\" Trump added.",
    "\"He was going to go, but he thought I was going to go.",
    "He wasn't going if I wasn't there.",
    "And I don't believe anything's going to happen, whether you like it or not, until he and I get together, but we're going to have to get it solved, because too many people are dying.\"",
    "The return to Istanbul is symbolic, the historic Turkish city having played host to arguably the most successful bursts of diplomacy in three years of devastating warfare.",
    "It was there in March 2022 that Ukrainian and Russian negotiators produced the Istanbul Communiqué -- the framework of a possible peace agreement to end Russia's nascent full-scale invasion.",
    "Its tradeoff was essentially one of Ukraine accepting permanent neutrality -- meaning forever abandoning any hope of becoming a member of NATO -- in exchange for ironclad security guarantees.",
    "The subsequent intensification of the war and emerging evidence of alleged Russian war crimes -- as well as suspicions of sabotage operations against peace talks participants -- fatally undermined those early peace efforts.",
    "Later, Istanbul was also the hub of the Black Sea Grain Initiative that ran from 2022 to 2023, which with the support of Turkey and the United Nations temporarily allowed for the safe export of grain and other agricultural goods from Ukrainian and Russian ports through the Black Sea -- which had by then become a key theater of the fighting -- to the rest of the world.",
    "Kremlin aide Vladimir Medinsky -- who led talks in 2022 -- will lead the Russian delegation.",
    "Medinsky will be joined by Deputy Foreign Minister Mikhail Galuzin, Deputy Defense Minister Alexander Fomin and Igor Kostyukov, the head of Russia's military intelligence agency.",
    "Zelenskyy and Putin last met in person in France in 2019 for a session of the Normandy Format, a peace forum convened with France and Germany in a bid to end the conflict in eastern Ukraine.",
    "The fighting there was touched off by Russia's annexation of Crimea and subsequent fomentation of a separatist revolt against Kyiv in the Donbas region.",
    "Moscow's 2022 full-scale invasion was a continuation of that initial cross-border aggression, with Russian columns surging out of occupied Crimea, Donetsk and Luhansk to seize more territory.",
    "Zelenskyy said at a news conference this week he would not meet any other Russian representative, because \"everything in Russia depends\" on its president.",
    "Zelenskyy arrived in the Turkish capital Ankara on Thursday to meet with President Recep Tayyip Erdogan.",
    "Once there, he posted to social media confirming Ukraine's \"top-level delegation,\" adding its representatives were \"ready to make any decisions that could lead to a long-awaited just peace.\"",
    "\"I have not yet received official confirmation regarding the Russian level of representation,\" he added.",
    "\"But from what we can observe, it appears theatrical.",
    "We will decide on our next steps after the conversation with President Erdogan.\"",
    "\"We will have several hours for an important discussion and very important decisions,\" Zelenskyy wrote.",
    "\"It is essential to understand the level of the Russian delegation, what mandate they hold, and whether they are authorized to make any decisions at all -- because we all know who actually makes decisions in Russia.\"",
    "President Donald Trump -- who since returning to office has been seeking a ceasefire and eventual peace deal -- suggested this week that he hoped for progress at Thursday's talks.",
    "\"I think we're having some pretty good news coming out of there today and maybe tomorrow and maybe Friday,\" Trump said upon arrival in Qatar on Wednesday.",
    "The president even hinted he might even travel to Istanbul, though did not say whether he expected Putin to do the same.",
    "\"Well I don't know if he's showing up,\" Trump said of his Russian counterpart.",
    "\"He would like me to be there, and that's a possibility.",
    "If we could end the war, I'd be thinking about that,\" Trump added.",
    "At a Thursday roundtable in Qatar during the second leg of his ongoing Middle East visit, Trump again floated the idea of traveling to Istanbul.",
    "\"If something happened, I'd go on Friday if it was appropriate,\" the president said.",
    "\"But we have people right now negotiating, and I think that I just hope that Russia and Ukraine are able to do something, because it has to stop, not only the money.\"",
    "Trump said he did not expect Putin to attend.",
    "\"I actually said, why would he go if I'm not going?",
    "Because I wasn't going to go.",
    "I wasn't planning to.",
    "I would go, but I wasn't planning to go.",
    "And I said, I don't think he's going to go if I don't go.",
    "And that turned out to be right.\"",
    "The U.S. delegation to Turkey includes Secretary of State Marco Rubio and senior envoys Steve Witkoff and Keith Kellogg.",
    "Speaking at a gathering of NATO foreign ministers in Ankara on Thursday, Rubio said of his hopes for the upcoming Ukraine-Russia talks, \"We'll see what happens over the next couple of days.\"",
    "\"I will say this, and I'll repeat it, that there is no military solution to the Russia-Ukraine conflict, Rubio continued.",
    "\"This war is going to end not through a military solution, but through a diplomatic one, and the sooner an agreement can be reached on ending this war, the less people, less people will die and the less destruction there will be.\"",
    "Trump, Rubio said, \"is interested in building things, not destroying.",
    "He wants economies and countries focused on building things, making things, providing opportunity and prosperity for its people, and he's against all the things that keep that from happening, like wars, like terrorism and all the instability that comes with that.\"",
    "Putin proposed the talks last weekend, in response to Ukraine's demand -- backed by the leaders of France, Germany, the U.K. and Poland during a joint visit to Kyiv -- for a full 30-day ceasefire during which time peace talks could proceed.",
    "Trump agreed to the plan by phone, the European leaders said.",
    "But Trump then also backed Putin's offer to restart the talks that collapsed in 2022.",
    "Trump even publicly pressed Zelenskyy to \"immediately\" agree to the meeting.",
    "Despite the significance of renewed direct Ukraine-Russia talks, Oleg Ignatov -- the International Crisis Group's senior Russia analyst -- told ABC News he had low expectations of an immediate breakthrough.",
    "\"The Russians clearly say that they're interested in keeping military and diplomatic pressure on Ukraine,\" he said.",
    "\"They clearly say that there will be long negotiations and Ukraine should be prepared for this.\"",
    "While Trump agitates for a deal he can sell as a political win, Kyiv and Moscow are maneuvering to avoid blame for the failure of peace talks -- and dodge Trump's subsequent wrath.",
    "Ukrainian Foreign Minister Andrii Sybiha met with Rubio on Wednesday in Istanbul.",
    "\"I reaffirmed Ukraine's strong and consistent commitment to President Trump's peace efforts and thanked the United States for its involvement,\" the former wrote om X.",
    "\"We are ready to advance our cooperation in a constructive and mutually beneficial manner,\" he added.",
    "\"It is critical that Russia reciprocate Ukraine's constructive steps.",
    "Moscow must understand that rejecting peace comes at a cost.\"",
    "Russian Foreign Ministry spokesperson Maria Zakharova, meanwhile, said during a Thursday morning press briefing that Moscow \"is ready for serious negotiations.\""
  ],
  "topics": {
    "Diplomacy": 0.9728603959083557,
    "Politics": 0.9708232283592224,
    "Transport": 0.9630554914474487,
    "Culture": 0.9610415697097778,
    "Environment": 0.9574282169342041,
    "Conflict": 0.9479223489761353,
    "Health": 0.9423381090164185,
    "Education": 0.9367566704750061,
    "Energy": 0.9349229335784912,
    "Elections": 0.9344018697738647,
    "Economy": 0.9160619378089905,
    "Technology": 0.9120566844940186,
    "Military": 0.8820449113845825,
    "Crime": 0.8093220591545105
  },
  "sentiment": {
    "positive": 0.5,
    "negative": 0.5,
    "neutral": 0.0
  }
}