[
    {
        "title": "Il nucleare iraniano in Medio Oriente: una trattativa fragile sotto la lente",
        "description": "Nulla di fatto nei colloqui tra la delegazione USA e quella iraniana a Roma per discutere un possibile rilancio dell’accordo – L’esperto Giuseppe Acconcia: «La posta in gioco è altissima, e tocca diversi attori regionali, da Israele alla Siria, passando da Russia e Cina»",
        "content": "«Il fatto che si dialoghi è già un successo, un passo avanti rispetto alle posizioni iniziali dell’Amministrazione Trump, quando sembrava che l’unica via fosse la guerra». Giuseppe Acconcia è docente di geopolitica del Medio Oriente all’università St... [7576 chars]",
        "url": "https://www.cdt.ch/news/mondo/il-nucleare-iraniano-in-medio-oriente-una-trattativa-fragile-sotto-la-lente-395203",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/23/960x640/2d33007c-05f2-4c88-ba6b-601711251839.jpeg",
        "publishedAt": "2025-05-24T04:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Lavrov respinge i negoziati in Vaticano mentre la Svizzera si propone come alternativa",
        "description": "Scambio di prigionieri tra Russia e Ucraina, ma il Cremlino frena sui negoziati di pace",
        "content": "\"Poco realistiche\": così il ministro degli Esteri russo Serghei Lavrov ha liquidato le ipotesi su una prosecuzione dei negoziati diretti tra Mosca e Kiev in Vaticano, mentre l'Ucraina fa sapere che la Svizzera ha manifestato \"la propria disponibilità... [3730 chars]",
        "url": "https://www.laregione.ch/estero/estero/1840389/ucraina-negoziati-svizzera-lavrov-russia-scambio-prigionieri-alternativa-vaticano",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-23T19:06:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "\"Ci sfidano? La Nato è pronta a difendere ogni suo centimetro\"",
        "description": "Il cancelliere tedesco Friedrich Merz: «Non permetteremo alla Russia di creare una spaccatura al nostro interno»",
        "content": "Merz ha anche sottolineato: «Poco più di 70 anni fa, il 6 maggio 1955, la Repubblica Federale Tedesca entrò a far parte della Nato. Da allora, la solidarietà del Trattato dell'Atlantico del Nord, in particolare l'articolo 5, è stato il fondamento ina... [466 chars]",
        "url": "https://www.tio.ch/dal-mondo/politica/1839928/nato-ogni-centimetro-merz-cancelliere",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-nato-ogni-centimetro-merz-cancelliere-1jolh.jpg?v=1",
        "publishedAt": "2025-05-22T12:30:34Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Putin visita Kursk mentre le tensioni tra Russia e Ucraina restano alte",
        "description": "Nessun progresso nei negoziati di pace, mentre gli Stati Uniti si concentrano sulla sfida con la Cina",
        "content": "Vladimir Putin ha visitato il Kursk: un viaggio simbolico nella regione russa che gli ucraini avevano tentato di invadere lo scorso anno con l'intento dichiarato di distogliere le truppe russe dall'offensiva nel Donbass e di guadagnare territorio da ... [3638 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839744/stati-negoziati-putin-ucraina-kursk-russia-tensioni",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-21T17:49:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "La Russia sta ritardando il memorandum sulla fine della guerra? Il Cremlino nega",
        "description": "Mosca «accoglie con favore la disponibilità e gli sforzi di tutti quei paesi che desiderano contribuire a una rapida soluzione» del conflitto",
        "content": "Intanto, riporta il \"New York Times\", il presidente statunitense Donald Trump avrebbe detto al presidente ucraino Volodymyr Zelensky e ad altri leader europei che la Russia e l'Ucraina dovranno trovare una soluzione alla guerra, solo pochi giorni dop... [340 chars]",
        "url": "https://www.tio.ch/dal-mondo/attualita/1839590/ucraina-soluzione-russia-guerra-memorandum-cremlino",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-ucraina-soluzione-russia-guerra-memorandum-cremlino-1jo3h.jpg?v=1",
        "publishedAt": "2025-05-21T11:10:04Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Colloqui di pace in Vaticano dopo la telefonata tra Meloni e Papa Leone XIV",
        "description": "La Santa Sede pronta a ospitare negoziati per un cessate il fuoco tra Russia e Ucraina",
        "content": "Colloqui di pace in Vaticano. Lo scenario diventa una possibilità concreta dopo la telefonata di Giorgia Meloni al Papa, che ha confermato alla premier la disponibilità della Santa Sede a ospitare i negoziati. Un colloquio a cui si è poi aggiunto il ... [3429 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839418/meloni-presidente-premier-negoziati-pace-telefonata-leone-vaticano-papa-xiv",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-20T20:41:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Sanzioni alla Russia: Europa, Stati Uniti e Gran Bretagna sono pronti",
        "description": "«Vediamo come si comporta Putin», ha detto Trump. In caso di mancati progressi verso la pace, potrebbero scattare più pacchetti di misure",
        "content": "In Gran Bretagna, il governo di Keir Starmer ha approvato sanzioni contro oltre un centinaio di nuove entità e individui e mirano a colpire i settori dell'industria militare, dell'energia e della finanza, nonché «la guerra dell'informazione contro l'... [298 chars]",
        "url": "https://www.tio.ch/dal-mondo/cronaca/1839414/sanzioni-alla-russia-europa-stati-uniti-e-gran-bretagna-sono-pronti",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-sanzioni-alla-russia-europa-stati-uniti-e-gran-bretagna-sono-pronti-1jnuu.jpg?v=1",
        "publishedAt": "2025-05-20T19:39:00Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "L'Europa intensifica le sanzioni contro la Russia per promuovere la pace",
        "description": "Nuove misure coinvolgono UE, Gran Bretagna e USA con restrizioni su energia e finanza",
        "content": "La parola d'ordine in Europa ora: è sanzioni più dure per spingere Vladimir Putin alla pace. Con un rinnovato accento sul coordinamento. Ecco perché fioccano i contatti sulla rotta Bruxelles-Londra-Washington, arrivando poi ad allargare il campo al G... [2584 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839411/sanzioni-ue-misure-russi-pace-europa-russia",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-20T19:30:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Russia e Ucraina tornano a dialogare ma il futuro dei negoziati resta incerto",
        "description": "Putin detta i tempi mentre Trump e l'Europa mostrano approcci divergenti sulla crisi",
        "content": "Come spesso accade, si può scegliere tra il bicchiere mezzo pieno o quello mezzo vuoto. Bene che Russia ed Ucraina, in qualche modo, siano tornate ad incontrarsi. Male tutto il resto. Il futuro dei negoziati è avvolto nell'incertezza, non si parla pi... [3114 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839397/putin-trump-europa-russia-futuro-negoziati-ucraina",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-20T18:03:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Quegli pneumatici per Boeing intercettati al confine erano per la Russia?",
        "description": "La merce, spedita dalla Spagna e con destinazione finale l'Azerbaigian secondo la bolla, è stata bloccata dalle autorità polacche: il transito attraverso i territori bielorusso e russo è vietato dalle sanzioni",
        "content": "La merce è stata intercettata durante un'ispezione a un camion a Koroszczyn, al confine con la Bielorussia. Dalla dichiarazione, consegnata dall'autista ai funzionari doganali, risultava che il carico fosse composto da pneumatici per auto e autobus. ... [596 chars]",
        "url": "https://www.cdt.ch/news/mondo/quegli-pneumatici-per-boeing-intercettati-al-confine-erano-per-la-russia-394733",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/20/960x640/111d1ab3-7a8d-4354-b551-d9da7ed578e9.jpeg",
        "publishedAt": "2025-05-20T17:30:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "L'UE e il Regno Unito intensificano le sanzioni contro la Russia con nuovi pacchetti",
        "description": "Le misure mirano a colpire la flotta ombra russa e settori chiave come l'industria militare e l'energia",
        "content": "\"L'UE ha approvato il suo 17esimo pacchetto di sanzioni contro la Russia, che prende di mira quasi 200 navi della flotta ombra. Le nuove misure riguardano anche le minacce ibride e i diritti umani. Sono in preparazione ulteriori sanzioni contro la Ru... [2305 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839253/sanzioni-russia-ue-flotta-misure",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-20T10:19:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "\"Putin vuole prendere tempo per continuare la guerra\"",
        "description": "Zelensky ribadisce la necessità di sanzioni più incisive contro la Russia e sottolinea l'importanza di una diplomazia concreta per porre fine alla guerra.",
        "content": "\"L'importante è che la diplomazia per la pace sia coordinata e orientata a risultati concreti\", ha sottolineato il leader ucraino. \"Non abbiamo dubbi che la guerra debba concludersi al tavolo delle trattative. Dovrebbero esserci proposte chiare e rea... [312 chars]",
        "url": "https://www.tio.ch/dal-mondo/cronaca/1839229/zelensky-ucraina-presidente-guerra-russia",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-zelensky-ucraina-presidente-guerra-russia-1jnkp.jpg?v=1",
        "publishedAt": "2025-05-20T10:03:17Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Zelensky accusa la Russia di temporeggiare per prolungare la guerra",
        "description": "Il presidente ucraino sottolinea l'importanza delle sanzioni e della diplomazia per la pace",
        "content": "\"È ovvio che la Russia sta cercando di prendere tempo per continuare la guerra e l'occupazione. Stiamo lavorando con i nostri partner per fare pressione sui russi affinché si comportino diversamente. Le sanzioni sono importanti e sono grato a chiunqu... [981 chars]",
        "url": "https://www.laregione.ch/estero/estero/1839233/presidente-guerra-russia-zelensky-diplomazia",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-20T09:34:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Zelensky: \"La Russia prende tempo per continuare la guerra e l'occupazione\"",
        "description": "Zakharova: Russia pronta a continuare i contatti diretti con l'Ucraina per la pace, ora «tocca a Kiev, servono azioni e passi concreti» – TUTTI GLI AGGIORNAMENTI",
        "content": "Non sono state fissate scadenze per la preparazione del memorandum tra Russia e Ucraina, le parti si scambieranno le bozze ed elaboreranno un testo unico, ha aggiunto portavoce. «Non ci sono scadenze e non possono essercene - ha detto in una dichiara... [329 chars]",
        "url": "https://www.cdt.ch/news/mondo/zelensky-la-russia-prende-tempo-per-continuare-la-guerra-e-loccupazione-394724",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/20/960x640/d12aab8a-a679-4e76-be88-d5be898b2841.jpeg",
        "publishedAt": "2025-05-20T04:29:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Conflitto in Ucraina, ora arriva la parte più dura",
        "description": "Il vertice telefonico tra Donald Trump e Vladimir Putin, definito «eccellente», «sincero» e «proficuo», lancia di fatto le trattative dirette tra Russia e Ucraina – Il presidente americano ha fatto riferimento alla proposta del Vaticano di ospitare i futuri negoziati",
        "content": "Evidentemente, i toni utilizzati da Donald Trump sono sembrati ben più positivi rispetto a quelli - prudenti - di Vladimir Putin. Il russo si è limitato ad accennare a un «possibile futuro accordo di pace». Ma l’americano è andato ben oltre. L’aspett... [1829 chars]",
        "url": "https://www.cdt.ch/news/mondo/conflitto-in-ucraina-ora-arriva-la-parte-piu-dura-394716",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/19/960x640/f33fcab7-d6ae-46dd-9fd0-6893f82032ef.jpeg",
        "publishedAt": "2025-05-19T20:45:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "\"Putin, incontriamoci faccia a faccia\"",
        "description": "Zelensky ribadisce la volontà di negoziare con la Russia. «A Istanbul respinti tutti i loro tentativi di minaccia»",
        "content": "Essi «hanno dimostrato al mondo la nostra disponibilità ad avvicinarci alla pace e, di conseguenza, la necessità di fare pressione sulla Russia affinché ponga fine alla guerra. In effetti, il risultato più importante dell'incontro è stato l'accordo s... [422 chars]",
        "url": "https://www.tio.ch/dal-mondo/cronaca/1839057/putin-incontriamoci-faccia-a-faccia",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-putin-incontriamoci-faccia-a-faccia-1jnc4.jpg?v=1",
        "publishedAt": "2025-05-19T16:27:49Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Zelensky: \"Pronti a negoziare con la Russia in Turchia, Vaticano o Svizzera\"",
        "description": "È quanto dichiara il presidente ucraino, dopo la telefonata tra Trump e Putin, al termine della quale il presidente americano ha reso noto che «Mosca e Kiev avvieranno immediatamente negoziati per un cessate il fuoco» – TUTTI GLI AGGIORNAMENTI",
        "content": "I leader di Francia, Gran Bretagna, Germania e Italia hanno parlato telefonicamente ieri sera con il presidente degli Stati Uniti Donald Trump, un giorno prima della sua telefonata con Vladimir Putin per cercare di porre fine al conflitto in Ucraina:... [757 chars]",
        "url": "https://www.cdt.ch/news/zelensky-pronti-a-negoziare-con-la-russia-in-turchia-vaticano-o-svizzera-394606",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/19/960x640/eeebb3db-1278-4d2d-bc15-8940eb39c1ab.jpeg",
        "publishedAt": "2025-05-19T04:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Italia protagonista nel trilaterale tra Meloni, Vance e von der Leyen",
        "description": "Cirielli sottolinea il ruolo centrale dell'Italia nei negoziati su dazi e Ucraina-Russia",
        "content": "\"Il grande successo del trilaterale di oggi tra il Presidente del Consiglio, Giorgia Meloni, il Vice Presidente degli Usa, Vance, e la Presidente della Commissione Europea, von der Leyen, certifica il ruolo dell'Italia come paese pontiere tra Europa ... [1027 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838804/meloni-italia-cirielli-protagonista-der-leyen-vance-von",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-18T22:02:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Il cancelliere tedesco Merz ribadisce l'importanza dell'Italia come partner strategico",
        "description": "Durante l'incontro con Meloni, discussi Ucraina, sanzioni alla Russia e politica europea sui rifugiati",
        "content": "\"L'Italia è per noi un partner strategico irrinunciabile nella politica europea ed estera\". Lo ha detto il cancelliere tedesco Friedrich Merz dopo il bilaterale con la premier italiana Giorgia Meloni.\nI colloqui di ieri sull'Ucraina \"non hanno soddis... [1554 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838628/merz-politica-meloni-partner-cancelliere-italia",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-17T17:49:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Tutti d'accordo tranne Mosca: \"Richieste russe inaccettabili\"",
        "description": "Le delegazioni di Ucraina e Russia si sono incontrate a Istanbul - L’unico risultato concreto è stato un largo scambio di prigionieri - Ora Trump prenota un vertice con Putin",
        "content": "L’unico risultato concreto - al di là di una superficiale intesa in vista di un futuro nuovo incontro - è stato un accordo per uno scambio di prigionieri tra le due parti in guerra. Mille ucraini potranno tornare in patria, e lo stesso faranno mille ... [1880 chars]",
        "url": "https://www.cdt.ch/news/tutti-daccordo-tranne-mosca-richieste-russe-inaccettabili-394380",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/16/960x640/5ea5bffb-2f17-40da-8c31-c0e00b2dedc5.jpeg",
        "publishedAt": "2025-05-16T20:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Colloqui di pace tra Russia e Ucraina a Istanbul portano a uno scambio di prigionieri",
        "description": "Nonostante le tensioni, le delegazioni discutono di tregua e un possibile incontro tra Putin e Zelensky",
        "content": "Russi e ucraini, dopo tre anni e mezzo di guerra, si sono ritrovati faccia a faccia per tentare di avvicinare le proprie posizioni. E‘ questo il risultato più rilevante arrivato da Istanbul, nella misura in cui questo round di colloqui diretti rischi... [3878 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838462/due-istanbul-incontro-zelensky-prigionieri-scambio-colloqui-russi-pace",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-16T18:20:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "\"Serve unità e sanzioni più dure per fermare la Russia\"",
        "description": "Zelensky discute con i leader occidentali in un vertice a Tirana la necessità di mantenere unità e pressione su Mosca per una pace vera.",
        "content": "«Mosca non è costruttiva»\n«La parte russa non ha dimostrato buona volontà e ha posto condizioni inaccettabili. Continueremo a lavorare insieme. Il compito principale è mantenere l'unità dei partner europei e americani intorno alla questione ucraina».... [288 chars]",
        "url": "https://www.tio.ch/dal-mondo/cronaca/1838416/serve-unita-e-sanzioni-piu-dure-per-fermare-la-russia",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-serve-unita-e-sanzioni-piu-dure-per-fermare-la-russia-1jma5.jpg?v=1",
        "publishedAt": "2025-05-16T15:59:21Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Von der Leyen annuncia nuove sanzioni contro la Russia al vertice della Cpe",
        "description": "Il pacchetto include divieti su Nord Stream e limiti al prezzo del greggio per sostenere l'Ucraina",
        "content": "\"Gli oratori che mi hanno preceduto hanno descritto le montagne russe degli ultimi giorni. Per essere chiari: vogliamo la pace. E stiamo lavorando a una prossima serie di sanzioni. Gli elementi principali di questo pacchetto saranno, ad esempio: il d... [1104 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838353/sanzioni-russia-leyen-der-von-cpe-vertice",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-16T12:39:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Keller-Sutter auspica colloqui di pace tra Ucraina e Russia al vertice di Tirana",
        "description": "La presidente svizzera partecipa al summit europeo e discute di dazi con gli USA, cercando soluzioni rapide",
        "content": "La presidente della Confederazione Karin Keller-Sutter spera in colloqui per la pace fra Ucraina e Russia. Kiev sembra pronta a sedersi al tavolo delle trattative, ha detto al suo arrivo al vertice della Comunità politica europea (CPE) a Tirana.\n\"Ved... [1721 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838331/presidente-svizzera-confederazione-vertice-keller-sutter-tirana-russia-ucraina-pace-colloqui",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-16T10:11:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "La Borsa svizzera apre in rialzo con l'indice SMI in crescita dello 0,33%",
        "description": "Investitori attenti a dazi USA, politica monetaria della Fed e colloqui Russia-Ucraina",
        "content": "Apertura in positivo stamane per la Borsa svizzera. Poco dopo le 9.00 l'indice dei titoli guida SMI segnava una progressione dello 0,33% a 12'267,79 punti.\nSui mercati gli investitori guardano agli sviluppi della politica commerciale americana, in pa... [882 chars]",
        "url": "https://www.laregione.ch/economia/economia/1838261/indice-smi-rialzo-svizzera-borsa",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-16T07:28:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Vertice di Istanbul tra Russia e Ucraina senza Putin e Trump",
        "description": "Zelensky critica la delegazione russa mentre USA e Turchia mediano per un cessate il fuoco",
        "content": "Istanbul alla fine si trasforma nel vertice degli assenti. Dopo il gran rifiuto del presidente russo Vladimir Putin, infatti, a cascata i big si sfilano. Quello ucraino Volodymyr Zelensky - già in Turchia per un incontro con l'omologo turco Recep Tay... [3591 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838142/trump-putin-zelensky-turchia-russia-istanbul-ucraina-vertice",
        "image": "https://media.laregione.ch/files/domains/laregione.ch/images/4c95/f_-trump-putin-zelensky-turchia-russia-istanbul-ucraina-vertice-1jlve.jpg?v=1",
        "publishedAt": "2025-05-15T18:51:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Cina e Russia rafforzano la cooperazione militare in risposta alle pressioni occidentali",
        "description": "Pechino annuncia l'espansione del partenariato strategico con Mosca, sfidando USA e UE",
        "content": "La Cina non molla la Russia. Anzi, punta ad espandere la collaborazione militare bilaterale. Mentre sale la pressione sul presidente Vladimir Putin perché accetti un confronto diretto con l'omologo ucraino Volodymyr Zelensky, Pechino corre in soccors... [2995 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838130/mosca-pechino-russia-cooperazione-cina",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-15T17:59:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Zelensky invia delegazione a Istanbul per colloqui di pace con la Russia",
        "description": "Il cessate il fuoco è la priorità, nessuna concessione territoriale prevista, afferma il presidente ucraino",
        "content": "Il presidente ucraino Volodymyr Zelensky ha annunciato che non parteciperà ai colloqui di Istanbul ma invierà una delegazione guidata dal ministro della difesa Rustem Umerov per incontrare i rappresentanti russi. A suo dire i colloqui potrebbero tene... [2106 chars]",
        "url": "https://www.laregione.ch/estero/estero/1838071/zelensky-delegazione-presidente-cessate-russia-fuoco-istanbul-colloqui-russi-pace",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-15T13:50:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Colloqui tra Russia e Ucraina a Istanbul rinviati al pomeriggio",
        "description": "La Turchia posticipa l'incontro, mentre le delegazioni discutono di cessate il fuoco e pace duratura",
        "content": "I colloqui diretti fra Russia e Ucraina in programma a Istanbul sono stati rinviati al pomeriggio per decisione della Turchia: lo ha reso noto la portavoce del Ministero degli esteri russo, Maria Zakharova, le cui dichiarazioni sono state riportate d... [1179 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837956/colloqui-ucraina-russia-rinviati-istanbul-pomeriggio",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-15T09:10:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Cina e Russia rafforzano la cooperazione militare per stabilità globale",
        "description": "Pechino e Mosca intensificano i legami strategici nonostante le tensioni internazionali",
        "content": "Le Forze Armate cinesi sono pronte a collaborare con la Russia per rafforzare la fiducia strategica reciproca e ampliare la cooperazione. Lo ha dichiarato oggi il Ministero della difesa della Repubblica Popolare Cinese in una nota ufficiale rilanciat... [2433 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837972/xi-russia-mosca-cina-cooperazione-stabilita",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-15T08:10:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Assenti Trump e Putin ai colloqui di pace a Istanbul tra Russia e Ucraina",
        "description": "Delegazioni russe e ucraine si incontrano per negoziati diretti, Zelensky aperto a diversi formati di dialogo",
        "content": "Donald Trump e Vladimir Putin non ci saranno oggi a Istanbul dove sono in programma i colloqui diretti con l'Ucraina. La conferma del tycoon è arrivata ieri sera dopo che anche il presidente della Federazione russa ha chiuso alla possibilità di recar... [2152 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837897/presidente-ucraina-putin-colloqui-trump-istanbul-russia-zelensky",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-15T05:03:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Zelensky: \"La delegazione russa sembra una farsa, una messa in scena teatrale\"",
        "description": "Immediata la risposta di Mosca: «Un clown, un fallito, una persona dall'istruzione sconosciuta» – I negoziati tra le delegazioni di Russia e Ucraina a Istanbul inizieranno domani – TUTTI GLI AGGIORNAMENTI",
        "content": "Il ministro degli esteri ucraino Andrii Sybiha ha incontrato nella serata di ieri ad Antalya il segretario di Stato USA Marc Rubio «per coordinare le posizioni durante questa settimana cruciale», scrive Sybiha su X. «Abbiamo discusso in dettaglio la ... [338 chars]",
        "url": "https://www.cdt.ch/news/zelensky-la-delegazione-russa-sembra-una-farsa-una-messa-in-scena-teatrale-394139",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/15/960x640/fcbe67da-54f9-45a6-b736-29ed943fb8cb.jpeg",
        "publishedAt": "2025-05-15T04:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Zelensky accetta di partecipare ai colloqui in Turchia dopo pressioni internazionali",
        "description": "Funzionari americani ed europei convincono il presidente ucraino a inviare una delegazione per negoziati con la Russia",
        "content": "Funzionari americani ed europei hanno convinto Volodymyr Zelensky ad andare ai colloqui in Turchia dopo che martedì sera il presidente si era detto frustrato e ha lasciato intendere che non sarebbe andato né avrebbe mandato i suoi collaboratori. Lo h... [882 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837832/russia-colloqui-zelensky-turchia-funzionari",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-14T19:39:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Zelensky in Turchia per negoziati di pace con la Russia",
        "description": "In attesa di conferme sulla partecipazione di Putin, si discute di sanzioni e possibili scambi di prigionieri",
        "content": "Volodymyr Zelensky parte per la Turchia, sperando che Vladimir Putin accetti la sua richiesta di un vertice in presenza. Ma si dice pronto a \"qualsiasi formato di negoziato\" per porre fine alla guerra, quindi anche a trattative a livello inferiore. D... [4036 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837821/presidente-putin-russia-turchia-zelensky-negoziati",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-14T18:11:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Ecco come in Russia si cerca di sottrarre i giovani alla propaganda",
        "description": "Alcune scuole hanno istituito orari segreti all'interno dei quali non sono previste le lezioni di educazione patriottica, mentre alcuni genitori hanno invece deciso di istruire i figli tra le mura domestiche",
        "content": "Un concorso musicale che premia chi esegue la migliore canzone militare russa, una gita scolastica per andare ad ascoltare un discorso a favore della guerra tenuto da un veterano dell'invasione sovietica dell'Afghanistan, lezioni che ritraggono la Ru... [910 chars]",
        "url": "https://www.cdt.ch/news/ecco-come-in-russia-si-cerca-di-sottrarre-i-giovani-alla-propaganda-393145",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/14/960x640/c3a21cd6-ed2b-4f7b-8a33-809fa10f9d06.jpeg",
        "publishedAt": "2025-05-14T15:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "La Russia non annuncia ancora chi andrà a Istanbul",
        "description": "Alla vigilia dei negoziati diretti con l'Ucraina a Istanbul, il Cremlino ha fatto sapere di non potere ancora rendere nota la composizione della delegazione russa – TUTTI GLI AGGIORNAMENTI",
        "content": "Il Papa, nel discorso, ricorda: «Chi più di voi, che conoscete da vicino gli orrori della guerra, tanto che Papa Francesco chiamò le vostre Chiese 'martiriali'? È vero: dalla Terra Santa all'Ucraina, dal Libano alla Siria, dal Medio Oriente al Tigray... [578 chars]",
        "url": "https://www.cdt.ch/news/mondo/la-russia-non-annuncia-ancora-chi-andra-a-istanbul-394042",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/14/960x640/3ecd6551-f31c-4794-951d-89183d8e593f.jpeg",
        "publishedAt": "2025-05-14T04:21:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Tensioni crescenti tra Russia e Ucraina in vista dei negoziati a Istanbul",
        "description": "Zelensky pronto a incontrare Putin mentre l'Occidente esorta alla cautela. Trump ottimista sui risultati",
        "content": "Una escalation di attacchi verbali incrociati che non sembra il più adatto a favorire il dialogo accompagna l'avvicinamento ai primi negoziati diretti tra Russia e Ucraina di giovedì a Istanbul. E mentre il presidente ucraino Volodymyr Zelensky si di... [3978 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837518/cremlino-presidente-negoziati-putin-russia-russi-ucraina-istanbul-zelensky",
        "image": "https://media.laregione.ch/files/domains/laregione.ch/images/4c95/f_-cremlino-presidente-negoziati-putin-russia-russi-ucraina-istanbul-zelensky-1jky8.jpg?v=1",
        "publishedAt": "2025-05-13T18:23:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "La risposta di Mosca: \"Sulla tragedia del volo MH17 ci sono ancora molte cose poco chiare\"",
        "description": "Il Cremlino attacca l'Agenzia per l'aviazione civile dell'ONU, che nelle scorse ore ha riconosciuto la Russia come responsabile dell'abbattimento dell'aereo di Malaysia Airlines sopra i cieli ucraini, avvenuto nel luglio 2014",
        "content": "A bordo dell'aereo, partito da Amsterdam e diretto a Kuala Lumpur, erano presenti 196 cittadini dei Paesi Bassi. Tra i passeggeri c'erano anche 38 australiani, 10 britannici e alcuni cittadini provenienti da Belgio e Malesia. Preso atto della dichiar... [617 chars]",
        "url": "https://www.cdt.ch/news/mondo/la-risposta-di-mosca-sulla-tragedia-del-volo-mh17-ci-sono-ancora-molte-cose-poco-chiare-393925",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/13/960x640/1471c902-f5e5-4fbf-b5a4-19814e078cda.jpeg",
        "publishedAt": "2025-05-13T12:30:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "L'aereo della Malaysia Airlines abbattuto e le accuse alla Russia: \"L'ONU è di parte\"",
        "description": "Il Cremlino non accetta le conclusioni a dell'Agenzia per l'aviazione civile delle Nazioni Unite (Icao) e attacca l'Organizzazione delle Nazioni Unite",
        "content": "Il Boeing della Malaysian Airlines (volo Mh17) era in viaggio da Amsterdam a Kuala Lumpur e si ritiene che sia stato abbattuto in Ucraina da un missile russo all'inizio del conflitto tra le truppe ucraine e i miliziani separatisti del Donbass sostenu... [290 chars]",
        "url": "https://www.tio.ch/dal-mondo/attualita/1837341/russia-malaysia-airlines-onu-abbattuto-aereo",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-russia-malaysia-airlines-onu-abbattuto-aereo-1jkoz.jpg?v=1",
        "publishedAt": "2025-05-13T10:56:32Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "L'Icao accusa la Russia per l'abbattimento del volo MH17 nel 2014",
        "description": "L'agenzia ONU conferma la responsabilità russa, accogliendo i ricorsi di Australia e Paesi Bassi",
        "content": "L'agenzia per l'aviazione civile delle Nazioni Unite (Icao) ha dichiarato che la Russia è responsabile dell'abbattimento del volo MH17 il 17 luglio 2014 in Ucraina, in cui persero la vita 298 tra passeggeri e membri dell'equipaggio.\nIl consiglio di a... [2801 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837150/abbattimento-volo-agenzia-responsabilita-mh17-russia-icao",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-13T05:05:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "L’Artico, il futuro protagonista dell’economia e della logistica",
        "description": "II graduale scioglimento dei ghiacci rende sempre più accessibili i minerali nascosti del Grande Nord, alimentando la competizione tra potenze – La Russia investe da anni nell’area – Cina, Stati Uniti ed Europa si contendono i passaggi strategici",
        "content": "La Russia è la potenza leader dell’area e investe nell’Artico, ormai da anni, circa un decimo delle risorse nazionali. La posizione preminente è anzitutto geografica, per i suoi 24 mila chilometri di coste (il 53% del totale) che vi si affacciano. Os... [639 chars]",
        "url": "https://www.cdt.ch/news/economia/lartico-il-futuro-protagonista-delleconomia-e-della-logistica-393863",
        "image": "https://naxos-cdn01.gruppocdt.ch/cdt/stories/2025/05/12/960x640/83fdb63d-6449-4ec2-83e6-6532e255d7b4.jpeg",
        "publishedAt": "2025-05-13T04:00:00Z",
        "source": {
            "name": "Corriere del Ticino",
            "url": "https://www.cdt.ch"
        }
    },
    {
        "title": "Meloni sollecita una risposta chiara dalla Russia per il cessate il fuoco in Ucraina",
        "description": "La premier italiana ribadisce il sostegno a Kiev e invita Mosca a rispondere alla proposta di pace di Zelensky",
        "content": "Da una parte c'è la \"propaganda\" russa, dall'altra la volontà di Kiev di chiudere il conflitto. La premier italiana Giorgia Meloni propone un netto distinguo tra le due parti, una \"responsabile della guerra\" e l'altra \"certamente a favore della pace\"... [3597 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837088/meloni-ucraina-sostegno-premier-zelensky-kiev-pace-russia-risposta-fuoco",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-12T19:07:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Lula da Silva ribadisce la sovranità del Brasile in risposta agli Stati Uniti",
        "description": "Il presidente brasiliano sottolinea l'indipendenza del Paese durante una conferenza stampa dopo i viaggi in Cina e Russia",
        "content": "\"Per molto tempo in molti hanno pensato che il Brasile fosse il cortile di casa degli Stati Uniti, ma il Brasile non è un cortile, è un Paese libero e sovrano, con interessi sovrani del suo popolo\". Così il presidente brasiliano Luiz Inacio Lula da S... [641 chars]",
        "url": "https://www.laregione.ch/estero/estero/1837031/brasile-paese-stati-lula-silva",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-12T15:18:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "La Russia rifiuta ultimatum sul cessate il fuoco in Ucraina",
        "description": "Peskov ribadisce l'impegno per una soluzione pacifica e negoziati diretti con Kiev",
        "content": "La Russia respinge ogni \"ultimatum\" su un cessate il fuoco in Ucraina. Lo ha affermato il portavoce del Cremlino Dmitry Peskov citato dall'agenzia Ria Novosti.\n\"Il linguaggio degli ultimatum non è accettabile per la Russia, non è appropriato, non si ... [1094 chars]",
        "url": "https://www.laregione.ch/estero/estero/1836971/russia-peskov-cessate-fuoco-ultimatum-ucraina",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-12T12:45:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "La storia della Russia, una continua ripetizione",
        "description": "Incontriamo Katerina Gordeeva, voce critica russa e autrice di ‘Oltre la soglia del dolore. 24 voci ucraine e russe, per chi sa ascoltare’",
        "content": "Katerina Gordeeva, giornalista indipendente russa fra le più conosciute, documentarista e scrittrice, è stata inclusa nella lista, sempre più lunga, degli “agenti stranieri” (i nuovi nemici del popolo nella Russia putiniana) poco dopo l’invasione su ... [10380 chars]",
        "url": "https://www.laregione.ch/culture/culture/1836693/russia-stato-anni-gordeeva-vita-russi-katerina-n-d-r-perestrojka",
        "image": "https://media.laregione.ch/files/domains/laregione.ch/images/4c95/f_-russia-stato-anni-gordeeva-vita-russi-katerina-n-d-r-perestrojka-1jjxm.jpg?v=1",
        "publishedAt": "2025-05-12T06:30:04Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Zelensky annuncia nuove decisioni a sostegno dell'Ucraina",
        "description": "Il presidente ucraino ringrazia i leader europei per il supporto e auspica un cessate il fuoco con la Russia",
        "content": "\"Stiamo preparando buone decisioni a sostegno dell'Ucraina e del suo popolo\". Lo afferma, nel suo consueto videomessaggio serale, il presidente ucraino, Volodymyr Zelensky, scrive Ukrinform.\n\"Oggi ho parlato con il presidente francese Emmanuel Macron... [748 chars]",
        "url": "https://www.laregione.ch/estero/estero/1836793/presidente-leader-zelensky-cessate-sostegno-ucraina-decisioni",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-11T20:11:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Erdogan rilancia i colloqui di pace tra Russia e Ucraina a Istanbul",
        "description": "Il presidente turco annuncia la ripresa dei negoziati interrotti nel 2022, con l'obiettivo di una soluzione permanente",
        "content": "Il Sultano riprende in mano i fili e si ripropone come il grande tessitore della pace in Ucraina. Ad annunciarlo è stato lo stesso presidente turco, Recep Tayyip Erdogan, che afferma di aver ricevuto la proposta dallo zar Vladimir Putin al telefono.\n... [3114 chars]",
        "url": "https://www.laregione.ch/estero/estero/1836740/erdogan-mosca-ucraina-colloqui-russia-istanbul-pace-russi",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-11T15:13:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "Erdogan pronto a ospitare nuovi negoziati di pace tra Russia e Ucraina",
        "description": "Il presidente turco offre Istanbul come sede per riprendere i colloqui interrotti nel 2022",
        "content": "Il presidente turco Recep Tayyip Erdogan ha avuto un colloquio telefonico con il presidente russo Vladimir Putin dicendosi pronto ad ospitare i negoziati per la pace in Ucraina.\nSecondo una dichiarazione della presidenza turca, Erdogan ha detto a Put... [1114 chars]",
        "url": "https://www.laregione.ch/estero/estero/1836698/negoziati-presidente-istanbul-erdogan-pace-ucraina-russia",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-11T11:18:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    },
    {
        "title": "\"Potenzialmente un giorno grandioso per Russia e Ucraina!\"",
        "description": "Putin propone negoziati diretti tra Mosca e Kiev. Macron: «Un primo passo, ma non sufficiente»",
        "content": "La tregua è finita - Nel frattempo è terminato alla mezzanotte di sabato (le 23 in Svizzera) il cessate il fuoco russo di 72 ore in Ucraina, che Kiev ha dichiarato essere stato violato centinaia di volte da Mosca. Il presidente Vladimir Putin aveva a... [306 chars]",
        "url": "https://www.tio.ch/dal-mondo/attualita/1836640/potenzialmente-un-giorno-grandioso-per-russia-e-ucraina",
        "image": "https://media.tio.ch/files/domains/tio.ch/images/4c95/f_-potenzialmente-un-giorno-grandioso-per-russia-e-ucraina-1jjpv.jpg?v=1",
        "publishedAt": "2025-05-11T06:31:29Z",
        "source": {
            "name": "20 minuti Ticino",
            "url": "https://www.tio.ch"
        }
    },
    {
        "title": "Kim Jong-un minaccia l'uso della forza militare contro gli Stati Uniti",
        "description": "Il leader nordcoreano giustifica l'invio di truppe in Russia come esercizio di diritti sovrani",
        "content": "Il leader nordcoreano Kim Jong-un ha assicurato che non esiterà a utilizzare la forza militare del paese eremita \"se gli Stati Uniti e i suoi stati vassalli cercheranno di organizzare\" un altro attacco contro la Russia.\n\"Se si permette loro di contin... [2147 chars]",
        "url": "https://www.laregione.ch/estero/estero/1836532/kim-truppe-russia-stati-leader-forza-jong-un-nord-jong",
        "image": "https://www.laregione.ch/img/laregione.ch/favicons/android-icon-192x192.png",
        "publishedAt": "2025-05-10T11:49:00Z",
        "source": {
            "name": "LaRegione Ticino",
            "url": "https://www.laregione.ch"
        }
    }
]