[
    {
        "title": "Andrea Orcel dit que la percée ukrainienne pourrait débloquer la vente de l'unité russe d'Unicredit - FT",
        "description": "* ANDREA ORCEL SAYS UKRAINE BREAKTHROUGH COULD UNLOCK SALE OF UNICREDITS RUSSIA UNIT- FT Source text : https://tinyurl.com/2exv8w77 Further company coverage : ...",
        "content": "M. Andrea Orcel est Chief Executive Officer d'UBS AG (succursale de Londres) et d'UBS Ltd. et président de la banque d'investissement d'UBS Group AG. Il est membre du conseil d'administration d'UBS Ltd. et d'UBS Americas Holding LLC. Il est devenu me... [1301 chars]",
        "url": "https://www.zonebourse.com/cours/action/UNICREDIT-S-P-A-33364083/actualite/Andrea-Orcel-dit-que-la-percee-ukrainienne-pourrait-debloquer-la-vente-de-l-unite-russe-d-Unicred-49107173/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2025-02-20T05:02:48Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Un tribunal russe remet à l'État russe les actifs d'un entrepôt appartenant aux Émirats arabes unis, selon l'entreprise",
        "description": "Les 16 entrepôts du plus grand propriétaire d'entrepôts de Russie ont été remis à l'État russe, a déclaré la société Raven Russia, détenue par les Émirats, citant une décision de justice...\n-Le 03 février 2025 à 14:47\n- Zonebourse",
        "content": "Les 16 entrepôts du plus grand propriétaire d'entrepôts de Russie ont été remis à l'État russe, a déclaré la société Raven Russia, détenue par les Émirats, citant une décision de justice qu'elle a qualifiée d'illégale et de sans fondement.\nDepuis la ... [1560 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/Un-tribunal-russe-remet-a-l-Etat-russe-les-actifs-d-un-entrepot-appartenant-aux-Emirats-arabes-u-48938564/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2025-02-03T13:47:29Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "ENR Russia sera décoté au 20 janvier",
        "description": "La société de participations ENR Russia a annoncé vendredi la validation de sa demande de décotation par SIX Exchange Regulation. Le dernier jour de négoce des actions est fixé au 17 janvier et...",
        "content": "Genève (awp) - La société de participations ENR Russia a annoncé vendredi la validation de sa demande de décotation par SIX Exchange Regulation. Le dernier jour de négoce des actions est fixé au 17 janvier et la radiation au 20 janvier, indique un co... [785 chars]",
        "url": "https://www.zonebourse.com/cours/indice/SMI-7508/actualite/ENR-Russia-sera-decote-au-20-janvier-48723298/",
        "image": "https://www.zonebourse.com/images/reuters/2015-09-17T111947Z_1007120001_LYNXNPEB8G0KP_RTROPTP_2_OFRBS-MARCHES-SYNTHESE-3.JPG",
        "publishedAt": "2025-01-10T06:23:00Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Défense : l'Inde inaugure sa dernière frégate \"Made In Russia\"",
        "description": "Selon New Delhi, le \"Tushil\" est équipé d'un \"mélange impressionnant de technologies de pointe russes et indiennes\". Le ministre indien de la Défense a assisté lundi 9 décembre à la mise en service du der... - 09/12/2024 à 15:16 - Boursorama",
        "content": "Selon New Delhi, le \"Tushil\" est équipé d'un \"mélange impressionnant de technologies de pointe russes et indiennes\".\nLe \"Tushil\" a été inspecté par les autorités indiennes, dans le port de Kaliningrad, avant sa mise en service ( India's Ministry of D... [1807 chars]",
        "url": "https://www.boursorama.com/actualite-economique/actualites/defense-l-inde-inaugure-sa-derniere-fregate-made-in-russia-280a9c142bc47e50a196c887b9a0c692",
        "image": "https://s.brsimg.com/static-000/cache/i/content/images/f/0/0/f00e4ddf5f0ffcc9f1872443574e117a-1200x800.jpg",
        "publishedAt": "2024-12-09T14:16:17Z",
        "source": {
            "name": "Boursorama",
            "url": "https://www.boursorama.com"
        }
    },
    {
        "title": "ENR Russia: feu vert des actionnaires à la décotation",
        "description": "Réunis vendredi en assemblée générale extraordinaire, les actionnaires de la société de participations ENR Russia ont accepté la proposition de retirer les actions de la Bourse. Le conseil...",
        "content": "Genève (awp) - Réunis vendredi en assemblée générale extraordinaire, les actionnaires de la société de participations ENR Russia ont accepté la proposition de retirer les actions de la Bourse. Le conseil d'administration pourra ainsi entreprendre les... [597 chars]",
        "url": "https://www.zonebourse.com/cours/action/ENR-RUSSIA-INVEST-SA-387966/actualite/ENR-Russia-feu-vert-des-actionnaires-a-la-decotation-48542959/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2024-12-06T18:19:12Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "ENR Russia: l'offre de Valartis est valable du 24 octobre au 6 novembre",
        "description": "Le groupe bancaire zougois Valartis a publié mercredi le prospectus de son offre de reprise de la société de participation genevoise ENR Russia. L'offre est valable du 24 octobre au 6 novembre...",
        "content": "Zurich (awp) - Le groupe bancaire zougois Valartis a publié mercredi le prospectus de son offre de reprise de la société de participation genevoise ENR Russia. L'offre est valable du 24 octobre au 6 novembre 2024, sous réserve de prolongation.\nLe pri... [925 chars]",
        "url": "https://www.zonebourse.com/cours/action/ENR-RUSSIA-INVEST-SA-387966/actualite/ENR-Russia-l-offre-de-Valartis-est-valable-du-24-octobre-au-6-novembre-48029522/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2024-10-09T06:17:22Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Valartis lance une offre publique d'achat sur ENR Russia Invest",
        "description": "Le groupe bancaire zougois Valartis souhaite reprendre entièrement la société de participation genevoise ENR Russia. Le prix de l'offre s'élève à 5,60 francs par action ENR.\nLe prospectus de...",
        "content": "Zurich (awp) - Le groupe bancaire zougois Valartis souhaite reprendre entièrement la société de participation genevoise ENR Russia. Le prix de l'offre s'élève à 5,60 francs suisses par action ENR.\nLe prospectus de l'offre devrait être publié en octob... [458 chars]",
        "url": "https://www.zonebourse.com/cours/action/VALARTIS-GROUP-AG-34973405/actualite/Valartis-lance-une-offre-publique-d-achat-sur-ENR-Russia-Invest-47888759/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2024-09-18T05:47:14Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "\" Entre RT et les sanctions, il y a un jeu du chat et de la souris \" : entretien avec Maxime Audinet, spécialiste de la Russie",
        "description": "Le groupe Meta a annoncé, lundi 16 septembre, l’interdiction sur ses plates-formes de médias d’Etat russes, comme Russia Today et Sputnik. Selon le chercheur Maxime Audinet, ces médias recourent à la clandestinité pour contourner les sanctions.",
        "content": "Le groupe américain Meta a annoncé, lundi 16 septembre, interdire aux médias d’Etat russes, tels que Russia Today (RT) et Sputnik, d’accéder à ses plates-formes (Facebook, Instagram, WhatsApp et Threads), pour éviter toute « activité d’ingérence étra... [2981 chars]",
        "url": "https://www.lemonde.fr/pixels/article/2024/09/18/entre-rt-et-les-sanctions-il-y-a-un-jeu-du-chat-et-de-la-souris-entretien-avec-maxime-audinet-specialiste-de-russia-today_6323180_4408996.html",
        "image": "https://img.lemde.fr/2024/09/17/138/0/7177/4784/1440/960/60/0/69d1fb6_2024-09-17t000136z-1323710273-rc290y9tklk4-rtrmadp-3-meta-platforms-russia.JPG",
        "publishedAt": "2024-09-17T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "Le festival de Toronto suspend la projection de \" Russians at War \", un documentaire accusé d’être la voix du Kremlin",
        "description": "Une réalisatrice russo-canadienne ancienne employée de la chaîne Russia Today soulève la polémique avec un film reposant sur son accès exclusif aux soldats russes combattant en Ukraine.",
        "content": "Témoignage unique ou insidieuse propagande russe ? Russians at War (Les Russes en guerre), un film documentaire de deux heures qui suit la vie de soldats russes combattant en Ukraine et qui leur donne la parole, suscite une vive polémique partout où ... [2436 chars]",
        "url": "https://www.lemonde.fr/culture/article/2024/09/14/le-festival-de-toronto-suspend-la-projection-de-russians-at-war-un-documentaire-accuse-d-etre-la-voix-du-kremlin_6317341_3246.html",
        "image": "https://img.lemde.fr/2024/09/13/0/0/3000/2000/1440/960/60/0/e2de8c3_fff310ada3b44fad8a4c3a993d96ef28-0-0263bd9c0ecc43e7b0742919e893071e.jpg",
        "publishedAt": "2024-09-13T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "Valartis détient la quasi-majorité d'ENR Russia",
        "description": "Le groupe bancaire Valartis détient désormais 97,9% du capital-actions d'ENR Russia Invest, ont annoncé les deux entreprises mercredi. L'établissement zougois détenait jusqu'à présent 63,2% de...",
        "content": "Zurich (awp) - Le groupe bancaire Valartis détient désormais 97,9% du capital-actions d'ENR Russia Invest, ont annoncé les deux entreprises mercredi. L'établissement zougois détenait jusqu'à présent 63,2% de la société de participations genevoise.\nCe... [587 chars]",
        "url": "https://www.zonebourse.com/cours/action/VALARTIS-GROUP-AG-34973405/actualite/Valartis-detient-la-quasi-majorite-d-ENR-Russia-47705689/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2024-08-21T19:06:23Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Les Etats-Unis démantèlent un réseau de \" bots \" russes sur X",
        "description": "Les autorités américaines ont identifié une plate-forme de création et gestion de faux comptes utilisée selon elles par le service de renseignement russe, le FSB, en collaboration avec la chaîne prorusse Russia Today.",
        "content": "Le département de la justice américain a annoncé, mardi 9 juillet, le démantèlement d’un réseau de faux comptes X attribués par les autorités américaines à un service de renseignement russe, le FSB. Le FBI a ainsi enquêté, en collaboration avec plusi... [2895 chars]",
        "url": "https://www.lemonde.fr/pixels/article/2024/07/10/les-etats-unis-demantelent-un-reseau-de-bots-russes-sur-x_6248365_4408996.html",
        "image": "https://img.lemde.fr/2023/10/10/0/161/3678/2452/1440/960/60/0/574807f_2023-10-10t213542z-1709739110-rc2p92a5aey1-rtrmadp-3-israel-palestinians-socialmedia.JPG",
        "publishedAt": "2024-07-09T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "Le GNL russe représente un quart des importations de gaz espagnoles en mars",
        "description": "Liquefied natural gas from Russia comprised almost 26% of Spain's gas imports in March, up from 14.4% a year earlier, confirming that the Iberian country is a key entry hub for Russian gas into...",
        "content": "Le gaz naturel liquéfié (GNL) en provenance de Russie a représenté près de 26 % des importations de gaz de l'Espagne en mars, contre 14,4 % un an plus tôt, ce qui confirme que le pays ibérique est une plaque tournante essentielle pour l'acheminement ... [1497 chars]",
        "url": "https://www.zonebourse.com/cours/action/ENAG-S-S-A-409361/actualite/Le-GNL-russe-represente-un-quart-des-importations-de-gaz-espagnoles-en-mars-46407841/",
        "image": "https://www.zonebourse.com/images/reuters/2022-10/2022-10-21T105641Z_1_LYNXMPEI9K0E0_RTROPTP_3_UE-ENERGIA-ESPANA.JPG",
        "publishedAt": "2024-04-10T17:50:45Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "L'Ukraine affirme avoir détruit 20 drones au cours de la nuit",
        "description": "Ukraine's air defence systems destroyed 20 attack drones launched by Russia overnight targeting seven Ukrainian regions across the country, Ukrainian Air Force Commander Mykola Oleshchuk said on...",
        "content": "KYIV, 9 avril (Reuters) - Les systèmes de défense anti-aérien ukrainiens ont neutralisé 20 drones lancés par la Russie sur sept régions différentes à travers le pays au cours de la nuit, a déclaré mardi le commandant de l'armée de l'air ukrainienne, ... [1484 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/L-Ukraine-affirme-avoir-detruit-20-drones-au-cours-de-la-nuit-46393845/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2024-04-09T10:10:21Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Le chef de la banque centrale autrichienne voit un \"risque de queue\" dans l'opération de Raiffeisen avec Strabag",
        "description": "Austria's central bank chief said there was a tail risk in a plan by Raiffeisen Bank International to buy a stake in Austrian building company Strabag with funds currently tied up in Russia and...",
        "content": "Le directeur de la banque centrale autrichienne a déclaré que le projet de Raiffeisen Bank International d'acquérir une participation dans la société de construction autrichienne Strabag avec des fonds actuellement bloqués en Russie comportait un \"ri... [2210 chars]",
        "url": "https://www.zonebourse.com/cours/action/RAIFFEISEN-BANK-INTERNATI-6497717/actualite/Le-chef-de-la-banque-centrale-autrichienne-voit-un-risque-de-queue-dans-l-operation-de-Raiffeisen-46344147/",
        "image": "https://www.zonebourse.com/images/reuters/2024-04/2024-04-02T173207Z_1_LYNXNPEK310OK_RTROPTP_3_UKRAINE-CRISIS-RAIFFEISEN.JPG",
        "publishedAt": "2024-04-03T05:17:29Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "ENR Russia Invest essuie une perte en raison de la chute du rouble",
        "description": "La société de participations ENR Russia Invest a essuyé une perte nette de 7,95 millions de francs l'année dernière, qu'elle explique par la dégringolade du rouble. La monnaie russe s'est en...",
        "content": "Zurich (awp) - La société de participations ENR Russia Invest a essuyé une perte nette de 7,95 millions de francs suisses l'année dernière, qu'elle explique par la dégringolade du rouble. La monnaie russe s'est en effet dépréciée de 35% par rapport a... [783 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/ENR-Russia-Invest-essuie-une-perte-en-raison-de-la-chute-du-rouble-46335236/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2024-04-02T06:19:23Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Le correspondant de CNews à Moscou travaille aussi pour Russia Today, média financé par le Kremlin interdit en France",
        "description": "La chaîne CNews travaille désormais avec le journaliste Igor Kurashenko en Russie, en tant que correspondant. Mais ce que la chaîne ne dit pas, c’est qu’il collabore également...",
        "content": "l'essentiel La chaîne CNews travaille désormais avec le journaliste Igor Kurashenko en Russie, en tant que correspondant. Mais ce que la chaîne ne dit pas, c’est qu’il collabore également avec Russia Today, média financé par le Kremlin. De quoi inter... [3059 chars]",
        "url": "https://www.ladepeche.fr/2024/03/27/le-correspondant-de-cnews-a-moscou-travaille-aussi-pour-russia-today-media-finance-par-le-kremlin-interdit-en-france-11853116.php",
        "image": "https://images.ladepeche.fr/api/v1/images/view/6604250352ff8859982f2c57/large/image.jpg?v=1",
        "publishedAt": "2024-03-26T23:00:00Z",
        "source": {
            "name": "LaDepeche.fr",
            "url": "https://www.ladepeche.fr"
        }
    },
    {
        "title": "Le correspondant de CNews à Moscou Igor Kurashenko travaille également pour la chaîne RT financée par la Russie",
        "description": "Igor Kurashenko travaille également pour la chaîne Russia Today, média financé par le Kremlin dont l’antenne française a été interdite de diffusion après l’invasion de l’Ukraine.",
        "content": "CNews CNews\nMÉDIAS - Igor Kurashenko travaille pour CNews, mais pas seulement. Un article du journal Libération lève le voile ce mardi 26 mars sur la double casquette du correspondant en Russie de la chaîne d’info conservatrice : il est aussi reporte... [2522 chars]",
        "url": "https://www.huffingtonpost.fr/medias/article/le-correspondant-de-cnews-a-moscou-igor-kurashenko-travaille-egalement-pour-la-chaine-rt-financee-par-la-russie_231777.html",
        "image": "https://huffpost-focus.sirius.press/2024/03/26/0/110/1379/776/1820/1023/75/0/6e17e46_1711471430596-wvuusyjfwvav7ndmgywoadeypq.jpg",
        "publishedAt": "2024-03-26T17:04:00Z",
        "source": {
            "name": "Le HuffPost",
            "url": "https://www.huffingtonpost.fr"
        }
    },
    {
        "title": "Incendie dans une raffinerie de pétrole russe après une attaque de drones ukrainienne-gouverneur",
        "description": "The governor of Russia's Samara region said on Saturday that Ukrainian drones had struck two Rosneft oil refineries in the region, causing no casualties but leaving one facility on fire....",
        "content": "MOSCOU, 16 mars (Reuters) - Une attaque de drones ukrainiens a visé deux raffineries de pétrole dans la région de Samara, a déclaré samedi le gouverneur de la région, précisant qu'un incendie s'était déclaré dans l'une des infrastructures.\nDmitry Aza... [701 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/Incendie-dans-une-raffinerie-de-petrole-russe-apres-une-attaque-de-drones-ukrainienne-gouverneur-46213902/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2024-03-16T06:12:39Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Dans les ports ukrainiens bombardés, les acheteurs de navires cherchent à faire des affaires",
        "description": "Since Russia invaded Ukraine two years ago, nearly 50 merchant ships have been languishing in its waters, stuck in ports too dangerous to sail from. ...\n-Le 15 mars 2024 à 12:49\n- Zonebourse",
        "content": "Depuis que la Russie a envahi l'Ukraine il y a deux ans, près de 50 navires marchands languissent dans ses eaux, bloqués dans des ports trop dangereux pour être utilisés.\nMais si ces navires n'ont pas bougé, certains de leurs propriétaires ont changé... [5569 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/Dans-les-ports-ukrainiens-bombardes-les-acheteurs-de-navires-cherchent-a-faire-des-affaires-46208341/",
        "image": "https://www.zonebourse.com/images/reuters/2024-03/2024-03-15T114958Z_1_LYNXNPEK2E0F9_RTROPTP_3_UKRAINE-CRISIS-SHIPPING-PORTS.JPG",
        "publishedAt": "2024-03-15T12:49:58Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Le cofondateur de Yandex, Arkady Volozh, sera retiré de la liste des sanctions russes de l'UE, selon certaines sources",
        "description": "EU countries have agreed to remove Arkady Volozh, co-founder of Russian internet giant Yandex, from their list of sanctioned entities and individuals relating to Russia's war in Ukraine, three...",
        "content": "Les pays de l'UE ont accepté de retirer Arkady Volozh, cofondateur du géant russe de l'internet Yandex, de leur liste d'entités et de personnes sanctionnées dans le cadre de la guerre en Ukraine, ont déclaré trois sources au fait du dossier.\nM. Voloz... [1199 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/Le-cofondateur-de-Yandex-Arkady-Volozh-sera-retire-de-la-liste-des-sanctions-russes-de-l-UE-selo-45999160/",
        "image": "https://www.zonebourse.com/images/reuters/2022-06/2022-06-03T151643Z_2_LYNXMPEI520QB_RTROPTP_3_UKRAINE-CRISIS-RUSSIA-YANDEX.JPG",
        "publishedAt": "2024-02-21T15:47:09Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Ukraine-L'armée de l'air dit avoir abattu 13 drones lancés par la Russie",
        "description": "Russia launched 19 attack drones at Ukraine overnight and six missiles, with the Ukrainian air defence systems destroying 13 of the drones and one missile, Ukraine's air force said on Wednesday. ...\n-Le 21 février 2024 à 06:56\n- Zonebourse",
        "content": "21 février (Reuters) - La Russie a lancé 19 drones et six missiles contre l'Ukraine dans la nuit de mardi à mercredi, a déclaré l'armée de l'air ukrainienne, précisant que les systèmes de défense aérienne ukrainiens avaient détruit 13 drones et un mi... [743 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/Ukraine-L-armee-de-l-air-dit-avoir-abattu-13-drones-lances-par-la-Russie-45993519/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2024-02-21T05:56:16Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Agriculteurs en colère : The New York Times, The Guardian, El Periodico, Russia Today ... le convoi parti d'Agen fait le tour de la presse mondiale !",
        "description": "Les médias du monde entier se sont emparés des événements agricoles en France en général, et en Lot-et-Garonne en particulier. Revue de presse.",
        "content": "l'essentiel Les médias du monde entier se sont emparés des événements agricoles en France en général, et en Lot-et-Garonne en particulier. Revue de presse.\nLes événements vécus actuellement en France animent aussi les médias à l'étranger. Et force es... [5271 chars]",
        "url": "https://www.ladepeche.fr/2024/01/30/agriculteurs-en-colere-le-convoi-parti-dagen-fait-le-tour-du-monde-11731601.php",
        "image": "https://images.ladepeche.fr/api/v1/images/view/65b8fc0b6f3c1f7d9c6306b7/large/image.jpg?v=1",
        "publishedAt": "2024-01-29T23:00:00Z",
        "source": {
            "name": "LaDepeche.fr",
            "url": "https://www.ladepeche.fr"
        }
    },
    {
        "title": "L'Ukraine dit avoir abattu 11 drones russes",
        "description": "Russia launched 14 attack drones and five missiles at Ukraine overnight, Ukraine's air force said on Thursday, with air defence systems destroying 11 of the drones. ...\n-Le 25 janvier 2024 à 06:47\n- Zonebourse",
        "content": "KYIV, 25 janvier (Reuters) - La Russie a lancé 14 drones et cinq missiles sur l'Ukraine dans la nuit de mercredi à jeudi, a déclaré jeudi l'armée de l'air ukrainienne, précisant les systèmes de défense aérienne ayant détruit 11 drones.\nL'armée de l'a... [674 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/L-Ukraine-dit-avoir-abattu-11-drones-russes-45807798/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2024-01-25T05:47:12Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "La Russie a lancé sa \" Tesla killer \" qui fait bien rire tout le monde",
        "description": "L'Université Polytechnique de Moscou a levé le voile sur Amber, un prototype de voiture électrique « made in Russia ». Surnommée ironiquement la « Tesla Killer » sur les réseaux sociaux, cette voiture a suscité des réactions on va dire contrastées, en raison de son design singulier et de ses promesses de fabrication entièrement russe.",
        "content": "L’Amber représente un sacré pari pour l’industrie automobile russe, en particulier pour l’usine Avtotor de Kaliningrad. Jadis constructeur de voitures pour les marques BMW, Ford, KIA ou encore Hyundai, l’usine a dû se réorienter à la suite des sancti... [2465 chars]",
        "url": "https://www.journaldugeek.com/2023/12/24/la-russie-a-lance-sa-tesla-killer-qui-fait-bien-rire-tout-le-monde/",
        "image": "https://www.journaldugeek.com/app/uploads/2023/12/Amber.jpg",
        "publishedAt": "2023-12-24T15:00:02Z",
        "source": {
            "name": "Journal du geek",
            "url": "https://www.journaldugeek.com"
        }
    },
    {
        "title": "Russie-Des paramilitaires opposés à Poutine revendiquent une attaque",
        "description": "The Freedom of Russia Legion, a Ukrainian-based paramilitary group of Russians who oppose President Vladimir Putin, claimed responsibility on Sunday for a cross-border attack a few kilometres ...\n-Le 17 décembre 2023 à 23:02\n- Zonebourse",
        "content": "KYIV, 17 décembre (Reuters) - La Légion de la liberté de la Russie, un groupe paramilitaire basé en Ukraine et composé de Russes opposés au président Vladimir Poutine, a revendiqué dimanche une attaque transfrontalière à quelques kilomètres de la rég... [1349 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/Russie-Des-paramilitaires-opposes-a-Poutine-revendiquent-une-attaque-45585895/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2023-12-17T22:02:28Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "La banque russe VTB finalisera l'intégration d'Otkritie d'ici fin 2024",
        "description": "Russia's No. 2 lender VTB will complete its integration of Otkritie Bank by the end of 2024, ahead of schedule, Georgy Gorshkov, deputy president and board chairman, said on Thursday. ...",
        "content": "Le deuxième prêteur de Russie, VTB, achèvera l'intégration d'Otkritie Bank d'ici la fin de 2024, en avance sur le calendrier, a déclaré jeudi Georgy Gorshkov, vice-président et président du conseil d'administration.\nLa banque centrale a renfloué Otkr... [899 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/La-banque-russe-VTB-finalisera-l-integration-d-Otkritie-d-ici-fin-2024-45520454/",
        "image": "https://www.zonebourse.com/images/reuters/2022-03/2022-03-01T084530Z_1_LYNXMPEI201QM_RTROPTP_3_EMERGING-RUSSIA-OTKRITIE.JPG",
        "publishedAt": "2023-12-07T10:31:20Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "L'Ukraine abat 16 drones et un missile lors des dernières attaques russes-armée",
        "description": "Ukraine's military shot down 16 out of 18 attack drones launched by Russia as well as one missile during overnight strikes, Kyiv's air force said on Thursday....\n-Le 16 novembre 2023 à 11:54\n- Zonebourse",
        "content": "KYIV, 16 novembre (Reuters) - L'armée ukrainienne a abattu 16 des 18 drones d'attaque lancés par la Russie au cours de la nuit de mercredi à jeudi, ainsi qu'un missile, a déclaré l'armée de l'air.\nLes défenses aériennes ukrainiennes ont été activées ... [1075 chars]",
        "url": "https://www.zonebourse.com/actualite-bourse/L-Ukraine-abat-16-drones-et-un-missile-lors-des-dernieres-attaques-russes-armee-45371492/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2023-11-16T10:54:04Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Poutine approuve le transfert à Rosatom d'actions détenues par l'État dans une société de transport maritime",
        "description": "President Vladimir Putin signed on Wednesday a decree transferring to Russia's state nuclear power company Rosatom state-owned shares of the Far Eastern Shipping Company, parent company of...",
        "content": "Le président Vladimir Poutine a signé mercredi un décret transférant à la compagnie nucléaire russe Rosatom les actions détenues par l'État dans la Far Eastern Shipping Company, société mère du groupe de transport Fesco.\nFesco était auparavant contrô... [1368 chars]",
        "url": "https://www.zonebourse.com/cours/action/FESCO-GROUP-CO-LTD-9950112/actualite/Poutine-approuve-le-transfert-a-Rosatom-d-actions-detenues-par-l-Etat-dans-une-societe-de-trans-45276521/",
        "image": "https://www.zonebourse.com/images/reuters/2022-07/2022-07-30T145955Z_1_LYNXMPEI6T05Q_RTROPTP_3_RUSSIA-FORUM.JPG",
        "publishedAt": "2023-11-08T17:55:53Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "ENR Russia Invest: VNI 10,64 francs par action à fin septembre",
        "description": "La société de participation spécialisée sur la Russie ENR Russia Invest affichait une valeur nette d'inventaire par action de 10,64 francs, a-t-elle indiqué mardi soir. En raison des variations...",
        "content": "Genève (awp) - La société de participation spécialisée sur la Russie ENR Russia Invest affichait une valeur nette d'inventaire (VNI) par action de 10,64 francs suisses, a-t-elle indiqué mardi soir. En raison des variations de l'environnement opératio... [335 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/ENR-Russia-Invest-VNI-10-64-francs-par-action-a-fin-septembre-45202515/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2023-10-31T19:08:02Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Valeo annonce la vente de son activité de systèmes thermiques en Russie à NPK Avtopribor",
        "description": "French car parts maker Valeo said on Tuesday it had signed an agreement to sell its thermal systems production assets in Russia to NPK Avtopribor for an undisclosed sum....",
        "content": "L'équipementier automobile français Valeo a annoncé mardi qu'il avait signé un accord pour vendre ses actifs de production de systèmes thermiques en Russie à NPK Avtopribor pour un montant non divulgué.\nValeo a déclaré dans un communiqué que la vente... [833 chars]",
        "url": "https://www.zonebourse.com/cours/action/VALEO-27891158/actualite/Valeo-annonce-la-vente-de-son-activite-de-systemes-thermiques-en-Russie-a-NPK-Avtopribor-45202056/",
        "image": "https://www.zonebourse.com/images/reuters/2023-05/2023-05-24T153129Z_1_LYNXMPEJ4N0M6_RTROPTP_3_VALEO-RESULTS.JPG",
        "publishedAt": "2023-10-31T18:03:36Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "La BERD réduit ses participations en Russie en vendant sa part dans la Bourse de Moscou -Forbes",
        "description": "La Banque européenne pour la reconstruction et le développement a vendu sa participation de 5,3 % dans la Bourse de Moscou à la société informatique Softline, a rapporté Forbes Russia lundi,...",
        "content": "La Banque européenne pour la reconstruction et le développement (BERD) a vendu sa participation de 5,3 % dans la Bourse de Moscou à la société informatique Softline, a rapporté Forbes Russia lundi, citant deux personnes familières avec le sujet.\nLa B... [1610 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/La-BERD-reduit-ses-participations-en-Russie-en-vendant-sa-part-dans-la-Bourse-de-Moscou-Forbes-45122808/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
        "publishedAt": "2023-10-23T08:28:27Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Cheap sunflower oil from Russia, Ukraine rattles palm oil market -Le 11 octobre 2023 à 11:08",
        "description": "Un afflux d'huile de tournesol bon marché en provenance de Russie et d'Ukraine exerce une pression à la baisse sur les prix de l'huile de palme, les deux principaux producteurs profitant de la...",
        "content": "Un afflux d'huile de tournesol bon marché en provenance de Russie et d'Ukraine exerce une pression à la baisse sur les prix de l'huile de palme, les deux principaux producteurs profitant de la dépréciation de leur monnaie pour s'emparer d'une plus gr... [4226 chars]",
        "url": "https://www.zonebourse.com/cours/matiere-premiere/WTI-2355639/actualite/L-huile-de-tournesol-bon-marche-en-provenance-de-Russie-et-d-Ukraine-ebranle-le-marche-de-l-huile-45037513/",
        "image": "https://www.zonebourse.com/images/reuters/2016-09-08T201411Z_2_LYNXNPEC8716K_RTROPTP_2_USA-ECONOMY-OIL.JPG",
        "publishedAt": "2023-10-11T06:26:07Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Russia's Magnit launches extra buyback offer after strong foreign demand -Le 10 octobre 2023 à 17:49",
        "description": "Le détaillant russe Magnit a annoncé mardi une offre supplémentaire de rachat d'actions bloquées, donnant ainsi à davantage d'investisseurs occidentaux la possibilité de retirer des fonds de...",
        "content": "Le détaillant russe Magnit a annoncé mardi une offre supplémentaire de rachat d'actions bloquées, donnant ainsi à davantage d'investisseurs occidentaux la possibilité de retirer des fonds de Russie après avoir suscité un intérêt significatif lors d'u... [2148 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBLE--2370597/actualite/Le-detaillant-russe-Magnit-lance-une-offre-de-rachat-supplementaire-apres-une-forte-demande-etra-45031098/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2023-10-10T15:49:20Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "Le FBI enquête sur l’empoisonnement d’une militante russe à Prague",
        "description": "L’attaque contre Natalia Arno, présidente de la fondation Free Russia, s’inscrit dans une longue liste d’anciens agents, opposants et journalistes russes, victimes de produits neurotoxiques.",
        "content": "LETTRE DE WASHINGTON\nNatalia Arno, présidente de la fondation Free Russia, à Bruxelles, le 5 juin 2023. OLIVIER HOSLET / EPA\nLa porte de sa chambre était ouverte. Natalia Arno eut un bref moment d’hésitation. Une femme de ménage de cet hôtel pragois ... [3054 chars]",
        "url": "https://www.lemonde.fr/international/article/2023/09/19/le-fbi-enquete-sur-l-empoisonnement-d-une-militante-russe-a-prague_6189941_3210.html",
        "image": "https://img.lemde.fr/2023/09/13/200/0/4487/2991/1440/960/60/0/38a5dcb_1694648842602-epalivesix871152.jpg",
        "publishedAt": "2023-09-18T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "ENR Russia glisse dans le rouge, pénalisée par le rouble",
        "description": "La société d'investissements ENR Russia Invest a inscrit une lourde perte sur les six premiers mois de l'année, pénalisée par une chute de 20% du rouble par rapport au franc. L'activité demeure...",
        "content": "Genève (awp) - La société d'investissements ENR Russia Invest a inscrit une lourde perte sur les six premiers mois de l'année, pénalisée par une chute de 20% du rouble par rapport au franc. L'activité demeure difficile en raison des sanctions interna... [633 chars]",
        "url": "https://www.zonebourse.com/cours/devise/US-DOLLAR-RUSSIAN-ROUBL-2370597/actualite/ENR-Russia-glisse-dans-le-rouge-penalisee-par-le-rouble-44686887/",
        "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
        "publishedAt": "2023-08-24T07:15:03Z",
        "source": {
            "name": "Zonebourse.com",
            "url": "https://www.zonebourse.com"
        }
    },
    {
        "title": "In a Ukrainian forest, soldiers push back against Russia's deadly advance",
        "description": "In the Serebryansʹkyy forest, in the northeast of the country, Ukrainian troops are outnumbered and outgunned as they try to contain a Russian offensive.",
        "content": "NewsIn the Serebryansʹkyy forest, in the northeast of the country, Ukrainian troops are outnumbered and outgunned as they try to contain a Russian offensive.\nA few hours after leaving the front line of his brigade's positions in the middle of the Ser... [2527 chars]",
        "url": "https://www.lemonde.fr/en/international/article/2023/08/02/in-a-ukrainian-forest-soldiers-push-back-against-russia-s-deadly-advance_6077574_4.html",
        "image": "https://img.lemde.fr/2023/07/29/0/0/4723/3149/1440/960/60/0/8737db5_1690610794848-lvds1435-b-07-23.jpg",
        "publishedAt": "2023-08-01T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "Russia raises conscription age from 27 to 30",
        "description": "The legislation approved by the Duma should allow for an additional 1.5 million recruits to be drafted and provides for tighter monitoring to prevent mass departures abroad.",
        "content": "Russian soldiers await Vladimir Putin's speech at the Kremlin, Moscow, June 27, 2023 SERGEI GUNEYEV / AP\nShort-staffed, the Russian army is looking for recruits in anticipation of a prolonged conflict in Ukraine. The Duma, the lower house of parliame... [3009 chars]",
        "url": "https://www.lemonde.fr/en/international/article/2023/07/29/russia-raises-conscription-age-from-27-to-30_6071258_4.html",
        "image": "https://img.lemde.fr/2023/07/28/2/0/6000/4000/1440/960/60/0/09e5545_1690511320812-ap23178479683751.jpg",
        "publishedAt": "2023-07-28T22:00:00Z",
        "source": {
            "name": "Le Monde",
            "url": "https://www.lemonde.fr"
        }
    },
    {
        "title": "En Russie, Vladimir Poutine a mis les propagandistes du Kremlin face à un dilemme inhabituel",
        "description": "L’émission du soir de la chaîne d’État Russia 1, qui réunit experts et députés acquis à la cause de Poutine, a adopté un ton bien inhabituel après la rébellion de Wagner.",
        "content": "RUSSIE - Depuis le début de la guerre en Ukraine, la télévision d’État russe défend invariablement la cause de Vladimir Poutine, à coups de fausses informations et de critiques virulentes de l’Occident. Jusqu’à semble-t-il dimanche 26 juin, après la ... [4703 chars]",
        "url": "https://www.huffingtonpost.fr/international/video/en-russie-vladimir-poutine-a-mis-les-propagandistes-du-kremlin-face-a-un-dilemme_219834.html",
        "image": "https://huffpost-focus.sirius.press/2023/06/27/0/0/1576/886/1820/1023/75/0/6ade573_1687880926006-nbbnbnbnvvv-1.JPG",
        "publishedAt": "2023-06-27T16:47:00Z",
        "source": {
            "name": "Le HuffPost",
            "url": "https://www.huffingtonpost.fr"
        }
    },
    {
        "title": "RT France annonce sa \"fermeture\" après le gel de ses comptes bancaires",
        "description": "(Reuters) - Le média Russia Today France (RT France), contrôlé par l'Etat russe, a annoncé samedi sa \"fermeture\" après le gel de ses comptes bancaires.\n\"Sous couvert du 9e paquet de sanctions à l'encont... - 21/01/2023 à 19:15 - Boursorama",
        "content": "Photo d'archives d'un microphone avec le logo RT France, à Paris\n(Reuters) - Le média Russia Today France (RT France), contrôlé par l'Etat russe, a annoncé samedi sa \"fermeture\" après le gel de ses comptes bancaires.\n\"Sous couvert du 9e paquet de san... [504 chars]",
        "url": "https://www.boursorama.com/actualite-economique/actualites/rt-france-annonce-sa-fermeture-apres-le-gel-de-ses-comptes-bancaires-a4007f4d69a972903d0033778e73ed98",
        "image": "https://s.brsimg.com/static-000/cache/i/content/images/9/4/b/94b392d57d149c6b8bc5496c4f1d701e-1200x800.jpg",
        "publishedAt": "2023-01-21T18:15:45Z",
        "source": {
            "name": "Boursorama",
            "url": "https://www.boursorama.com"
        }
    },
    {
        "title": "RT France, branche française de la chaîne russe Russia Today, annonce sa fermeture \"après 5 années d'acharnement\"",
        "description": "RT France, branche française de la chaîne russe RT suspendue dans l'Union européenne, a annoncé ce samedi 21 janvier sa",
        "content": "l'essentiel RT France, branche française de la chaîne russe RT suspendue dans l'Union européenne, a annoncé ce samedi 21 janvier sa \"fermeture\" au lendemain du gel de ses comptes bancaires.\nLa branche française de la chaîne russe a fini par céder. \"A... [2555 chars]",
        "url": "https://www.ladepeche.fr/2023/01/21/rt-france-branche-francaise-de-la-chaine-russe-russia-today-annonce-sa-fermeture-apres-5-annees-dacharnement-10942285.php",
        "image": "https://images.ladepeche.fr/api/v1/images/view/63cc1fbe6deb52313f0c3020/large/image.jpg?v=1",
        "publishedAt": "2023-01-20T23:00:00Z",
        "source": {
            "name": "LaDepeche.fr",
            "url": "https://www.ladepeche.fr"
        }
    },
    {
        "title": "Il avait suggéré de noyer des enfants ukrainiens, un journaliste de la chaîne Russia Today suspendu",
        "description": "Anton Krassovski, journaliste de Russia Today, a déclaré, la semaine dernière, a déclaré que les enfants ukrainiens ayant critiqué la Russie méritaient d'être",
        "content": "l'essentiel Anton Krassovski, journaliste de Russia Today, a déclaré, la semaine dernière, a déclaré que les enfants ukrainiens ayant critiqué la Russie méritaient d'être \"noyés\". Il a été suspendu, ce lundi 24 octobre, par sa rédaction qui dénonce d... [1935 chars]",
        "url": "https://www.ladepeche.fr/2022/10/24/il-avait-suggere-de-noyer-des-enfants-ukrainiens-un-journaliste-de-la-chaine-russia-today-suspendu-10759853.php",
        "image": "https://images.ladepeche.fr/api/v1/images/view/6356a1182afc4255ce4be487/large/image.jpg?v=1",
        "publishedAt": "2022-10-23T22:00:00Z",
        "source": {
            "name": "LaDepeche.fr",
            "url": "https://www.ladepeche.fr"
        }
    },
    {
        "title": "Enel : A vendu sa participation dans PJSC Enel Russia",
        "description": "(CercleFinance.com) - Enel annonce avoir finalisé la vente de la totalité de sa participation dans PJSC Enel Russia, soit 56,43 % du capital social de cette …",
        "content": "Les données collectées sont indispensables à ces traitements et sont destinées aux services concernés de BFM Bourse et, le cas échéant, de ses prestataires. Elles sont conservées pendant la durée du traitement et/ou pour la durée des traitements spéc... [910 chars]",
        "url": "https://www.tradingsat.com/actualites/informations-societes/enel-a-vendu-sa-participation-dans-pjsc-enel-russia-1039471.html",
        "image": "https://www.tradingsat.com/refonte/img/logos/BFM-Bourse.jpg",
        "publishedAt": "2022-10-13T10:40:00Z",
        "source": {
            "name": "BFM Bourse",
            "url": "https://www.tradingsat.com"
        }
    },
    {
        "title": "RT France perd un recours contre l'UE, Moscou met en garde contre des représailles",
        "description": "par Foo Yun Chee\nBRUXELLES (Reuters) - Le Tribunal de l'Union européenne a rejeté mercredi un recours déposé par le média Russia Today France (RT France), contrôlé par l'État russe, contre l'inter... - 27/07/2022 à 16:53 - Boursorama",
        "content": "RT FRANCE PERD UN RECOURS CONTRE L'UE, MOSCOU MET EN GARDE CONTRE DES REPRÉSAILLES\npar Foo Yun Chee\nBRUXELLES (Reuters) - Le Tribunal de l'Union européenne a rejeté mercredi un recours déposé par le média Russia Today France (RT France), contrôlé par... [2103 chars]",
        "url": "https://www.boursorama.com/actualite-economique/actualites/rt-france-perd-un-recours-contre-l-ue-moscou-met-en-garde-contre-des-represailles-d34f6a73d754dcc2f9a7744503950cc3",
        "image": "https://s.brsimg.com/static-000/cache/i/content/images/8/c/4/8c4aedf6797fd20e020cafbf596222a0-1200x800.jpg",
        "publishedAt": "2022-07-27T14:53:39Z",
        "source": {
            "name": "Boursorama",
            "url": "https://www.boursorama.com"
        }
    },
    {
        "title": "RT France: la justice européenne confirme la suspension du média russe",
        "description": "La justice européenne a rejeté mercredi la demande de la chaîne d'information RT France (ex-Russia Today) d'annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l'UE contre Moscou,…",
        "content": "Luxembourg (AFP) – La justice européenne a rejeté mercredi la demande de la chaîne d'information RT France (ex-Russia Today) d'annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l'UE contre Moscou, qui a immédiatement promis... [1768 chars]",
        "url": "https://www.france24.com/fr/info-en-continu/20220727-rt-france-la-justice-europ%C3%A9enne-confirme-la-suspension-du-m%C3%A9dia-russe",
        "image": "https://s.france24.com/media/display/3982492e-fdd2-11eb-93a0-005056bfb2b6/w:1280/p:16x9/94fccdaa186797c0c32bb3808a735c21250c8a19.jpg",
        "publishedAt": "2022-07-27T10:12:11Z",
        "source": {
            "name": "FRANCE 24",
            "url": "https://www.france24.com/fr"
        }
    },
    {
        "title": "RT France: la justice européenne confirme la suspension du média russe",
        "description": "La justice européenne a rejeté mercredi la demande de la chaîne d'information RT France (ex-Russia Today) d'annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l'UE contre Moscou, qui a immédiatement promis de riposter contre les médias occidentaux.",
        "content": "La justice européenne a rejeté mercredi la demande de la chaîne d'information RT France (ex-Russia Today) d'annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l'UE contre Moscou, qui a immédiatement promis de riposter contre... [1714 chars]",
        "url": "https://actu.orange.fr/societe/high-tech/rt-france-la-justice-europeenne-confirme-la-suspension-du-media-russe-CNT000001QJzfW.html",
        "image": "http://media3.woopic.com/api/v1/images/661%2Factu%2Fafp-news%2F9a4%2F9c4%2F77a56988fbc61cb77eb8f4fa39%2Frt-france-la-justice-europeenne-confirme-la-suspension-du-media-russe%7C000_15A7F6-highDef.jpg?format=470x264&facedetect=1&quality=85",
        "publishedAt": "2022-07-27T10:10:34Z",
        "source": {
            "name": "Actu Orange",
            "url": "https://actu.orange.fr"
        }
    },
    {
        "title": "La justice européenne confirme la suspension du média RT France",
        "description": "La justice européenne a rejeté ce mercredi la demande de la chaîne d’information RT France (ex-Russia Today) d’annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l’UE...",
        "content": "La justice européenne a rejeté ce mercredi la demande de la chaîne d’information RT France (ex-Russia Today) d’annuler la suspension de sa diffusion décidée dans le cadre des sanctions de l’UE contre Moscou, selon un arrêt consulté par l’AFP. Dans sa... [318 chars]",
        "url": "https://www.letelegramme.fr/france/la-justice-europeenne-confirme-la-suspension-du-media-rt-france-27-07-2022-13127253.php",
        "image": "https://www.letelegramme.fr/static/assets/img/letelegramme-logot-t.png",
        "publishedAt": "2022-07-27T09:40:00Z",
        "source": {
            "name": "Le Télégramme",
            "url": "https://www.letelegramme.fr"
        }
    },
    {
        "title": "Russie : face aux pénuries, des entreprises jouent la carte du \"made in Russia\"",
        "description": "Conséquence des sanctions économiques contre la Russie en raison de l’invasion de l’Ukraine, les entreprises russes ne reçoivent plus de composants ni de matières premières. Face au risque de pénuries,…",
        "content": "REPORTAGE\nConséquence des sanctions économiques contre la Russie en raison de l’invasion de l’Ukraine, les entreprises russes ne reçoivent plus de composants ni de matières premières. Face au risque de pénuries, certaines s’adaptent et mettent en ava... [1169 chars]",
        "url": "https://www.france24.com/fr/europe/20220615-russie-face-aux-p%C3%A9nuries-des-entreprises-jouent-la-carte-du-made-in-russia",
        "image": "https://s.france24.com/media/display/bc027344-ecd1-11ec-8f1b-005056bf30b7/w:1280/p:16x9/ReportageRussie.jpg",
        "publishedAt": "2022-06-15T17:47:26Z",
        "source": {
            "name": "FRANCE 24",
            "url": "https://www.france24.com/fr"
        }
    },
    {
        "title": "Russie: RT France conteste sa suspension devant la justice européenne",
        "description": "La chaîne d'information RT France (ex-Russia Today) a contesté vendredi devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou, le média d'Etat russe…",
        "content": "La chaîne d'information RT France (ex-Russia Today) conteste devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou\nLuxembourg (AFP) – La chaîne d'information RT France (ex-Russia Today) a contest... [2600 chars]",
        "url": "https://www.france24.com/fr/info-en-continu/20220610-russie-rt-france-conteste-sa-suspension-devant-la-justice-europ%C3%A9enne",
        "image": "https://s.france24.com/media/display/ceed9bf6-e8b1-11ec-82c8-005056a9a7b9/w:1280/p:16x9/f79dcecc53fe427fdd41d29624b638f8427e7f2c.jpg",
        "publishedAt": "2022-06-10T11:38:12Z",
        "source": {
            "name": "FRANCE 24",
            "url": "https://www.france24.com/fr"
        }
    },
    {
        "title": "Russie: RT France conteste sa suspension devant la justice européenne",
        "description": "La chaîne d'information RT France (ex-Russia Today) a contesté vendredi devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou, le média d'Etat russe revendiquant sa \"liberté d'expression\".",
        "content": "La chaîne d'information RT France (ex-Russia Today) a contesté vendredi devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou, le média d'Etat russe revendiquant sa \"liberté d'expression\".\nAccusé... [2518 chars]",
        "url": "https://actu.orange.fr/france/russie-rt-france-conteste-sa-suspension-devant-la-justice-europeenne-CNT000001Oev0i.html",
        "image": "http://media1.woopic.com/api/v1/images/661%2Factu%2Fafp-news%2F4e1%2Ff27%2Fe8aa34068153d5ab54c6a07a1e%2Frussie-rt-france-conteste-sa-suspension-devant-la-justice-europeenne%7C000_324C23P-highDef.jpg?format=470x264&facedetect=1&quality=85",
        "publishedAt": "2022-06-10T11:36:59Z",
        "source": {
            "name": "Actu Orange",
            "url": "https://actu.orange.fr"
        }
    },
    {
        "title": "Russie: RT France conteste sa suspension devant la justice européenne",
        "description": "La chaîne d'information RT France (ex-Russia Today) a contesté vendredi devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou, le média d'Etat russe rev... - 10/06/2022 à 13:36 - Boursorama",
        "content": "La chaîne d'information RT France (ex-Russia Today) conteste devant la justice européenne la suspension de sa diffusion dans le cadre des sanctions de l'UE contre Moscou ( AFP / Ludovic MARIN )\nLa chaîne d'information RT France (ex-Russia Today) a co... [2712 chars]",
        "url": "https://www.boursorama.com/actualite-economique/actualites/russie-rt-france-conteste-sa-suspension-devant-la-justice-europeenne-35c51501b25a0f64ed81f10acef17683",
        "image": "https://s.brsimg.com/static-000/cache/i/content/images/4/e/1/4e1f27e8aa34068153d5ab54c6a07a1e-1200x800.jpg",
        "publishedAt": "2022-06-10T11:36:59Z",
        "source": {
            "name": "Boursorama",
            "url": "https://www.boursorama.com"
        }
    }
]