[
    {
        "title": "Kyiv comes under massive Russian drone, missile attack",
        "description": "The nighttime Russian attack came hours after Russia and Ukraine began a major prisoner exchange, swapping hundreds of soldiers and civilians in the first phase of an exchange that was agreed on by the two sides at a meeting in Istanbul last week.",
        "content": "Ukraine’s capital came under a large-scale Russian drone and missile attack early Saturday with explosions and machine gun fire heard throughout the city, forcing many Kyiv residents to take shelter in underground subway stations.\nThe nighttime Russi... [3450 chars]",
        "url": "https://indianexpress.com/article/news-today/kyiv-massive-russian-drone-missile-attack-10025355/",
        "image": "https://images.indianexpress.com/2025/05/Kyiv-attack.jpg",
        "publishedAt": "2025-05-24T02:38:59Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Kyiv Under Siege: A Night of Drone and Missile Assaults",
        "description": "Russia launched a significant drone and missile assault on Kyiv, leading to fires, debris, and injuries. At least eight people were hurt, with buildings damaged across the city. The attack follows Ukrainian drone strikes on Russian soil, escalating tension between the two nations.",
        "content": "In a relentless onslaught, Russia unleashed drones and missiles on Kyiv early Saturday, leaving significant damage and at least eight injured, according to the city's mayor.\nEyewitnesses reported drones flying over the Ukrainian capital amid a series... [457 chars]",
        "url": "https://www.devdiscourse.com/article/science-environment/3423294-kyiv-under-siege-a-night-of-drone-and-missile-assaults",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/15_05_2025_10_47_58_4389231.png?width=920&format=jpeg",
        "publishedAt": "2025-05-24T01:30:12Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "In Operation Sindoor, air power, sky high",
        "description": "The reputation acquired by the Turkish and Chinese drones and UCAVs during the Armenia-Azerbaijan and Russia-Ukraine wars has been punctured",
        "content": "While it is too early to draw operational and tactical lessons from Operation Sindoor, it may be possible to look at the big picture and draw positive lessons for future national security contingencies. This article seeks to throw light on four criti... [5576 chars]",
        "url": "https://indianexpress.com/article/opinion/columns/in-operation-sindoor-air-power-sky-high-10025063/",
        "image": "https://images.indianexpress.com/2025/05/SiNDooR24id.jpg",
        "publishedAt": "2025-05-24T01:19:25Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Ukraine Kyiv faces large scale Russian drone missile attack with massive explosions heard throughout city",
        "description": "Russia-Ukraine conflict: Prior to the attack, city mayor Vitalii Klitschko warned Kyiv residents of more than 20 Russian strike drones heading towards Kyiv. As the attack continued, he said drone debris fell on a shopping mall and a residential building in Obolon district of Kyiv.",
        "content": "Ukraine: Kyiv faces large-scale Russian drone, missile attack with massive explosions heard throughout city Russia-Ukraine conflict: Prior to the attack, city mayor Vitalii Klitschko warned Kyiv residents of more than 20 Russian strike drones heading... [2880 chars]",
        "url": "https://www.indiatvnews.com/news/world/ukraine-kyiv-faces-large-scale-russian-drone-missile-attack-with-massive-explosions-heard-throughout-city-2025-05-24-991662",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/mussiel-atatck-1748048339.jpg",
        "publishedAt": "2025-05-24T01:14:10Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        }
    },
    {
        "title": "Blitz Over Kyiv: Drone Assaults Ignite Chaos and Blaze",
        "description": "Russia launched an early morning drone and missile attack on Ukraine's capital, Kyiv. The assault caused fires, scattered debris across the city, and injured eight people. Kyiv's mayor reported damage to residential and non-residential buildings. Russian military actions follow recent Ukrainian drone strikes on Russian targets, including Moscow.",
        "content": "In a pre-dawn offensive that rattled residents and set parts of Ukraine's capital ablaze, Russia targeted Kyiv with drones and missiles early Saturday. The assault injured at least eight individuals and left a trail of destruction, authorities report... [614 chars]",
        "url": "https://www.devdiscourse.com/article/science-environment/3423289-blitz-over-kyiv-drone-assaults-ignite-chaos-and-blaze",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/15_05_2025_10_47_58_4389231.png?width=920&format=jpeg",
        "publishedAt": "2025-05-24T00:46:43Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "'Bring them home': Ukraine and Russia exchange 800 POWs in largest prisoner swap since 2022",
        "description": "Announcing the commencement of the first phase of the exchange, Ukrainian President Volodymyr Zelenskyy said that Kyiv returned 390 people to Russia on Friday and said that the process of prisoner swap would continue over the weekend",
        "content": "Announcing the commencement of the first phase of the exchange, Ukrainian President Volodymyr Zelenskyy said that Kyiv returned 390 people to Russia on Friday and said that the process of prisoner swap would continue over the weekend read more\nFreed ... [2910 chars]",
        "url": "https://www.firstpost.com/world/bring-them-home-ukraine-and-russia-exchange-800-pows-in-largest-prisoner-swap-since-2022-13891187.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Untitled-design-2025-05-24T054738.557-2025-05-51b973d2cab5b23c8075c96a1eebd884.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-24T00:18:05Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Kyiv Under Siege: Drone Strikes Ignite Chaos",
        "description": "Early Saturday, Russia targeted Kyiv with drones and missiles, causing fires and scattering debris across the city. The attack injured at least two people, with significant damage reported in Solomyanskyi and Dniprovskyi districts. Emergency crews responded while officials confirmed multiple fires and ongoing anti-aircraft operations.",
        "content": "Early Saturday, Russia launched a series of drone and missile attacks on Kyiv, injuring at least two people and causing widespread damage, according to city officials.\nMayor Vitali Klitschko confirmed a drone hit an apartment building in Solomyanskyi... [398 chars]",
        "url": "https://www.devdiscourse.com/article/science-environment/3423276-kyiv-under-siege-drone-strikes-ignite-chaos",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/20_07_2024_05_42_34_7003346.png?width=920&format=jpeg",
        "publishedAt": "2025-05-23T23:26:43Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "India asserts zero-tolerance on terrorism in Russia, UAE and Japan after Operation Sindoor",
        "description": "India carried out precision strikes on terror infrastructure in Pakistan and Pakistan-occupied Kashmir in the early hours of May 7, following which Pakistan attempted to attack Indian military bases on May 8, 9 and 10. The Indian side responded strongly to the Pakistani actions.",
        "content": "India carried out precision strikes on terror infrastructure in Pakistan and Pakistan-occupied Kashmir in the early hours of May 7, following which Pakistan attempted to attack Indian military bases on May 8, 9 and 10. The Indian side responded stron... [4741 chars]",
        "url": "https://www.firstpost.com/world/india-asserts-zero-tolerance-on-terrorism-in-russia-uae-and-japan-after-operation-sindoor-13891165.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-23T231402.298-2025-05-3f1221e83fb42ff92c97cc562d8c1566.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-23T17:59:02Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Sole National Conference MP does not join all-party delegation, says informed in advance",
        "description": "Mian Altaf Ahmad, who was part of the team that is in Russia now, is due to host annual Urs at his village; NC ‘yet to decide’ on if it will send a replacement",
        "content": "The only representative of the National Conference in the seven all-party delegations which are travelling to foreign countries to convey India’s stand on terrorism and Pakistan did not leave with his group on Thursday.\nMP Mian Altaf Ahmad, who was p... [2090 chars]",
        "url": "https://indianexpress.com/article/political-pulse/sole-nc-mp-does-not-join-all-party-delegation-says-informed-in-advance-10024752/",
        "image": "https://images.indianexpress.com/2025/05/mian-althaf-ahmed.jpg",
        "publishedAt": "2025-05-23T15:26:00Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "No direct negotiations yet: Russia on peace talks with Ukraine",
        "description": "The European Union, along with the UK, has, however, ramped up sanctions on Russia in its 17th sanctions package, announced earlier this week",
        "content": "Russia and Ukraine have no further direct negotiations scheduled, the Kremlin announced on Thursday, as the conflict between them, which is well into its third year, continues to rage on.\n“There is no concrete agreement about the next meetings,” Krem... [2390 chars]",
        "url": "https://www.theweek.in/news/world/2025/05/22/no-direct-negotiations-yet-russia-on-peace-talks-with-ukraine.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/world/images/2025/5/22/russia ukraine no negotiations.jpg",
        "publishedAt": "2025-05-21T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        }
    },
    {
        "title": "‘Russia ready to work with Ukraine on peace accord’: Putin after 2-hour call with Trump",
        "description": "Kremlin aide Yuri Ushakov said that Putin and Trump didn’t discuss any specific timeline for the ceasefire proposal with Ukraine.",
        "content": "After a two-hour telephonic conversation with US President Donald Trump on Monday, Russian President Vladimir Putin agreed to work with Ukraine on a memorandum dealing with a peace accord and said that efforts to end the war with Ukraine were on the ... [2709 chars]",
        "url": "https://indianexpress.com/article/world/russia-ukraine-peace-accord-putin-trump-call-10016742/",
        "image": "https://images.indianexpress.com/2025/03/Trump_9ea38d_20250325172325.jpg",
        "publishedAt": "2025-05-20T03:02:32Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Trump proposes Vatican as ‘great’ venue for Russia-Ukraine talks, Kremlin says ‘no deadline can be set’",
        "description": "President Putin agreed to work with Ukraine on a memorandum for a potential peace deal and end the hostilities with Ukraine.",
        "content": "US President Donald Trump suggested on Monday that peace talks between Russia and Ukraine could take place in the Vatican, as it would provide added significance to the proceedings. Trump said “it would be great” for Russia and Ukraine to hold ceasef... [2135 chars]",
        "url": "https://indianexpress.com/article/world/trump-proposes-vatican-russia-ukraine-talks-kremlin-no-deadline-set-10016693/",
        "image": "https://images.indianexpress.com/2025/03/Trump-Putin-Zelenskyy-.jpg",
        "publishedAt": "2025-05-20T01:12:48Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "5,000 soldiers are being killed every week, we're trying to stop it: Trump on Russia-Ukraine ceasefire talks",
        "description": "Calling the Russia-Ukraine war an absolute bloodbath, Donald Trump said he has seen satellite pictures that are so bad, so horrible.",
        "content": "5,000 soldiers are being killed every week, we're trying to stop it: Trump on Russia-Ukraine ceasefire talks Calling the Russia-Ukraine war an absolute bloodbath, Donald Trump said he has seen satellite pictures that are so bad, so horrible.\nWashingt... [2174 chars]",
        "url": "https://www.indiatvnews.com/news/world/5-000-soldiers-are-being-killed-every-week-we-re-trying-to-stop-it-trump-on-russia-ukraine-ceasefire-talks-2025-05-20-991006",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/17477010211003408_trump_12191.jpg",
        "publishedAt": "2025-05-20T01:11:46Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        }
    },
    {
        "title": "‘Russia, Ukraine to immediately start talks on ceasefire’: Trump after 2-hour call with Putin",
        "description": "Trump previously posted that his conversation with Putin would address ending the 'bloodbath' and might include discussions on trade",
        "content": "US President Donald Trump said on Monday that Russia and Ukraine will begin negotiations immediately, following a phone call with Russian President Vladimir Putin.\nIn a post on Truth Social, Trump said the two-hour conversation with Putin “went very ... [4572 chars]",
        "url": "https://indianexpress.com/article/world/trump-putin-call-russia-ukraine-ceasefire-war-10016284/",
        "image": "https://images.indianexpress.com/2025/05/US-1-5.jpg",
        "publishedAt": "2025-05-20T00:12:31Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Global Dynamics: From Kremlin Talks to Trade Resets",
        "description": "This summary captures significant world events, including complex peace discussions between Moscow and Kyiv, Britain's new trade relationships with the EU post-Brexit, and Russia's ban on Amnesty International. Additionally, pivotal U.S. Supreme Court deliberations and U.S.-Russia relations are detailed, alongside multiple geopolitical developments.",
        "content": "The Kremlin has dismissed the possibility of setting a deadline for a peace and ceasefire memorandum concerning Ukraine, highlighting the complexity of negotiations with Kyiv. Spokesperson Dmitry Peskov emphasized detailed preparations are paramount,... [700 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3418361-global-dynamics-from-kremlin-talks-to-trade-resets",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/19_05_2025_16_22_12_7155715.png?width=920&format=jpeg",
        "publishedAt": "2025-05-19T23:53:12Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "Trump and Putin: Navigating the Path to a Ceasefire",
        "description": "Presidents Trump and Putin discussed initiating negotiations for a ceasefire between Russia and Ukraine. Trump resisted imposing further sanctions on Russia, suggesting some progress was being made. European leaders have pressured Russia with sanctions, while Trump coordinated global leaders towards finding a peaceful resolution.",
        "content": "In a pivotal discussion on Monday, President Donald Trump communicated with President Vladimir Putin, signaling an imminent start to negotiations for a ceasefire between Russia and Ukraine, according to Trump. However, the Kremlin indicated that achi... [902 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3418354-trump-and-putin-navigating-the-path-to-a-ceasefire",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/04_01_2025_21_22_11_3948417.jpg?width=920&format=jpeg",
        "publishedAt": "2025-05-19T23:13:45Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "European Leaders Rally for Increased Sanctions on Russia",
        "description": "European leaders, informed by U.S. President Donald Trump about his call with Russian President Vladimir Putin, agreed to heighten sanctions on Russia. The discussions aim to address the ongoing Ukrainian conflict, which Trump has attempted to mediate, without achieving major concessions from Russia.",
        "content": "European leaders, following a briefing from U.S. President Donald Trump, have decided to escalate sanctions against Russia. The briefing detailed Trump's discussion with Russian President Vladimir Putin regarding the conflict in Ukraine.\nTrump's call... [659 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3418339-european-leaders-rally-for-increased-sanctions-on-russia",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/29_04_2025_18_32_02_9175884.png?width=920&format=jpeg",
        "publishedAt": "2025-05-19T22:10:56Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "Trump Mediation: A New Bid for Ukraine-Russia Peace",
        "description": "President Donald Trump announced potential ceasefire negotiations between Russia and Ukraine, following calls with both nations' leaders. While no specific plans are set, Trump remains hopeful his rapport with President Putin will ease tensions. Despite limited progress, discussions may lead to a future peace treaty.",
        "content": "President Donald Trump declared the imminent start of ceasefire talks between Russia and Ukraine after engaging in separate dialogues with their leaders. Aimed at resolving a three-year conflict, this effort reflects Trump's diplomatic resolve.\nDespi... [610 chars]",
        "url": "https://www.devdiscourse.com/article/law-order/3418325-trump-mediation-a-new-bid-for-ukraine-russia-peace",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/19_05_2025_21_31_42_5852248.png?width=920&format=jpeg",
        "publishedAt": "2025-05-19T21:31:51Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "Trump Suggests Vatican Talks for Russia-Ukraine Ceasefire",
        "description": "President Donald Trump proposed that Russia and Ukraine should hold ceasefire talks at the Vatican. He emphasized this during a conversation with Russian President Vladimir Putin, questioning when the conflict would end. The suggestion aims to impart additional significance to the peace negotiations.",
        "content": "U.S. President Donald Trump on Monday suggested that the Vatican could serve as a venue for ceasefire talks between Russia and Ukraine, expressing that such a setting would lend extra significance to the discussions.\nTrump's proposal came after a pho... [265 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3418321-trump-suggests-vatican-talks-for-russia-ukraine-ceasefire",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/15_04_2025_11_11_35_3966761.png?width=920&format=jpeg",
        "publishedAt": "2025-05-19T21:27:58Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "EU, UK announce new sanctions on Russia after Trump's phone call fails to bring about ceasefire",
        "description": "The US, however, mulls possible involvement in enforcing the sanctions, staying silent for now",
        "content": "The United Kingdom and the European Union (EU) have announced new sanctions against Russia, following the failure of US President Trump's two-hour telephone call to Russia in bringing about a ceasefire.\nThe new measures, coming as a part of the 17th ... [2312 chars]",
        "url": "https://www.theweek.in/news/world/2025/05/20/eu-uk-announce-new-sanctions-on-russia-after-trump-s-phone-call-fails-to-bring-about-ceasefire.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/world/images/2025/5/20/russia 17 sanctions.jpg",
        "publishedAt": "2025-05-19T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        }
    },
    {
        "title": "Russia-Ukraine ceasefire: While Putin 'agrees' to compromises, Zelenskyy rejects 'withdraw troops' demand, MoU soon",
        "description": "While US President Donald Trump sounded victorious after holding talks with his Russian and Ukrainian counterparts, Vladimir Putin and Volodymyr Zelenskyy, respectively, the warring countries are yet to agree on a timeline for the ceasefire. Both nations have agreed to sign an MoU that would pave the way for future peace talks.",
        "content": "While US President Donald Trump sounded victorious after holding talks with his Russian and Ukrainian counterparts, Vladimir Putin and Volodymyr Zelenskyy, respectively, the warring countries are yet to agree on a timeline for the ceasefire. Both nat... [2224 chars]",
        "url": "https://www.theweek.in/news/india/2025/05/20/russia-ukraine-ceasefire-while-putin-agrees-to-compromises-zelenskyy-rejects-withdraw-troops-demand-mo-u-soon.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/world/images/2025/5/17/trump calls rus ukr.jpg",
        "publishedAt": "2025-05-19T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        }
    },
    {
        "title": "With Operation Sindoor, India taught world how to quickly end war",
        "description": "In an era when conflicts like Russia-Ukraine and Israel-Hamas drag on, Operation Sindoor can serve as a template for others to follow.",
        "content": "In an age when conflicts are dragging on and nations struggle to decide the correct time to terminate them, this military operation can serve as a template for others to follow in the future.\nLaunched to avenge the dastardly terror attack on innocent... [9450 chars]",
        "url": "https://theprint.in/opinion/with-operation-sindoor-india-just-taught-the-world-how-to-quickly-end-war/2630562/",
        "image": "https://static.theprint.in/wp-content/uploads/2025/05/Press-briefing-Sindoor-1-1.jpg",
        "publishedAt": "2025-05-19T11:59:34Z",
        "source": {
            "name": "ThePrint",
            "url": "https://theprint.in"
        }
    },
    {
        "title": "Russia Tried To Manipulate Elon Musk With Sex And Drugs, Claims Former FBI Agent",
        "description": "Musk and Putin were allegedly in contact since 2022.",
        "content": "> Culture\nA former FBI agent has made explosive claims about Russia's intentions to manipulate US billionaire Elon Musk. In a documentary by German broadcaster ZDF, former counterintelligence officer Jonathan Buma said that the GRU, Russia's foreign ... [2591 chars]",
        "url": "https://in.mashable.com/culture/94367/russia-tried-to-manipulate-elon-musk-with-sex-and-drugs-claims-former-fbi-agent",
        "image": "https://sm.mashable.com/mashable_in/seo/default/photo-8_snju.png",
        "publishedAt": "2025-05-19T11:00:33Z",
        "source": {
            "name": "Mashable India",
            "url": "https://in.mashable.com"
        }
    },
    {
        "title": "Russia Launches War's Largest Drone Attack On Ukraine Ahead Of Putin-Trump Call",
        "description": "Russia launched its largest drone attack on Ukraine, killing at least one woman, ahead of U.S. President Trump's ceasefire talks with Putin.",
        "content": "Russia Launches War's Largest Drone Attack On Ukraine Ahead Of Putin-Trump Call\nLast Updated: May 19, 2025, 08:41 IST\nUkraine's intelligence service said it also believed Moscow intended to fire an intercontinental ballistic missile later on Sunday a... [4192 chars]",
        "url": "https://www.news18.com/world/russia-launches-wars-largest-drone-attack-ahead-of-putin-trump-call-ws-l-9342517.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/05/Russia-Drone-attacks-2025-05-75b2db50afc8052d2382e22a044b1bd5-16x9.jpg",
        "publishedAt": "2025-05-19T03:11:41Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        }
    },
    {
        "title": "JD Vance meets Zelenskyy in Rome to discuss Ukraine-Russia peace talks",
        "description": "As per a statement from the Office of the Vice President, the focus of the meeting was on the ongoing conflict between Russia and Ukraine, with discussions centred on their shared objective of halting the bloodshed in Ukraine.",
        "content": "JD Vance meets Zelenskyy in Rome to discuss Ukraine-Russia peace talks As per a statement from the Office of the Vice President, the focus of the meeting was on the ongoing conflict between Russia and Ukraine, with discussions centred on their shared... [2278 chars]",
        "url": "https://www.indiatvnews.com/news/world/jd-vance-meets-zelenskyy-in-rome-to-discuss-ukraine-russia-peace-talks-2025-05-19-990863",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/jd-vance-1747617661.jpg",
        "publishedAt": "2025-05-19T01:21:11Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        }
    },
    {
        "title": "Zelensky Meets Vance as Russian Drones Pound Ukraine",
        "description": "The meeting came two days after the first direct talks between Ukraine and Russia in over three years",
        "content": "Ukrainian President Volodymyr Zelensky met with US Vice President JD Vance on Sunday, for the first time since their heated White House debate in February, as Russia launched a \"record\" drone barrage on Kyiv.The meeting came two days after the first ... [4638 chars]",
        "url": "https://www.deccanchronicle.com/world/europe/zelensky-meets-vance-as-russian-drones-pound-ukraine-1879796",
        "image": "https://www.deccanchronicle.com/h-upload/2025/05/19/1919215-aa-4711048.jpg",
        "publishedAt": "2025-05-19T01:19:00Z",
        "source": {
            "name": "Deccan Chronicle",
            "url": "https://www.deccanchronicle.com"
        }
    },
    {
        "title": "Zelenskyy meets US Vice President Vance amid Russia’s largest drone attack ahead of Putin-Trump call",
        "description": "Russia, which launched war’s largest drone attack, is also reportedly planning to use an intercontinental ballistic missile against Kyiv.",
        "content": "On Maharashtra visit, CJI Gavai miffed over absence of top officials at event\n27 min ago\nOn his first visit to his home state of Maharashtra after taking over as Chief Justice of India on May 14, CJI B R Gavai expressed his disappointment at the abse... [4840 chars]",
        "url": "https://indianexpress.com/article/world/zelenskyy-us-vice-president-vance-russia-drone-attack-putin-trump-call-10014797/",
        "image": "https://images.indianexpress.com/2025/05/vance-zelenskyy-meeting.jpg",
        "publishedAt": "2025-05-19T00:25:41Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Global Leaders Urge Unconditional Ceasefire in Ukraine Conflict",
        "description": "British PM Keir Starmer discussed Russia's war with Ukraine with leaders from the U.S., Italy, France, and Germany. The call focused on urging an unconditional ceasefire and considering sanctions if Russia fails to engage in peace talks. The leaders stressed the urgency of the situation amid ongoing diplomacy.",
        "content": "British Prime Minister Keir Starmer on Sunday engaged in discussions with leaders from the U.S., Italy, France, and Germany regarding Russia's ongoing war against Ukraine, according to a Downing Street spokesperson.\nOn the cusp of a scheduled call be... [732 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3416919-global-leaders-urge-unconditional-ceasefire-in-ukraine-conflict",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/03_05_2025_08_20_22_2162609.png?width=920&format=jpeg",
        "publishedAt": "2025-05-18T22:54:02Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "Global Leaders Urge Ceasefire in Ukraine Conflict",
        "description": "British Prime Minister Keir Starmer held discussions with leaders from the U.S., Italy, France, and Germany regarding the Ukraine war. They emphasized the need for peace talks with Russia. UK Foreign Minister David Lammy criticized Moscow after ceasefire talks ended quickly, highlighting challenges in diplomatic engagement.",
        "content": "In a critical discussion on Sunday, British Prime Minister Keir Starmer conversed with leaders from the U.S., Italy, France, and Germany about the ongoing conflict in Ukraine, according to a Downing Street spokesperson.\nAs U.S. President Donald Trump... [538 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3416914-global-leaders-urge-ceasefire-in-ukraine-conflict",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/25_02_2025_14_55_00_4800488.jpg?width=920&format=jpeg",
        "publishedAt": "2025-05-18T22:09:31Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "'It went very well': Trump announces Russia-Ukraine calls a success, ceasefire negotiations underway",
        "description": "However, he does not mention the terms of the negotiations in his Truth Social post, released just after the two-hour-long call",
        "content": "US President Donald Trump announced on Monday that his two-hour telephone conversation with Russian President Vladimir Putin had been a success, explaining that the “tone and spirit of the conversation were excellent”.\nAmerica's phone calls to Russia... [1799 chars]",
        "url": "https://www.theweek.in/news/world/2025/05/19/it-went-very-well-trump-announces-russia-ukraine-telephone-talks-a-success-ceasefire-negotiations-underway.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/world/images/2025/5/17/trump calls rus ukr.jpg",
        "publishedAt": "2025-05-18T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        }
    },
    {
        "title": "US-Russia: ट्रंप-पुतिन के बीच दो घंटे फोन पर चर्चा, रूसी राष्ट्रपति ने कहा- समझौते के बाद ही युद्धविराम संभव",
        "description": "Trump and Putin discussed on phone about Ukraine war, Vladimir says ceasefire is possible only after agreement",
        "content": "अमेरिकी राष्ट्रपति डोनाल्ड ट्रंप ने सोमवार को रूस के राष्ट्रपति व्लादिमीर पुतिन से फोन पर यूक्रेन युद्ध को लेकर चर्चा की है। ट्रंप के साथ दो घंटे से अधिक देर तक हुई बातचीत में पुतिन ने कहा कि, दोनों देशों के बीच समझौते के बाद युद्धविराम संभव है। उन्ह... [3612 chars]",
        "url": "https://www.amarujala.com/world/trump-and-putin-discussed-on-phone-about-ukraine-war-vladimir-says-ceasefire-is-possible-only-after-agreement-2025-05-19",
        "image": "https://staticimg.amarujala.com/assets/images/2025/02/18/donald-trump-vladimir-putin_2e998a2a55d42488098136ddc2720849.jpeg?w=750&dpr=1.0",
        "publishedAt": "2025-05-18T18:30:00Z",
        "source": {
            "name": "अमर उजाला",
            "url": "https://www.amarujala.com"
        }
    },
    {
        "title": "Putin’s plan to outlast Ukraine and the US",
        "description": "Russia’s leader ‘blossoms whenever he talks about war’ and hopes Trump will give up on a peace deal.",
        "content": "After all the speculation about how Russian President Vladimir Putin would respond to Ukrainian President Volodymyr Zelensky’s offer to meet for peace talks in Istanbul, it isn’t surprising that Mr. Putin declined. Instead he sent a low-level delegat... [5506 chars]",
        "url": "https://www.livemint.com/opinion/russia-ukraine-peace-talks-vladimir-putin-ukraine-war-volodymyr-zelensky-peace-offer-donald-trump-ukraine-policy-11747639763086.html",
        "image": "https://www.livemint.com/lm-img/img/2025/05/19/1600x900/Russia-Victory-Day-27_1746925035749_1747639820416.jpg",
        "publishedAt": "2025-05-18T18:30:00Z",
        "source": {
            "name": "Livemint",
            "url": "https://www.livemint.com"
        }
    },
    {
        "title": "Ukraine to get $100 million-plus worth of ammunition from Finland, paid with Russia's frozen billions",
        "description": "In a landmark move, the EU unlocks frozen Russian assets to arm Ukraine with Finnish munitions and more",
        "content": "Ukraine is set to receive €90 million ($101.35 million) worth of ammunition from Finland, as per a press release from the Finnish Ministry of Defence on Monday.\nThe ammunition will be sourced using Russian financial assets that had been frozen by the... [1812 chars]",
        "url": "https://www.theweek.in/news/world/2025/05/19/ukraine-to-get-dollar100-million-plus-worth-of-ammunition-from-finland-paid-with-russia-s-frozen-billions.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/world/images/2025/5/19/ukraine finland.jpg",
        "publishedAt": "2025-05-18T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        }
    },
    {
        "title": "Russia May Launch Intercontinental Ballistic Missile To Intimidate Kyiv, West: Ukraine",
        "description": "Ukraine's military intelligence reports Russia plans to launch an RS-24 missile from Sverdlovsk region to intimidate Ukraine and the West.",
        "content": "Russia May Launch Intercontinental Ballistic Missile To Intimidate Kyiv, West: Ukraine\nLast Updated: May 18, 2025, 23:35 IST\nThere was no immediate comment from Russia on the Ukrainian military intelligence statement.\nRussia does not answer questions... [1384 chars]",
        "url": "https://www.news18.com/world/russia-may-launch-intercontinental-ballistic-missile-to-intimidate-kyiv-west-ukraine-ws-l-9342442.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/05/Untitled-design-2025-05-18T233509.633-2025-05-7f514f42d8f466765eb978358a4e8510-16x9.jpg",
        "publishedAt": "2025-05-18T18:05:34Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        }
    },
    {
        "title": "‘We have ample force’: Putin rules out nuclear option in Ukraine conflict",
        "description": "President Vladimir Putin said the objectives of Russia \"are about the elimination of the original causes of this crisis, the formation of conditions for the long-lasting and sustainable peace and the provision of security to Russia”.",
        "content": "Even without resorting to nuclear weapons, Russia has sufficient forces to accomplish its objectives in Ukraine, President Vladimir Putin said in an interview with the Kremlin correspondent of state media VGTRK.\n“Several attempts were made to force u... [2596 chars]",
        "url": "https://indianexpress.com/article/world/we-have-ample-force-putin-rules-out-nuclear-option-in-ukraine-conflict-10014575/",
        "image": "https://images.indianexpress.com/2025/05/Putin_20250512130927.jpg",
        "publishedAt": "2025-05-18T17:31:37Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "'Even without use of nukes...': Putin expresses confidence in Russian forces to achieve set goals in Ukraine",
        "description": "Putin has repeatedly called for resolving the Ukraine conflict, highlighting the need to take Russia's interests into account when addressing the root causes of the crisis.",
        "content": "'Even without use of nukes...': Putin expresses confidence in Russian forces to achieve set goals in Ukraine Putin has repeatedly called for resolving the Ukraine conflict, highlighting the need to take Russia’s interests into account when addressing... [1953 chars]",
        "url": "https://www.indiatvnews.com/news/world/putin-expresses-confidence-in-russian-forces-to-achieve-set-goals-in-ukraine-even-without-use-of-nukes-2025-05-18-990844",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/putin-1747581881.jpg",
        "publishedAt": "2025-05-18T15:26:05Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        }
    },
    {
        "title": "Trump to speak with Putin to end Ukraine ‘bloodbath’",
        "description": "Trump, who has been pressing Russia to agree a 30-day unconditional ceasefire, said he would speak with him by phone on Monday. Kremlin spokesman Dmitri Peskov told the state TASS news agency the call was 'being prepared'",
        "content": "Trump, who has been pressing Russia to agree a 30-day unconditional ceasefire, said he would speak with him by phone on Monday. Kremlin spokesman Dmitri Peskov told the state TASS news agency the call was ‘being prepared’ read more\nThis combination o... [5152 chars]",
        "url": "https://www.firstpost.com/world/trump-to-speak-with-putin-to-end-ukraine-bloodbath-13889370.html",
        "image": "https://images.firstpost.com/uploads/2025/03/AFP__20250318__372U8KT__v2__HighRes__ComboUsRussiaUkraineConflict-1-2025-03-72ccf9168d2250e2f5d2c9ea336e2f93.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-18T00:21:12Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Donald Trump Says He Would Talk To Putin And Zelensky On Monday To Press For Ceasefire In Ukraine",
        "description": "Russia-Ukrane War: पुतिन-जेलेंस्की से कल फोन पर बात करेंगे ट्रंप, यूक्रेन में युद्धविराम के लिए डालेंगे दबाव \r\nDonald Trump says he would talk to Putin and Zelensky on Monday to press for ceasefire in Ukraine",
        "content": "अमेरिकी राष्ट्रपति डोनाल्ड ट्रंप सोमवार (स्थानीय समयानुसार) को यूक्रेन में युद्ध समाप्त करने के बारे में रूसी राष्ट्रपति व्लादिमीर पुतिन से फोन पर बात करेंगे। इसके बाद, वह यूक्रेनी राष्ट्रपति वोलोदिमीर जेलेंस्की और विभिन्न नाटो देशों के नेताओं से भी ... [1531 chars]",
        "url": "https://www.amarujala.com/world/donald-trump-says-he-would-talk-to-putin-and-zelensky-on-monday-to-press-for-ceasefire-in-ukraine-2025-05-18",
        "image": "https://staticimg.amarujala.com/assets/images/2025/05/17/us-trump-administration-requests-supreme-court-to-allow-layoffs-of-federal-workers_adbf4bcfc585b9e476a59135587ff82c.jpeg?w=750&dpr=1.0",
        "publishedAt": "2025-05-17T18:30:00Z",
        "source": {
            "name": "अमर उजाला",
            "url": "https://www.amarujala.com"
        }
    },
    {
        "title": "Why Russia-Ukraine talks offer little real hope for a ceasefire",
        "description": "The first high level talks between Russia and Ukraine since the early months of Moscow's 2022 attack showed they are far from agreement on steps needed for a ceasefire, even though they promised a major swap of prisoners of war.",
        "content": "The first high level talks between Russia and Ukraine since the early months of Moscow’s 2022 attack showed they are far from agreement on steps needed for a ceasefire, even though they promised a major swap of prisoners of war. read more\nThe first h... [5082 chars]",
        "url": "https://www.firstpost.com/world/why-russia-ukraine-talks-offer-little-real-hope-for-a-ceasefire-13889330.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-17T231513.043-2025-05-d00e4ffcc5c2fa539122f7d257db8e28.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-17T17:55:51Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Russia-Ukraine war: Trump says he will speak with Putin, Zelenskyy on Monday to stop ‘bloodbath’",
        "description": "The announcement came just a day after the first direct Russia-Ukraine peace talks in three years failed to produce a ceasefire.",
        "content": "US President Donald Trump announced on Saturday that he will make phone calls to both of his counterparts Vladimir Putin and Volodymyr Zelenskyy on Monday, in a bid to end the ongoing “very violent” Russia-Ukraine war.\nIn a post on Truth Social, Trum... [2023 chars]",
        "url": "https://indianexpress.com/article/world/trump-russia-ukraine-war-phone-calls-presidents-putin-zelenskyy-10012796/",
        "image": "https://images.indianexpress.com/2025/03/Trump-Putin-Zelenskyy-.jpg",
        "publishedAt": "2025-05-17T15:42:51Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Zelenskiy Urges Stronger Sanctions Following Deadly Drone Strike in Ukraine",
        "description": "Ukrainian President Volodymyr Zelenskiy calls for stronger sanctions on Russia after a Russian drone attack kills nine civilians in northeastern Ukraine, despite recent peace talks in Turkey. Zelenskiy emphasizes the need for United States and European sanctions against Russia to push for genuine diplomatic efforts.",
        "content": "Ukrainian President Volodymyr Zelenskiy intensified his call for harsher sanctions against Russia after a drone attack in northeastern Ukraine resulted in the death of nine civilians.\nThe call came following inconclusive peace talks in Turkey, markin... [305 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3415549-zelenskiy-urges-stronger-sanctions-following-deadly-drone-strike-in-ukraine",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_16_55_29_8451536.jpg?width=920&format=jpeg",
        "publishedAt": "2025-05-17T09:42:22Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        }
    },
    {
        "title": "Russian drone attack on minibus kills 9 in Ukraine as direct talks with Moscow falter",
        "description": "The attack comes after Russia and Ukraine held their first direct talks since 2022. The meeting failed to achieve any breakthrough, although the two countries did agree to swap prisoners",
        "content": "The attack comes after Russia and Ukraine held their first direct talks since 2022. The meeting failed to achieve any breakthrough, although the two countries did agree to swap prisoners read more\nMunicipal workers clean up around burnt cars in the r... [2382 chars]",
        "url": "https://www.firstpost.com/world/russian-drone-attack-on-minibus-kills-9-in-ukraine-as-direct-talks-with-moscow-falter-13889252.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-04T215413.883-2025-05-b77353eefeb3553667bc8ef3db2c937d.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-17T07:53:26Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Putin invites Arab leaders to first Russia-Arab summit after Trump's West Asia visit",
        "description": "The Arab League, a regional organisation of Arab states in the Middle East and parts of Africa, has 22 member states who have pledged, among others, to cooperate on political, economic and military affairs in the region",
        "content": "The Arab League, a regional organisation of Arab states in the Middle East and parts of Africa, has 22 member states who have pledged, among others, to cooperate on political, economic and military affairs in the region read more\nRussian President Vl... [1116 chars]",
        "url": "https://www.firstpost.com/world/putin-invites-arab-leaders-to-first-russia-arab-summit-after-trumps-west-asia-visit-13889251.html",
        "image": "https://images.firstpost.com/uploads/2025/04/Untitled-design-2025-04-23T193305.021-2025-04-0d4d012d1a465425605d15893c00db3d.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-17T07:41:01Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Are Ukraine-Russia talks about how ‘not’ to talk peace?",
        "description": "The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the fighting.",
        "content": "The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the... [3511 chars]",
        "url": "https://www.firstpost.com/world/are-ukraine-russia-talks-about-how-not-to-talk-peace-13889170.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-17T000849.511-2025-05-50240774d39fcb7a0d5b065d58905767.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-16T18:47:02Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Two Prosecutors & Dossier 137 - eerie portraits of lives crushed under absolute power",
        "description": "Loznitsa is in familiar territory, having given us glimpses into the labyrinthine workings of Russia and his native Ukraine in his earlier work",
        "content": "A succession of similar scenes, in which the protagonist is seen waiting in a hard, straight-backed chair, in dreary brown rooms ruled over by dreary brown bureaucrats, is amongst the most telling leitmotifs of Sergei Lozintsa’s Cannes competition en... [4097 chars]",
        "url": "https://indianexpress.com/article/entertainment/two-prosecutors-dossier-137-eerie-portraits-of-lives-crushed-under-absolute-power-10011286/",
        "image": "https://images.indianexpress.com/2025/05/two-prosecutors.jpg",
        "publishedAt": "2025-05-16T18:24:50Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Russia and Ukraine hold first direct talks in 3 years, agree on prisoner swap, but no truce",
        "description": "In their first direct talks in over three years, Russia and Ukraine on Friday agreed on a large-scale prisoner exchange, said would continue talking on a potential ceasefire and discussed a meeting between Zelenskyy and Putin",
        "content": "In their first direct talks in over three years, Russia and Ukraine on Friday agreed on a large-scale prisoner exchange, said would continue talking on a potential ceasefire and discussed a meeting between Zelenskyy and Putin read more\nRussian and Uk... [4782 chars]",
        "url": "https://www.firstpost.com/world/russia-and-ukraine-hold-first-direct-talks-in-3-years-agree-on-prisoner-swap-but-no-truce-13889165.html",
        "image": "https://images.firstpost.com/uploads/2025/05/Russia-Ukrainetalks1200-2025-05-540d72a83d28d7600d4b16a98511bc7f.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-05-16T17:06:21Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        }
    },
    {
        "title": "Russia, Ukraine Agree On 1000-For-1000 POW Exchange As Peace Talks Move Ahead In Istanbul",
        "description": "The officials present sat around a U-shaped table, with the Russians and Ukrainians facing each other.",
        "content": "Russia, Ukraine Agree On 1000-For-1000 POW Exchange As Peace Talks Move Ahead In Istanbul\nCurated By :\nNews18.com\nLast Updated: May 16, 2025, 20:15 IST\nThe officials present sat around a U-shaped table, with the Russians and Ukrainians facing each ot... [2811 chars]",
        "url": "https://www.news18.com/world/russia-ukraine-officials-meet-in-istanbul-for-first-direct-peace-talks-in-3-years-9340150.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/05/FotoJet-2025-05-16T172651.066-2025-05-1c4bc306031eb6ad9be5292ea87196db-16x9.jpg",
        "publishedAt": "2025-05-16T14:45:11Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        }
    },
    {
        "title": "Syria plans to print new banknotes in UAE and Germany, ending Russian role",
        "description": "The move marks a break from Russia, which had printed Syrian money throughout the 13-year conflict.",
        "content": "Syria is preparing to print new currency in the United Arab Emirates and Germany, replacing Russia as its long-time printing partner, three sources told Reuters. This shift comes as Syria’s new leadership builds stronger ties with Gulf Arab and Weste... [2878 chars]",
        "url": "https://indianexpress.com/article/world/syria-plans-print-new-banknotes-uae-germany-end-russia-role-10010779/",
        "image": "https://images.indianexpress.com/2025/05/Syria_8bd4b3.jpg",
        "publishedAt": "2025-05-16T13:57:18Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        }
    },
    {
        "title": "Zelenskyy Names Delegation for Russia-Ukraine Talks at Istanbul",
        "description": "The Istanbul delegation will be led by Defence Minister Rustem Umerov and will include military and intelligence officials",
        "content": "Kyiv: Ukrainian President Volodymyr Zelenskyy on Thursday announced that a Ukrainian delegation will participate in talks with Russia in Istanbul, with the primary goal of achieving a ceasefire.\nThe Istanbul delegation will be led by Defence Minister... [2493 chars]",
        "url": "https://www.deccanchronicle.com/world/zelenskyy-names-delegation-for-russia-ukraine-talks-at-istanbul-1879179",
        "image": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-8h052shel7lbjd47qi96iuq3d1-20220312114832.Medi.jpeg",
        "publishedAt": "2025-05-16T02:21:44Z",
        "source": {
            "name": "Deccan Chronicle",
            "url": "https://www.deccanchronicle.com"
        }
    },
    {
        "title": "Turkey to Hold Talks with Russia, Ukraine Teams on Friday: Sources",
        "description": "The meeting between Foreign Minister Hakan Fidan and the delegation headed by Vladimir Medinsky at Istanbul's Dolmabahce Palace finished late on Thursday, the source added.",
        "content": "Istanbul: Talks in Istanbul between Turkey's top diplomat and a Russian delegation have ended with the two sides set to meet again Friday with the Ukrainians, a foreign ministry source said.\nThe meeting between Foreign Minister Hakan Fidan and the de... [1818 chars]",
        "url": "https://www.deccanchronicle.com/world/turkey-to-hold-talks-with-russia-ukraine-teams-on-friday-sources-1879178",
        "image": "https://www.deccanchronicle.com/h-upload/2025/05/16/1918290-untitleddesign50.jpg",
        "publishedAt": "2025-05-16T02:07:00Z",
        "source": {
            "name": "Deccan Chronicle",
            "url": "https://www.deccanchronicle.com"
        }
    }
]