[
    {
        "title": "Gazprom's grandeur fades as Europe abandons Russian gas",
        "description": "\"This is symbolic,\" he said, referring to the modern new offices in Russia's most European city. \"Europe will increasingly need Russian gas.\" Instead, the opulent offices have come to symbolize Gazprom's rapid decline, dragged down by the almost total loss of European markets after the war in Ukraine ruptured Russia's ties with the West.",
        "content": "Reuters spoke to three executives and half a dozen former and current employees for this story on the depth of change at what used to be Russia's most valuable company. All requested anonymity, citing fear of professional repercussions.\n\"Gazprom has ... [9761 chars]",
        "url": "https://finance.yahoo.com/news/gazproms-grandeur-fades-europe-abandons-070342076.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/6ebbf9af9ab457dfe4fe37991b55c97b",
        "publishedAt": "2025-03-13T07:03:42Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Serbia shores up oil reserves as seeks delay of U.S. sanctions on oil company NIS",
        "description": "Serbia is shoring up its crude oil and fuel reserves as the country presses on with talks with the United States and Russia to avoid U.S. sanctions on its oil company NIS, energy minister Dubravka Djedovic Handanovic said on Wednesday. Gazprom Neft and Gazprom hold stakes of 50% and 6.15% respectively in NIS, which operates the sole oil refinery in Serbia.",
        "content": "BELGRADE (Reuters) - Serbia is shoring up its crude oil and fuel reserves as the country presses on with talks with the United States and Russia to avoid U.S. sanctions on its oil company NIS, energy minister Dubravka Djedovic Handanovic said on Wedn... [805 chars]",
        "url": "https://finance.yahoo.com/news/serbia-shores-oil-reserves-seeks-080034264.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/ace6a21f71256fcdd23bb447600217c8",
        "publishedAt": "2025-02-26T08:00:34Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "UNSC adopts US resolution taking neutral stance on Ukraine war",
        "description": "UNITED NATIONS: The UN Security Council adopted a US resolution on the third anniversary of Russia’s military intervention in Ukraine.",
        "content": "UNITED NATIONS: The UN Security Council adopted a US resolution on the third anniversary of Russia’s military intervention in Ukraine that softens Washington’s stance on the conflict as President Donald Trump pushes for a peace deal.\nTen of the 15 Co... [2199 chars]",
        "url": "https://www.bolnews.com/latest/2025/02/unsc-adopts-us-resolution-taking-neutral-stance-on-ukraine-war/",
        "image": "https://www.bolnews.com/wp-content/uploads/2025/02/FotoJet-2025-02-25T095502.234.jpg",
        "publishedAt": "2025-02-25T04:58:01Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Trump teases 'economic development' with Russia as he marks the third year of the war in Ukraine",
        "description": "President Donald Trump added a new wrinkle to ongoing talks that he says may help end the war in Ukraine: new \"economic development\" with Russia.",
        "content": "President Donald Trump added a new wrinkle to ongoing talks that he says may help end the war in Ukraine: new \"economic development\" with Russia that the president says could come in addition to ongoing discussions between the US and Ukraine.\n\"I am i... [2649 chars]",
        "url": "https://finance.yahoo.com/news/trump-teases-economic-development-with-russia-as-he-marks-the-third-year-of-the-war-in-ukraine-215643953.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/K.wn0iKOM0l1ZetmOEyc4Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-02/35c3e810-f2f7-11ef-bbcf-01bae5a746fc",
        "publishedAt": "2025-02-24T21:56:43Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Goldman Sachs says it does not see Ukraine ceasefire boosting Russia output",
        "description": "U.S. President Donald Trump's administration said on Tuesday it had agreed to hold more talks with Russia on ending the war in Ukraine. \"We believe that Russia crude oil production is constrained by its OPEC+ 9.0 million barrels per day (mbpd) production target rather than current sanctions, which are affecting the destination but not the volume of oil exports,\" Goldman Sachs said.",
        "content": "(Reuters) - A potential Ukraine ceasefire and the associated easing in sanctions on Russia are unlikely to substantially increase Russia's oil flows, Goldman Sachs said on Wednesday.\nU.S. President Donald Trump's administration said on Tuesday it had... [1554 chars]",
        "url": "https://finance.yahoo.com/news/goldman-sachs-says-does-not-065441358.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/c4b6850eb7efb4157e57bf30f7136054",
        "publishedAt": "2025-02-19T06:54:41Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Brent oil prices tick down after gaining on Caspian pump station attack",
        "description": "Brent crude oil prices paused in early trading on Tuesday after gaining in the previous session following a drone attack on an oil pipeline pumping station in Russia that reduced flows from Kazakhstan. Brent crude futures ticked down 7 cents, or 0.09%, to $75.15 a barrel by 0137 GMT. U.S. West Texas Intermediate (WTI) crude rose 47 cents to $71.21 a barrel.",
        "content": "By Colleen Howe\nBEIJING (Reuters) - Brent crude oil prices paused in early trading on Tuesday after gaining in the previous session following a drone attack on an oil pipeline pumping station in Russia that reduced flows from Kazakhstan.\nBrent crude ... [1196 chars]",
        "url": "https://finance.yahoo.com/news/brent-oil-prices-tick-down-020104801.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/f33eb54b4f67cd169e46d2bb6e0aa452",
        "publishedAt": "2025-02-18T02:01:04Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Russia-Ukraine peace deal could see Brent fall by $5-$10 a barrel",
        "description": "A peace deal between Russia and Ukraine could lead to higher oil output and lower Brent prices, offering some relief to consumers, according to Bank of America.",
        "content": "A peace deal between Russia and Ukraine could lead to higher oil output and lower Brent prices, offering some relief to consumers, according to Bank of America (BAC) analysts.\n“We believe Brent crude oil (BZ=F) prices could drop between $5 and $10 a ... [1608 chars]",
        "url": "https://finance.yahoo.com/news/russia-ukraine-peace-deal-could-101200959.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/QmW5U4NhwOInl1VJK1Bv6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDU-/https://s.yimg.com/os/creatr-uploaded-images/2025-02/7905d320-ed31-11ef-beec-d60ea8fd2f74",
        "publishedAt": "2025-02-17T10:12:00Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Crypto exchange platform BestChange in the dark over Russia block",
        "description": "Circulating and advertising digital currencies is banned in Russia, although using cryptocurrency for international payments is now legal, as is cryptocurrency mining. \"bestchange.ru has been restricted in Russia by Roskomnadzor,\" the platform said late on Monday in response to a request for comment.",
        "content": "(Reuters) - Cryptocurrency exchange platform BestChange has said it is unsure why its website was blocked by Russia's communications watchdog Roskomnadzor, but that it is in touch with the central bank to try to lift the ban.\nCirculating and advertis... [1416 chars]",
        "url": "https://finance.yahoo.com/news/crypto-exchange-platform-bestchange-dark-092352634.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/432564c1fa7a07a9c1029e60daae9a24",
        "publishedAt": "2025-02-11T09:23:52Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Serbian oil company NIS asks U.S. Treasury for a 90-day waiver of sanctions",
        "description": "Serbian oil company NIS, which is majority-owned by Russia's Gazprom Neft and Gazprom, has submitted a formal request to the U.S. Treasury Department for a waiver of sanctions for 90 days, Serbia's energy ministry said on Tuesday. In a statement, the ministry said that the NIS request has the backing of the Serbian and Hungarian governments.",
        "content": "BELGRADE (Reuters) - Serbian oil company NIS, which is majority-owned by Russia's Gazprom Neft and Gazprom, has submitted a formal request to the U.S. Treasury Department for a waiver of sanctions for 90 days, Serbia's energy ministry said on Tuesday... [1682 chars]",
        "url": "https://finance.yahoo.com/news/serbian-oil-company-nis-asks-101938459.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/fb7dd64ec4b090ea759ade498abba1e9",
        "publishedAt": "2025-02-04T10:19:38Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "L3Harris forecasts upbeat annual sales on strong defense demand",
        "description": "Demand for arms and military equipment has ballooned as a result of the Russia-Ukraine war and ongoing conflicts in the Middle East, benefiting defense contractors such as L3Harris. The company also raised its cost-saving goal to $1.2 billion by the end of 2025, a year ahead of its previously disclosed timeline. L3Harris said it had achieved $800 million in cost savings in 2024.",
        "content": "(Reuters) - L3Harris Technologies forecast 2025 sales above estimates and posted higher-than-expected fourth-quarter results on Thursday, bolstered by strong demand for weapons due to higher defense spending amid global geopolitical tensions.\nDemand ... [1155 chars]",
        "url": "https://finance.yahoo.com/news/l3harris-forecasts-upbeat-annual-sales-130819150.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/7f119bfa4ffd1e2a3f0829b564ce2e37",
        "publishedAt": "2025-01-30T13:08:19Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Iran confirms Sukhoi-35 jet deal as military cooperation with Russia expands",
        "description": "Iran has officially confirmed purchase of Russian-made Sukhoi-35 fighter jets, as announced by senior commander of the Revolutionary Guards.",
        "content": "Iran has officially confirmed the purchase of Russian-made Sukhoi-35 fighter jets, as announced by a senior commander of the Revolutionary Guards on Monday.\nAccording to sources, Ali Shadmani did not reveal how many jets were purchased or their deliv... [629 chars]",
        "url": "https://www.bolnews.com/international/2025/01/iran-confirms-sukhoi-35-jet-deal-as-military-cooperation-with-russia-expands/",
        "image": "https://www.bolnews.com/wp-content/uploads/2025/01/FotoJet-1-13.jpg",
        "publishedAt": "2025-01-28T14:12:58Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Kazakhstan's daily oil output at record high amid Chevron-led expansion",
        "description": "Oil production in Kazakhstan reached a daily record high of 278,499 metric tons on Sunday just after it embarked on an expansion of its largest oilfield, Chevron-led Tengiz, according to official data. OPEC+ has named top 10 global oil producer Kazakhstan along with Iraq and Russia as countries that have repeatedly failed to comply with pledges to curb oil production.",
        "content": "MOSCOW (Reuters) - Oil production in Kazakhstan reached a daily record high of 278,499 metric tons on Sunday just after it embarked on an expansion of its largest oilfield, Chevron-led Tengiz, according to official data.\nKazakhstan - which relies on ... [1109 chars]",
        "url": "https://finance.yahoo.com/news/kazakhstans-daily-oil-output-record-114304809.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/380775d2e04b9f5dfa82d1b02dbb546c",
        "publishedAt": "2025-01-27T11:43:04Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "The Russian war economy is facing a ‘moment of truth’ as Putin’s dwindling cash reserves raise odds of a financial crash, expert says",
        "description": "\"As the risk of a financial crash rises, Russia’s imperiled economy is about to pose serious constraints on Putin’s war.\"",
        "content": "Nearly three years after Russia invaded Ukraine, Vladimir Putin's economy is entering a critical phase as inflation, shortages, and shrinking cash reserves constrain his war effort soon, a Russia expert said.\nRussia's economy is facing a \"moment of t... [3502 chars]",
        "url": "https://finance.yahoo.com/news/russian-war-economy-facing-moment-223309337.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/CNVnOJ92nxQVkE7ccyBwdw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://media.zenfs.com/en/fortune_175/caf94e9c128011e29681a95f2fca780a",
        "publishedAt": "2025-01-26T22:33:09Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Oil prices decreases as Russia sanctions stay in focus",
        "description": "Oil prices dropped on Tuesday from the previous day's four-month highs, but the market remained supported by ongoing concerns about the impact of new US sanctions on Russian oil exports to major buyers, India and China.",
        "content": "Oil prices dropped on Tuesday from the previous day’s four-month highs, but the market remained supported by ongoing concerns about the impact of new US sanctions on Russian oil exports to major buyers, India and China.\nBrent crude futures fell by 58... [1115 chars]",
        "url": "https://www.bolnews.com/pakistan/2025/01/oil-prices-decreases-as-russia-sanctions-stay-in-focus/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/09/Crude-oil-67.jpg",
        "publishedAt": "2025-01-14T16:46:35Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Oil prices jump to 5-month high over increasing worries of supply crunch stemming from sanctions",
        "description": "Oil extended gains as markets priced the supply impact of recently announced sanctions against Russia's energy market.",
        "content": "Oil extended gains to hit a five-month high on Monday as worries grew over supply disruptions impacting big importers China and India following wide-ranging sanctions against Russian crude.\nWest Texas Intermediate crude (CL=F) rose roughly 3% to trad... [1780 chars]",
        "url": "https://finance.yahoo.com/news/oil-prices-jump-to-5-month-high-over-increasing-worries-of-supply-crunch-stemming-from-sanctions-182258000.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/dIh1.sH5LPBvUA.lMtHazg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/ebe317b0-1d37-11ef-97f5-415e7fa54254",
        "publishedAt": "2025-01-13T18:22:58Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Gas pipeline to Turkey targeted by Ukraine, claims Russia",
        "description": "Russia accused Ukraine of attempting drone attack on Turk Stream gas pipeline, which transports Russian gas to Europe via Turkey.",
        "content": "On Monday, Russia accused Ukraine of attempting a drone attack on the Turk Stream gas pipeline infrastructure, which transports Russian gas to Europe via Turkey.\nAccording to a statement by Russia’s defense ministry, Ukraine deployed nine drones on J... [1257 chars]",
        "url": "https://www.bolnews.com/international/2025/01/gas-pipeline-to-turkey-targeted-by-ukraine-claims-russia/",
        "image": "https://www.bolnews.com/wp-content/uploads/2025/01/FotoJet-4-3.jpg",
        "publishedAt": "2025-01-13T16:07:20Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Oil touches $80 per barrel as sweeping sanctions against Russia rattle markets",
        "description": "Oil rose to $80 per barrel, the highest level since October, as the US announced new sanctions against Russia.",
        "content": "Oil prices jumped to a three-month high on Friday, with traders digesting new sweeping sanctions against Russia as the Biden administration tries to cut off Moscow from crude revenue amid the ongoing war in Ukraine.\nWest Texas Intermediate crude (CL=... [2094 chars]",
        "url": "https://finance.yahoo.com/news/oil-touches-80-per-barrel-as-sweeping-sanctions-against-russia-rattle-markets-162612572.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/a1HarHJjKSzpxsTqM6A9VA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-09/a499d860-84a9-11ef-ac93-72e0eed54c7e",
        "publishedAt": "2025-01-10T16:26:12Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Oil prices up on tighter OPEC supply, US jobs data",
        "description": "Oil prices rose on Wednesday as supplies from Russia and OPEC members tightened, while data showing an unexpected increase in U.S. jobs openings pointed to expanding economic activity and consequent growth in oil demand. Brent crude was up 32 cents, or 0.42%, to $77.37 a barrel at 0135 GMT. U.S. West Texas Intermediate crude rose 42 cents, or 0.57%, to $74.67.",
        "content": "By Katya Golubkova\nTOKYO (Reuters) - Oil prices rose on Wednesday as supplies from Russia and OPEC members tightened, while data showing an unexpected increase in U.S. jobs openings pointed to expanding economic activity and consequent growth in oil ... [1656 chars]",
        "url": "https://finance.yahoo.com/news/oil-prices-tighter-opec-supply-013939663.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/821459bbec8ce61048d8afbe8f25fcbe",
        "publishedAt": "2025-01-08T01:39:39Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Russia's new car sales up 47% in 2024, agencies cite industry ministry",
        "description": "New sales in 2025 are seen dropping by around 10% to 1.43 million units, Sergei Tselikov, head of Russian analytical agency Autostat, said in December, as high inflation and scrappage fees push prices up. Moscow's invasion of Ukraine in February 2022 drastically reshaped Russia's car market, with Western carmakers abandoning the country and Chinese ones swooping in to plug the production gap.",
        "content": "(Reuters) - Sales of new passenger cars in Russia increased by 47% year on year to 1.55 million units in 2024, Russian news agencies reported on Saturday, citing industry and trade ministry data.\nNew sales in 2025 are seen dropping by around 10% to 1... [454 chars]",
        "url": "https://finance.yahoo.com/news/russias-car-sales-47-2024-085540545.html",
        "image": "https://media.zenfs.com/en/reuters-finance.com/286ef84b88cd3bb413c5622fd14bfdf7",
        "publishedAt": "2025-01-04T08:55:40Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Shafqat Ali Khan appointed as foreign office spokesperson",
        "description": "Career diplomat and former ambassador to Russia Shafqat Ali Khan was appointed new spokesperson for the Ministry of Foreign Affairs.",
        "content": "Career diplomat and former ambassador to Russia Shafqat Ali Khan on Thursday was appointed the new spokesperson for the Ministry of Foreign Affairs.\nShafqat has been appointed as the new spokesperson for Pakistan’s Foreign Office, replacing Mumtaz Za... [984 chars]",
        "url": "https://www.bolnews.com/pakistan/2025/01/shafqat-ali-khan-appointed-as-foreign-office-spokesperson/",
        "image": "https://www.bolnews.com/wp-content/uploads/2025/01/FotoJet-77.jpg",
        "publishedAt": "2025-01-02T15:09:12Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Shafqat Ali Khan appointed new MoFA spokesperson",
        "description": "ISLAMABAD: Shafqat Ali Khan, a career diplomat and former ambassador to Russia, was appointed as the Ministry of Foreign Affairs' new spokesperson on Thursday. The new...",
        "content": "Career diplomat and former ambassador to Russia Shafqat Ali Khan. — APP\nISLAMABAD: Shafqat Ali Khan, a career diplomat and former ambassador to Russia, was appointed as the Ministry of Foreign Affairs' new spokesperson on Thursday.\nThe new spokespers... [998 chars]",
        "url": "https://www.thenews.com.pk/latest/1267904-shafqat-ali-khan-appointed-new-mofa-spokesperson",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2025-01-02/l_1267904_072013_updates.jpg",
        "publishedAt": "2025-01-01T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Moscow, Kyiv end Russian gas transit to Europe via Ukraine",
        "description": "Russia's gas transit to Europe via Ukraine stopped on Wednesday, Moscow and Kyiv said, ending a decades-long arrangement and marking the latest casualty of the war between the neighbours.Russian gas...",
        "content": "This picture taken on September 2, 2014 shows equipment from the border release and compressor station of the gas pipeline from Ukraine. — AFP\nRussia's gas transit to Europe via Ukraine stopped on Wednesday, Moscow and Kyiv said, ending a decades-lon... [2056 chars]",
        "url": "https://www.thenews.com.pk/latest/1267531-moscow-kyiv-end-russian-gas-transit-to-europe-via-ukraine",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2025-01-01/l_1267531_031247_updates.jpg",
        "publishedAt": "2024-12-31T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia unveils anti-fraud measures for the digital ruble, including a two-day transaction freeze",
        "description": "The move will offer enhanced security protections for Russia's digital ruble.",
        "content": "Starting February 2025, Russian banks will acquire a new tool to combat suspected fraud involving the digital ruble, Russia’s new central bank digital currency (CBDC).\nBanks will have the capability to freeze digital ruble transactions for a maximum ... [1667 chars]",
        "url": "https://finance.yahoo.com/news/russia-unveils-anti-fraud-measures-231656360.html",
        "image": "https://media.zenfs.com/en/thestreet_881/6ea8dcad62f9bd753d9811a680b26f25",
        "publishedAt": "2024-12-29T23:16:56Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Azerbaijan demands Russia admit it shot down passenger plane",
        "description": "BAKU: Azerbaijani President Ilham Aliyev on Sunday demanded that Russia admit that it fired at an Azerbaijan Airlines passenger jet before it crashed, accusing Moscow of initially trying to cover...",
        "content": "A drone view shows emergency specialists working at the crash site of an Azerbaijan Airlines passenger plane near the city of Aktau, Kazakhstan December 25, 2024. — Reuters\nBAKU: Azerbaijani President Ilham Aliyev on Sunday demanded that Russia admit... [3173 chars]",
        "url": "https://www.thenews.com.pk/print/1266852-azerbaijan-demands-russia-admit-it-shot-down-passenger-plane",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-30/l_1266852_060121_updates.jpg",
        "publishedAt": "2024-12-29T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "‘2nd highest mercury recorded in Asia in 2023’",
        "description": "Islamabad: Dr Liudmila Kolomeets from World Meteorological Organisation , Russia, has said that 2023’s mean temperature was the second highest recorded in Asia. Dr Kolomeets was delivering...",
        "content": "Vendors cover their faces as they ride on their donkeys and three-wheeler vehicles loaded with water cans during a hot summer day in Sindh’s Jacobabad, May 28, 2024, amid ongoing heatwave conditions. — AFP\nIslamabad: Dr Liudmila Kolomeets from World ... [1886 chars]",
        "url": "https://www.thenews.com.pk/print/1267109-2nd-highest-mercury-recorded-in-asia-in-2023",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-31/l_1267109_015259_updates.jpg",
        "publishedAt": "2024-12-29T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia bans crypto mining in several regions until 2031",
        "description": "The government's concerns about the crypto mining sector's high energy demands have prompted a temporary ban in key regions.",
        "content": "Russia has banned crypto mining in ten key regions of the country until 2031, citing its high energy consumption, according to Russian news sources.\nDagestan, North Ossetia, and Chechnya are among the regions impacted by the new ban, which will start... [1556 chars]",
        "url": "https://finance.yahoo.com/news/russia-bans-crypto-mining-several-200313048.html",
        "image": "https://media.zenfs.com/en/thestreet_881/920c274ad1f1ff06d338843bc0b9e31a",
        "publishedAt": "2024-12-28T20:03:13Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        }
    },
    {
        "title": "Russia to scrap unilateral missile moratorium: Lavrov",
        "description": "MOSCOW:Russia will scrap a moratorium on the deployment of intermediate and shorter range nuclear-capable missiles because the United States has deployed such weapons in various regions around the...",
        "content": "Russia's Foreign Minister Sergei Lavrov speaks to the media as he attends the 31st Organization for Security and Co-operation in Europe (OSCE) Ministerial Council in Ta'Qali, Malta, December 5, 2024. — Reuters\nMOSCOW:Russia will scrap a moratorium on... [2810 chars]",
        "url": "https://www.thenews.com.pk/print/1266828-russia-to-scrap-unilateral-missile-moratorium-lavrov",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-30/l_1266828_041006_updates.jpg",
        "publishedAt": "2024-12-28T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Putin apologises to Azerbaijan over passenger plane crash",
        "description": "MOSCOW: Russia’s Vladimir Putin on Saturday apologised to Azerbaijan’s President Ilham Aliyev for a “tragic incident” which happened in Russian airspace involving an...",
        "content": "The wreckage of the Azerbaijani Airlines-operated Embraer 190, flight J2-8243, near Kazakhstan's Aktau city on December 25, 2024. — AFP\nMOSCOW: Russia’s Vladimir Putin on Saturday apologised to Azerbaijan’s President Ilham Aliyev for a “tragic incide... [1936 chars]",
        "url": "https://www.thenews.com.pk/print/1266536-putin-apologises-to-azerbaijan-over-passenger-plane-crash",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-29/l_1266536_035403_updates.jpg",
        "publishedAt": "2024-12-28T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Azerbaijan says Russia shot at plane before crash, demands it admit",
        "description": "Azerbaijani President Ilham Aliyev accused Russia on Sunday of firing at an Azerbaijan Airlines passenger jet before it crashed and of initially trying to cover up the cause of the fatal disaster,...",
        "content": "A drone view shows emergency specialists working at the crash site of an Azerbaijan Airlines passenger plane near the city of Aktau, Kazakhstan December 25, 2024. — Reuters\nAzerbaijani President Ilham Aliyev accused Russia on Sunday of firing at an A... [3273 chars]",
        "url": "https://www.thenews.com.pk/latest/1266669-azerbaijan-says-russia-shot-at-plane-before-crash-demands-it-admit",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-29/l_1266669_071558_updates.jpg",
        "publishedAt": "2024-12-28T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "'Tragic incident': Putin apologises to Aliyev over Azerbaijan plane crash",
        "description": "MOSCOW: Russian President Vladimir Putin apologised to his Azerbaijan's counterpart Ilham Aliyev over the tragic Azerbaijan Airlines passenger plane crash which occurred in Russia's airspace on...",
        "content": "A drone view shows emergency specialists working at the crash site of an Azerbaijan Airlines passenger plane near the city of Aktau, Kazakhstan December 25, 2024. — Reuters\nMOSCOW: Russian President Vladimir Putin apologised to his Azerbaijan's count... [1951 chars]",
        "url": "https://www.thenews.com.pk/latest/1266379-tragic-incident-putin-apologises-to-aliyev-over-azerbaijan-plane-crash",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-28/l_1266379_063342_updates.jpg",
        "publishedAt": "2024-12-27T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Early indications suggest Azerbaijan plane possibly downed by Russia: White House",
        "description": "The United States has seen early indications suggesting that the Azerbaijan Airlines jet that crashed in Kazakhstan this week was possibly brought down by Russian air defense systems, the White...",
        "content": "A drone view shows emergency specialists working at the crash site of an Azerbaijan Airlines passenger plane near the city of Aktau, Kazakhstan December 25, 2024. — Reuters\nThe United States has seen early indications suggesting that the Azerbaijan A... [3869 chars]",
        "url": "https://www.thenews.com.pk/latest/1266104-early-indications-suggest-azerbaijan-plane-possible-downed-by-russia-white-house",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-27/l_1266104_113339_updates.jpg",
        "publishedAt": "2024-12-26T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia attacks Ukraine energy grid with missiles, drones",
        "description": "Volodymyr Zelensky condemned \"inhumane\" Russian attack, as over 170 missiles and drones targeted country's power grid on Christmas Day.",
        "content": "Ukrainian President Volodymyr Zelensky condemned an “inhumane” Russian attack on Wednesday, as over 170 missiles and drones targeted the country’s power grid on Christmas Day, killing an energy worker.\nAt 5:30 am (0330 GMT), air raid alarms sounded a... [1254 chars]",
        "url": "https://www.bolnews.com/international/2024/12/russia-attacks-ukraine-energy-grid-with-missiles-drones/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/09/syria.jpg",
        "publishedAt": "2024-12-26T12:47:48Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "BMW admits to supplying cars to Russia despite sanctions",
        "description": "BMW has acknowledged that it supplied cars to Russia in violation of sanctions. An internal investigation confirmed that the vehicles",
        "content": "BMW has acknowledged that it supplied cars to Russia in violation of sanctions. An internal investigation confirmed that the vehicles were imported from Hanover.\nBMW stated that the employees responsible for bypassing the sanctions have been dismisse... [1486 chars]",
        "url": "https://www.bolnews.com/auto/2024/12/bmw-admits-to-supplying-cars-to-russia-despite-sanctions/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/12/BMW.jpg",
        "publishedAt": "2024-12-24T06:54:46Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        }
    },
    {
        "title": "Russia paves way to remove Taliban from ‘terror’ list",
        "description": "MOSCOW: Russia´s parliament on Tuesday approved a bill that could pave the way for Moscow to lift its designation of the Taliban as a banned “terrorist” organisation.Moscow has...",
        "content": "Russian Foreign Minister Sergei Lavrov shakes hands with Acting Foreign Minister of Afghanistan's Taliban movement Amir Khan Muttaqi during a meeting in Moscow, Russia, October 4, 2024. — Reuters\nMOSCOW: Russia´s parliament on Tuesday approved a bill... [1249 chars]",
        "url": "https://www.thenews.com.pk/print/1262765-russia-paves-way-to-remove-taliban-from-terror-list",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-18/l_1262765_025845_updates.jpg",
        "publishedAt": "2024-12-16T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Moscow evacuates part of its diplomatic personnel in Syria",
        "description": "MOSCOW: Russia’s foreign ministry said it has evacuated some of its diplomatic staff from Syria Sunday, a week after the fall of Bashar al-Assad.“On December 15, the withdrawal of part...",
        "content": "This handout satellite image released by Maxar Technologies on December 13, 2024 shows an Antonov An-124 heavy transport aircraft preparing to load equipment at the Russian Hmeimim Air Base in Syria's western province of Latakia.— AFP\nMOSCOW: Russia’... [1327 chars]",
        "url": "https://www.thenews.com.pk/print/1262021-moscow-evacuates-part-of-its-diplomatic-personnel-in-syria",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-16/l_1262021_051616_updates.jpg",
        "publishedAt": "2024-12-14T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "At least one killed as Russian tankers wrecked in Black Sea",
        "description": "MOSCOW: Russia mounted a rescue effort on Sunday after two oil tankers were wrecked in rough seas off Moscow-annexed Crimea and one broke apart, killing at least one sailor and causing an oil...",
        "content": "Kerch Strait, Crimea, July 17, 2023. — Reuters\nMOSCOW: Russia mounted a rescue effort on Sunday after two oil tankers were wrecked in rough seas off Moscow-annexed Crimea and one broke apart, killing at least one sailor and causing an oil spill.\nThe ... [2511 chars]",
        "url": "https://www.thenews.com.pk/latest/1261902-at-least-one-killed-as-russian-tankers-wrecked-in-black-sea",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-15/l_1261902_111856_updates.jpg",
        "publishedAt": "2024-12-14T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Ukraine replaces commander as Russia advances fast in east",
        "description": "KYIV: Ukraine’s military leadership has replaced the commander overseeing defences in the eastern Donetsk region where Russian forces are making swift advances, a military official said on...",
        "content": "A Ukrainian tank and a car are parked near a road sign that reads, 'Pokrovsk’, amid Russia's attack on Ukraine, in the town of Pokrovsk in Donetsk region, Ukraine December 12, 2024. — Reuters\nKYIV: Ukraine’s military leadership has replaced the comma... [2141 chars]",
        "url": "https://www.thenews.com.pk/print/1261774-ukraine-replaces-commander-as-russia-advances-fast-in-east",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-15/l_1261774_065340_updates.jpg",
        "publishedAt": "2024-12-13T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia pulling back but not out of Syria",
        "description": "TARTOUS, Syria: Russia is pulling back its military from the front lines in northern Syria and from posts in the Alawite Mountains but is not leaving its two main bases in the country after the fall...",
        "content": "A Russian military convoy heads towards Hmeimim air base in Syria's coastal Latakia. — Reuters/File\nTARTOUS, Syria: Russia is pulling back its military from the front lines in northern Syria and from posts in the Alawite Mountains but is not leaving ... [1678 chars]",
        "url": "https://www.thenews.com.pk/print/1261740-russia-pulling-back-but-not-out-of-syria",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-15/l_1261740_042322_updates.jpg",
        "publishedAt": "2024-12-13T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "European troops in Ukraine could guarantee future peace deal: Kyiv",
        "description": "KYIV, Ukraine: The deployment of European troops in Ukraine could help guarantee a future deal aimed at securing peace in the nearly three-year war with Russia, a senior Kyiv official said on...",
        "content": "Poland's Prime Minister Donald Tusk (right) and French President Emmanuel Macron give a joint press conference in Warsaw, Poland, on December 12, 2024. —AFP\nKYIV, Ukraine: The deployment of European troops in Ukraine could help guarantee a future dea... [1452 chars]",
        "url": "https://www.thenews.com.pk/print/1261082-european-troops-in-ukraine-could-guarantee-future-peace-deal-kyiv",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261082_041237_updates.jpg",
        "publishedAt": "2024-12-11T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia ‘close to’ deal with rebels to retain military bases in Syria",
        "description": "MOSCOW: Russia has established direct contacts with the political committee of Syria’s Islamist rebel group, Hayat Tahrir al-Sham, the Interfax news agency quoted Russian Deputy Foreign...",
        "content": "Rebels led by the Islamist militant group Hayat Tahrir al-Sham drive a military vehicle in al-Rashideen, Aleppo province, Syria November 29, 2024. — Reuters\nMOSCOW: Russia has established direct contacts with the political committee of Syria’s Islami... [3352 chars]",
        "url": "https://www.thenews.com.pk/print/1261088-russia-close-to-deal-with-rebels-to-retain-military-bases-in-syria",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261088_042149_updates.jpg",
        "publishedAt": "2024-12-11T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Pak-Russia IGC meeting discusses cooperation in energy sector",
        "description": "ISLAMABAD: The collaboration in gas infrastructure development, oil field services, oil and LNG trade was widely discussed during the Inter-Governmental Commission meeting held in Moscow on...",
        "content": "Two employees while working on a gas pipeline in an unidentified location. — AFP/File\nISLAMABAD: The collaboration in gas infrastructure development, oil field services, oil and LNG trade was widely discussed during the Inter-Governmental Commission ... [4943 chars]",
        "url": "https://www.thenews.com.pk/print/1260780-pak-russia-igc-meeting-discusses-cooperation-in-energy-sector",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-12/l_1260780_083226_updates.jpg",
        "publishedAt": "2024-12-11T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "A new compass for the Global South",
        "description": "President Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support...",
        "content": "Chinese President Xi Jinping attends a presentation ceremony in Beijing, China September 29, 2024. — Reuters\nPresident Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries... [6944 chars]",
        "url": "https://www.thenews.com.pk/print/1260637-a-new-compass-for-the-global-south",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-12/1260637_025304_updates.jpg",
        "publishedAt": "2024-12-11T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia could launch another hypersonic missile at Ukraine soon: US",
        "description": "WASHINGTON: Russia could launch another hypersonic ballistic missile in Ukraine in the coming days, but Washington does not consider the Oreshnik weapon a game-changer in the war, a US official said...",
        "content": "Parts of a ballistic missile, which Russia used in a strike towards Dnipro city this week, are displayed, amid Russia's attack on Ukraine, at an undisclosed location in Ukraine November 24, 2024. — Reuters\nWASHINGTON: Russia could launch another hype... [1548 chars]",
        "url": "https://www.thenews.com.pk/print/1260737-russia-could-launch-another-hypersonic-missile-at-ukraine-soon-us",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-12/l_1260737_044435_updates.jpg",
        "publishedAt": "2024-12-10T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia preparing for prisoner swap with Trump",
        "description": "MOSCOW: Russia is preparing for a possible prisoner swap when President-elect Donald Trump returns to office to demonstrate a reset in relations with the United States.Sergei Ryabkov, Russia’s...",
        "content": "US president-elect Trump and Russian President Vladimir Putin talk at the APEC Summit in Danang, Vietnam. — Reuters/File\nMOSCOW: Russia is preparing for a possible prisoner swap when President-elect Donald Trump returns to office to demonstrate a res... [2438 chars]",
        "url": "https://www.thenews.com.pk/print/1260734-russia-preparing-for-prisoner-swap-with-trump",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-12/l_1260734_044102_updates.jpg",
        "publishedAt": "2024-12-10T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia takes step towards recognising Afghanistan’s Taliban government",
        "description": "MOSCOW: Russia moved a step closer towards recognising the Taliban government of Afghanistan on Tuesday as parliament voted in favour of a law that would make it possible to remove the Taliban from...",
        "content": "Members of the State Duma, the lower house of parliament, attend a plenary session in Moscow, Russia December 10, 2024. — Reuters\nMOSCOW: Russia moved a step closer towards recognising the Taliban government of Afghanistan on Tuesday as parliament vo... [1235 chars]",
        "url": "https://www.thenews.com.pk/print/1260387-russia-takes-step-towards-recognising-afghanistan-s-taliban-government",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-11/l_1260387_030504_updates.jpg",
        "publishedAt": "2024-12-09T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Syria enters critical chapter in history as post-Assad era begins",
        "description": "Syrians awakened on Monday to a mix of hope and uncertainty after rebels captured Damascus and President Bashar al-Assad fled to Russia, ending a 13-year civil war and over 50 years of the...",
        "content": "A tank is parked on a street after Syrian rebels announced that they have ousted Syria's Bashar al-Assad, in Damascus, Syria, December 8, 2024. — Reuters\nSyrians awakened on Monday to a mix of hope and uncertainty after rebels captured Damascus and P... [4260 chars]",
        "url": "https://www.thenews.com.pk/latest/1259760-syria-enters-critical-chapter-in-history-as-post-assad-era-begins",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-09/l_1259760_105219_updates.jpg",
        "publishedAt": "2024-12-08T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Russia, Iran ‘share responsibility’ for Assad crimes: Nato",
        "description": "BRUSSELS: Nato chief Mark Rutte on Monday said Russia and Iran were complicit in the crimes of ousted Syrian president Bashar al-Assad, and his fall showed they were “unreliable...",
        "content": "NATO's Dutch Secretary General Mark Rutte gestures as he answers journalists' questions during a NATO (North Atlantic Treaty Oganization) Foreign Ministers' meeting at the Nato headquarters in Brussels, on December 3, 2024. — AFP\nBRUSSELS: Nato chief... [427 chars]",
        "url": "https://www.thenews.com.pk/print/1260049-russia-iran-share-responsibility-for-assad-crimes-nato",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-10/l_1260049_044212_updates.jpg",
        "publishedAt": "2024-12-08T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Nobel laureate warns Putin about danger of nuclear weapons",
        "description": "OSLO: This year´s Nobel Peace Prize laureate, Japan´s atomic bomb survivors´ group Nihon Hidankyo, on Monday urged Russia to stop issuing nuclear threats in a bid to prevail in its...",
        "content": "Terumi Tanaka, the representative of 2024 Nobel Peace Prize winner Nihon Hidankyo, signs the guest book at the Nobel Institute in Oslo, Norway December 9, 2024. — Reuters\nOSLO: This year´s Nobel Peace Prize laureate, Japan´s atomic bomb survivors´ gr... [879 chars]",
        "url": "https://www.thenews.com.pk/print/1260057-nobel-laureate-warns-putin-about-danger-of-nuclear-weapons",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-10/l_1260057_045515_updates.jpg",
        "publishedAt": "2024-12-08T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "India inducts Russia-built warship into its naval fleet",
        "description": "A Russian-manufactured guided missile frigate, INS Tushil, was commissioned into India’s naval fleet at a Russian shipyard on Monday, with the country’s defence ministry terming it a...",
        "content": "This handout photograph taken on December 9, 2024 shows India's Defense Minister Rajnath Singh (C) posing for photographs with the Russian delegation during the commissioning ceremony of India's latest multi-role stealth guided missile frigate INS Tu... [1890 chars]",
        "url": "https://www.thenews.com.pk/latest/1259909-india-inducts-russia-built-warship-into-its-naval-fleet",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-09/l_1259909_112338_updates.jpg",
        "publishedAt": "2024-12-08T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    },
    {
        "title": "Trump calls for immediate Ukraine ceasefire, Kyiv and Moscow cite conditions",
        "description": "PARIS: US President-elect Donald Trump called on Sunday for an immediate ceasefire and negotiations between Ukraine and Russia to end “the madness”, prompting Ukrainian President...",
        "content": "US President-elect Donald Trump (left) shaking hand with Ukrainian President Volodymr Zelenskiy. — Reuters/File\nPARIS: US President-elect Donald Trump called on Sunday for an immediate ceasefire and negotiations between Ukraine and Russia to end “the... [1706 chars]",
        "url": "https://www.thenews.com.pk/print/1259736-trump-calls-for-immediate-ukraine-ceasefire-kyiv-and-moscow-cite-conditions",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-09/l_1259736_070701_updates.jpg",
        "publishedAt": "2024-12-08T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        }
    }
]