[
    {
        "title": "Make russia Great Again?",
        "description": "Попри те, що наразі нам дійсно недостатньо відомо про генія-перемовника президента США.",
        "content": "Попри те, що наразі нам дійсно недостатньо відомо про генія-перемовника президента США.\n(Хоча, можливо, і мають рацію ті експерти, які у випадках зустрічі з ведмедем рекомендують прикидатись мертвим, не думаю, що це рішення релевантне для слона. Тим ... [2380 chars]",
        "url": "https://www.pravda.com.ua/columns/2025/02/14/7498319/",
        "image": "https://img.pravda.com/images/doc/7/8/78cb3a0-tkach1.jpg",
        "publishedAt": "2025-02-13T22:00:00Z",
        "source": {
            "name": "УКРАИНСКАЯ ПРАВДА",
            "url": "https://www.pravda.com.ua"
        }
    },
    {
        "title": "\"Росіяни розлючені\". Яке значення має від’єднання енергосистем країн Балтії від російських електромереж?",
        "description": "«Goodbye Russia! Goodbye Lenin!» – сказав Гітанас Науседа",
        "content": "Прощанням з Росією і Леніним зустрів новину про під’єднання до енергомережі ЄС литовський президент Гітанас Науседа на спеціальній церемонії, на якій була присутня також президентка Єврокомісії Урсула фон дер Ляєн. Три балтійські держави від'єдналися... [4999 chars]",
        "url": "https://www.radiosvoboda.org/a/baltiya-rosiya-enerhomerezhi-vidklyuchennya-analiz/33309844.html",
        "image": "https://gdb.rferl.org/c3410000-0aff-0242-8a45-08d99c6bc4d1_cx0_cy6_cw0_w1200_r1.jpg",
        "publishedAt": "2025-02-10T15:23:16Z",
        "source": {
            "name": "Радіо Свобода",
            "url": "https://www.radiosvoboda.org"
        }
    },
    {
        "title": "Пропагандиста Russia today, який був радником Табачника, судитимуть за держзраду",
        "description": "Співробітники Державного бюро розслідувань передали до суду справу колишнього радника міністра освіти і науки України Дмитра Табачника, а нині - пропагандиста Russia today. — Укрінформ.",
        "content": "Працівники ДБР завершили досудове розслідування стосовно колишнього держслужбовця. Обвинувальний акт направлений до суду.\nСлідство встановило, що ще під час перебування в Україні зрадник отримував гроші від представників керівництва Росії для ведення... [2267 chars]",
        "url": "https://www.ukrinform.ua/rubric-society/3947091-propagandista-russia-today-akij-buv-radnikom-tabacnika-suditimut-za-derzzradu.html",
        "image": "https://static.ukrinform.com/photos/2025_01/thumb_files/630_360_1736506139-888.jpg",
        "publishedAt": "2025-01-10T10:37:00Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "Пропагандистка Симоньян заявила, що її чоловік впав у кому",
        "description": "Фото: aqreqator.az Симоньян і Кеосаян Очільниця Russia Today розповіла, що її чоловік переніс клінічну смерть і зараз перебуває в комі.",
        "content": "Очільниця Russia Today розповіла, що її чоловік переніс клінічну смерть і зараз перебуває в комі.\nЧоловік російської пропагандистки, очільниці телеканалу Russia Today Маргарити Симонян, російський пропагандист Тигран Кеосаян перебуває в комі в реанім... [986 chars]",
        "url": "https://1news.com.ua/svit/propagandystka-symonyan-zayavyla-shho-yiyi-cholovik-vpav-u-komu.html",
        "image": "https://1news.com.ua/wp-content/uploads/2025/01/Propagandystka-Symonyan-zayavyla-shho-yiyi-cholovik-vpav-u-komu.jpg",
        "publishedAt": "2025-01-08T23:30:41Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "Зробимо Росію знову маленькою: Як відбувається матеріалізація ідеї",
        "description": "«…А вкінці з цілої тої Росії зостанеться стілько, що буде видно в Москві з балкона». Make russia small again! — Укрінформ.",
        "content": "«…А вкінці з цілої тої Росії зостанеться стілько, що буде видно в Москві з балкона». Make russia small again!\nШалено це все-таки цікаво – стежити за тим, як відбувається МАТЕРІАЛІЗАЦІЯ ІДЕЇ...\nВід перших обережних натяків і прогнозів, від публічних з... [2426 chars]",
        "url": "https://www.ukrinform.ua/rubric-world/3939199-zrobimo-rosiu-znovu-malenkou-ak-vidbuvaetsa-materializacia-idei.html",
        "image": "https://static.ukrinform.com/photos/2024_12/thumb_files/630_360_1734448376-137.jpg",
        "publishedAt": "2024-12-18T09:00:00Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "Глава МЗС Литви підтримав спортсменку, яку зняли з ЧС через футболку з антиросійським написом",
        "description": "Міністр закордонних справ Литви Кястутіс Будріс висловив підтримку литовській спортсменці Корнелії Дудайте, яку зняли з участі у чемпіонаті світу із функціонального спорту після того, як вона вдягла футболку з написом Make Russia small again («Зробимо Росію знову маленькою»). — Укрінформ.",
        "content": "Міністр закордонних справ Литви Кястутіс Будріс висловив підтримку литовській спортсменці Корнелії Дудайте, яку зняли з участі у чемпіонаті світу із функціонального спорту після того, як вона вдягла футболку з написом Make Russia small again («Зробим... [988 chars]",
        "url": "https://www.ukrinform.ua/rubric-world/3938063-glava-mzs-litvi-pidtrimav-sportsmenku-aku-znali-z-cs-cerez-futbolku-z-antirosijskim-napisom.html",
        "image": "https://static.ukrinform.com/photos/2024_12/thumb_files/630_360_1734186692-473.jpg",
        "publishedAt": "2024-12-14T14:37:23Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "\"Ніхто не має бути покараний за те, що виступає проти терору\": в Литві відреагували на скандал з антиросійською футболкою",
        "description": "В Міністерстві закордонних справ Литви відреагували на інцидент з литовською атлеткою та футболкою з написом \"Make Russia small again\"",
        "content": "В Міністерстві закордонних справ Литви відреагували на інцидент з литовською атлеткою та футболкою з написом \"Make Russia small again\". Міністр Кястутіс Будрис став на захист спортсменки.\nПро це пише LRT з посиланням на соцмережі посадовця.\nВін проко... [903 chars]",
        "url": "https://apostrophe.ua/ua/news/sport/2024-12-14/nikto-ne-doljen-byit-nakazan-za-to-chto-vyistupaet-protiv-terrora-v-litve-otreagirovali-na-skandal-s-antirossiyskoy-futbolkoy/335876",
        "image": "https://static.apostrophe.ua/uploads/image/475f03a6458bb1a057a245154644e33b.png",
        "publishedAt": "2024-12-13T22:00:00Z",
        "source": {
            "name": "Апостроф",
            "url": "https://apostrophe.ua"
        }
    },
    {
        "title": "Литовську спортсменку зняли з ЧС через напис \"Make Russia small again\"",
        "description": "Литовську спортсменку Корнелію Дудайте зняли з Чемпіонату світу з функціональних видів спорту через футболку з написом \"Make russia small",
        "content": "Литовську спортсменку Корнелію Дудайте зняли з Чемпіонату світу з функціональних видів спорту через футболку з написом \"Make russia small again\" (\"Зробимо Росію малою знову\").\nПро це повідомило видання LRT.\nНа чемпіонаті, який зараз проходить в Угорщ... [3730 chars]",
        "url": "https://apostrophe.ua/ua/news/sport/2024-12-14/litovskuyu-sportsmenku-snyali-s-chm-iz-za-nadpisi-make-russia-small-again/335868",
        "image": "https://static.apostrophe.ua/uploads/image/cf64df618b22582a036172e0b17fcec9.jpg",
        "publishedAt": "2024-12-13T22:00:00Z",
        "source": {
            "name": "Апостроф",
            "url": "https://apostrophe.ua"
        }
    },
    {
        "title": "ЗСУ ліквідували продюсера телеканалу Russia Today",
        "description": "27-річний Бучаєв загинув під час штурму Часового Яру",
        "content": "27-річний Бучаєв загинув під час штурму Часового Яру\nЗСУ ліквідували російського пропагандиста, продюсера телеканалу Russia Today Магомеда Бучаєва. Це сталося у Часовому Яру Донецької області, повідомляють росЗМІ.\nЗазначається, що 27-річний Бучаєв за... [727 chars]",
        "url": "https://glavcom.ua/country/incidents/zsu-likviduvali-prodjusera-telekanalu-russia-today-1033037.html",
        "image": "https://glavcom.ua/img/article/10330/37_main-v1732359909.webp",
        "publishedAt": "2024-11-23T11:04:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "Вперше з 2022 року більшість росіян підтримує перемови - опитування",
        "description": "Дослідження Russia Field свідчить, що за перехід до переговорного процесу висловилося 53% респондентів. Більш як половина росіян уперше з початку війни виступили за негайні переговори з Україною.",
        "content": "Дослідження Russia Field свідчить, що за перехід до переговорного процесу висловилося 53% респондентів.\nБільш як половина росіян уперше з початку війни виступили за негайні переговори з Україною. Про це свідчить опитування Russia Field за листопад.\nЗ... [985 chars]",
        "url": "https://1news.com.ua/svit/vpershe-z-2022-roku-bilshist-rosiyan-pidtrymuye-peremovy-opytuvannya.html",
        "image": "https://1news.com.ua/wp-content/uploads/2024/11/Vpershe-z-2022-roku-bilshist-rosiyan-pidtrymuye-peremovy-opytuvannya.jpg",
        "publishedAt": "2024-11-22T15:54:18Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "\"Stop Russia!\" Українські активісти зірвали виступ Навальної на конференції в Лісабоні",
        "description": "Під час виступу Навальної на вебсаміті українці увімкнули сигнал тривоги",
        "content": "Українські активісти кричали «Stop Russia» та «Stop the War» під час виступу Навальної на саміті\nПід час виступу Навальної на вебсаміті українці увімкнули сигнал тривоги\nУкраїнські активісти зірвали виступ вдови російського опозиціонера Олексія Навал... [2222 chars]",
        "url": "https://glavcom.ua/world/world-politics/ukrajinski-aktivisti-zirvali-vistup-navalnoji-na-konferentsiji-v-lisaboni-video-1031034.html",
        "image": "https://glavcom.ua/img/article/10310/34_main-v1731430678.webp",
        "publishedAt": "2024-11-12T17:11:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "Українці ввімкнули повітряну тривогу та скандували під час виступу Навальної у Лісабоні",
        "description": "У Лісабоні українські активісти увімкнули звук повітряної тривоги та скандували Stop Russia під час виступу дружини російського політика Алексєя Навального Юлії на конференції Web Summit 2024 у Лісабоні.",
        "content": "У Лісабоні українські активісти увімкнули звук повітряної тривоги та скандували \"Stop Russia\" під час виступу дружини російського політика Алексєя Навального Юлії на конференції Web Summit 2024 у Лісабоні.\nДжерело: маркетологиня та блогерка Христина ... [1834 chars]",
        "url": "https://www.pravda.com.ua/news/2024/11/12/7484151/",
        "image": "https://img.pravda.com/images/doc/7/4/7484151_fb_image_ukr_2024_11_12_19_55_46.jpg",
        "publishedAt": "2024-11-11T22:00:00Z",
        "source": {
            "name": "УКРАИНСКАЯ ПРАВДА",
            "url": "https://www.pravda.com.ua"
        }
    },
    {
        "title": "Росія обурилася через футболку Зеленського з красномовним написом",
        "description": "23 жовтня, президент України Володимир Зеленський виступив із традиційним вечірнім відеозверненням, під час якого він був одягнений у футболку з написом Make russia small again",
        "content": "У МЗС РФ обурилися через напис на футболці президента України\n23 жовтня, президент України Володимир Зеленський виступив із традиційним вечірнім відеозверненням, під час якого він був одягнений у футболку з написом Make russia small again\nУ Міністерс... [2029 chars]",
        "url": "https://glavcom.ua/world/world-politics/mzs-rf-oburilosja-cherez-futbolku-zelenskoho-z-napisom-zrobimo-rosiju-maloju-znovu-1027482.html",
        "image": "https://glavcom.ua/img/article/10274/82_main-v1729750273.webp",
        "publishedAt": "2024-10-24T06:10:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "Make Russia small again: Зеленський одягнув оригінальну футболку",
        "description": "Український президент Володимир Зеленський, розповідаючи у вечірньому відеозверненні про обговорення невідкладних рішень у низц",
        "content": "Український президент Володимир Зеленський, розповідаючи у вечірньому відеозверненні про обговорення невідкладних рішень у низці сфер, був одягнений у красномовну тематичну футболку, присвячену Росії.\nПро це повідомляє \"Апостроф\", посилаючись на віде... [1251 chars]",
        "url": "https://apostrophe.ua/ua/news/society/2024-10-23/make-russia-small-again-zelenskiy-nadel-originalnuyu-futbolku/332720",
        "image": "https://static.apostrophe.ua/uploads/image/a09aa46c76d1c2d3e06e2498a246f071.png",
        "publishedAt": "2024-10-22T21:00:00Z",
        "source": {
            "name": "Апостроф",
            "url": "https://apostrophe.ua"
        }
    },
    {
        "title": "ЦПД: Росія готує інформаційну операцію проти України й Туреччини",
        "description": "Росія планує кампанію для дискредитації військово-технічного співробітництва України й Туреччини. Наприкінці жовтня через пропагандистський канал Russia Today спецслужби планують оприлюднити серію дезінформаційних матеріалів про те, що Україна нібито без відома США торгує зброєю з ...",
        "content": "Росія хоче зруйнувати відносини Києва із союзниками. Фото: Pexels\nРосія планує кампанію для дискредитації військово-технічного співробітництва України й Туреччини.\nНаприкінці жовтня через пропагандистський канал Russia Today спецслужби планують оприл... [1147 chars]",
        "url": "https://gazeta.ua/articles/politics/_cpd-rosiya-gotuye-informacijnu-operaciyu-proti-ukrayini-j-turechchini/1196007",
        "image": "https://gazeta.ua/images/favicon.ico",
        "publishedAt": "2024-10-10T16:05:49Z",
        "source": {
            "name": "Gazeta.ua",
            "url": "https://gazeta.ua"
        }
    },
    {
        "title": "Венеційський фестиваль: показали фільм від режисерки-пропагандистки \"Росіяни на війні\"",
        "description": "На Венеційському кінофестивалі показали фільм \"Росіяни на війні\" (Russians at War) російської режисерки Анастасії Трофімової, яка раніше знімала кіно для пропагандистського холдингу RT (Russia Today). Фільм показує лише короткі проблиски реальних боїв і взагалі не дає розуміння про ...",
        "content": "На Венеційському кінофестивалі показали фільм про \"хороших росіян\". Фото: Український репортер\nНа Венеційському кінофестивалі показали фільм \"Росіяни на війні\" (Russians at War) російської режисерки Анастасії Трофімової, яка раніше знімала кіно для п... [1921 chars]",
        "url": "https://gazeta.ua/articles/life/_na-kinofestivali-v-veneciyi-pokazali-propagandistskij-film-pro-horoshih-rosiyan-na-vijni-z-ukrayinoyu-kinospilnota-oburena/1192760",
        "image": "https://gazeta.ua/images/favicon.ico",
        "publishedAt": "2024-09-06T21:53:55Z",
        "source": {
            "name": "Gazeta.ua",
            "url": "https://gazeta.ua"
        }
    },
    {
        "title": "Russia Today платила американській медіакомпанії за \"дружній\" до РФ контент",
        "description": "Фото: Х / OSINTdefender Зліва на право: Бенні Джонсон, Дейв Рубін і Тім Пул Російські пропагандисти передали майже 10 мільйонів доларів компанії для створення контенту, “дружнього” до Росії.",
        "content": "Російські пропагандисти передали майже 10 мільйонів доларів компанії для створення контенту, “дружнього” до Росії.\nАмериканська медіакомпанія, пов’язана з шістьма впливовими консервативними діячами, таємно фінансувалася співробітниками російських дер... [1512 chars]",
        "url": "https://1news.com.ua/svit/russia-today-platyla-amerykanskij-mediakompaniyi-za-druzhnij-do-rf-kontent.html",
        "image": "https://1news.com.ua/wp-content/uploads/2024/09/Russia-Today-platyla-amerykanskij-mediakompaniyi-za-druzhnij-do-RF-kontent.jpg",
        "publishedAt": "2024-09-05T11:23:37Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "Russia Today витратила майже $10 мільйонів на створення у США \"дружнього\" до Кремля контенту",
        "description": "Американська медіакомпанія, пов'язана з шістьма впливовими консервативними діячами, таємно фінансувалася співробітниками російських державних ЗМІ для випуску англомовних відео, які часто відповідали «інтересам Кремля в посиленні внутрішніх розбіжностей в США з метою послаблення американської опозиції». — Укрінформ.",
        "content": "Американська медіакомпанія, пов'язана з шістьма впливовими консервативними діячами, таємно фінансувалася співробітниками російських державних ЗМІ для випуску англомовних відео, які часто відповідали «інтересам Кремля в посиленні внутрішніх розбіжност... [1864 chars]",
        "url": "https://www.ukrinform.ua/rubric-world/3902416-russia-today-vitratila-majze-10-miljoniv-na-stvorenna-u-ssa-druznogo-do-kremla-kontentu.html",
        "image": "https://static.ukrinform.com/photos/2024_07/thumb_files/630_360_1721977741-605.jpg",
        "publishedAt": "2024-09-05T09:43:33Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "США планують звинуватити Росію у спробі вплинути на вибори 2024 року - ЗМІ",
        "description": "Згідно з повідомленнями, Кремль використовував такі засоби масової інформації, як RT, колишня Russia Today, і підтримувані ним онлайн-платформи, щоб поширювати дезінформацію серед виборців США",
        "content": "Адміністрація президента США Джо Байдена збирається звинуватити Росію в постійних спробах вплинути на вибори в США 2024 року через керовані Кремлем ЗМІ й онлайн-платформи, повідомили 4 вересня американські ЗМІ з посиланням на неназвані джерела.\nЗгідн... [636 chars]",
        "url": "https://www.radiosvoboda.org/a/news-ssha-propahanda-rf/33106028.html",
        "image": "https://gdb.rferl.org/10e3a86d-f3ee-409c-b2d7-aa5cf0a3e1cb_cx0_cy4_cw0_w1200_r1.jpg",
        "publishedAt": "2024-09-04T17:31:47Z",
        "source": {
            "name": "Радіо Свобода",
            "url": "https://www.radiosvoboda.org"
        }
    },
    {
        "title": "Ексдиректора Russia Today засудили за заклики вбивати українських дітей",
        "description": "Пропагандист Антон Красовський в одному з ефірів публічно закликав топити та спалювати українських дітей. Суд визнав колишнього директора Russia Today Антона Красовського винним у публічних закликах до геноциду.",
        "content": "Пропагандист Антон Красовський в одному з ефірів публічно закликав топити та спалювати українських дітей.\nСуд визнав колишнього директора Russia Today Антона Красовського винним у публічних закликах до геноциду. Про це Суд визнав колишнього директора... [1204 chars]",
        "url": "https://1news.com.ua/ukraine/eksdyrektora-russia-today-zasudyly-za-zaklyky-vbyvaty-ukrayinskyh-ditej.html",
        "image": "https://1news.com.ua/wp-content/uploads/2024/08/Eksdyrektora-Russia-Today-zasudyly-za-zaklyky-vbyvaty-ukrayinskyh-ditej.png",
        "publishedAt": "2024-08-13T12:44:59Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "У Курській області РФ закрили три залізничні вокзали",
        "description": "Фото: russia-ic.com (ілюстративне фото) Росіяни закрили три залізничні вокзали у Курській області через бойові дії Для забезпечення безпеки руху в Курській області влада проводить додаткові огляди інфраструктури та інструктує персонал.",
        "content": "Росіяни закрили три залізничні вокзали у Курській області через бойові дії\nДля забезпечення безпеки руху в Курській області влада проводить додаткові огляди інфраструктури та інструктує персонал.\nУКурській областіРосії через бойові дії тимчасово закр... [591 chars]",
        "url": "https://1news.com.ua/svit/u-kurskij-oblasti-rf-zakryly-try-zaliznychni-vokzaly.html",
        "image": "https://1news.com.ua/wp-content/uploads/2024/08/U-Kurskij-oblasti-RF-zakryly-try-zaliznychni-vokzaly.jpg",
        "publishedAt": "2024-08-08T13:09:56Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "У США ліквідували російську ботоферму, створену за допомогою ШІ",
        "description": "​Ботофермою керувало керівництво пропагандистського каналу Russia Today.",
        "content": "У США вперше ліквідували масштабну російську \"ботоферму\", створену за допомогою штучного інтелекту у соцмережі Х.\nПро це повідомляє Мін'юст США.\n\"Цими діями Міністерство юстиції зірвало підтримувану російським урядом пропагандистську кампанію з викор... [2420 chars]",
        "url": "https://lb.ua/world/2024/07/11/623593_ssha_vpershe_likviduvali_rosiysku.html",
        "image": "https://i.lb.ua/026/46/668f8b0ba7cbb.jpeg",
        "publishedAt": "2024-07-11T10:33:00Z",
        "source": {
            "name": "Левый берег",
            "url": "https://lb.ua"
        }
    },
    {
        "title": "Керівник ФЛА Закарпаття Олег Коноваленко ходить в куртці з написом Russia",
        "description": "Голова Закарпатської федерації легкої атлетики Олег Коноваленко хоче відокремити Закарпаття від України та тренується у куртці з написом RUSSIA",
        "content": "Президент Федерації легкої атлетики Закарпатської області Олег Коноваленко тренується в формі з написом \"Russia\" та заявляє про відокремлення Закарпаття від України.\nВідповідне відео оприлюднив журналіст Віталій Глагол.\nЧитайте також: Чи може Росія а... [955 chars]",
        "url": "https://apostrophe.ua/ua/news/society/accidents/2024-05-21/sportivnyiy-chinovnik-iz-zakarpatya-zasvetilsya-v-olimpiyke-s-nadpisyu-russia-video-i-detali-skandala/321973",
        "image": "https://static.apostrophe.ua/uploads/image/3ed6d5562db9db820e30f797deb0fc3c.jpg",
        "publishedAt": "2024-05-20T21:00:00Z",
        "source": {
            "name": "Апостроф",
            "url": "https://apostrophe.ua"
        }
    },
    {
        "title": "???? Повідомлено про нову підозру головреду пропагандистського телеканалу Russia today, ...",
        "description": "Повідомлено про нову підозру головреду пропагандистського телеканалу Russia today, яка закликала «добити» жителів Західної України ????За процесуального керівництва Офісу Генерального прокурора",
        "content": "Повідомлено про нову підозру головреду пропагандистського телеканалу Russia today, яка закликала «добити» жителів Західної України\n????За процесуального керівництва Офісу Генерального прокурора повідомлено про підозру російській журналістці – головно... [1195 chars]",
        "url": "https://1news.com.ua/podii/povidomleno-pro-novu-pidozru-golovredu-propagandystskogo-telekanalu-russia-today.html",
        "image": "https://cdn4.cdn-telegram.org/file/X_fUwg0pEWmPVy3SuelvWdCDLVwzuBBl8JCp9J1uXF-l5Q0DZ219wgGcyn6n6xiTCCquWpV8wBW-e6gq2JHMFR2Yk0LZWVx9fOcEurEt_7qvcRbMbJkiPosLLyR_pKxRbRDMaw_kfClAUFYyXPdCZ_quziRlLFp0Wojda6vwvhbdRwqNnM3eMD2TQY1L45ucPvE8dPjkRa6j1dwiWuVcNjl8bvDk5INfjNYpLFQgnQxbI-kS7R7gjaBtACxb97QYBmbt5ox319H21qSfuFnfbTiJsIiwvGIwAN9eWE_98qeOJsXf_NTV3bwt1NLjfxlit8pIo6m_hOQUDvFEcAegsQ.jpg",
        "publishedAt": "2024-04-01T11:12:54Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "Російські хакери атакували урядові сайти Словенії",
        "description": "Відповідальність за кібератаки взяла на себе російська хакерська група Cyber Army Russia Reborn",
        "content": "Державні сайти зазнали DDoS-нападу, однак хакери не змогли отримати доступу до системи\nВідповідальність за кібератаки взяла на себе російська хакерська група Cyber Army Russia Reborn\nDDoS-атак зазнали урядові сайти Словенії, а також сайт президента к... [827 chars]",
        "url": "https://glavcom.ua/techno/telecom/rosijski-khakeri-atakuvali-urjadovi-sajti-sloveniji-993317.html",
        "image": "https://glavcom.ua/img/article/9933/17_main-v1711653473.jpg",
        "publishedAt": "2024-03-28T19:17:53Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "???? #russia_is_terrorist_state Сергійко – 9 рочків ???? Злата – 8 рочків ???? Лізонька – 7 місяців ???? М...",
        "description": "#russia_is_terrorist_stateСергійко – 9 рочків ????Злата – 8 рочків ????Лізонька – 7 місяців ????Марк – 3 рочки ????Тимофійко – 4 місяці ????Їх вбила недокраїна.",
        "content": "#russia_is_terrorist_state\nСергійко – 9 рочків ????\nЗлата – 8 рочків ????\nЛізонька – 7 місяців ????\nМарк – 3 рочки ????\nТимофійко – 4 місяці ????\nЇх вбила недокраїна. Цинічно, у своїх ліжках. Хтось загинув у теплих, міцних обіймах мами. У когось поря... [337 chars]",
        "url": "https://1news.com.ua/podii/russia_is_terrorist_state-sergijko-9-rochkiv-zlata-8-rochkiv-lizonka-7-misyatsiv-m.html",
        "image": "https://cdn4.cdn-telegram.org/file/MneTOJ0mYaB1uzi2Dm_9jPqTV6mbHS8E3ATWWd8O764oN7pDcpoIFN4HjGmG9Ml-HnaPcZVlj_2nuccvvY1BUUkOCxGePDhHnWuFEi-EtM0m1TgwXwJ3sNh2DT8_SX80X09k7OM0TmuRmk8kMYT3VAn2iE8r4hslffDuMZgAILEbY5tejw6XkYvgq1jfusjS7WvN1tjbV0rG3D7-A5XHPmlTApu118Ug3Z9K9Jz8-YeWMlCDoVLm25Wl2c1pH_6gT7EM9dM3avpf4ts0UhO7AWNhFxn0L7XI2uyrvjGAQylVTPxn78j_48f7eegzpmG1muCVbUK_sYYMG9oryrMsNg.jpg",
        "publishedAt": "2024-03-05T00:12:46Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "Литва: концерт LP скасували через появу в одязі з прапором РФ",
        "description": "Американська співачка LP виклала відео, на якому вона була в худі з кольорами російського прапора та написом “LP Russia Official”, незабаром її концерт у Литві скасували",
        "content": "Співачка згодом видалила відео в одязі з російським прапором, але каунаська “Жальгіріс Арена” оголосила про скасування концерту.\nАмериканська співачка LP (Лаура Перголіцці) поділилась в Instagram відео, на якому вона була в худі, прикрашеному кольора... [1811 chars]",
        "url": "https://lb.ua/world/2024/02/27/600750_litvi_skasuvali_kontsert.html",
        "image": "https://i.lb.ua/092/27/65de2ad997495.jpeg",
        "publishedAt": "2024-02-27T20:33:00Z",
        "source": {
            "name": "Левый берег",
            "url": "https://lb.ua"
        }
    },
    {
        "title": "LP потрапила у скандал через використання російської символіки",
        "description": "Американська співачка Лора Перголіцці, яка виступає під псевдонімом LP, потрапила у гучний скандал. Артистка опублікувала відео, на якому була одягнена в худі з прапором РФ і написом Russia official. Зірка, яка раніше підтримувала Україну, подякувала російським фанам за такий ...",
        "content": "Фото: instagram.com/iamlpofficial\nАмериканська співачка Лора Перголіцці, яка виступає під псевдонімом LP, потрапила у гучний скандал.\nАртистка опублікувала відео, на якому була одягнена в худі з прапором РФ і написом Russia official. Зірка, яка раніш... [982 chars]",
        "url": "https://gazeta.ua/articles/celebrities/_odyagla-hudi-z-praporom-rosiyi-amerikanska-spivachka-lp-potrapila-u-skandal/1173156",
        "image": "https://static.gazeta.ua/images/favicon.ico",
        "publishedAt": "2024-02-27T14:53:50Z",
        "source": {
            "name": "Gazeta.ua",
            "url": "https://gazeta.ua"
        }
    },
    {
        "title": "Від договорняків до \"F*ck Russia!\": що Україні чекати від можливого президентства Трампа",
        "description": "Політика Трампа щодо України у випадку обрання президентом залежатиме від його переговорів з Путіним",
        "content": "Діяльність Дональда Трампа на посаді президента в минулому не свідчила про близькі відносини з Володимиром Путіним і навіть навпаки: під час його каденції Україна отримала летальне озброєння і саме екс-президент США досяг згортання Північного потоку-... [1581 chars]",
        "url": "https://apostrophe.ua/ua/news/politics/2024-02-13/ot-dogovornyakov-do-fck-russia-chto-ukraine-jdat-ot-vozmojnogo-prezidentstva-trampa/314032",
        "image": "https://apostrophe.ua/uploads/image/2c2f1b16949b75b011078db3177e5c77.jpeg",
        "publishedAt": "2024-02-12T22:00:00Z",
        "source": {
            "name": "Апостроф",
            "url": "https://apostrophe.ua"
        }
    },
    {
        "title": "Головний редактор The Insider Russia Доброхотов: Щойно Путін прийшов до влади, почалися отруєння й убивства",
        "description": "Серія журналістських розслідувань засвідчила, що президент країни-агресора РФ Володимир Путін намагався отруїти...",
        "content": "Контекст\nОчолюване Доброхотовим видання The Insider разом із групою Bellingcat розслідували збиття малайзійського Boeing МН17 над Донецькою областю, отруєння колишнього російського розвідника Сергія Скрипаля, убивство російського опозиціонера Бориса ... [1115 chars]",
        "url": "https://gordonua.com/ukr/news/worldnews/holovnij-redaktor-the-insider-russia-dobrokhotov-shchojno-putin-prijshov-do-vladi-pochalisja-otrujennja-j-ubivstva-1692316.html",
        "image": "https://gordonua.com/img/article/16923/16_big-v1703521261.jpg",
        "publishedAt": "2023-12-25T06:00:00Z",
        "source": {
            "name": "ГОРДОН",
            "url": "https://gordonua.com"
        }
    },
    {
        "title": "У Казахстані заблокували сайт із російськими телеканалами Sputnik24 - ЗМІ",
        "description": "У Казахстані заблокували платформу новин Sputnik24, яка є частиною російського пропагандистського холдингу Russia Today. — Укрінформ.",
        "content": "У Казахстані заблокували платформу новин Sputnik24, яка є частиною російського пропагандистського холдингу Russia Today.\nЯк передає Укрінформ, про це повідомляє ТГ-канал Orda.kz.\nНа сайті Sputnik24 можна було дивитися Russia Today та інші телеканали ... [683 chars]",
        "url": "https://www.ukrinform.ua/rubric-world/3788611-u-kazahstani-zablokuvali-sajt-iz-rosijskimi-telekanalami-sputnik24-zmi.html",
        "image": "https://static.ukrinform.com/photos/2020_06/thumb_files/630_360_1591893289-695.jpg",
        "publishedAt": "2023-11-18T15:19:57Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "Фінляндія конфіскувала логотипи трьох російських компаній, серед яких власник Russia Today",
        "description": "АНО \"Новини\", \"Сбербанк\" та \"Калашников\" залишилися без логотипів.",
        "content": "АНО \"Новини\", \"Сбербанк\" та \"Калашников\" залишилися без логотипів.\nУправління зі стягнення боргів конфіскувало усі товарні знаки та логотипи, зареєстровані у Фінляндії компанією АНО ”ТВ-Новини, яка керує російським телеканалом Russia Today, – пише Yl... [851 chars]",
        "url": "https://lb.ua/world/2023/11/01/582288_finlyandiya_konfiskuvala_logotipi.html",
        "image": "https://i.lb.ua/000/44/654291a2c6646.jpeg",
        "publishedAt": "2023-11-01T19:52:00Z",
        "source": {
            "name": "Левый берег",
            "url": "https://lb.ua"
        }
    },
    {
        "title": "Посол України закликав Ізраїль разом з Al Jazeera заблокувати російські канали",
        "description": "Посол України Євген Корнійчук закликав разом із телеканалом Al Jazeera заблокувати в Ізраїлі Russia Today та інші російські канали. — Укрінформ.",
        "content": "Посол України Євген Корнійчук закликав разом із телеканалом Al Jazeera заблокувати в Ізраїлі Russia Today та інші російські канали.\nПро це дипломат заявив на брифінгу в Медіацентрі Україна – Укрінформ.\n“Саме сьогодні в Ізраїлі закривають відділення A... [811 chars]",
        "url": "https://www.ukrinform.ua/rubric-world/3778040-posol-ukraini-zaklikav-izrail-razom-z-al-jazeera-zablokuvati-rosijski-kanali.html",
        "image": "https://static.ukrinform.com/photos/2023_10/thumb_files/630_360_1698152911-351.jpg",
        "publishedAt": "2023-10-24T13:46:51Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "Війна в Ізраїлі: соратник Нетаньягу пригрозив Росії",
        "description": "Росія заплатить за підтримку ХАМАСу та Ірану. А Україна та Ізраїль обов'язково переможуть. Таке попередження росіянам зробив один із лідерів провладної партії Ізраїлю \"Лікуд\" Амір Вейтман. Про це він сказав в ефірі російського пропагандистського каналу Russia ...",
        "content": "Один із лідерів провладної партії Ізраїлю \"Лікуд\" Амір Вейтман пригрозив Росії за підтримку ХАМАСу. Фото: скріншот\nРосія заплатить за підтримку ХАМАСу та Ірану. А Україна та Ізраїль обов'язково переможуть.\nТаке попередження росіянам зробив один із лі... [1596 chars]",
        "url": "https://gazeta.ua/articles/world-life/_zrobimo-tak-scho-ukrayina-peremozhe-soratnik-netanyagu-prigroziv-rosiyi/1161685",
        "image": "https://static2.gazeta.ua/img2/cache/preview/1161/1161685_w_450.jpg?v=0",
        "publishedAt": "2023-10-20T11:26:40Z",
        "source": {
            "name": "Gazeta.ua",
            "url": "https://gazeta.ua"
        }
    },
    {
        "title": "Вєрка Сердючка звернулась до Путіна на концерті в Маямі",
        "description": "Український артист Андрій Данилко, який виступає під псевдонімом Вєрки Сердючки, виступив у Маямі. Музикант виконав пісню Russia Goodbye і прямо зі сцени вигукнув: \"Путін, щоб ти здох\". Глядачі почали бурхливо аплодувати.ЧИТАЙТЕ ТАКОЖ: В Криму троє дівчат танцювали ...",
        "content": "Фото: instagram.com/v_serduchka\nУкраїнський артист Андрій Данилко, який виступає під псевдонімом Вєрки Сердючки, виступив у Маямі.\nМузикант виконав пісню Russia Goodbye і прямо зі сцени вигукнув: \"Путін, щоб ти здох\". Глядачі почали бурхливо аплодува... [552 chars]",
        "url": "https://gazeta.ua/articles/celebrities/_putin-schob-ti-zdoh-serdyuchka-na-koncerti-v-mayami-romantichno-zvernulas-do-prezidenta-rf/1156957",
        "image": "https://static2.gazeta.ua/img2/cache/preview/1156/1156957_w_450.jpg?v=0",
        "publishedAt": "2023-09-07T12:26:30Z",
        "source": {
            "name": "Gazeta.ua",
            "url": "https://gazeta.ua"
        }
    },
    {
        "title": "\"Якщо орки кидаються гівном, отже, фестиваль удався\". У Юрмалі Полякова заспівала українські хіти, а Сердючка - Russia Good Bye. Відео",
        "description": "Ексклюзив від Бульвара Шоубіз ➤➤➤ 28 липня в Юрмалі стартував музичний фестиваль Laima Rendezvous Jūrmala 2023 під патронатом латвійської співачки...",
        "content": "Полякова і Макс Барських виступили на фестивалі Вайкуле в Юрмалі Фото: polyakovamusic / Instagram\nУкраїнські знаменитості на сцені в Юрмалі виконали свої хіти українською мовою. Латвійські зірки виконували пісні латиською й англійською мовами. Концер... [793 chars]",
        "url": "https://gordonua.com/ukr/bulvar/news/jakshcho-orki-kidajutsja-govnom-to-festival-vdavsja-u-jurmali-poljakova-zaspivala-ukrajinski-hiti-a-serdjuchka-russia-good-bye-video-1675230.html",
        "image": "https://gordonua.com/img/article/16752/30_big.jpg?v1690727637",
        "publishedAt": "2023-07-30T08:27:00Z",
        "source": {
            "name": "ГОРДОН",
            "url": "https://gordonua.com"
        }
    },
    {
        "title": "???? СБУ повідомила про нову підозру ексдиректору Russia Today, який закликав вбивати укр...",
        "description": "СБУ повідомила про нову підозру ексдиректору Russia Today, який закликав вбивати українських дітейСлужба безпеки задокументувала нові злочини ексдиректора з мовлення російського телеканалу «Russia Today» Антона Кузнєцова-Красовського, який закликав до геноциду українців.",
        "content": "СБУ повідомила про нову підозру ексдиректору Russia Today, який закликав вбивати українських дітей\nСлужба безпеки задокументувала нові злочини ексдиректора з мовлення російського телеканалу «Russia Today» Антона Кузнєцова-Красовського, який закликав ... [979 chars]",
        "url": "https://1news.com.ua/podii/sbu-povidomyla-pro-novu-pidozru-eksdyrektoru-russia-today-yakyj-zaklykav-vbyvaty-ukr.html",
        "image": "https://cdn4.telegram-cdn.org/file/m0EuPHa-mfrqPxY7r_4aZQkI_5aizxyeituCCffg81ZzseVsjRs1yIGCd2qcB6Vebpq0G4RuavOhCuwyri-HrTs564FYpMJr0a9VBVVlUCVx9Y25lIzJKEG37UpKY3LBR0-nF4rKI3f9df_foiXxEJ2dPEYh_j6-T3ZBsjICf1-wd3jfhiGEtW8Wqa1Bo6TbDMN--p568jqrVRLzDxpBqyXocAl4eEUt6FjAr6SZYq1qEKYZGu5NdvWOysOcRmiywn2EE7o442BC7myN5qzqN9FOw09xelYydtocY1NJCxWMdXQ-cPV-vkOYdT1QPXGENov0F7YeLpDsfvz64t6hHA.jpg",
        "publishedAt": "2023-07-18T15:20:23Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "СБУ повідомила про нову підозру ексдиректору Russia Today, який закликав вбивати українських дітей",
        "description": "Сюжет із закликами до геноциду показали у телевипусках Russia Today.",
        "content": "Сюжет із закликами до геноциду показали у телевипусках Russia Today.\nСлужба безпеки задокументувала нові злочини ексдиректора з мовлення російського телеканалу «Russia Today» Антона Кузнєцова-Красовського, який закликав до геноциду українців.\nПро це ... [879 chars]",
        "url": "https://lb.ua/society/2023/07/18/565807_sbu_povidomila_pro_novu_pidozru.html",
        "image": "https://i.lb.ua/065/35/64b6578d96eb6.png",
        "publishedAt": "2023-07-18T12:12:00Z",
        "source": {
            "name": "Левый берег",
            "url": "https://lb.ua"
        }
    },
    {
        "title": "Бізнесмен зі Львова в обхід санкцій постачав до рф \"Роллс-Ройси\" та \"Майбахи\"",
        "description": "Серед замовників підсанкційної продукції були представники топменеджменту кремлівського монополіста Газпром і пропагандистського телеканалу russia today. З серпня 2022 до березня 2023 року ділок нелегально переправив російським «замовникам» 45 автомобілів на загальну суму понад 3 млн євро.",
        "content": "Знайшли помилку? Виділіть текст і натисніть Повідомити\nКіберфахівці та слідчі СБУ ліквідували масштабну схему нелегального експорту до рф підсанкційних автомобілів преміум-класу.До організації оборудки причетний львівський підприємець, який раніше пр... [1649 chars]",
        "url": "https://www.volynnews.com/news/all/biznesmen-zi-lvova-v-obkhid-sanktsiy-postachav-do-rf-rolls-roysy-ta-maybakhy/",
        "image": "https://www.volynnews.com/files/news/2023/05-05/360618/photo_2023-05-05_09-55-07.jpg",
        "publishedAt": "2023-05-05T09:30:09Z",
        "source": {
            "name": "Волинські Новини",
            "url": "https://www.volynnews.com"
        }
    },
    {
        "title": "Бізнесмен зі Львова в обхід санкцій постачав до РФ елітні автомобілі",
        "description": "Серед замовників авто були представники топ-менеджменту \"Газпрому\" та російського телеканалу Russia today.",
        "content": "СБУ викрила львівського підприємця, який під час повномасштабної війни в обхід санкцій постачав до Росії автомобілі преміум-класу.\nПро це повідомила прес-служба відомства.\nДо організації незаконної схеми експорту підсанкційних автомобілів в обхід між... [1000 chars]",
        "url": "https://vesti.ua/uk/lvov-uk/biznesmen-zi-lvova-v-obhid-sanktsij-postachav-do-rf-elitni-avtomobili",
        "image": "https://vesti.ua/wp-content/uploads/2023/05/social_10536016_7-8-1200x800-1-800x418.jpg",
        "publishedAt": "2023-05-05T07:51:05Z",
        "source": {
            "name": "Вести.ua",
            "url": "https://vesti.ua"
        }
    },
    {
        "title": "Російські шахісти остаточно втекли до Азійської федерації",
        "description": "Фото: Chess Federation of Russia Росія відтепер можна вважати азійською країною у шахах Федерація шахів країни-агресорки тепер буде відправляти виступати спортсменів до дружніх до неї країнах.",
        "content": "Росія відтепер можна вважати азійською країною у шахах\nФедерація шахів країни-агресорки тепер буде відправляти виступати спортсменів до дружніх до неї країнах.\nРосійські шахісти не хочуть більше бути європейцями. Через постійні санкції та дискваліфік... [952 chars]",
        "url": "https://1news.com.ua/sport/rosijski-shahisty-ostatochno-vtekly-do-azijskoyi-federatsiyi.html",
        "image": "https://1news.com.ua/wp-content/uploads/2023/05/Rosijski-shahisty-ostatochno-vtekly-do-Azijskoyi-federatsiyi.jpg",
        "publishedAt": "2023-05-02T14:30:44Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "\"Политолог\" Медведчука, который скрывается в Крыму, получил подозрение",
        "description": "Подозреваемый частым «гостем» в эфире подсанкционных каналов «Наш», «Zik», «NewsOne», «112» и «Russia today»",
        "content": "Подозреваемый частым «гостем» в эфире подсанкционных каналов «Наш», «Zik», «NewsOne», «112» и «Russia today»\nСлужба безопасности Украины собрала доказательную базу на прокремлевского «политолога» Александра Лазарева, который помогал агрессору в войне... [1396 chars]",
        "url": "https://glavcom.ua/ru/news/politoloh-medvedchuka-kotoryj-skryvaetsja-v-krymu-poluchil-podozrenie-919414.html",
        "image": "https://glavcom.ua/img/article/9194/14_main-v1680886028.jpg",
        "publishedAt": "2023-04-07T20:40:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "Twitter зняв обмеження з акаунтів Кремля, МЗС РФ, Russia Today та інших пропагандистів",
        "description": "Соціальна мережа Twitter зняла обмеження з російських урядових акаунтів після того, як соцмережу придбав американський мільярдер Ілон Маск.",
        "content": "Соціальна мережа Twitter зняла обмеження з російських урядових акаунтів після того, як соцмережу придбав американський мільярдер Ілон Маск.\nНа це звернуло увагу видання The Telegraph.\nУ квітні 2023 року, через кілька тижнів після початку війни Росії ... [2107 chars]",
        "url": "https://prm.ua/twitter-zniav-obmezhennia-z-akauntiv-kremlia-mzs-rf-russia-today-ta-inshykh-propahandystiv/",
        "image": "https://prm.ua/wp-content/uploads/2020/10/cropped-Favicon-1-32x32.png",
        "publishedAt": "2023-04-07T20:00:00Z",
        "source": {
            "name": "Прямий",
            "url": "https://prm.ua"
        }
    },
    {
        "title": "\"Політолог\" Медведчука, який переховується у Криму, отримав підозру",
        "description": "Підозрюваний частим «гостем» в ефірах підсанкційних каналів «Наш», «Zik», «NewsOne», «112» і «Russia today»",
        "content": "Підозрюваний частим «гостем» в ефірах підсанкційних каналів «Наш», «Zik», «NewsOne», «112» і «Russia today»\nСлужба безпеки України зібрала доказову базу на прокремлівського «політолога» Олександра Лазарєва, який допомагає агресору у війні проти Украї... [1337 chars]",
        "url": "https://glavcom.ua/country/incidents/politoloh-medvedchuka-jakij-perekhovujetsja-u-krimu-otrimav-pidozru-919331.html",
        "image": "https://glavcom.ua/img/article/9193/31_main-v1680868564.jpg",
        "publishedAt": "2023-04-07T11:56:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "​​???? Russia’s Cyber Tactics: Lessons Learned 2022",
        "description": "​​???? Russia’s Cyber Tactics: Lessons Learned 2022 – аналітичний звіт Держспецзв'язку про рік повномасштабної кібервійни росії проти УкраїниДержспецзв'язку підготувала аналітичний звіт про кіберагресію росії проти України у 2022 році Russia’s Cyber Tactics: Lessons Learned 2022.",
        "content": "​​???? Russia’s Cyber Tactics: Lessons Learned 2022 – аналітичний звіт Держспецзв’язку про рік повномасштабної кібервійни росії проти України\nДержспецзв’язку підготувала аналітичний звіт про кіберагресію росії проти України у 2022 році Russia’s Cyber... [2978 chars]",
        "url": "https://1news.com.ua/podii/russia-s-cyber-tactics-lessons-learned-2022-analitychnyj-zvit-derzhspetszvyazku-pro-rik-povnomas.html",
        "image": "https://cdn4.telegram-cdn.org/file/Eft4vpfsLJbWoh4gYVOyvWqUBUFbW48nDYvKu7Z3SmOlo0Qdc4wj3LxTvpdAQILKqKLPpdwQWIG2E-bhGqXRg6noCschDNIYX8_p1TMxRwBgkrjzZSBwZVa8yTY_ln_BKISAB4CQRgri2V-Fg71ZvBoBhZRbWX2L0Kcmn2eeCyqFQXLXS553VxXRHW5q0h-M4kAj0afQBD7QqSOtxCqL-pAu8DskpoOso2Fi4sj3a3lF-WbVvPRGePPRHVzVSZfgET9NasZF_JrxbSqtuURt578Eg5bvmVbhdYzagM1NKms_QIRijwe1UxXttBDxTp0FrZlLDFmZpL3pgg6_SubbPQ.jpg",
        "publishedAt": "2023-03-08T15:12:00Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    },
    {
        "title": "Український суд призначив пропагандисту Красовському п'ять років ув'язнення з конфіскацією майна",
        "description": "Російського пропагандиста з Russia Today Антона Красовського в Україні засудили до п'яти років позбавлення волі з конфіскацією майна. Як повідомили в Службі безпеки України, український суд розглянув звернення СБУ і визнав Красовського винним за двома статтями, зокрема - за заклики до геноциду",
        "content": "Російського пропагандиста з Russia Today Антона Красовського в Україні засудили до п’яти років позбавлення волі з конфіскацією майна.\nЯк повідомили в Службі безпеки України, український суд розглянув звернення СБУ і визнав Красовського винним за двом... [1949 chars]",
        "url": "https://prm.ua/zaklykav-vbyvaty-ukrainskykh-ditey-propahandysta-krasovskoho-zasudyly-na-p-iat-rokiv-z-konfiskatsiieiu-mayna/",
        "image": "https://prm.ua/wp-content/uploads/2023/02/photo_2023-02-17_14-00-49-1200x630.jpg",
        "publishedAt": "2023-02-17T19:42:00Z",
        "source": {
            "name": "Прямий",
            "url": "https://prm.ua"
        }
    },
    {
        "title": "Директора Russia Today, який закликав до геноциду українців, засудили до 5 років ув’язнення - СБУ",
        "description": "За матеріалами Служби безпеки України тюремний строк у вигляді 5 років позбавлення волі отримав директор пропагандистського російського телеканалу Russia Today, який закликав до геноциду українців.",
        "content": "За матеріалами Служби безпеки України тюремний строк у вигляді 5 років позбавлення волі отримав директор пропагандистського російського телеканалу Russia Today, який закликав до геноциду українців.\nПро це інформує пресслужба СБУ.\nВідтак, під час слід... [1339 chars]",
        "url": "https://bykvu.com/ua/bukvy/dyrektora-russia-today-iakyi-zaklykav-do-henotsydu-ukraintsiv-zasudyly-do-5-rokiv-uv-iaznennia-sbu/",
        "image": "https://bykvu.com/ua/kd_image_generate/dyrektora-russia-today-iakyi-zaklykav-do-henotsydu-ukraintsiv-zasudyly-do-5-rokiv-uv-iaznennia-sbu/719120.jpg?ver=0.0.1",
        "publishedAt": "2023-02-17T13:23:06Z",
        "source": {
            "name": "#Буквы",
            "url": "https://bykvu.com"
        }
    },
    {
        "title": "Закликав топити українських дітей. Директор Russia Today отримав п’ять років в’язниці",
        "description": "Наразі злочинець переховується від правосуддя за кордоном, втім співробітники СБУ знають про його місцезнаходження",
        "content": "У червні слідчі СБУ повідомили Красовському про підозру за заклики до геноциду\nНаразі злочинець переховується від правосуддя за кордоном, втім співробітники СБУ знають про його місцезнаходження\nЗа матеріалами Служби безпеки України тюремний строк отр... [2249 chars]",
        "url": "https://glavcom.ua/country/criminal/zaklikav-topiti-ukrajinskikh-ditej-direktor-russia-today-otrimav-pjat-rokiv-vjaznitsi-909145.html",
        "image": "https://glavcom.ua/img/article/9091/45_main-v1676639762.jpg",
        "publishedAt": "2023-02-17T13:15:00Z",
        "source": {
            "name": "ГЛАВКОМ",
            "url": "https://glavcom.ua"
        }
    },
    {
        "title": "Директора russia today Красовського в Україні засудили до п’яти років в’язниці",
        "description": "Директора russia today Антона Кузнєцова-Красовського, який закликав до геноциду українців, заочно засудили до п’яти років позбавлення волі. — Укрінформ.",
        "content": "Директора russia today Антона Кузнєцова-Красовського, який закликав до геноциду українців, заочно засудили до п’яти років позбавлення волі.\nЯк передає Укрінформ, про це Служба безпеки України повідомляє у Телеграмі.\n«У ході слідчо-оперативних дій зіб... [1728 chars]",
        "url": "https://www.ukrinform.ua/rubric-society/3671418-direktora-russia-today-krasovskogo-v-ukraini-zasudili-do-pati-rokiv-vaznici.html",
        "image": "https://static.ukrinform.com/photos/2022_12/thumb_files/630_360_1671313501-183.jpg",
        "publishedAt": "2023-02-17T12:58:34Z",
        "source": {
            "name": "Укрінформ. Новини України та світу",
            "url": "https://www.ukrinform.ua"
        }
    },
    {
        "title": "???? За матеріалами СБУ тюремний строк отримав директор Russia Today, який закликав до ге…",
        "description": "За матеріалами СБУ тюремний строк отримав директор Russia Today, який закликав до геноциду українцівСлужба безпеки системно притягує до відповідальності російських пропагандистів, які публічно виступають на підтримку збройної агресії рф.",
        "content": "???? За матеріалами СБУ тюремний строк отримав директор Russia Today, який закликав до ге…\nЗа матеріалами СБУ тюремний строк отримав директор Russia Today, який закликав до геноциду українців\nСлужба безпеки системно притягує до відповідальності росій... [1494 chars]",
        "url": "https://1news.com.ua/podii/za-materialamy-sbu-tyuremnyj-strok-otrymav-dyrektor-russia-today-yakyj-zaklykav-do-ge.html",
        "image": "https://cdn4.telegram-cdn.org/file/pR6NAbyFZOPW9fs2t_qZoqKGJmoqYPneJVYNu7c_tmtR1AiO5pQiDHtmOkObqG06VwptUKkpGDsUCmF56a26g4QBr8Cg39IWoHT4RF9zIUvhLD0v8Xd1Sg2ewX1vD4jlszSWpKLu_6sTKNv8nq6fPUXv9HllcGFUNFLxZf715rAV1QASTmeMU-_GfwU6pG0JTokadfETK4gaiDJwxgyHqWsQmD7aZz10wf_wgg-nyr4DGRoPp_VFMULWXGslz77HmgtXUH-JGTgCAdTtgLPBBMnbkF5xZHLXg7KbA9VV-rYcTcDsZhv3OLUEPTzioT2t4caHmzVIX4jcPy95X42BNg.jpg",
        "publishedAt": "2023-02-17T12:11:53Z",
        "source": {
            "name": "1NEWS Україна",
            "url": "https://1news.com.ua"
        }
    }
]