[
  {
    "title": "Trump unveils design of $273 billion Golden Dome shield to protect US from Russia and China",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/trump-announces-golden-dome-us-defence-shield-design-c-18759861",
    "publishedAt": "2025-05-20T22:34:31Z",
    "sentences": [
      "US President Donald Trump has selected a design for the Golden Dome missile defence shield and has named a Space Force general to head the ambitious program aimed at blocking threats from China and Russia.",
      "Trump announced on Tuesday at a White House press conference that US Space Force General Michael Guetlein would be the lead program manager for what the president said would be a $US175 billion ($A273 billion) project, an effort widely viewed as the keystone to Trump’s military planning.",
      "Golden Dome will “protect our homeland”, Trump said from the Oval Office and added that Canada had said it wanted to be part of it.",
      "The office of Prime Minister Mark Carney was not immediately available for comment.",
      "Know the news with the 7NEWS app: Download today First ordered by Trump in January, Golden Dome aims to create a network of satellites to detect, track and potentially intercept incoming missiles.",
      "The shield could deploy hundreds of satellites for missile detection and tracking.",
      "At a cost of $US175 billion ($A273 billion), it will take years to implement, as the controversial program faces both political scrutiny and funding uncertainty.",
      "Democratic lawmakers have voiced concern about the procurement process and the involvement of Trump ally Elon Musk’s SpaceX, which has emerged as a frontrunner alongside Palantir and Anduril to build key components of the system.",
      "“The new autonomous space-age defence ecosystem is more about Silicon Valley than it is about ‘big metal,’” Senator Kevin Cramer of North Dakota said at the White House event.",
      "“So what’s exciting about this is it makes it available to everybody to participate - to compete.” “Big metal” refers to legacy defence contractors.",
      "The Golden Dome idea was inspired by Israel’s land-based Iron Dome defence shield that protects it from missiles and rockets.",
      "Trump’s Golden Dome is much more extensive and includes a massive array of surveillance satellites and a separate fleet of attacking satellites that would shoot down offensive missiles soon after lift-off.",
      "Tuesday’s announcement kicks off the Pentagon’s effort to test and ultimately buy the missiles, systems, sensors and satellites that will make up the Golden Dome.",
      "Trump, who said the project would be completed by the end of his term in January 2029, said Alaska will be a big part of the program and named Florida, Georgia and Indiana as also benefiting from the project.",
      "Many of the early systems are expected to come from existing production lines.",
      "Attendees at the press conference named L3Harris Technologies, Lockheed Martin and RTX Corp as potential contractors for the massive project.",
      "L3 has invested $US150 million ($A234 million) in building out its new facility in Fort Wayne, Indiana, where it makes the Hypersonic and Ballistic Tracking Space Sensor satellites which are part of a Pentagon effort to better detect and track hypersonic weapons with space-based sensors and could be adapted for Golden Dome.",
      "Golden Dome’s funding remains uncertain.",
      "Republican lawmakers have proposed a $US25 billion ($A39 billion) initial investment for Golden Dome as part of a broader $US150 billion ($A234 billion) defence package, but this funding is tied to a contentious reconciliation bill that faces significant hurdles in Congress.",
      "“Unless reconciliation passes, the funds for Golden Dome may not materialise,” said an industry executive following the program.",
      "“This puts the entire project timeline in jeopardy.” 1 min read 2 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "golden dome",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "read 0",
      "0 min",
      "defence shield",
      "space force"
    ]
  },
  {
    "title": "Russia’s invasion united different parts of Ukraine against a common enemy - 3 years on, that unanimity still holds",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/russias-invasion-united-different-parts-of-ukraine-against-a-common-enemy-3-years-on-that-unanimity-still-holds-255092",
    "publishedAt": "2025-05-20T14:00:00Z",
    "sentences": [
      "Assistant Professor in the School of Information Sciences, University of Tennessee Professor of Journalism & Media, University of Tennessee Professor of Anthropology, University of Tennessee Ben Horne has received funding from the Office of Naval Research through the Minerva Research Initiative (Grant: N000142012618).",
      "Catherine Luther has received funding from the Office of Naval Research through the Minerva Research Initiative (Grant: N000142012618).",
      "R. Alexander Bentley has received funding from the Office of Naval Research through the Minerva Research Initiative (Grant: N000142012618) University of Tennessee provides funding as a member of The Conversation US.",
      "View all partners When Russia invaded Ukraine in the spring of 2022, President Vladimir Putin incorrectly assumed it would be a swift takeover.",
      "In fact, three years on, negotiators from both countries are tentatively exploring the idea of a negotiated way out of a largely stalemated conflict.",
      "So what did the Kremlin’s initial assessment get wrong?",
      "Aside from underestimating the vulnerabilities of Russia’s military, analysts have suggested that Moscow also miscalculated the support Russia would receive from Ukrainians in the country’s east who have close ethnic ties to Russia.",
      "Our recently published study on Ukrainian sentiment toward Russia before and after the invasion backs up that assertion.",
      "It demonstrates that even those Ukrainians who had close ties to Russia based on ethnicity, language, religion or location dramatically changed allegiances immediately following the invasion.",
      "For example, just prior to the invasion of 2022, native Russian speakers in Ukraine’s east tended to blame the West for tensions with Russia.",
      "But immediately after the invasion, they blamed Moscow in roughly the same numbers as non-Russian-speaking Ukrainians.",
      "Moreover, this shift was not just a short-lived reaction.",
      "Three years after the invasion, we followed up on our survey and found that Ukrainians still blame Russia for tensions to a degree that was never so unanimous before 2022.",
      "Our study is part of a larger project exploring how effective Russian propaganda has been at influencing Russian-speaking adults in certain former Soviet states.",
      "Our inaugural survey was launched in the fall of 2020, while the question regarding tensions between Ukraine and Russia was first posed in February 2022, immediately prior to Russia’s invasion of Ukraine.",
      "Surveys were completed by over 1,000 Russian-speaking people in Ukraine − excluding Crimea and the breakaway Donbas region for security reasons − and in Belarus.",
      "While the spring surveys in Ukraine were conducted in person, the others were done by telephone due to the political situation in each country.",
      "Belarus was chosen because it shares a similar historical, linguistic and ethnic background to Ukraine, but the two nations have diverged in their geopolitical paths.",
      "Shortly after the fall of the Soviet Union in 1991, Belarus, like Ukraine, forged ahead in attempting to build democratic systems.",
      "But after Belarusian President Alexander Lukashenko came to power in 1994, the country become an authoritarian state with a high dependence on Russia for political and economic support.",
      "In broad terms, Ukraine has had an opposite trajectory.",
      "Relations between Ukraine and Russia fluctuated over the initial years of independence.",
      "But since the Maidan revolution of November 2013 to February 2014, a staunch pro-Western leadership has emerged.",
      "Still, certain segments of the population in Ukraine continued to hold affinities toward Russia – most notably, the Russian-speaking older generation in the country’s east.",
      "Our surveys provide a kind of natural experiment looking at the impact of a Russian invasion on previous pro-Russian public sentiment.",
      "Ukraine serves as the “treatment” group and Belarus as a “quasi-control” group, with the distinguishing factor being a Russian invasion.",
      "The questions we asked: “Who do you think is responsible for the worsening tensions between Russia and Ukraine?” and “In general, how do Russian policies affect your country?” We found that in Ukraine, but not in Belarus, geopolitical views were sharply unified by the experience of the invasion.",
      "On one level, this is not surprising – after all, the people of a country being invaded would be expected to hold some degree of resentment to the invading army.",
      "But what we found most interesting is that this effect in Ukraine massively overrode the split among various identities before the invasion.",
      "This was most prominent in people’s perceptions of who was to blame for rising tensions.",
      "Prior to the invasion, 69.7% of respondents in Ukraine overall blamed Russia for the tensions between the two countries, with 30.3% blaming NATO, Ukraine or the U.S. By August 2022, 97.3% of respondents in Ukraine blamed Russia for the tensions, with only 2.7% blaming NATO, Ukraine or the U.S. By comparison, in the neighboring country of Belarus, 15.5% of respondents blamed Russia for the tensions prior to the invasion, and only 21.9% of respondents blamed Russia for the tensions after the invasion.",
      "This near unanimity in Ukraine masks the massive shifts you see when broken down for demographic differences.",
      "For example, blame varied widely across regions of Ukraine before the invasion but converged after the invasion.",
      "Prior to the invasion, only 36.0% of respondents in the east of Ukraine and 51.4% of respondents in the south of Ukraine blamed Russia for the tensions.",
      "After the invasion, over 96% of respondents in both regions blamed Russia.",
      "A similar effect can be seen across other demographic differences.",
      "Only 30.6% of Catholics in Ukraine blamed Russia for the tensions prior to the invasion, while 83.0% blamed Russia later on.",
      "What were once stratified opinions before the invasion became uniform afterward.",
      "To check that this trend was not just an immediate post-invasion blip, we conducted the surveys again in September 2024 and February 2025.",
      "The overall proportion of Ukrainians who blamed Russia for the tensions remained high, with 85.7% and 84.5%, respectively.",
      "And again, these results held across the various demographic breakdowns.",
      "In February 2025, the most recent survey, 77.2% of respondents in the east of Ukraine and 83.0% of respondents in the south blamed Russia.",
      "Catholics across Ukraine continued to blame Russia, with 90.7% in September 2024 and 90.6% in February 2025.",
      "Overall, there has been a small drop in the percentages of those blaming Russia – with war fatigue a possible reason.",
      "Our findings suggest that in times of collective threat, divisions within a society tend to fade as people come together to face a common enemy.",
      "And that could have huge consequences now, as various parties, including the U.S., look at peace proposals to end the Russia-Ukraine war.",
      "Among the options being explored is a scenario in which the current front lines are frozen.",
      "This would entail recognizing the Russian-occupied territory of Crimea and the separatist regions of Donetsk and Luhansk as part of Russia.",
      "But it would also effectively relinquish Ukraine’s southeastern provinces of Kherson and Zaporizhzhia to Russia.",
      "While our surveys cannot speak to how this will go down among the people of Crimea, Donetsk and Luhansk, the study did include Kherson and Zaporizhzhia.",
      "And our findings show that the sense of Ukrainian identity strengthened even among Russian-speaking people in those areas."
    ],
    "topics": [
      "blamed russia",
      "russia tensions",
      "prior invasion",
      "university tennessee",
      "received funding",
      "funding office",
      "office naval",
      "naval research",
      "research minerva",
      "minerva research"
    ]
  },
  {
    "title": "Europe looks to Australia in the face of an aggressive Russia and Trump 2.0",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-20/europe-russia-putin-australia-alliance/105311082",
    "publishedAt": "2025-05-20T05:04:22Z",
    "sentences": [
      "By Debra Killalea Topic:World Politics Europe is becoming increasingly concerned by an expansionist Russia led by President Vladimir Putin.",
      "(Reuters: Sputnik Vyacheslav Prokofyev) Australia is mulling over a proposal from the EU to strengthen ties in the wake of an unpredictable Trump administration and expansionist Russia.",
      "Some experts have expressed concern about any potential defence pacts that may arise, arguing relationships with Asian neighbours are a bigger priority.",
      "European and Asian allies will be watching developments closely with Russia Ukraine peace talks ongoing.",
      "A proposal to strengthen ties between the European Union and Australia in the face of increasing global instability could prove to be a major boost for both allies.",
      "However some experts have cautioned against Canberra signing a potential defence pact with Brussels amid warnings it would not be in our national interest.",
      "During talks in Rome on Sunday, European Commission President Ursula von der Leyen proposed developing stronger defence and strategic ties with Australia, a move cautiously welcomed by Prime Minister Anthony Albanese.",
      "Australian Strategic Policy Institute senior analyst Malcolm Davis said it was clear Europe was looking to broaden its influence with allies further afield, particularly given uncertainty with an expansionist Russia.",
      "While the proposal was in the early stages, Dr Davis said any new alliance could ultimately help diversify Australia's defence capabilities amid concerns around the future of the AUKUS deal.",
      "European Commission President Ursula von der Leyen is keen to tighten ties between Europe and Australia.",
      "(Reuters: Ints Kalnins) \"I think this is clearly a development that needs to be seen against a context of growing uncertainty about the US role under Trump 2.0,\" Dr Davis said.",
      "\"Europe clearly recognises that the US under Trump isn't necessarily committed to ensuring its security, be it under NATO Article 5, or more broadly.",
      "\"So it's moving to be more self-reliant — and that means spending considerably more on defence and moving more rapidly to build up capability in anticipation of a looming threat from an aggressive Russia that could move beyond Ukraine within the next five years, especially if Trump does a deal with Putin at the expense of Ukraine, and by extension, Europe.\"",
      "But while a strategic pact with Europe appeared to be a beneficial move for Australia, any defence pacts which tied the two was simply not in our national interests, according to one analyst.",
      "Canberra should instead focus on maintaining and growing relationships in the Asia Pacific region, according to Alexander Korolev, a Senior Lecturer in Politics and International Relations in the School of Social Science at the University of NSW.",
      "Dr Korolev told the ABC that Europe had more to gain out of this proposal than Australia did, especially on a defence level.",
      "\"Since Trump took office he has unilaterally collapsed a unified front against Russia,\" Dr Korolev said.",
      "\"Europe is marginalised and without support from the US, it cannot make an impact on Ukraine.",
      "It is quite clear the geopolitical weight of the EU in Ukraine/Russia relations has diminished.\"",
      "Dr Korolev said Australia's interests should be more focused on the Asia Pacific — somewhere Europe was keen to expand.",
      "\"It's great to cooperate and establish strong connections [between Australia and Europe], it makes sense — the US has shown it is not a reliable ally,\" he said.",
      "\"But [extending this] to any defence pact is foolish.",
      "Dumping resources in an area not relevant to Australia's national interests is not a wise move.",
      "Europe needs Australia more because of what Washington is doing.\"",
      "Anothony Albanese, pictured with Indonesian President Prabowo Subianto, should be focusing on Asian neighbours over Europe, some experts have suggested.",
      "(Reuters: Ajeng Dinar Ulfiana) Dr Davis said strengthening ties with Europe would help Australia to diversify defence supply chains and explore new sources of military capabilities.",
      "This would also be in Australia's interest with an unpredictable Trump yet to fully reveal his strategy in the Asia Pacific.",
      "\"There's obvious defence industry and capability opportunities here, where Australia could participate in some European projects, and thus diversify our capability supply chains, which I think is a good move at this point,\" he said.",
      "Europe's move to develop stronger defence and strategic ties with wider allies wasn't necessarily sparked by an ambitious and aggressive Vladimir Putin and his desire to expand Russia's borders.",
      "Rather, a trigger for the EU's accelerated program lay in the US Vice President JD Vance.",
      "Dr Léa Vuong, a senior lecturer and current Chair of French and Francophone Studies at the University of Sydney, said Mr Vance's speech to the EU in February shocked Europe and made it realise that it could no longer rely on the US to guarantee most of its defence.",
      "\"At the time, Emmanuel Macron called for an emergency meeting to discuss European security,\" Dr Vuong said.",
      "US Vice President JD Vance sparked alarm bells with a speech about Europe not relying on his country for defence.",
      "(Reuters: Leah Millis) \"At a public ceremony on 8 May, Macron warned of the return of 'the spectre of war' and called for a 'stronger Europe'.",
      "Vladimir Putin was trained in the KGB world of working out the psychology of your opponent, so it is not surprising he is outfoxing Donald Trump.",
      "The US president is now talking about walking away from peace talks.",
      "\"Europe is moving forward to position itself as a region that can defend itself and it wants to align with countries and regions that stand for similar democratic and liberal values in a fast-changing world.\"",
      "Dr Vuong said strengthening the relationship between France and Australia was a step forward after Australia ditched it's submarine deal with France.",
      "According to Dr Davis, European nations will continue to have strong interests in our region.",
      "\"France has Indo-Pacific territories in the Southwest Pacific, so it sees itself as a Pacific and European power,\" he said.",
      "\"The UK too has Indo-Pacific interests more related to strategic and security relationships and commitments — for example, through AUKUS, and also as a member of UN Command on the Korean Peninsula.\"",
      "Other European states would also recognise economic interests, and according to Dr Davis are trying to manage an assertive China which is seeking to reshape European policy to suit Beijing.",
      "John Blaxland, Professor of International Security & Intelligence Studies, Strategic and Defence Studies Centre, at the Australian National University said it was important to remember while Europe was further away than Asia was, the world remained very interconnected.",
      "The ties and relationship with Europe remained strong as did Australia's relationships with the Asia Pacific but Prof Blaxland said it didn't have to be one or the other.",
      "\"The French has enormous interests in the Pacific, the UK does through the Five Powers [defence arrangements], the Germans have massive interests in Asia,\" he said.",
      "\"A strategic partnership makes sense, it mutually benefits Australia to strengthen those ties — the game has changed.\"",
      "The point of any such partnership or alliance would not to be dragged into a war alongside Europe but would be to prevent one, whether it was in Asia or elsewhere, through exchanging notes and conducting joint military exercises.",
      "Prof Blaxland said Australia had a lot to gain from mutual collaboration and was closer to its European allies than we thought.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:World Politics European Union United States Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "world politics",
      "dr davis",
      "topic world",
      "davis said",
      "asia pacific",
      "expansionist russia",
      "vladimir putin",
      "strengthen ties",
      "said europe",
      "dr korolev"
    ]
  },
  {
    "title": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/news/world/trump-says-russia-and-ukraine-to-immediately-talk-peace-deal-after-call-with-putin-c-18747589",
    "publishedAt": "2025-05-19T21:55:41Z",
    "sentences": [
      "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.",
      "“Negotiations between Russia and Ukraine will begin immediately,” Trump said in a Truth Social post following his call with Putin, which lasted two hours.",
      "WATCH THE VIDEO ABOVE: Trump talks peace between Russia and Ukraine after phone call with Putin.",
      "After the call, Putin said efforts to end the war were “generally on the right track” and that the Kremlin was ready to work with Ukraine on a potential peace deal.",
      "“We have agreed with the president of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” Putin told reporters near the Black Sea resort of Sochi.",
      "Trump later said he had made progress during his call with Putin and that he also spoke to the heads of several European countries.",
      "“The tone and spirit of the conversation were excellent,” Trump said in his post on TruthSocial.",
      "Kremlin presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the US, told reporters that the two countries were working out details of an exchange of prisoners jailed in Russia and the United States involving nine people on each side.",
      "Ukrainian President Volodymyr Zelenskiy said he spoke to Trump one-on-one on Monday before Trump called Putin, and again afterwards in a conversation that involved the leaders of France, Finland, Germany, Italy and the European Union.",
      "He said Ukraine and its partners were considering arranging a high-level meeting between Ukraine, Russia, the United States, European Union countries and the United Kingdom as part of a push to end the war.",
      "Speaking to reporters in Kyiv, the Ukrainian leader said he hoped the meeting could happen as soon as possible and that it could be hosted by Turkey, the Vatican or Switzerland.",
      "“We are considering a meeting of all teams at a high level,” he said.",
      "Ukraine has said it is ready for a ceasefire now while Russia has said conditions must be met first.",
      "In his social media post, Trump said the Vatican, “as represented by the Pope, has stated that it would be very interested in hosting the negotiations.",
      "Let the process begin!” Putin and Trump spoke after direct talks last week in Turkey between Russian and Ukrainian delegations, the first since 2022 in the early months of Russia’s invasion of Ukraine.",
      "Talks last week failed to agree on a truce.",
      "Putin said on Monday the memorandum would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.",
      "He said that if appropriate agreements were reached, there could be a ceasefire, adding that direct talks between Russia and Ukraine gave “reason to believe that we are generally on the right track”.",
      "“The main thing for us is to eliminate the root causes of this crisis,” Putin said.",
      "“We just need to determine the most effective ways to move towards peace.” Putin was speaking from Russia’s Black Sea resort of Sochi while Trump was in Washington DC.",
      "Shortly before the call, White House press secretary Karoline Leavitt told reporters that Trump wanted to see a ceasefire but that he had grown “weary and frustrated with both sides of the conflict”.",
      "Asked if a package of secondary sanctions against Russia remains on the table, she said: “I think everything’s on the table.” - With AP"
    ],
    "topics": [
      "russia ukraine",
      "call putin",
      "end war",
      "trump said",
      "putin said",
      "united states",
      "told reporters",
      "war speaking",
      "generally right",
      "right track"
    ]
  },
  {
    "title": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/trump-says-russia-and-ukraine-to-immediately-talk-peace-deal-after-two-hour-call-with-putin-c-18747589",
    "publishedAt": "2025-05-19T21:55:41Z",
    "sentences": [
      "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.",
      "“Negotiations between Russia and Ukraine will begin immediately,” Trump said in a Truth Social post following his call with Putin, which lasted two hours.",
      "WATCH THE VIDEO ABOVE: Trump talks peace between Russia and Ukraine after phone call with Putin.",
      "Know the news with the 7NEWS app: Download today After the call, Putin said efforts to end the war were “generally on the right track” and that the Kremlin was ready to work with Ukraine on a potential peace deal.",
      "“We have agreed with the president of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” Putin told reporters near the Black Sea resort of Sochi.",
      "Trump later said he had made progress during his call with Putin and that he also spoke to the heads of several European countries.",
      "“The tone and spirit of the conversation were excellent,” Trump said in his post on TruthSocial.",
      "Kremlin presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the US, told reporters that the two countries were working out details of an exchange of prisoners jailed in Russia and the United States involving nine people on each side.",
      "Ukrainian President Volodymyr Zelenskiy said he spoke to Trump one-on-one on Monday before Trump called Putin, and again afterwards in a conversation that involved the leaders of France, Finland, Germany, Italy and the European Union.",
      "He said Ukraine and its partners were considering arranging a high-level meeting between Ukraine, Russia, the United States, European Union countries and the United Kingdom as part of a push to end the war.",
      "Speaking to reporters in Kyiv, the Ukrainian leader said he hoped the meeting could happen as soon as possible and that it could be hosted by Turkey, the Vatican or Switzerland.",
      "“We are considering a meeting of all teams at a high level,” he said.",
      "Ukraine has said it is ready for a ceasefire now while Russia has said conditions must be met first.",
      "In his social media post, Trump said the Vatican, “as represented by the Pope, has stated that it would be very interested in hosting the negotiations.",
      "Let the process begin!” Putin and Trump spoke after direct talks last week in Turkey between Russian and Ukrainian delegations, the first since 2022 in the early months of Russia’s invasion of Ukraine.",
      "Talks last week failed to agree on a truce.",
      "Putin said on Monday the memorandum would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.",
      "He said that if appropriate agreements were reached, there could be a ceasefire, adding that direct talks between Russia and Ukraine gave “reason to believe that we are generally on the right track”.",
      "“The main thing for us is to eliminate the root causes of this crisis,” Putin said.",
      "“We just need to determine the most effective ways to move towards peace.” Putin was speaking from Russia’s Black Sea resort of Sochi while Trump was in Washington DC.",
      "Shortly before the call, White House press secretary Karoline Leavitt told reporters that Trump wanted to see a ceasefire but that he had grown “weary and frustrated with both sides of the conflict”.",
      "Asked if a package of secondary sanctions against Russia remains on the table, she said: “I think everything’s on the table.” - With AP 5 min read 3 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "russia ukraine",
      "call putin",
      "read 0",
      "0 min",
      "end war"
    ]
  },
  {
    "title": "Russia and Ukraine will hold direct ceasefire talks, Trump says after call with Putin",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-20/donald-trump-vladimir-putin-ukraine-war-ceasefire-phone-call/105312068",
    "publishedAt": "2025-05-19T19:20:45Z",
    "sentences": [
      "Topic:War Donald Trump described his call with Vladimir Putin as excellent in spirit and tone.",
      "(AP: Alex Brandon) After a two-hour call with Vladimir Putin, Donald Trump said Russia and Ukraine would hold talks about a ceasefire and ending the war.",
      "The US president said the Vatican was \"very interested in hosting the negotiations\".",
      "The Vatican has not commented.",
      "Neither Russia nor the US have outlined specific details about how future talks will work.",
      "Mr Trump said they would start immediately.",
      "Donald Trump and Vladimir Putin have held another lengthy phone call about Russia's invasion of Ukraine, but again failed to reach any breakthrough agreement on a ceasefire.",
      "Instead, the US president said Russia and Ukraine would now hold direct talks because \"they know details of a negotiation that nobody else would be aware of\".",
      "\"The tone and spirit of the conversation were excellent,\" Mr Trump posted online after the two-hour call with his Russian counterpart.",
      "\"If it wasn't, I would say so now, rather than later.\"",
      "Mr Trump, who repeatedly pledged to end the war quickly during his election run, has been pushing both Mr Putin and Ukrainian President Volodymyr Zelenskyy to make a deal.",
      "Under pressure from the US president, Mr Zelenskyy agreed to an American proposal for a 30-day ceasefire in March.",
      "But Mr Putin rejected the terms during a subsequent phone call with Mr Trump.",
      "None of the parties has outlined specific details about how the future negotiations will work, but Mr Trump suggested the Vatican could host them.",
      "Later, when Mr Trump was asked if he thought Pope Leo could help broker peace, he said: \"I do.\"",
      "Officials from Russia and Ukraine last week held their first direct talks since 2022.",
      "The talks, in Türkiye, led to a prisoner-swap agreement but little other progress.",
      "Vladimir Putin is a Russian leader known for using power plays and intimidation to dance around negotiations with world leaders.",
      "Mr Zelenskyy said he spoke to Mr Trump before his call with Mr Putin, and again afterwards in a conversation that included the leaders of France, Finland, Germany, Italy and the European Union.",
      "He said Kyiv and its partners were considering arranging a high-level meeting between Ukraine, Russia, the United States, European Union countries and Britain.",
      "After Monday's call, Mr Putin reiterated that his top priority was to \"eliminate the root causes\" of the conflict, in which Russian forces have killed thousands of Ukrainians since invading more than three years ago.",
      "\"We have agreed with the president of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,\" Mr Putin said, according to a translation by the Reuters news agency.",
      "The memorandum would set out \"a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement\", Mr Putin said.",
      "\"We just need to determine the most effective ways to move towards peace.\"",
      "Before the call, the White House warned Mr Trump had grown \"weary and frustrated with both sides of the conflict\", and Vice-President JD Vance said America was \"more than open to walking away\".",
      "ABC/wires Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Unrest, Conflict and War Topic:World Politics Analysis by Mazoe Ford Russian Federation United States War Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr trump",
      "mr putin",
      "vladimir putin",
      "donald trump",
      "russia ukraine",
      "us president",
      "call mr",
      "united states",
      "topic world",
      "world politics"
    ]
  },
  {
    "title": "Anthony Albanese tells Volodymyr Zelenskyy Australia doing 'whatever we can' to pressure on Russia",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-19/albanese-meets-zelenskyy-and-the-pope-in-rome/105308062",
    "publishedAt": "2025-05-18T21:54:45Z",
    "sentences": [
      "Topic:Foreign Affairs Anthony Albanese has assured Ukrainian President Volodymyr Zelenskyy that Australia is doing \"whatever we can\" to place pressure on Russia.",
      "The prime minister held talks with Mr Zelenskyy and European Commission President Ursula von der Leyen in the wake of Pope Leo XIV's inaugural mass in Vatican City.",
      "Mr Albanese also met briefly with the pope, telling him that his late mother would be \"looking down from heaven with the biggest smile she's ever had\".",
      "Anthony Albanese has assured Volodymyr Zelenskyy that Abrams tanks are now \"on the way\" to the war-torn country to help it push back Russia's invasion, after meeting Ukraine's president in Rome.",
      "The prime minister has also responded cautiously to a push from the European Union to deepen defence cooperation, after European Commission President Ursula von der Leyen proposed a new security partnership with Australia.",
      "A fleet of retired tanks the Albanese government pledged to Ukraine last year remain stuck in Australia, with defence figures in part blaming resistance from the United States for their delayed transfer.",
      "Mr Albanese held talks with both European political heavyweights in the wake of Pope Leo XIV's inaugural mass in Vatican City on Sunday morning — an event which drew dozens of leaders and top officials from across the globe.",
      "Mr Albanese also met briefly with the pope after the mass, telling the new pontiff that his late mother would be \"looking down from heaven with the biggest smile she's ever had\", watching him attending the mass as prime minister.",
      "Mr Albanese's talks with Mr Zelenskyy focused on how Australia could help maximise pressure on Russia in the wake of stalled peace talks in Türkiye last week.",
      "Australia has provided about $1.5 billion in support to Ukraine, but the ABC revealed last month the fleet of retired Abrams tanks pledged to Ukraine last year remained stuck in Australia.",
      "But Mr Albanese told Mr Zelenskyy at the opening of the meeting that the tanks were now \"on their way\".",
      "However, he declined to provide any details to journalists after the meeting, suggesting that would undermine Ukraine's war effort.",
      "Mr Zelenskyy responded by thanking Mr Albanese for the \"news\" about the tanks, and praised Australia's contribution to helping Ukraine resist Russian aggression.",
      "Australia has already sanctioned some 1,400 Russian individuals and entities, but the Ukrainian president suggested he would like to see even more action from the federal government.",
      "\"And we're very thankful for sanctions.",
      "I want to raise with you also this topic, which is very important: Put more pressure, more sanctions on Russia.\"",
      "The prime minister signalled he was open to that, saying Australia would \"continue to look at whatever we can do to place pressure on Russia\".",
      "The two men also discussed Australian Oscar Jenkins, who was sentenced to 13 years in a high-security Russian jail after being captured fighting for Ukraine in December last year.",
      "Mr Albanese said Australia continued to \"seek his freedom and his return to Australia and we thank you for the assistance in that\", suggesting Ukraine might be open to trying to secure his release through a broader prisoner swap with Russia down the track.",
      "Russia's invasion of Ukraine also featured in the prime minister's talks with Ms von der Leyen.",
      "The European Commission chief opened the meeting by saying that the EU saw Australia not just as a \"trading partner\" but as a \"strategic partner\" as well.",
      "She also suggested that the sharp deterioration of the global strategic environment should compel Australia and the EU to develop stronger defence and strategic ties.",
      "\"We would very much like to broaden this strategic partnership,\" she told Mr Albanese.",
      "\"For example, we have signed security and defence agreements with South Korea and with Japan [and] soon with the UK.",
      "\"We would be very pleased if we could develop such a security and defence partnership too, just to broaden the strategic partnership in many topics that we have in common.\"",
      "The agreements set a broad framework to bolster security cooperation across a range of fields.",
      "For example, the security partnership between the EU and Japan commits both sides to \"concrete cooperation in maritime security, space, cybersecurity, hybrid threats including foreign information manipulation and interference\".",
      "But the prime minister responded cautiously, saying that while Australia was \"certainly interested\" in the idea, it was at the \"very early stages\" at this point.",
      "\"I wouldn't over-read what [the] Ursula von der Leyen statements were,\" he said.",
      "\"It was a suggestion by the president that the relationship was based upon not just economic relations, but based upon our values.\"",
      "The prime minister also told reporters that he met privately with members of his Italian family in Rome yesterday, after they travelled from Italy's Puglia region to see him, including his half-brother and his wife and daughter.",
      "\"That was a great privilege,\" Mr Albanese said \"They came up to Rome and it was very nice to spend a short period of time with them.",
      "\"They are very proud that someone who shares their name [is prime minister] … It was a really nice moment for them.\"",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:World Politics Australia Foreign Affairs Holy See (Vatican City State) Italy Ukraine Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr albanese",
      "prime minister",
      "mr zelenskyy",
      "von der",
      "der leyen",
      "world politics",
      "pressure russia",
      "european commission",
      "ursula von",
      "vatican city"
    ]
  },
  {
    "title": "Russia launches largest drone attack of war after deadlocked peace talks, killing woman near Kyiv and injuring child",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/russia-launches-largest-drone-attack-of-war-after-deadlocked-peace-talks-killing-woman-near-kyiv-and-injuring-child-c-18734058",
    "publishedAt": "2025-05-18T08:00:21Z",
    "sentences": [
      "The largest known Russian drone attack since full-scale war began in 2022 killed a woman in the Kyiv region and injured at least three people, Ukrainian authorities say, as Moscow steps up strikes following peace talks on Friday.",
      "Russia had launched 273 drones by 8am on Sunday local time (0500 GMT), targeting chiefly the central Kyiv region and the Dnipropetrovsk and Donetsk regions in the country’s east, Ukraine’s air force said.",
      "Based on data provided by the air force, this was Russia’s largest drone attack on Ukraine during the war.",
      "Know the news with the 7NEWS app: Download today On the eve of the third anniversary of Russia’s full-scale invasion of Ukraine on February 23, Moscow launched a then-record 267 drones.",
      "The first direct talks in three years between Russia and Ukraine on Friday failed to broker the temporary ceasefire Kyiv and its allies have been urging.",
      "The 100 minutes of talks in Istanbul yielded an agreement to trade 1000 prisoners of war on each side.",
      "US President Donald Trump said he would speak to Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskiy on Monday.",
      "The sustained overnight Russian drone attack on Sunday killed a 28-year-old woman in the capital region and injured at least three people, including a four-year-old, Ukrainian authorities said.",
      "“Unfortunately, as a result of the enemy attack in the Obukhiv district, a woman died from her injuries,” Mykola Kalashnik, governor of the Kyiv region, posted on Telegram.",
      "Kyiv, the region around it and the eastern part of Ukraine were under raid warnings for nine hours overnight before they were called off about 9am local time (0600 GMT).",
      "Air defence units were engaged several times trying to repel attacks, the military said on Telegram.",
      "“It’s been a tough night.",
      "The Russians have always used war and attacks to intimidate everyone in negotiations,” Andriy Kovalenko, head of Ukraine’s Centre for Countering Disinformation, said on Telegram of Sunday’s attack.",
      "Air defence units destroyed 88 of the drones overnight.",
      "The attack also included 128 simulator drones that were lost along the way without hitting anything, Ukraine’s air force said in a statement on Telegram.",
      "On Saturday, a Russian drone attack killed nine civilians after hitting a shuttle bus in the Sumy region in northeast Ukraine, Kyiv said.",
      "Zelenskiy called the attack “deliberate” and urged stronger sanctions on Moscow, which said it had attacked a military facility.",
      "All of those injured in the Obukhiv district just south of Kyiv city were taken to hospital, Kalashnik said.",
      "He said several residential buildings in the area were damaged.",
      "In the city of Kyiv, fragments of a destroyed drone damaged the roof of a non-residential building, the city’s military administration said on Telegram.",
      "Reuters witnesses in and around Kyiv heard blasts that sounded like air defence units in operation.",
      "There was no immediate comment from Russia.",
      "Both sides deny targeting civilians in the war, but thousands have been killed in the conflict, the vast majority of them Ukrainian.",
      "1 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "drone attack",
      "kyiv region",
      "read 0",
      "0 min",
      "russian drone"
    ]
  },
  {
    "title": "Jailed Aussie fighter at centre of high-stakes talks between Albanese and Zelenskiy",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/jailed-aussie-fighter-at-centre-of-high-stakes-talks-between-albanese-and-zelenskiy-c-18731322",
    "publishedAt": "2025-05-18T01:25:29Z",
    "sentences": [
      "The fate of jailed Australian Oscar Jenkins is set to be discussed in face-to-face talks between Prime Minister Anthony Albanese and Ukrainian President Volodymyr Zelenskiy in Rome.",
      "Jenkins faces 13 years in a Russian prison after a court found him guilty of taking part in an armed conflict as a mercenary, which denies him the protections provided to prisoners of war under the Geneva Convention.",
      "The Australian government insists he was fighting as a member of the Ukrainian defence forces and should be entitled to humane treatment as a prisoner of war.",
      "Know the news with the 7NEWS app: Download today “This is an appalling decision from Russia, and another outrage in a long line of outrages when it comes to matters involving Ukraine,” federal frontbencher Murray Watt told Sky News on Sunday morning.",
      "“We consider this to be a sham trial, and we don’t accept that Jenkins should be treated this way.” Watt said he was sure Albanese would bring up Jenkins’ treatment and prospects for release with Zelenskiy.",
      "The pair are expected to meet on Sunday, Vatican time, on the sidelines of the inauguration of Pope Leo XIV in the Holy See.",
      "On Saturday, Albanese told journalists he was “outraged” by Jenkins’ incarceration and that Russia was continuing to abrogate its obligations to international law.",
      "Zelenskiy held direct talks with Russian officials for the first time on Friday as the two sides make abortive efforts to work towards a ceasefire deal.",
      "Jenkins was captured in occupied eastern Ukraine and taken into Russian custody last December.",
      "He was seen in social media videos visibly bruised and shaken while being interrogated and beaten by a Russian-speaking captor.",
      "The 33-year-old is believed to be the first Australian combatant reportedly captured by Russian forces.",
      "All sides of politics have offered their support to Jenkins, with opposition home affairs spokesman James Paterson calling his treatment “shocking”.",
      "Ukrainian Ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.",
      "More than three years have passed since Russia launched its invasion of Ukraine on February 24, 2022.",
      "1 min read 1 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 1",
      "read 2",
      "2 min",
      "read 0",
      "0 min",
      "prisoners war",
      "fate jailed",
      "jailed australian"
    ]
  },
  {
    "title": "Donald Trump will call Putin, then Zelensky, to push for ceasefire",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/politics/federal/trump-to-call-putin-about-stopping-ukraine-bloodbath-20250518-p5m03d",
    "publishedAt": "2025-05-17T21:20:38Z",
    "sentences": [
      "Copy link Copied Copy link Copied Mexican navy ship hits New York’s Brooklyn Bridge Bomb kills one near California fertility clinic; FBI calls it ‘terrorism’ Victorian budget gives kids free public transport Watt promises to get offshore gas through Senate Some former state premiers and MPs won’t pay $3m super tax Trump says Walmart shouldn’t blame tariffs for higher prices Lucy Slade Copy link Copied Copy link Copied That’s a wrap.",
      "Thanks for following The Australian Financial Review’s live news coverage this Sunday, May 18, 2025.",
      "We will have more for you in the next live news coverage.",
      "Here are some of the stories we covered today: Bomb near California fertility clinic; FBI calls it ‘terrorism’ | An explosion near a reproductive health facility in Palm Springs, California on Saturday (Sunday AEST) killed one person and injured at least four in an incident the FBI called an “intentional act”.",
      "Victorian budget gives kids free public transport | Children will be able to travel at no cost from next year as a state cost-of-living sweetener.",
      "Watt promises to get offshore gas through Senate | Environment Minister Murray Watt says he will get the job done, as he did with the CFMEU laws.",
      "Some former state premiers and MPs won’t pay $3m super tax | Those receiving generous defined benefit pensions will not be required to pay the federal government’s controversial new levy.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "near california",
      "california fertility",
      "fertility clinic",
      "clinic fbi",
      "fbi calls",
      "calls terrorism",
      "victorian budget"
    ]
  },
  {
    "title": "Anthony Albanese and Penny Wong slam Russia over 13-year sentence for captured fighter",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/anthony-albanese-and-penny-wong-slam-russia-over-13-year-sentence-for-captured-fighter-c-18727462",
    "publishedAt": "2025-05-17T13:28:40Z",
    "sentences": [
      "Foreign Minister Penny Wong has slammed the 13-year prison sentence handed to Australian citizen Oscar Jenkins by a Russian-controlled court, calling the proceedings a “sham trial” and demanding he be treated as a prisoner of war.",
      "Jenkins, 33, from Melbourne, was convicted of fighting as a mercenary alongside Ukrainian forces and sentenced to a maximum-security penal colony in the Russian-occupied Luhansk region of eastern Ukraine.",
      "The former biology teacher, who was captured by Russian troops in December 2023, was accused of receiving up to 800,000 rubles (around A$15,000) per month to engage in military operations against Russian forces.",
      "Know the news with the 7NEWS app: Download today State-run media claimed Jenkins had “fully admitted his guilt,” though serious concerns have been raised about the fairness of the trial and the conditions of his detention.",
      "“The Australian government is appalled at the sham trial and 13-year sentence given to Australian man Oscar Jenkins,” Wong said in a statement posted to social media.",
      "“As a full-serving member of the regular armed forces of Ukraine, Mr Jenkins is a prisoner of war.",
      "Russia is obligated under international humanitarian law to provide him with humane treatment and full POW protections.” Prime Minister Anthony Albanese echoed the condemnation, calling the sentence “an outrage” during a press conference in Rome.",
      "“Let’s be very clear.",
      "This sentence by Russia is an outrage – it is a continuation of the way they have behaved, abrogating their responsibilities,” the Prime Minister said.",
      "“This conflict began with them choosing to invade a sovereign nation, and their decision to abrogate their responsibility to uphold international law.” Jenkins was formally charged with mercenary activity in April and appeared in court on Friday in a glass cage, reportedly looking frail and despondent.",
      "Russian prosecutors argued he had signed a contract with the Ukrainian Defence Ministry and fought in the Donbas region with Ukraine’s 66th Separate Mechanised Brigade.",
      "Footage of Jenkins in Russian custody circulated online after his capture, showing him bound, slapped, and aggressively interrogated.",
      "The video sparked global outrage and led to fears that he had been killed, prompting the Australian government to summon the Russian ambassador in January.",
      "New footage later surfaced in February showing Jenkins alive but visibly unwell, with possible injuries including a broken arm — heightening concerns over his treatment.",
      "Russian state media claimed reports of his death were “fake news” orchestrated by Ukrainian intelligence.",
      "Opposition home affairs spokesman James Paterson described the sentence as a “sham” and a “gross violation” of international law, saying Jenkins must be treated as a prisoner of war under the Geneva Conventions.",
      "Human rights groups have echoed calls for Jenkins’ release, criticising the legality of the trial and raising the possibility that he may be included in a future swap.",
      "One such deal could involve Russian spies Kira and Igor Korolev, according to speculation from the Russian branch of the International Committee for the Protection of Human Rights.",
      "Jenkins’ case follows the March conviction of British national James Scott Rhys Anderson, who received a 19-year sentence from a Russian military court — the first such case involving a British citizen since the war began.",
      "The Australian Department of Foreign Affairs and Trade has been contacted for further comment.",
      "1 min read 2 min read 4 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "read 0",
      "0 min",
      "prisoner war",
      "oscar jenkins",
      "sham trial"
    ]
  },
  {
    "title": "Ukraine accuses Russia of deadly attack on bus hours after peace talks",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-17/ukraine-accuses-russia-of-deadly-attack-on-bus-after-peace-talks/105305262",
    "publishedAt": "2025-05-17T06:26:12Z",
    "sentences": [
      "Topic:Unrest, Conflict and War Ukrainian military officials say, in unverified reports, that this passenger bus was targeted in a Russian drone strike.",
      "(Supplied: Sumy regional military administration) Ukrainian officials say a Russian drone strike has hit a bus, killing at least nine people and injuring four more, in the country's north-eastern Sumy region.",
      "The attack came just hours after Moscow and Kyiv held their first direct peace talks in years, in diplomatic discussions held in Istanbul, Türkiye.",
      "The peace talks failed to produce a ceasefire deal, but Russia and Ukraine agreed to exchange 1,000 prisoners of war and to meet again for further negotiations.",
      "Ukrainian officials say a Russian drone strike has hit a bus, killing at least nine people and injuring four more, in the country's north-eastern Sumy region, in an attack that took place hours after Moscow and Kyiv held their first direct peace talks in years.",
      "\"Unfortunately, as a result of a cynical attack by Russians on a bus with civilians, there are dead,\" the administration said in a Telegram post on Saturday.",
      "\"Unfortunately, the death toll has risen to nine.\"",
      "Unverified images released by the local Sumy military administration appear to show a vehicle surrounded by debris and emergency personnel attending to victims.",
      "(Supplied: Sumy regional military administration) The bus, which was attacked near the city of Bilopillya while travelling towards Sumy, was \"targeted by the Russians\", the military administration said.",
      "Local media outlet Suspilne said the passengers on the bus were being evacuated from Bilopillia when the strike occurred.",
      "Authorities are working to identify some of the victims, most of them elderly women.",
      "A period of mourning has been declared in the city, with local community chief Yurii Zarko calling the attack \"Black Saturday\".",
      "Ukraine's police posted photos of a nearly destroyed dark blue passenger van, with the roof torn off and the windows blown out.",
      "\"This is not just another shelling — it is a cynical war crime,\" Ukraine's National Police said in a post on the Telegram messaging app.",
      "Ihor Tkachenko, head of Sumy's military administration, said on Telegram that a rescue operation was underway.",
      "Reuters was unable to independently verify the Ukrainian report, but Russia's TASS state news agency reported, citing a statement from the defence ministry, that Russian forces struck a Ukrainian military equipment staging area in the Sumy region with drones.",
      "Both sides deny targeting civilians in their attacks, but thousands have died in the conflict, the vast majority of them Ukrainians.",
      "Ukrainian Defence Minister Rustem Umerov says Kyiv and Moscow will exchange 1,000 captives but a date for the swap will not be made public.",
      "The meeting of Russian and Ukrainian officials in Türkiye on Friday failed to broker a temporary ceasefire.",
      "It was the first direct dialogue between the two sides since the early months of the war that Russia launched in February 2022.",
      "During the exchange, Russia and Ukraine decided on an exchange of 1,000 prisoners of war each and agreed in principle to meet again for further negotiations aimed at brokering a ceasefire deal.",
      "Ukraine says the next step should be a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin.",
      "Mr Zelenskyy has called for tougher sanctions on Russia should it reject a US-backed proposal for a 30-day ceasefire.",
      "Peace talks held in Istanbul fell short of achieving a ceasefire deal between Ukraine and Russia, but the countries did agree on an exchange of 1,000 prisoners of war.",
      "(Reuters: Arda Kucukkaya/Turkish Foreign Ministry) Meanwhile, Russia said it was satisfied with the talks and was ready to keep talking.",
      "Vladimir Medinsky, the head of Russia's delegation, said the prisoner exchange was one of the largest such swaps since the beginning of the conflict.",
      "Neither Russian President Vladimir Putin nor his Ukrainian counterpart Volodymyr Zelenskyy will attend talks in Istanbul.",
      "The question now is, will these talks amount to anything?",
      "Both Moscow and the United States government have also talked up the need for a meeting on the conflict between Mr Putin and President Donald Trump.",
      "Mr Trump, who is growing increasingly frustrated with both Russia and Ukraine as he tries to push them towards a peace settlement, said he was \"always considering\" secondary sanctions against Moscow if he thought it was blocking the process.",
      "US officials have spoken about possible financial sanctions as well as potential secondary sanctions on buyers of Russian oil.",
      "Reuters/AFP Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:World Politics Topic:World Politics Topic:Unrest, Conflict and War Russian Federation Ukraine Unrest, Conflict and War Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "military administration",
      "peace talks",
      "topic world",
      "world politics",
      "politics topic",
      "unrest conflict",
      "conflict war",
      "officials say",
      "russian drone",
      "drone strike"
    ]
  },
  {
    "title": "In The Know: MH17 Russia ruling, Sussan Ley, South Yunderup crash, Diddy trial, Go-Jo at Eurovision",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/politics/in-the-know-mh17-russia-ruling-sussan-ley-south-yunderup-crash-diddy-trial-go-jo-at-eurovision--c-18712923",
    "publishedAt": "2025-05-17T01:24:22Z",
    "sentences": [
      "Harrison McElroy, 24, and Kayla Shepherd, 31, were killed on Mother’s Day when they pulled their car into the southbound emergency lane of Forrest Highway in South Yunderup and were struck by a Volvo station wagon.",
      "Ms Shepherd’s 17-month-old daughter was found in the back seat of the parked sedan when police arrived.",
      "It is unclear why the couple had stopped on the side of the road.",
      "On Monday, a UN aviation agency issued a historic ruling finding that Russia was responsible for downing Malaysian Airlines Flight MH17 which claimed 289 lives.",
      "The flight was scheduled to travel from Amsterdam to Kuala Lumpur on July 17, 2014 but was shot down by a surface-to-air missile while flying over eastern Ukraine.",
      "Sussan Ley made history this week when she was appointed as the Liberal party’s first female leader — she defeated Angus Taylor 29 votes to 25 in a ballot of MPs in Canberra.",
      "The 63-year-old is replacing Peter Dutton as Opposition Leader after he lost his seat at the May 3 election.",
      "On the third day of Sean ‘Diddy’ Combs’ criminal trial, his ex-girlfriend Casandra Ventura testified that the rapper had raped her in 2018.",
      "Ventura, better known by her stage name Cassie, is the prosecution’s star witness against Combs.",
      "She fought back tears as she described the alleged rape and testified that Combs beat her during drug-fuelled sex parties known as “Freak Offs,” and that he threatened to release videos of her taking part, warning that he would ruin her career.",
      "Manjimup’s own Marty Zambotto, aka Go-Jo, made Australia proud when he took to the Eurovision stage to belt out his tongue-in-cheek hit Milkshake Man, but he missed out on qualifying for the grand final on Thursday night.",
      "He was the first performance of the evening, and is the tenth musical act to represent Australia at the world’s most popular singing contest."
    ],
    "topics": [
      "harrison mcelroy",
      "mcelroy 24",
      "24 kayla",
      "kayla shepherd",
      "shepherd 31",
      "31 killed",
      "killed mother",
      "mother day",
      "day pulled",
      "pulled car"
    ]
  },
  {
    "title": "Russia-Ukraine agree to swap POWs",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/europe/russia-ukraine-agree-to-swap-pows-20250517-p5lzz0",
    "publishedAt": "2025-05-16T16:25:43Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Istanbul, Turkey | The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours on Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the fighting.",
      "Ukrainian President Volodymyr Zelensky said he discussed the results of the talks with US President Donald Trump and the leaders of France, Germany, the UK and Poland.",
      "In a post on X from a European leadership meeting in Albania, he urged “tough sanctions” against Moscow if it rejects “a full and unconditional ceasefire and an end to killings”.",
      "AP Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "\"A clear escalation in Russia’s crackdown on digital privacy tools\" - experts warn against recent VPN disappearances in Russia",
    "source": "TechRadar",
    "url": "https://www.techradar.com/vpn/vpn-privacy-security/a-clear-escalation-in-russias-crackdown-on-digital-privacy-tools-experts-warn-against-recent-vpn-disappearances-in-russia",
    "publishedAt": "2025-05-16T16:02:25Z",
    "sentences": [
      "The VPN purge from Russian official app stores continues, with smaller providers becoming the new target after Apple and Google.",
      "Between May 15 and 16, 2025, Samsung and Xiaomi both removed the AdGuard VPN application at the Roskomnadzor's demand.",
      "At least one more VPN provider, HideMyName VPN, has also been removed from the Huawei Store in Russia and China – a Russian VPN digital rights group, VPN Guild, confirmed to TechRadar.",
      "\"The removal of VPN apps from app stores marks a clear escalation in Russia’s crackdown on digital privacy tools,\" said VPN Guild Chair Alexey Kozliuk.",
      "The recent events, Kozliuk explains, aren't isolated incidents, but part of a broader, ongoing campaign to block Russian citizens' access to uncensored information and control internet use.",
      "In October 2023, for example, HideMyName filed the first-ever lawsuit against the Kremlin's infamous censorship body regulator Roskomnadzor.",
      "In January 2024, authorities deemed the VPN provider to be a \"foreign agent.\"",
      "In March 2024, the government then passed a new law to criminalize the spread of information about ways to circumvent internet restrictions.",
      "This is likely the legal basis upon which the Russian censor body began issuing these removal demands to tech firms.",
      "From July 2024 onwards, Apple has removed at least 60 VPN apps, including AdGuard VPN, and a popular Russian service, Amnezia VPN, alongside some of the best VPN services on the market.",
      "This brought the total toll to almost 100 VPN apps unavailable in Russia's App Store.",
      "While Google seems mostly resistant to these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia.",
      "Now, authorities' targets have also expanded towards smaller app store providers.",
      "TechRadar needs you!",
      "We want to know what you think about the world of VPNs.",
      "Whether you're a novice or a VPN pro, we want to hear your thoughts.",
      "Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete!",
      "To take part, click the link below:  \"We’re seeing a coordinated squeeze across platforms, limiting users’ ability to bypass restrictions,\" said Kozliuk.",
      "\"What’s especially concerning is the growing role of global tech companies in enforcing local censorship, whether under direct state pressure or as preemptive compliance.\"",
      "GreatFire’s Campaign and Advocacy Director, Benjamin Ismail, also shared the same concerns.",
      "Through the organization's project AppCensorship, Ismail and the team have been busy monitoring a staggering increase in these VPN removals across both Apple and Google's official app stores.",
      "While it's the first time Ismail has heard of such an incident involving Samsung's Galaxy App Store, he told TechRadar that a way smaller provider (F-Droid) was also hit by a similar request in 2024.",
      "According to Ismail, this may mean that Roskomnadzor has understood that it can try its luck to put pressure on tech vendors.",
      "\"Smaller providers may struggle more to resist these demands as the prospect of becoming fully unavailable in Russia might be an issue for these platforms,\" he added.",
      "VPNs will remain a critical line of defense for digital freedom This is exactly why experts have long argued that Big Tech giants, which have the means and resources, should uphold their users' human rights and challenge the Kremlin's censorship requests.",
      "Commenting on this point, Kozliuk from the VPN Guild said: \"This underscores the urgent need to give users more control and make them less reliant on centralized platforms and app ecosystems, as well as the need for stronger international advocacy to hold tech platforms accountable.",
      "\"As political tensions rise, especially around elections or protests, these crackdowns will likely intensify – and VPNs will remain a critical line of defense for digital freedom.\"",
      "Chiara is a multimedia journalist committed to covering stories to help promote the rights and denounce the abuses of the digital side of life – wherever cybersecurity, markets, and politics tangle up.",
      "She believes an open, uncensored, and private internet is a basic human need and wants to use her knowledge of VPNs to help readers take back control.",
      "She writes news, interviews, and analysis on data privacy, online censorship, digital rights, tech policies, and security software, with a special focus on VPNs, for TechRadar and TechRadar Pro.",
      "Got a story, tip-off, or something tech-interesting to say?",
      "Reach out to chiara.castro@futurenet.com Please logout and then login again, you will then be prompted to enter your display name."
    ],
    "topics": [
      "app stores",
      "vpn guild",
      "vpn apps",
      "app store",
      "official app",
      "smaller providers",
      "apple google",
      "adguard vpn",
      "vpn provider",
      "store russia"
    ]
  },
  {
    "title": "Russia and Ukraine agree major prisoner of war-swap in first direct peace talks since 2022",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-17/russia-and-ukraine-agree-exchange-1-000-prisoners/105304128",
    "publishedAt": "2025-05-16T14:55:57Z",
    "sentences": [
      "Topic:World Politics Hakan Fidan chairs a meeting between Ukrainian and Russian negotiators in Istanbul.",
      "(Reuters: Arda Kucukkaya) The first direct peace talks between Russia and Ukraine in more than three years ended after less than two hours in Istanbul.",
      "Ukrainian Defence Minister Rustem Umerov said the two sides agreed to exchange 1,000 prisoners of war.",
      "Volodymyr Zelenskyy says Kyiv's top priority is \"a full, unconditional and honest ceasefire\" and that Ukraine regards Russia's demands as unacceptable.",
      "Russia and Ukraine have agreed to exchange 1,000 prisoners of war during the first direct peace talks between the two sides since 2022.",
      "Ukrainian Defence Minister Rustem Umerov, who led Kyiv's delegation at the talks, on Friday, local time, said the date for the exchange would not be made public.",
      "Turkish Foreign Minister Hakan Fidan, who chaired the meeting, said the two sides agreed in principle to meet again for negotiations aimed at reaching a ceasefire.",
      "Ukraine has said the next step should be a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin.",
      "After the talks concluded, Mr Zelenskyy confirmed on X that he had spoken to US President Donald Trump and Ukraine's European allies on the phone.",
      "He called for tougher sanctions on Russia should it reject a US-backed proposal for a 30-day ceasefire.",
      "\"Our position — if the Russians reject a full and unconditional ceasefire and an end to killings, tough sanctions must follow.",
      "Pressure on Russia must be maintained until Russia is ready to end the war.\"",
      "Meanwhile, Russia said it was satisfied with the talks and was ready to keep talking.",
      "Vladimir Medinsky, the head of Russia's delegation, said the prisoner exchange was one of the largest such swaps since the beginning of the conflict.",
      "\"In general, we are satisfied with the result and are ready to continue contacts.",
      "In the coming days, there will be a massive thousand-for-thousand prisoner exchange,\" Mr Medinsky said.",
      "\"We have agreed that each side will present its vision of a possible future ceasefire and spell it out in detail.",
      "After such a vision has been presented, we believe it would be appropriate, as also agreed, to continue our negotiations.\"",
      "Ukraine and its allies accuse Mr Putin of stalling, saying he is not serious about wanting peace.",
      "Russia said it wanted to end the war by diplomatic means and was ready to discuss a ceasefire.",
      "But it has raised a list of questions and concerns, saying Ukraine could use a pause to rest its forces, mobilise extra troops and acquire more Western weapons.",
      "Kyiv wants the West to impose tighter sanctions unless Moscow accepts a proposal from the White House for a 30-day ceasefire.",
      "Russia's demands were \"detached from reality and go far beyond anything that was previously discussed,\" a source in the Ukrainian delegation told Reuters.",
      "The source, speaking on condition of anonymity, said Moscow had issued ultimatums for Ukraine to withdraw from parts of its own territory in order to obtain a ceasefire \"and other non-starters and non-constructive conditions\".",
      "Mr Trump and US Secretary of State Marco Rubio have said further progress is unlikely to happen unless Mr Putin agrees to face-to-face talks with the US president.",
      "Both sides are under pressure from Mr Trump to end Europe's deadliest conflict since World War II.",
      "Mr Fidan said the two sides would also share in writing their conditions for a ceasefire.",
      "The Ukrainian delegation, led by Ukrainian Defence Minister Rustem Umerov, at the meeting in Istanbul.",
      "(Reuters: Arda Kucukkaya) At the negotiations in Istanbul, delegates were seated opposite each other, with the Russians in suits and half of the Ukrainians wearing camouflage military fatigues.",
      "\"There are two paths ahead of us: One road will take us on a process that will lead to peace, while the other will lead to more destruction and death,\" Mr Fidan said.",
      "It was Mr Putin who proposed the direct talks in Türkiye, but he spurned a challenge from Mr Zelenskyy to meet him there in person, instead sending a team of mid-level officials.",
      "Ukraine responded by naming negotiators of similar rank.",
      "Mr Rubio had said on the eve of the meeting that no major breakthrough was likely, based on the level of the negotiating teams.",
      "Russia said on Friday it had captured another village in its slow, grinding advance in eastern Ukraine.",
      "The delegation has been announced by Russia with President Vladimir Putin's name not listed to discuss peace with Ukraine.",
      "Minutes before the start of the Istanbul meeting, Ukrainian media reported an air alert and explosions in the city of Dnipro.",
      "Russia said it viewed the talks as a continuation of the negotiations that took place in the early weeks of the war in 2022, also in Istanbul.",
      "However, the terms under discussion at the time, when Ukraine was still reeling from Russia's initial invasion, would have been deeply disadvantageous to Kyiv.",
      "They included a demand by Moscow for large cuts to the size of Ukraine's military.",
      "With Russian forces now in control of close to a fifth of Ukraine, Mr Putin has held fast to his longstanding demands for Kyiv to cede territory, abandon its NATO membership ambitions and become a neutral country.",
      "Ukraine rejects these terms as tantamount to capitulation and is seeking guarantees of its future security from world powers, especially America.",
      "Reuters Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:World Politics Russian Federation Ukraine Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "world politics",
      "topic world",
      "two sides",
      "russia said",
      "mr putin",
      "meeting ukrainian",
      "ukrainian defence",
      "defence minister",
      "minister rustem",
      "rustem umerov"
    ]
  },
  {
    "title": "Russia jails Australian man for fighting for Ukraine",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/russia-jails-australian-man-for-fighting-for-ukraine-c-18718879",
    "publishedAt": "2025-05-16T14:29:02Z",
    "sentences": [
      "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.",
      "Oscar Jenkins, 33, was found guilty by a court of taking part in an armed conflict as a mercenary, a statement from the prosecutors said on Friday.",
      "The court had ruled he had taken part in combat operations against Russian troops between March and December 2024.",
      "Know the news with the 7NEWS app: Download today Australian media reported in 2024 that Jenkins, a teacher from Melbourne, was serving alongside Ukraine’s military when he was captured by Russian forces.",
      "In January, Australia summoned the Russian ambassador over what turned out to be false reports that Jenkins had been killed after being captured by Russia.",
      "Ukrainian ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.",
      "Prime Minister Anthony Albanese has said Australia has made representations to Ukraine, including a one-on-one discussion he had with Ukrainian President Volodymyr Zelenskiy.",
      "with AAP 4 min read 3 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "read 0",
      "0 min",
      "russia sentenced",
      "sentenced australian",
      "australian citizen"
    ]
  },
  {
    "title": "Australian Oscar Jenkins sentenced to 13 years in jail by Russia for fighting alongside Ukrainian forces",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-16/oscar-jenkins-sentence-13-years-maximum-security-russia-ukraine/105304126",
    "publishedAt": "2025-05-16T13:21:19Z",
    "sentences": [
      "Topic:Unrest, Conflict and War Russia has sentenced Australian Oscar Jenkins to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, according to prosecutors in the Russian-controlled part of eastern Ukraine.",
      "The 33-year-old Melbourne man was found guilty of participating in an armed conflict as a mercenary, the prosecutors said, after a court ruled he had fought against Russian troops between March and December last year.",
      "He is to serve his sentence \"in a strict regime penal colony\", according to the ruling.",
      "In a statement, Foreign Affairs Minister Penny Wong said the Australian government was \"appalled\" by the \"sham trial\" and sentence given to Mr Jenkins.",
      "\"We are working with Ukraine and other partners, including the International Committee of the Red Cross, to advocate for his welfare and release.\"",
      "Penny Wong says the Australian government has \"serious concerns\" for Oscar Jenkins.",
      "(Reuters: Kevin Mohatt) Ms Wong said as a prisoner of war, Mr Jenkins must be given \"the protections afforded to him\".",
      "\"Russia is obligated to treat him in accordance with international humanitarian law, including humane treatment,\" she said.",
      "\"The Department of Foreign Affairs and Trade continues to provide consular support to Mr Jenkins' family.\"",
      "Mr Jenkins, a former biology teacher who the Australian government has repeatedly called on Russia to release, was captured in December while serving alongside Ukraine's military in the Donbas region.",
      "Russia and its eastern Ukrainian proxies consider foreigners who have travelled to fight in Ukraine to be mercenaries, which enables them to be prosecuted under Russia's criminal code rather than having to be treated as prisoners of war — which would entitle them to rights under the Geneva Convention.",
      "In the same month he was captured, Mr Jenkins was filmed being roughly interrogated and slapped in the face, with the video then being shared online by a Russian military blogger.",
      "The following month, the Australian government summoned the Russian ambassador over reports he had been killed while in captivity.",
      "Oscar Jenkins speaks to his captors in a video released in January.",
      "(Supplied) However, in February, new videos of Mr Jenkins were posted online showing him alive and in Russian captivity, but looking frail and potentially suffering from a broken arm.",
      "He was charged in April, and prosecutors later posted a video of him standing in court in a glass cage, with his hands behind his back and his expression despondent.",
      "The prosecution alleged he had signed a contract with the Ukrainian Defence Ministry to fight against the Russian army for between 600,000 and 800,000 roubles ($11,000 and $15,000) a month.",
      "Shortly after Mr Jenkins was charged, Prime Minister Anthony Albanese said Australia had not abandoned him.",
      "\"We'll continue to make representations to the reprehensible regime of Vladimir Putin on behalf of Mr Jenkins.",
      "We will stand up and use whatever avenues we have at our disposal to continue to make those representations,\" Mr Albanese said last month.",
      "A Moscow-based human rights group — whose public statements regularly align with those of senior Kremlin officials — has also suggested Mr Jenkins could be released as part of a prisoner swap between Australia and Russia.",
      "The swap could involve accused Russian spies Kira and Igor Korolev as well as Sydney fugitive Simion Boikov, known as the \"Aussie Cossack\", the group suggested.",
      "Reuters/AFP Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Federal Government Australia Courts Defence Forces Foreign Affairs Russian Federation Ukraine Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr jenkins",
      "australian government",
      "oscar jenkins",
      "foreign affairs",
      "world politics",
      "politics topic",
      "unrest conflict",
      "conflict war",
      "penny wong",
      "wong said"
    ]
  },
  {
    "title": "Russia jails Australian man for fighting for Ukraine",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/news/crime/russia-jails-australian-man-for-fighting-for-ukraine-c-18718884",
    "publishedAt": "2025-05-16T12:23:32Z",
    "sentences": [
      "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.",
      "Oscar Jenkins, 33, was found guilty by a court of taking part in an armed conflict as a mercenary, a statement from the prosecutors said on Friday.",
      "The court had ruled he had taken part in combat operations against Russian troops between March and December 2024.",
      "Australian media reported in 2024 that Jenkins, a teacher from Melbourne, was serving alongside Ukraine's military when he was captured by Russian forces.",
      "In January, Australia summoned the Russian ambassador over what turned out to be false reports that Jenkins had been killed after being captured by Russia.",
      "Ukrainian ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.",
      "Prime Minister Anthony Albanese has said Australia has made representations to Ukraine, including a one-on-one discussion he had with Ukrainian President Volodymyr Zelenskiy.",
      "with AAP"
    ],
    "topics": [
      "russia sentenced",
      "sentenced australian",
      "australian citizen",
      "citizen 13",
      "13 years",
      "years prison",
      "prison fighting",
      "fighting alongside",
      "alongside ukrainian",
      "ukrainian forces"
    ]
  },
  {
    "title": "Samsung and Xiaomi remove AdGuard VPN from Russian app stores - here’s what we know so far",
    "source": "TechRadar",
    "url": "https://www.techradar.com/vpn/vpn-privacy-security/adguard-vpn-disappears-from-russias-samsung-galaxy-app-store-heres-what-we-know-so-far",
    "publishedAt": "2025-05-16T08:55:24Z",
    "sentences": [
      "UPDATE: AdGuard confirmed to TechRadar that Xiaomi also removed its VPN app from its Russian App Store at Roskomnadzor's request on May 16, 2025, after publication.",
      "We edit the article to reflect this.",
      "Yet another VPN service has disappeared from official app stores in Russia.",
      "This time, Samsung has removed the AdGuard VPN app from its Galaxy App Store in the country at the Roskomnadzor's demand.",
      "A day after, on May 16, 2025, the tech giant Xiaomi also did the same, killing the provider's VPN application from its Russian app store after receiving a removal order from the country's censoring body.",
      "This comes as part of the Kremlin's actions against VPNs that have seen over 100 apps disappear from the Russian Apple App Store, including some of the best VPN services on the market.",
      "Despite Google seemingly resisting most of these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia.",
      "AdGuard VPN, however, hasn't been affected yet.",
      "\"Our app has indeed been removed from the Samsung Store in Russia – a regrettable development, in our view,\" AdGuard CPO, Denis Vyazovoy, told TechRadar.",
      "The VPN service has received a synthetic email from Samsung (see image below) to inform that its \"application information has been modified.\"",
      "The change?",
      "\"Russia was excluded from the sales country lists according to Russian government's request.",
      "This app is banned by Russian government,\" reads the email.",
      "Xiaomi has sent a similar communication to the provider (see image below), noting that \"Distribution of VPN applications in Russia is not allowed.",
      "Therefore, we have to remove your application from Russia.\"",
      "AdGuard VPN was already among the virtual private network (VPN) services affected by the big purge from Russia's Apple App Store last year.",
      "Unavailable apps also include some of TechRadar's favorites, such as NordVPN, ExpressVPN, and Proton VPN, but also the popular Russian service Amnezia VPN.",
      "The provider confirmed to TechRadar, though, that its app is still available in Russia's Google Play Store at the time of writing.",
      "It's also worth noting that these removals only affect Russia-based users.",
      "The AdGuard VPN app is still available across all official app stores outside Russia.",
      "\"We see this as part of a broader trend of restricting access to tools that help people protect their privacy and maintain access to an open internet,\" Vyazovoy told TechRadar.",
      "The Kremlin's actions against VPNs have intensified since a law enforced in March 2024 criminalized the spread of information about ways to circumvent internet restrictions.",
      "This is likely the legal basis upon which the Russian censor body is issuing these demands to Big Tech firms.",
      "Yet, experts have long called on these companies to uphold Russian citizens' human rights by refraining from cooperating with these demands and restoring censored VPN apps.",
      "Vyazovoy confirmed to TechRadar that the service continues to operate through other channels and the provider is actively looking for ways to remain accessible to all users.",
      "If you are using a Galaxy or Xiaomi smartphone, I recommend downloading the AdGuard VPN app from the Google Play Store, where the service is still available at the time of writing.",
      "The provider also suggests downloading it directly from their official website to be sure to get the latest and safest version.",
      "TechRadar needs you!",
      "We want to know what you think about the world of VPNs.",
      "Whether you're a novice or a VPN pro, we want to hear your thoughts.",
      "Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete!",
      "To take part, click the link below:  Chiara is a multimedia journalist committed to covering stories to help promote the rights and denounce the abuses of the digital side of life – wherever cybersecurity, markets, and politics tangle up.",
      "She believes an open, uncensored, and private internet is a basic human need and wants to use her knowledge of VPNs to help readers take back control.",
      "She writes news, interviews, and analysis on data privacy, online censorship, digital rights, tech policies, and security software, with a special focus on VPNs, for TechRadar and TechRadar Pro.",
      "Got a story, tip-off, or something tech-interesting to say?",
      "Reach out to chiara.castro@futurenet.com Please logout and then login again, you will then be prompted to enter your display name."
    ],
    "topics": [
      "app store",
      "adguard vpn",
      "vpn app",
      "confirmed techradar",
      "google play",
      "play store",
      "still available",
      "xiaomi also",
      "russian app",
      "may 16"
    ]
  },
  {
    "title": "How a common enemy is pushing Afghanistan's Taliban closer to Russia",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-16/russia-offers-support-to-the-taliban-to-fight-afghan-isis/105271142",
    "publishedAt": "2025-05-16T05:05:08Z",
    "sentences": [
      "By Heloise Vyas Topic:Foreign Affairs Russia delisted the Afghan Taliban as a terrorist organisation in April, a move that paved the way for deeper ties between Moscow and Kabul.",
      "(Reuters: Ali Khara) Russia's involvement in Afghanistan stretches as far back as the 19th century.",
      "Sitting at the crossroads of Central and South Asia, Afghanistan was (and is) considered strategically important and served as a buffer between the empires of Tsarist Russia and British India — both at their heights.",
      "The Russian empire initiated contact with Kabul in 1837 and after later becoming the Soviet Union, was the first country to establish formal diplomatic relations with it in 1919.",
      "Sixty years later, the same Soviets invaded Afghanistan in a watershed event that set off a decade-long war and spawned a resistance movement that grew into what is the modern-day Taliban.",
      "Most nations remain distanced with the group, which retook control of Afghanistan in 2021, but Vladimir Putin's Russia wants to work more closely with it.",
      "That largely relates to counter-terrorism efforts against Afghanistan-based Islamic State (ISIS), but it also comes amid a battle for hegemony in Central Asia, where China sees an opportunity amid Russia's ongoing invasion of Ukraine.",
      "Moscow has been one of a handful of global players who have sought to grow their ties with Afghanistan since the chaotic 2021 withdrawal of US-armed troops from Kabul swept the Taliban back to power.",
      "Last month, Russia's top court formally removed the Taliban from its list of terrorist organisations and lifted a ban on the group put in place in 2003.",
      "Russia's presidential envoy to Afghanistan Zamir Kabulov said earlier this month the suspension of that ban \"finally removes all obstacles to full cooperation between our countries in various fields\", but insisted that the cooperation between Moscow and Kabul \"continues de facto\".",
      "The Taliban's delegation pictured at the St. Petersburg International Economic Forum in Russia in June 2024.",
      "(Reuters: Anton Vaganov) No country, nor the UN, has officially recognised the Afghan government under Taliban rule post-August 2021 over the group's human rights record, but many have maintained engagements through both official and informal channels.",
      "Russia has an embassy and a consulate-general in Afghanistan, and has offered to accredit an Afghan ambassador in Moscow.",
      "Dozens of countries have diplomatic missions in Afghanistan, while the Taliban itself has control of at least 39 Afghan embassies all over the world.",
      "In its latest show of support for the de facto administration, Russia has indicated it will provide \"specialised\" help for the Taliban to fight ISIS's Afghan branch, Islamic State Khorasan (ISIS-K), a group seen as having been \"fixated on Russia\" and vocally anti-Putin in recent years.",
      "Moscow's willingness to play a proactive role in Afghanistan's security affairs at a time when it is faced with all-round constraints on the Ukraine war front is due to a heightened threat of violent extremism at home, according to analysts.",
      "Mr Kabulov, said earlier this month that the Kremlin would undertake concerted efforts with Taliban authorities to combat what it saw as a \"common enemy\" in ISIS-K. \"We see and appreciate the efforts that the Taliban are making in the fight against the Afghan wing of ISIS, which professes the ultra-radical ideology of 'global jihad'\", he told Russian state-run agency RIA.",
      "\"We will provide all possible assistance to the authorities of this country (Afghanistan) through specialised structures.\"",
      "ISIS-K has claimed responsibility for two terrorist attacks on Russia in the past three years: In September 2022 against the Russian embassy in Kabul and in March last year against the Crocus City Hall outside Moscow.",
      "Last year's mass shooting saw more than 130 people killed in what was the deadliest terror attack in Europe in 20 years.",
      "ISIS has previously claimed responsibility for attacks it did not commit but US intelligence and other evidence also pointed to the organisation as responsible.",
      "Four months after that incident, Mr Putin said the \"Taliban are certainly our allies in the fight against terrorism\", notwithstanding its illegitimate status.",
      "Russian presidential envoy to Afghanistan Zamir Kabulov called ISIS-K a \"common enemy\" of Moscow and Kabul.",
      "(Reuters: Alexander Zemlianichenko/Pool) ISIS-K emerged as a breakaway faction of the Pakistani Taliban in 2015 and has been linked to numerous deadly attacks across Asia and Europe.",
      "Today it has an established presence across Afghanistan but is a sworn enemy of the Afghan Taliban.",
      "The group has also had its grievances with Russia for years.",
      "\"ISIS-K accuses the Kremlin of having Muslim blood on its hands, referencing Moscow's interventions in Afghanistan, Chechnya and Syria,\" counterterrorism analyst Colin P. Clarke said after the Crocus City Hall attack last year.",
      "Islamic State, and its precursor groups, have been linked to several attacks against Russia since the early 2000s.",
      "ISIS as a whole has grown in strength since 2019, although ISIS-K's attacks in its core areas of operation in Afghanistan have decreased in the face of pressure from the Taliban after it returned to power in 2021.",
      "According to the Global Terrorism Index's most recent report, ISIS and its affiliates remained the world's deadliest terrorist group in 2023.",
      "The report also found Russia continued to be the country most affected by terrorism in the Russia and Eurasia region and 35th worldwide.",
      "Countering the security threats emanating from Afghan soil, particularly from ISIS-K, is Russia's main motivation to provide assistance to the Taliban, said Aleksei Zakharov, a fellow with the Observer Research Foundation's (ORF) Strategic Studies Programme.",
      "IS-K has carried out dozens of deadly attacks in Afghanistan, targeting schools, mosques and women.",
      "And its bitter enemy is now in charge of the country they want to control.",
      "\"When it comes to Afghanistan, ISIS-K is seen by Russia as a primary threat.",
      "This has been Moscow's long-standing position since the mid-2010s, which actually led Russia to align itself more closely with the Taliban, even before they took over Kabul in 2021,\" he said.",
      "So far nothing suggests that assistance will eventuate into any form of bilateral defence agreements between the two nations.",
      "Even if it were to, a Russia-Taliban military pact alone would likely fail to stabilise Afghanistan's security situation without external actors becoming involved, Mr Zakharov said.",
      "\"It is more of a symbolic political statement showing Russia's intention to deepen ties with the Taliban government and exchange information on the security front,\" he said.",
      "\"The broader idea is to get a grip on terrorist activities in Afghanistan and neighbouring Central Asian states.",
      "This will be difficult to achieve, given the Taliban's poor track record on fighting terrorism, while radical ideas are flowing into Central Asia not only from Afghanistan, but also from the Middle East.\"",
      "\"Russia's activity in statements about its assistance to the Taliban may actually be part of the political signalling, inviting foreign partners for cooperation and coordination on the situation in Afghanistan.\"",
      "Counter-terrorism is one of many areas of expanding cooperation between Russia and the Taliban.",
      "Following the group's terror delisting in April, the Kremlin said it aims to strengthen trade, business and investment relations with Kabul, leveraging Afghanistan's strategic position for energy and infrastructure projects.",
      "Energy trade forms a key part of those economic ties.",
      "Russia remains the world's second-largest exporter of crude oil, but sanctions imposed by the US and Europe post the 2022 invasion of Ukraine have led it to search for new trade routes and markets in Asia.",
      "Moscow aims for improved trade mobility through its International North-South Transport Corridor (INSTC), a proposed railway route connecting Russia to the Indian Ocean via Iran, but the project is not fully complete.",
      "In the meantime, Russia has said it wants to use Afghanistan as a transit hub for exporting fossil fuels to the booming markets of India and Pakistan through a gas pipeline, as well as other goods through rail routes.",
      "The INSTC currently does not have a southward transport route from Russia.",
      "Opening up a trans-Afghan pathway in the Pakistani direction has been seen as beneficial for Russia amid instability in the Middle East and the involvement of Iran, an important link in the supply chain between India and Russia.",
      "\"In an ideal scenario, Russia's strengthened ties with Kabul could be beneficial for the wider region,\" Mr Zakharov said.",
      "\"The transport corridors that are expected to run through Afghan territory could boost trade between Central and South Asia and provide some of the landlocked countries with access to the Indian Ocean,\" he said.",
      "\"However, any investment into Afghanistan depends on the security situation and stability, which are far from being normal.\"",
      "Mineral development and gas pipeline projects have been floated as possible joint economic ventures to be discussed at a Russia-Afghan business forum later this month in the Russian city of Kazan.",
      "Central Asia, comprised of five former Soviet Republics (and informally Afghanistan), has long been considered as under Russia's sphere of influence, but the Ukraine war has diverted much of its focus away from it.",
      "That distraction has proved opportune for China to expand its \"political clout\", a shift Russia would want to resist, wrote Dr Dawood Azmi for the Caspian Policy Center.",
      "\"While Russia seeks to maintain influence in its traditional sphere of influence, Moscow's entanglement in the Ukrainian quagmire is making it harder for Moscow to dedicate the same amount of resources and attention to this region,\" he said.",
      "Chinese President Xi Jinping (left) and Vladimir Putin share warm relations but are not formal allies.",
      "(Reuters: Sputnik/Mikhail Metzel) Dr Azmi said a Central Asian landscape under diminished Russian reach could see China \"fill the vacuum, mainly due to its geographical proximity and huge economic potential\".",
      "\"As part of its efforts to better secure its geo-political and geo-economic interests, Xi (Jinping)-led Chinese policies in the Central Asia republics … are now also focused on enhancing military cooperation and countering the influence of major powers competing with China for a greater role in the region.\"",
      "That view was backed by a peer-reviewed paper in the Texas National Security Review, which noted indications Moscow was \"perceived as unreliable\" by its Central Asian partners — Kazakhstan, Kyrgyzstan, Uzbekistan, Tajikistan and Turkmenistan — post the Ukraine war, but that even before the 2022 invasion, a cultural distancing from Russia had started taking place.",
      "China stands ready to synergise development strategies with the five Central Asian nations of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan.",
      "\"In this situation, China is poised to supplant Russia as the dominant power and security provider in the region,\" it said.",
      "Beijing's increased involvement in Central Asia since 2022 is evident on many fronts: Chinese President Xi Jinping met with all five Central Asian leaders at the China-Central Asia Summit in May 2023, committing support for their sovereignty and territorial integrity; China's trade with the region increased considerably in 2022-2024 and it overtook Russia as the largest trading partner for every Central Asian country but Turkmenistan; direct Chinese investment in the region exceeded Russia's by mid-2023, reaching $US63.9 billion ($99.4 billion) compared to the latter's $US23.9 billion.",
      "For Taliban-ruled Afghanistan, which by and large remains a global pariah, there is equal reliance on China and Russia to help \"break its international diplomatic isolation\" and attract aid and investment, Dr Azmi said.",
      "\"Given their centuries-old political, economic, and cultural links, a degree of mutual understanding exists between the Central Asian republics and Russia compared to China.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Terrorism Topic:Unrest, Conflict and War Topic:Tourism and Leisure Industry Afghanistan Foreign Affairs Terrorism World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "central asian",
      "central asia",
      "moscow kabul",
      "islamic state",
      "ukraine war",
      "last year",
      "xi jinping",
      "world politics",
      "politics topic",
      "foreign affairs"
    ]
  },
  {
    "title": "Putin, Zelenskyy and Trump aren't going, so will the Russia-Ukraine talks amount to anything?",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-16/ukraine-peace-talks-fizzle-out-in-istanbul/105299844",
    "publishedAt": "2025-05-16T00:55:25Z",
    "sentences": [
      "analysis Topic:War \"Nothing's going to happen until Putin and I get together,\" Donald Trump says.",
      "(Nicolas Maeterlinck/Leah Millis/Mikhail Metzel) As the call to prayer rang out across Istanbul at sundown on Thursday afternoon, the meeting many around the world were waiting for hadn't happened.",
      "However, after a lot of \"I'll go, if he goes\" and \"we won't go, if they won't go,\" there now appears to be some certainty about those who will and won't go to the Russia-Ukraine peace talks, now expected on Friday, local time.",
      "Neither Russian President Vladimir Putin nor his Ukrainian counterpart Volodymyr Zelenskyy will attend.",
      "Instead, they are sending ministers, diplomats, spies, and defence officials.",
      "The question now, is will these talks amount to anything?",
      "The fact they are due to happen at all is significant, because these will be the first direct discussions between Russia and Ukraine in more than three years.",
      "The only previous meeting was also held in Istanbul, just two months after Moscow sent its armies charging into Ukraine.",
      "Last time, Kyiv accused the Kremlin delegation of demanding its surrender instead of seeking to negotiate.",
      "This time, the man who helped lead those discussions for the Russian side will head up its team again — presidential aide, Vladimir Medinsky.",
      "He will be joined by a deputy foreign minister, the director of Russian military intelligence, and other government officials.",
      "The Russian delegation sent for the talks did not include Vladimir Putin or any of his top-level advisors.",
      "(Reuters: Vladimir Soldatkin) Ukraine believes the delegation is not senior enough to deliver the desired result — an immediate and unconditional, 30-day ceasefire.",
      "Mr Medinsky has said his team is prepared to resume the 2022 negotiations and discuss possible compromises.",
      "\"Our official delegation has been appointed by the president's order, and it has all the necessary jurisdictions and powers to negotiate,\" Mr Medinsky said.",
      "When Mr Putin suggested these talks earlier this week after threats of fresh western sanctions, Mr Zelenskyy challenged him to meet in Istanbul face-to-face.",
      "Volodymyr Zelenskyy flew into Istanbul for the talks and met with Turkish President Recep Tayyip Erdoğan.",
      "(Ukrainian Presidential Press Service via Reuters) However, Mr Putin said he wouldn't be going, and that left Mr Zelenskyy with a choice to make — go anyway, or try to match like with like.",
      "He went for the latter approach.",
      "Ukraine's delegation will be led by its defence minister, Rustem Umerov, and include the deputy heads of its intelligence services, the deputy chief of military staff, and the deputy foreign minister.",
      "Mr Umerov is best known for negotiating prisoner exchanges and, like Russia's Mr Medinsky, was part of the delegation in the failed 2022 talks.",
      "Mr Zelenskyy said Mr Putin's decision not to attend in person, but to send what he called a \"decorative\" line-up, showed the Russian leader was not serious about ending the war.",
      "The reality is Mr Putin doesn't care what his Ukrainian counterpart thinks.",
      "For two main reasons.",
      "One, he doesn't like to be dictated to by anyone, let alone a leader he believes he is defeating in a war.",
      "And two, he doesn't recognise Mr Zelenskyy as a president.",
      "Period.",
      "And he therefore doesn't believe he is worthy of negotiating with.",
      "As we waited outside Istanbul's Dolmabahce Palace with the world's media ahead of the proposed peace talks, we spoke to Russia 24 TV anchor Konstantin Churikov.",
      "\"He's not a president,\" Mr Churikov said of Mr Zelenskyy during our interview.",
      "\"He is for a long, long time in power without any elections, so that's a problem.",
      "\"I do not have any idea how President [Putin] can officially meet, as a president, a person who is not a president.",
      "So, it's ridiculous for us.\"",
      "Volodymyr Zelenskyy says Vladimir Putin is \"not serious\" about ending the conflict.",
      "(Reuters: Valentyn Ogirenko) Mr Zelenskyy's first five-year term of office was due to come to an end in May 2024, but Ukraine has been under martial law since Russia's full-scale invasion began, which means elections are suspended.",
      "Russia doesn't accept this.",
      "If a 30-day unconditional ceasefire can't be agreed to during Friday's talks, Mr Zelenskyy has said the West must act.",
      "The US president has cast doubt over the meeting between officials from Kyiv and Moscow producing any significant progress.",
      "\"Russia does not feel that it needs to end the war, which means there is not enough political, economic and other pressure on the Russian Federation,\" he said.",
      "\"And so we ask, if there is no ceasefire, if there are no serious decisions, if there are no bilateral meetings, we ask for appropriate sanctions that will be a stimulus for faster ending of the war.\"",
      "On Tuesday, both French President Emmanuel Macron and new German Chancellor Friedrich Merz spoke of fresh sanctions on Russia in the coming days if Moscow failed to agree to a pause in the fighting.",
      "They mentioned financial services, as well as oil and gas, as possible targets.",
      "Other European nations, such as the United Kingdom and Poland, are also threatening financial penalties, but Russia knows the quickest way to securing sanctions relief will likely be through the United States.",
      "The Kremlin is keen to build a solid relationship with the Trump administration, and has been working hard to improve ties.",
      "Speaking aboard Air Force One on the final day of his Middle East visit on Thursday, US President Donald Trump said he doesn't believe there will be a ceasefire between Russia and Ukraine yet.",
      "\"Nothing's going to happen until Putin and I get together, OK?\"",
      "he told journalists.",
      "\"I don't believe anything's going to happen, whether you like it or not, until he and I get together.\"",
      "The Turkish government is hoping the meeting it hosts between the two sides will be a step towards easing the deep hostility.",
      "But even one step forward is a big ask when both sides have such deep distrust.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:World Politics Foreign Affairs Russian Federation Turkiye Ukraine United States War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr zelenskyy",
      "mr putin",
      "world politics",
      "going happen",
      "get together",
      "wo go",
      "vladimir putin",
      "volodymyr zelenskyy",
      "mr medinsky",
      "said mr"
    ]
  },
  {
    "title": "Russia, Ukraine in first direct peace talks since 2022",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/news/conflict/rubio-suggests-russia-ukraine-talks-at-logjam-c-18709173",
    "publishedAt": "2025-05-15T18:20:27Z",
    "sentences": [
      "Russian and Ukrainian negotiators have met in Istanbul at their first direct peace talks in more than three years, under pressure from US President Donald Trump to end Europe's deadliest conflict since World War II.",
      "Live Turkish television pictures on Friday showed Russian and Ukrainian negotiators holding discussions together with a Turkish delegation.",
      "Turkish Foreign Minister Hakan Fidan was making a speech at the start of the meeting.",
      "The meeting at the Dolmabahce Palace on the Bosphorus marks a rare sign of diplomatic progress between the warring sides, who had not met face-to-face since March 2022, the month after Russia's invasion.",
      "Expectations for a major breakthrough, already low, were dented further on Thursday when Trump said there would be no movement without a meeting between himself and Russia's President Vladimir Putin.",
      "Trump, winding up a Middle East tour and heading back to Washington, said on Friday he would meet the Russian leader \"as soon as we can set it up\".",
      "Setting out Kyiv's priorities, the head of Ukraine's delegation said peace was only possible if Russia agreed to a 30-day ceasefire, the return of abducted Ukrainian children and an exchange of all prisoners of war.",
      "Russia says it wants to end the war by diplomatic means and is ready to discuss a ceasefire.",
      "But it has raised a list of questions and concerns, saying Ukraine could use the pause to rest its forces, mobilise extra troops and acquire more western weapons.",
      "Ukraine and its allies accuse Putin of stalling, and say he is not serious about wanting peace.",
      "It was Putin who proposed the direct talks in Turkey, but he spurned a challenge from Ukrainian President Volodymyr Zelenskiy to meet him there in person.",
      "Instead, he sent a team of mid-level officials, and Ukraine responded by naming negotiators of similar rank.",
      "US Secretary of State Marco Rubio and Trump's Ukraine envoy Keith Kellogg were also in Istanbul, where a flurry of separate meetings took place earlier on Friday.",
      "Rubio told reporters on Thursday night that, based on the level of the negotiating teams, a major breakthrough was unlikely.",
      "\"I hope I'm wrong.",
      "I hope I'm 100 per cent wrong,\" he said.",
      "\"I hope tomorrow the news says they've agreed to a ceasefire; they've agreed to enter serious negotiations.",
      "But I'm just giving you my assessment, honestly.\"",
      "Russia said on Friday it had captured another village in its slow, grinding advance in eastern Ukraine.",
      "Minutes before the start of the Istanbul meeting, Ukrainian media reported an air alert and explosions in the city of Dnipro."
    ],
    "topics": [
      "russian ukrainian",
      "ukrainian negotiators",
      "major breakthrough",
      "said friday",
      "agreed ceasefire",
      "negotiators met",
      "met istanbul",
      "istanbul first",
      "first direct",
      "direct peace"
    ]
  },
  {
    "title": "Putin dodges peace talks in Istanbul as Russia pushes for territorial concessions from Ukraine",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/putin-dodges-peace-talks-in-istanbul-as-russia-pushes-for-territorial-concessions-from-ukraine-256504",
    "publishedAt": "2025-05-14T14:00:00Z",
    "sentences": [
      "Commissioning Editor, International Affairs View all partners This article was first published in The Conversation UK’s World Affairs Briefing email newsletter.",
      "Sign up to receive weekly analysis of the latest developments in international relations, direct to your inbox.",
      "Demands by British, French, German and Polish leaders in Kyiv last weekend that Russia agree to a 30-day ceasefire in Ukraine or face possible “massive” sanctions went down in Moscow about as well as you’d expect.",
      "In an address from the Kremlin, Russian president Vladimir Putin lambasted European powers for talking to Russia “in a boorish manner and with the help of ultimatums”.",
      "He did, however, offer a counter-proposal: an invitation for Ukraine to take part in direct talks in the Turkish city of Istanbul.",
      "Putin called the talks “the first step towards a long-term, lasting peace”.",
      "Ukraine’s president, Volodymyr Zelensky, accepted the invitation and announced he would attend the talks in person.",
      "He challenged Putin to do the same.",
      "But on the eve of the talks it was announced that, no, Putin wouldn’t attend and a junior delegation would be sent in his place.",
      "Zelensky, who is in Turkey anyway for talks with the Turkish president, Recep Tayyip Erdoğan, has called the Russian envoy “phony” and accused Moscow of sending “stand-in props”.",
      "Putin’s no-show, alongside Russia’s refusal to agree to a ceasefire as a precursor to negotiations, probably says all you need to know about whether Moscow truly intends to bring the war to an end.",
      "But, regardless, the talks are the first to take place directly between the two warring parties since the early weeks of Russia’s full-scale invasion.",
      "Sign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK.",
      "Every Thursday we’ll bring you expert analysis of the big stories in international relations.",
      "The Russian delegation in Istanbul is being led by Vladimir Medinsky, a Putin aide who led the previous round of direct peace talks with Ukraine.",
      "This is evidence, as Stefan Wolff and Tetyana Malyarenko also point out, that Russia wants the talks to be based on the same framework as in 2022 – namely, forcing Ukraine to accept significant restrictions on its military and sovereignty.",
      "Wolff and Malyarenko, who are two regular contributors to our coverage of the war in Ukraine, explain that Russia’s territorial demands have become more contentious since the start of the war.",
      "Russia’s current position is that it sees international recognition of Crimea, Sevastopol, the Donetsk and Luhansk People’s Republics, and the Kherson and Zaporizhzhia regions as part of Russia as “imperative”.",
      "This is a non-starter for Ukraine.",
      "But Wolff and Malyarenko suggest there could be some flexibility on accepting that some parts of Ukrainian territory are under temporary Russian control in exchange for peace.",
      "The problem, they write, is that much of the territory Russia currently occupies, including Crimea and land on the shores of the Azov Sea, is of key strategic value for Russia.",
      "Donetsk and Luhansk, meanwhile, have substantial economic value because of the resources located there.",
      "In any case, there is no guarantee that territorial concessions from Kyiv now would put a permanent end to the war, write Wolff and Malyarenko.",
      "This is because it “does not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorstep”.",
      "Read more: Territorial concessions will be central to any Ukraine peace deal, and to Russia's long-term plan Lasting peace between India and Pakistan, two countries that regularly clash over control of the disputed Kashmir region, is proving equally tricky to find.",
      "Several rounds of military strikes, prompted by a terrorist attack in Indian-administered Kashmir in April that killed at least 31 people, have recently brought the nuclear powers closer to war than they have been in decades.",
      "The Trump administration initially expressed reluctance to get involved, saying it was “none of our business”.",
      "But as hostilities rapidly escalated, raising the prospect of nuclear war, US officials stepped in and talked down the two countries.",
      "A ceasefire was agreed that, for almost a week now, seems to have held.",
      "Alex Waterman and Sudhir Selvaraj, experts on peace studies at the University of Bradford, say the ceasefire represents an “incredibly precarious peace”.",
      "That ceasefires have been agreed – and respected – by the two parties before is cause for optimism, they write.",
      "But cross-border tensions have increased in recent years.",
      "Waterman and Selvaraj argue this has been part of a strategy used by Pakistan’s powerful army to deflect attention away from political and economic crises at home.",
      "Tensions remain high and may, at some point, spill over again.",
      "Some of the decisions taken by India after the recent terror attack, for instance, such as the suspension of a treaty governing water sharing of rivers in the Indus basin, could compel further support for militant groups in Kashmir.",
      "Despite a US offer to mediate talks between the two countries, deeper resolution looks a way off.",
      "Read more: India and Pakistan have agreed a precarious peace – but will it last?",
      "Donald Trump, meanwhile, is wrapping up his four-day tour of the Middle East.",
      "His visit has seen him sit down with the Saudi crown prince and the Qatari emir (as well as Syria’s leader, Ahmed al-Sharaa) to discuss bolstering economic and security ties.",
      "In that sense, the trip has been a resounding success.",
      "Trump signed a US$142 billion (£107 billion) arms deal with Saudi Arabia and agreements with Qatar that, according to the White House, will “generate an economic exchange worth at least US$1.2 trillion”.",
      "Adam Hanieh, a professor of political economy at the University of Exeter, explains that arrangements like these are part of a long history in which the Gulf monarchies have supported the architecture of US global power.",
      "In this piece, Hanieh explores how the vast amounts of income generated by the Gulf’s nationalised petroleum industries in the 20th century was invested into US financial markets.",
      "Gulf states, he writes, were essential contributors to the growth of the US as a global financial power.",
      "The US promised military protection in return, resulting in a web of American military bases across the region.",
      "As Trump’s lavish welcome in the Middle East shows, the relationship between the US and Gulf monarchies looks robust.",
      "But much has changed in the past two decades, says Hanieh, referring to China’s rise as a global manufacturing hub.",
      "The Gulf is a critical energy lifeline for Beijing, while China’s demand for oil, gas and petrochemicals will be a vital part of the Gulf’s economic future.",
      "Read more: Not every US president gets a free private jet, but the Gulf states have boosted US economic dominance for decades Trump is no stranger to competition with China, as his first five months in office have shown.",
      "Tit-for-tat tariffs that the US and China imposed on each other quickly snowballed into heavy duties, as high as 145% on Chinese goods looking to enter the US.",
      "However, after weeks of signalling that tariff levels could reduce, US and Chinese officials announced this week that US tariffs on Chinese goods would drop to 30% for a period of 90 days, while Chinese tariffs on US products would drop back to 10%.",
      "Trade negotiations between the two countries will continue.",
      "We asked Chee Meng Tan, an assistant professor of business economics at the University of Nottingham, what the deal means for China.",
      "He says the tariff reduction has provided China with much-needed relief as it attempts to repair its ailing economy.",
      "But China will ultimately hope to bring US tariffs down to around 10%, in line with the rest of the world.",
      "And, as Tan explains, there is more China can do to persuade the Trump administration to cut tariffs further.",
      "Ensuring the flow of critical minerals to the US and assuring its support for US agriculture, an important political support base for Trump, will be key.",
      "China needs to engage with the US and lower US tariffs as much as possible.",
      "But it will want to look at other options, writes Tan, rather than relying on an unpredictable Trump.",
      "The next 90 days are a big deal for Beijing.",
      "Read more: China-US trade war: the next 90 days are a big deal for Beijing as it seeks long-term solutions Jonathan Este is on holiday.",
      "World Affairs Briefing from The Conversation UK is available as a weekly email newsletter.",
      "Click here to get updates directly in your inbox."
    ],
    "topics": [
      "two countries",
      "conversation uk",
      "world affairs",
      "affairs briefing",
      "wolff malyarenko",
      "us tariffs",
      "90 days",
      "email newsletter",
      "sign receive",
      "receive weekly"
    ]
  },
  {
    "title": "Australian feared killed while fighting Russia in Ukraine",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/australian-feared-killed-while-fighting-russia-in-ukraine-c-18691706",
    "publishedAt": "2025-05-14T06:34:47Z",
    "sentences": [
      "The family of a young Australian feared killed while fighting in Ukraine against Russia hold hope he will be found alive.",
      "There are grave concerns for Caleb List, 25, who is missing in the country’s eastern Kharkiv region.",
      "WATCH THE VIDEO ABOVE: Australian man feared dead in war-torn Ukraine.",
      "Know the news with the 7NEWS app: Download today List had volunteered with Ukraine’s foreign legion, and military sources believe he may have been killed by artillery fire near the city of Izyum in April, the ABC reports.",
      "His remains have not been recovered and his death has not been confirmed.",
      "“There’s a number of scenarios so while there’s still those possibilities we’ll hold out hope that he’ll come home to us and we’ll be able to get him home and keep him home,” List’s uncle Michael Connolly told 7NEWS.",
      "He added: “I know Caleb and I know he’s a fairly clever young lad.",
      "If he (had a chance to get) out of that situation, well and truly, he would have gotten out of it.” 7NEWS.com.au understands the Department of Foreign Affairs and Trade (DFAT) is providing consular assistance to the fighter’s family, but it has declined to comment on specific cases.",
      "“(DFAT) is aware of people attempting to travel to fight in the war and a small number of Australians reported as missing or deceased in Ukraine,” a department spokesperson said.",
      "The Australian government has again warned citizens not to travel to the region.",
      "“We all condemn Russia’s illegal and immoral invasion but it is not for Australians to travel to Ukraine to fight,” Foreign Minister Penny Wong said.",
      "Speaking in Perth on Wednesday, Prime Minister Anthony Albanese described the reports surrounding List as “deeply troubling”.",
      "“My heart goes out to the family and loved ones of the gentleman concerned,” he said.",
      "“There is a travel warning in place for a reason.",
      "Australians should not be travelling to Ukraine.",
      "“It is dangerous and people should follow that advice.” List, a former labourer from Queensland, travelled to Ukraine three years ago to fight against Russia’s invasion.",
      "In a 2024 interview with German broadcaster Deutsche Welle, List said he “wanted to push myself to the extreme”.",
      "“I’ve basically done that and now I just do this because it’s the only thing I’m really good at,” he said.",
      "In 2023, he told the SBS his parents were “quite proud of me” and “happy that I’m happy”.",
      "“You can die anywhere.",
      "It’s less likely in Gladstone … but I could also breathe enough coal dust to get black lung,” he said.",
      "“At the end of the day I’m just a mercenary and I’m just a soldier of fortune.",
      "“I’m just looking for an experience and enjoyment and something to get me through life, because in Australia I didn’t really have much going for me.” He said he had been interested in the army but that he had been rejected by Australia’s Defence Force.",
      "“He was always wanting to be in the military so his wanting to be a soldier probably outweighed his desire for anything else,” his uncle said.",
      "List was most recently in Australia about six months ago and was described as “the Caleb that we always knew”.",
      "“He wasn’t affected by the warzone... well if he was he kept it to himself,” Connolly said.",
      "List’s family were worried about his safety in Ukraine but knew he “wanted to make a difference and he wanted to help” “I would like people not to judge him harshly because he didn’t go over (to Ukraine) with an agenda,” Connolly said.",
      "It comes after confirmation Australian Nick Parson died while working for a landmine clearing charity, also in Izyum.",
      "It is not known exactly what happened, but he was working with UK-based charity Prevail Together as a bomb disposal expert at the time.",
      "Parsons was among three people critically injured, including Prevail’s British co-founder, Chris Garrett, who died from his injuries.",
      "Albanese this week offered his “deepest condolences and sympathies” to the Australian’s family.",
      "“I can confirm he wasn’t a participant in the conflict.",
      "He was volunteering with a humanitarian organisation and so I do want to remind Australians that Ukraine is a do-not-travel zone,” Albanese said.",
      "“The situation is extremely dangerous and we continue to strongly advise all Australians not to travel to Ukraine under any circumstances.” Queenslander Jed William Danahay was killed by Russian forces in Izyum in 2022 while working as a combat medic helping injured frontline troops.",
      "Meanwhile, Ukraine leader Volodymyr Zelenskyy insists he will attend a meeting with Russia if Vladimir Putin is there.",
      "Zelenskyy said he wants to negotiate an unconditional 30-day ceasefire as the first step towards ending the war.",
      "The Kremlin has yet to confirm if Putin will take part in the talks expected to take place in Istanbul on Thursday.",
      "2 min read 2 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "2 min",
      "read 2",
      "1 min",
      "read 1",
      "read 0",
      "0 min",
      "hold hope",
      "australians travel",
      "travel ukraine"
    ]
  },
  {
    "title": "Could Australia learn about prepardness from Finland, the prepper nation of the Nordics?",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-14/could-finland-prepper-mindset-be-a-role-model-for-australia/105245186",
    "publishedAt": "2025-05-13T21:00:00Z",
    "sentences": [
      "ABC Radio National Topic:National Security Finland's self-reliance and disaster preparedness could offer lessons for other countries.",
      "(Getty: Leon Neal) Cheerful and alert don't seem like characteristics that go hand in hand.",
      "But in Finland, they do.",
      "Often ranked as one of the happiest places in the world, the country is also known by another title, as the \"prepper nation of the Nordics\".",
      "During the Cold War era, Finland built up stockpiles of medical and military equipment as well as fuel and food — and never stopped.",
      "Rear Vision puts contemporary events in their historical context, answering the question: \"How did it come to this?\"",
      "This level of planning served the country well in 2020 when Finland's Nordic counterparts, and many other nations, were grappling with supply shortages during the COVID-19 pandemic.",
      "With personal protective equipment in high demand, the Finnish government dipped into its massive stockpile and, despite a temporary setback with out-of-date PPE, kept calm and carried on.",
      "Locals say preparedness is in Finland's DNA, a necessary skill to have in a country that shares a border with Russia.",
      "But experts credit the nation's preparedness and self-reliance to a few key factors: collective responsibility; conscription and national defence courses; and massive stockpiles.",
      "So could Australia learn something from Finland's preparedness?",
      "And would it help us better prepare for a shifting global climate?",
      "Towards the end of last year, Finland joined its Scandinavian neighbours (Sweden, Denmark and Norway) in better preparing its citizens for confronting a global security environment that has become more unpredictable.",
      "US President Donald Trump's shift to an America-first position, the war in Ukraine and the Middle East, the rapid expansion of artificial intelligence and hybrid threats have changed the world as we know it.",
      "Firefighters work at the site of a Russian missile strike in central Sumy, Ukraine in April 2025.",
      "(Reuters: Press service of the State Emergency Service of Ukraine/Handout) Under this shadow, the Nordic nation published a consolidated online version of its crisis preparedness in November, with the aim of ensuring the entire population knew what to do in case of an \"incident\".",
      "The umbrella term covers short-term events such as long power cuts and water outages to longer-term crises, including pandemics or military conflicts.",
      "Europeans have been given similar guidance in recent months.",
      "Russia isn't referenced in the online version but its invasion of Ukraine in 2022 likely played a hand in the update.",
      "Finland was once seen as a Cold War-era meeting point between East and West, but it has turned more westward in recent decades as Moscow has flexed its military might.",
      "The pivot prompted Finland to join the European Union in 1995, adopt the Euro in 1999 and, more recently, sign onto the NATO alliance.",
      "\"The entire modern history of independent Finland was shaped by wartime experience [with Russia],\" Professor Rory Medcalf, head of the national security college at the Australian National University, tells ABC Radio National's Rear Vision.",
      "Finland became part of the Russian empire in 1809 and declared independence a century later in 1917, not long after the Bolsheviks overthrew the Russian royal family, the Romanovs, to form the Soviet Union.",
      "In 1939, the Soviet Union invaded its neighbour, triggering a brutal conflict, known as the Winter War of 1939-1940, that helped shape Finland's preparedness and security mindset, Professor Medcalf says.",
      "The much \"smaller Finnish military fought the Soviets effectively to a standstill\", he adds, without much material support from the rest of the world.",
      "A Finnish Maxim M-32 machine gun nest during the Winter War.",
      "(Wikimedia Commons) Finland ceded some of its territory when the two nations signed a treaty in 1940, but citizens left the battlefield with greater confidence in the country's ability to defend itself.",
      "\"In lots of ways, the Winter War brought the country together.",
      "This experience of a common existential threat galvanised the society to fight together,\" says Christian Fjäder, managing director of Geostrategic Intelligence Group in Finland.",
      "The Finns had to walk a delicate tightrope to maintain their independence after World War II.",
      "Finland was forced to sign a treaty which, in practice, gave the Soviets the right to control part of their foreign policy and became the basis for \"Finlandisation\".",
      "Until the end of the Cold War, political leaders simultaneously appeased their neighbour while marshalling every part of Finnish society for their security, just as they had during the Winter War.",
      "They called the latter policy \"total defence\".",
      "\"'Total defence' was effectively Finland building the ability for very powerful territorial defence against the Soviet Union if, as they feared, the model of compromise would break down and the Soviets would invade,\" Professor Medcalf says.",
      "After World War II, Finland maintained a conscription army but stayed outside military alliances, until it joined NATO in April.",
      "(Supplied: Puolustusvoimat/Finnish Defence Forces) Total defence involved a combination of state power and civilian resources.",
      "Security was therefore seen as a shared responsibility involving all parts of society — from government and the private sector to smaller organisations and individual citizens.",
      "Everyone had a role to play.",
      "In the early 2000s, Finland's approach to total defence evolved into a new doctrine: \"comprehensive security\".",
      "Professor Medcalf says this was because the former relied \"very heavily on traditional military defence against a foreign aggressor at the border\".",
      "Comprehensive security, on the other hand, still incorporated a \"whole of society attitude that everyone is involved in security\", former Finland president Sauli Niinistö says, but it looks at threats beyond military ones.",
      "Dr Karl knows the best app for free podcasts, radio, music, news and audiobooks … and you don't need to be a scientist to find it!",
      "\"We [now] have a lot of different challenges and threats, from viruses to the consequences of climate change.",
      "And the fact is that whatever the threat is, the answer is quite similar: [We] have to guarantee that people have food, water, energy, security, and that logistics are working.",
      "And that makes it a very collective thing,\" he says.",
      "\"It's important to understand that we are not living in silos, that we have to be able to cooperate.\"",
      "Professor Medcalf, who has researched and written about Finland's preparedness, describes comprehensive security as a \"virtuous circle\" where citizens recognise they must contribute to national security and resilience to enable society to continue functioning as it should.",
      "\"Importantly, it [is] about building quite a strong political consensus across what is actually a very lively multi-party democracy,\" he adds.",
      "A key aspect of Finland's approach to cooperation is universal male conscription.",
      "All Finnish men above 18 are obligated to participate in national defence and depending on the training, service lasts 165, 255 or 347 days.",
      "Women have the option to apply for military service on a voluntary basis.",
      "While mandatory service is still in place in some European countries, Finland is something of an outlier when it comes to this position and its \"extraordinary level of preparedness,\" Professor Medcalf says.",
      "Finland's experience living next to Russia has helped inform its national disaster preparedness.",
      "(Reuters: Essi Lehto) \"When most of the rest of the world and certainly most of Europe began to celebrate the peace dividend [at the end of the Cold War] and effectively rapidly disarm, Finland maintained [total defence],\" he says.",
      "Mr Niinistö explains that this attitude was again shaped by local history and a \"Finnish mindset\".",
      "\"I could describe my own attitude at the time I made my conscription — and it still is — it's a question of honour in a way, not an obligation, but a question of honour.",
      "You have to serve your country,\" he says.",
      "A series of national defence courses designed specifically for corporate and civic leaders is another example of Finland's comprehensive efforts to prepare for future emergencies.",
      "The three-and-a-half week residential course teaches citizens about national security, potential threats and the role of the government in a disaster.",
      "It is run by the Finnish Defence Force and has become an \"important and popular aspect of comprehensive defence in Finland,\" says Elisabeth Braw, a senior fellow with the Atlantic Council and author of Globalisation: The Return of a Divided World and the upcoming Undersea War.",
      "Finland's inclusion in EU membership was seen as a sign it aligned itself with Western Europe politically while remaining militarily neutral.",
      "(AP: Heikki Saukkomaa) \"It's set up for rising members of any organisation in the country.",
      "So you may be between 30 and 50 when you take this course and being selected for it is incredibly prestigious,\" she says.",
      "\"So what you have is an elite within Finnish society, from academia all the way to government agencies, the private sector and so forth, who understand national security … as a result of attending this course.",
      "\"[Those who participate] obviously form contacts and friendships with leaders from all these other sectors, which again, helps the country … it's a brilliant idea.\"",
      "Finns say the benefit of national defence service and special courses is that it creates security awareness beyond the military.",
      "Those who have done the courses can be \"switched on\" in the event of an emergency, despite having spent most of their careers in the private sector.",
      "Stockpiling essential goods, whether that be as a business or an individual, is another tool in Finland's toolbox of preparedness.",
      "Households are expected to have enough water, food and medicine for at least 72 hours, while businesses are required to maintain even larger stockpiles of essential items.",
      "\"Preparing allows you to be ready for various incidents,\" says Finland's official online version of its crisis preparedness.",
      "(Reuters: Lehtikuva) Importers or manufacturers of medicines in Finland are obligated to maintain stock that is roughly equivalent to 3-10 months of normal consumption for the emergency supply.",
      "Meanwhile, stockpiles of important fuels equal about five months' average consumption to provide \"additional time if there's a disruption\", Dr Fjäder says.",
      "\"Stockpiling is a big element in the Finnish resilience systems,\" he says.",
      "The national stockpile has been built up over years and, along with pharmaceuticals and fuel, it includes grains, production parts and critical chemicals.",
      "It is overseen by Finland's government-funded National Emergency Supply Agency (NESA), which is responsible for ensuring that stockpiles are available and activated in a crisis.",
      "Mr Niinistö was asked by the European Union to report on how Finland's approach to security might work across the continent.",
      "Mr Niinistö says Europe needs to learn to be proactive about threats.",
      "(Reuters: Johanna Geron) He says one of the key takeaways from this model is that being proactive means you have to \"develop your capabilities\".",
      "\"I think that we in Europe have been living since World War II, or at least after the Cold War ended, in a world where we have thought that security [is] self-evident, it's [taken] for granted, you don't have to care about that.",
      "But now things have changed and we have to learn to be proactive,\" he says.",
      "As for whether Finland's level of preparedness could be adopted in Australia, Professor Medcalf says he doesn't think the way forward is a \"wholesale copying of the template or transferring of all the elements of the Finnish model\".",
      "But he says there are some elements that \"can and should be looked at\" given the range of potential risks on the horizon.",
      "\"For example, if there were to be a war elsewhere in our region that we were not deeply involved in, but which effectively broke the maritime supply lines to Australia, suddenly flows of energy and imports and exports [would all stop],\" he says.",
      "\"Imagine what this country would be like if we ran out of fuel, which we could easily do within about two weeks in a crisis.",
      "So it's worth, I think, looking at a model like Finland and [asking], well, what can we pick and choose?\"",
      "Part of that process will likely involve identifying points of difference between Australian and European attitudes, particularly on issues like mandatory service.",
      "\"[In the European democracies] that either have national service or have had it or are bringing it back, [conscription] is seen very differently in those countries.",
      "It is very much about homeland defence, and in many cases, it's about non-military civil defence,\" Professor Medcalf says.",
      "\"Anyone who is called up for conscription has the option of choosing a civilian role, whether it's in, for example, hospitals or other areas of social service.",
      "\"That seems to be a healthy starting point for a conversation in Australia about what is obviously an intensely sensitive subject.\"",
      "Professor Medcalf says preparedness ultimately comes down to people because they are \"the one capability that we really cannot substitute\".",
      "\"In a way, the strength of a nation's robustness and security is the quality of its people and their willingness to contribute,\" he says.",
      "\"It doesn't matter how powerful a submarine fleet or an air force we may or may not have one day, if you have a population that effectively says, 'we're not interested in risk and responsibility to protect the things that we enjoy [as] part of this society', then you've effectively surrendered all of that other capability.\"",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Happiness Topic:Marine Incidents Topic:Child Care Australia Finland Globalisation - Society Government National Security Russian Federation Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "professor medcalf",
      "medcalf says",
      "national security",
      "cold war",
      "national defence",
      "winter war",
      "total defence",
      "finland preparedness",
      "online version",
      "soviet union"
    ]
  },
  {
    "title": "Territorial concessions will be central to any Ukraine peace deal, and to Russia’s long-term plan",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/territorial-concessions-will-be-central-to-any-ukraine-peace-deal-and-to-russias-long-term-plan-256347",
    "publishedAt": "2025-05-13T14:00:00Z",
    "sentences": [
      "Professor of International Security, University of Birmingham Professor of International Security, Jean Monnet Professor of European Security, National University Odesa Law Academy Stefan Wolff is a past recipient of grant funding from the Natural Environment Research Council of the UK, the United States Institute of Peace, the Economic and Social Research Council of the UK, the British Academy, the NATO Science for Peace Programme, the EU Framework Programmes 6 and 7 and Horizon 2020, as well as the EU's Jean Monnet Programme.",
      "He is a Trustee and Honorary Treasurer of the Political Studies Association of the UK and a Senior Research Fellow at the Foreign Policy Centre in London.",
      "Tetyana Malyarenko does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Birmingham provides funding as a founding partner of The Conversation UK.",
      "View all partners If the Ukrainian president, Volodymyr Zelensky, and his Russian counterpart, Vladimir Putin, meet in Istanbul on May 15, territory – and who controls it – will be high on their agenda.",
      "Putin offered to start direct talks between Russia and Ukraine at a press conference on May 11.",
      "Donald Trump pushed Zelensky to accept this offer in a social media post, saying that “Ukraine should agree to this, IMMEDIATELY.” The Ukrainian president, still buoyed by a meeting with the British, French, German and Polish leaders that called for an unconditional 30-day ceasefire, agreed shortly afterwards.",
      "Russia has said it wants to focus on the Istanbul communique of March 2022 and a subsequent draft agreement that was negotiated, but never adopted, by the two sides in April 2022.",
      "Get your news from actual experts, straight to your inbox.",
      "Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.",
      "These 2022 negotiations focused on Ukraine becoming a permanently neutral state and on which nations would provide security guarantees for any deal.",
      "They also relegated discussions over Crimea to separate negotiations with a ten-to-15-year timeframe.",
      "Russia uses the phrase “the current situation on the ground” as thinly disguised code for territorial questions that have become more contentious over the past three years.",
      "This relates to Russian gains on the battlefield and the illegal annexation of four Ukrainian regions in September 2022 (in addition to Crimea, which Russia also illegally annexed in 2014).",
      "Russia’s position, as articulated recently by the country’s foreign minister, Sergey Lavrov, is that “the international recognition of Crimea, Sevastopol, the DPR, the LPR, the Kherson and Zaporozhye regions as part of Russia is … imperative”.",
      "This is clearly a non-starter for Ukraine, as repeatedly stated by Zelensky.",
      "There could, however, be some flexibility on accepting that some parts of sovereign Ukrainian territory are under temporary Russian control.",
      "This has been suggested by both Trump’s Ukraine envoy, Keith Kellogg, and Kyiv’s mayor, Vitali Klitschko.",
      "The territories that Russia currently occupies, and claims, in Ukraine have varying strategic, economic and symbolic value for Moscow and Kyiv.",
      "The areas with the greatest strategic value include Crimea and the territories on the shores of the Azov Sea, which provide Russia with a land corridor to Crimea.",
      "The international recognition of Crimea as part of Russia, as apparently suggested under the terms of an agreement hashed out by Putin and Trump’s envoy Steve Witkoff, could expand the areas of the Black Sea that Russia can claim to legally control.",
      "This could then be used by the Kremlin as a launchpad for renewed attacks on Ukraine and to threaten Nato’s eastern maritime flank in Romania and Bulgaria.",
      "Any permanent recognition of Russia’s control of these territories is, therefore, unacceptable to Ukraine and its European partners.",
      "Read more: Russia-China ties on full display on Victory Day – but all is not as well as Putin is making out Donetsk and Luhansk are of lower strategic value, compared with Crimea and the Kherson and Zaporizhzhia regions.",
      "However, they do have economic value because of the substantial resources located there.",
      "These include some of the mineral and other resources that were the subject of a separate deal which the US and Ukraine concluded on April 30.",
      "They also include Europe’s largest nuclear power plant in Zaporizhzhia and a large labour force among their estimated population of between 4.5 million to 5.5 million people who will be critical to Ukraine’s post-war reconstruction.",
      "Beyond the strategic and economic value of the illegally occupied territories, the symbolism that both sides attach to their control is the most significant obstacle to any deal, given how irreconcilable Moscow’s and Kyiv’s positions are.",
      "For both sides, control of these territories, or loss thereof, is what defines victory or defeat in the war.",
      "Putin may be able to claim that some territorial gains in Ukraine since the start of the full-scale invasion in February 2022 are a victory for Russia.",
      "But even for him any compromise that would see Russia give up territory that it has conquered – often at exceptionally high cost – would be a risky gamble for the stability of his regime.",
      "Anything less than the complete restoration of the country’s territorial integrity in its 1991 borders would imply recognition of defeat in the war for Ukraine.",
      "This would critically threaten the stability of the Zelensky government, whose political programme rests on exactly the premise of a return to the 1991 borders.",
      "As a result, the Ukrainian leadership has become hostage to its own information strategy, which has placed the “return of all territories” at the top of the criteria for victory.",
      "This is a goal widely shared among Ukrainians, according to a poll conducted by the Razumkov Center in March 2025.",
      "But it will be hard to achieve.",
      "Read more: US-Ukraine minerals deal looks better for Kyiv than expected – but Trump is an unpredictable partner Apart from the potential domestic fall-out from any territorial compromises that Ukraine may be forced to make, there is another reason why the territorial question has become so intractable.",
      "Beyond any strategic, economic and symbolic value that the occupied Ukrainian territories hold from the Kremlin’s perspective, control over territory has always been an instrument for Russia to pursue its broader geopolitical agenda of exercising influence over its neighbours – from Moldova, to Georgia, Armenia and Ukraine.",
      "It is also important to remember that Russia’s territorial claims in Ukraine have gradually expanded since 2014.",
      "Until September 2022, when it annexed the other four regions, Russia laid claim to Crimea only.",
      "There is no guarantee that any territorial concession from Kyiv now would put a permanent end to Moscow’s territorial expansionism.",
      "It is therefore worrying that Trump envoy Witkoff, in an interview with the Breitbart news website, reiterated the US view that the two sides need to find compromises on who controls which territories.",
      "Russia’s aggression against Ukraine was not a war over territory as such, but was part of Moscow’s agenda to restore the sphere of influence that it lost at the end of the cold war.",
      "This agenda is far from finished.",
      "The strategy of both Moscow and Washington to focus on territorial consequences may lead to a ceasefire.",
      "But it will not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorsteps."
    ],
    "topics": [
      "strategic economic",
      "professor international",
      "international security",
      "university birmingham",
      "jean monnet",
      "research council",
      "council uk",
      "conversation uk",
      "ukrainian president",
      "two sides"
    ]
  },
  {
    "title": "International Civil Aviation Organization rules Russia downed flight MH17 in 2014",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-13/russia-responsible-for-downing-of-flight-mh17/105285364",
    "publishedAt": "2025-05-12T23:31:21Z",
    "sentences": [
      "Topic:Air Incidents Wreckage from MH17 was spread across 50 square kilometres.",
      "The International Civil Aviation Organization (ICAO) council has ruled that Russia was responsible for the downing of a Malaysian airliner over Ukraine in 2014.",
      "It found that Russia breached the prohibition under international law on the use of weapons against civil aircraft in flight and is responsible for the loss of 298 innocent lives.",
      "Australia and the Netherlands want the ICAO council to order Russia to enter into negotiations over reparations.",
      "The International Civil Aviation Organization (ICAO) council has ruled that Russia was responsible for the downing of a Malaysian airliner over Ukraine that killed all 298 people on board, including 38 Australians citizens or residents.",
      "The council found that Russia breached the prohibition under international law on the use of weapons against civil aircraft in flight and is responsible for the loss of life.",
      "Read more about the 38 Australian citizens and residents killed in the attack on flight MH17.",
      "Malaysian Airlines Flight MH17 departed from Amsterdam for Kuala Lumpur on July 17, 2014, and was shot down over eastern Ukraine as fighting raged between pro-Russian separatists and Ukrainian forces.",
      "In November 2022, Dutch judges convicted two Russian men and a Ukrainian man in absentia of murder for their role in the attack.",
      "Moscow called the ruling \"scandalous\" and said it would not extradite its citizens.",
      "The case with the ICAO was launched in 2022 by Australia and the Netherlands.",
      "Both governments said the council would in the coming weeks consider what form of reparation was in order.",
      "An emergency worker looks at the mangled wreckage of the Malaysia Airlines flight MH17 plane that crashed in the Donetsk region of Ukraine.",
      "(Reuters: Maxim Zmeyev) Australia Foreign Minister Penny Wong said the government welcomed the decision and urged ICAO to move swiftly to determine remedies.",
      "\"This is a historic moment in the pursuit of truth, justice and accountability for the victims of the downing of Flight MH17, and their families and loved ones,\" she said in a statement.",
      "\"We call upon Russia to finally face up to its responsibility for this horrific act of violence and make reparations for its egregious conduct, as required under international law.",
      "\"Our thoughts remain with those who lost their lives as a result of Russia's actions, their families and loved ones.\"",
      "Dutch Foreign Minister Caspar Veldkamp wants the ICAO council to order Russia to enter into negotiations over reparations.",
      "\"The decision is an important step towards establishing the truth and achieving justice and accountability for all victims of Flight MH17, and their families and loved ones,\" he said.",
      "\"This decision also sends a clear message to the international community: states cannot violate international law with impunity.\"",
      "ICAO lacks regulatory power but holds moral suasion and sets global aviation standards overwhelmingly adopted by its 193-member states.",
      "ABC/Reuters Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Explainer Topic:Air Incidents Topic:Disasters, Accidents and Emergency Incidents Air Incidents Australia Law, Crime and Justice Netherlands Russian Federation Ukraine World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "flight mh17",
      "icao council",
      "international law",
      "air incidents",
      "families loved",
      "loved ones",
      "world politics",
      "politics topic",
      "topic air",
      "international civil"
    ]
  },
  {
    "title": "MH17: International Civil Aviation Organisation finds Russia responsible for downing Malaysia Airlines flight",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/news/australia/mh17-international-civil-aviation-organisation-finds-russia-responsible-for-downing-malaysia-airlines-flight-c-18672356",
    "publishedAt": "2025-05-12T20:49:26Z",
    "sentences": [
      "The International Civil Aviation Organisation (ICAO) has issued a historic ruling, finding Russia responsible for downing Malaysian Airlines Flight MH17 which killed 298 people, including Australians.",
      "MH17, scheduled to fly from Amsterdam to Kuala Lumpur on 17 July 2014 was shot down by a surface-to-air missile while flying over eastern Ukraine.",
      "Of the 283 passengers and 15 crew, there were no survivors.",
      "“This is a historic moment in the pursuit of truth, justice and accountability for the victims of the downing of Flight MH17, and their families and loved ones,” Foreign Minister Penny Wong said.",
      "“The ICAO Council found that Russia breached the prohibition under international law on the use of weapons against civil aircraft in flight and is responsible for the loss of 298 innocent lives, including 38 who called Australia home.” Senator Wong said the Government “welcomes the ICAO Council’s decision”, highlighting that the “fundamental principle that weapons should not be used again civil aircraft” had been upheld, but the group to “move swiftly to determine remedies for this violation.” “We call upon Russia to finally face up to its responsibility for this horrific act of violence and make reparations for its egregious conduct, as required under international law.” Senator Wong offered the Government’s thoughts to those impacted by the tragedy,.",
      "“Our thoughts remain with those who lost their lives as a result of Russia’s actions, their families and loved ones,” she said.",
      "“While we cannot take away the grief of those left behind, we will continue to stand with them in that grief and pursue justice for this horrific act.”"
    ],
    "topics": [
      "flight mh17",
      "families loved",
      "loved ones",
      "wong said",
      "icao council",
      "civil aircraft",
      "senator wong",
      "horrific act",
      "international civil",
      "civil aviation"
    ]
  },
  {
    "title": "Ukraine's Zelenskiy wants face-to-face talks with Putin",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/news/conflict/putin-serious-on-talks-ukraine-says-he-ignores-truce-c-18671323",
    "publishedAt": "2025-05-12T17:24:44Z",
    "sentences": [
      "President Volodymyr Zelenskiy will only attend talks on Ukraine if Russia's Vladimir Putin is also there, the Ukrainian leader's top aide says, challenging the Kremlin to show it is genuine about seeking peace.",
      "US President Donald Trump has offered to attend Thursday's proposed meeting in Istanbul, which has become the focus of his attempts to end the deadliest conflict in Europe since World War II.",
      "Putin has yet to say if he will take part.",
      "Both Russia and Ukraine have sought to show they are working towards peace after Trump prioritised ending the war, but they have yet to agree any clear path.",
      "Putin on Sunday proposed direct talks with Ukraine after ignoring a Ukrainian proposal for an unconditional 30-day ceasefire.",
      "Trump then publicly told Zelenskiy to accept.",
      "\"President Zelenskiy will not meet with any other Russian representative in Istanbul, except Putin,\" Ukrainian presidential adviser Mykhailo Podolyak told Reuters.",
      "His chief of staff, Andriy Yermak, said Zelenskiy's trip to Turkey showed Kyiv was ready for talks but repeated Ukraine's stance that any negotiations must come after a ceasefire.",
      "\"Our position is very principled and very strong,\" Yermak said during a visit to Copenhagen.",
      "Moscow has not said if Putin will travel to Turkey.",
      "\"We are committed to a serious search for ways of a long-term peaceful settlement,\" Kremlin spokesman Dmitry Peskov told reporters on Monday but would not comment further on the talks.",
      "Putin launched a full-scale invasion of Ukraine in February 2022, unleashing a war that has killed hundreds of thousands of soldiers on both sides.",
      "Most of Europe has rallied around Kyiv providing arms and financial aid, while Russia has turned to Iran and North Korea for support.",
      "Trump has demanded the two nations end the war, threatening to walk away from efforts to broker a peace deal unless there are clear signs of progress soon.",
      "If Zelenskiy and Putin, who make no secret of their mutual contempt, were to meet on Thursday it would be their first face-to-face meeting since December 2019.",
      "Trump, who is visiting Saudi Arabia, the United Arab Emirates and Qatar this week, unexpectedly offered on Monday to travel to Istanbul, which straddles the divide between Europe and Asia.",
      "\"I was thinking about actually flying over there.",
      "There's a possibility of it, I guess, if I think things can happen, but we've got to get it done,\" Trump said before leaving for his second foreign trip since returning to the White House in January.",
      "\"Don't underestimate Thursday in Turkey.\"",
      "Following the offer, US Secretary of State Marco Rubio discussed the \"way forward for a ceasefire\" in Ukraine with his Ukrainian, British, French, Polish, German and EU counterparts.",
      "Russian Foreign Minister Sergei Lavrov, meanwhile, held talks with his Turkish counterpart Hakan Fidan.",
      "Reuters reported in 2024 that Putin was open to discussing a ceasefire with Trump, but Moscow ruled out making any major territorial concessions and insists Kyiv abandon ambitions to join NATO.",
      "Ukraine has said it is ready for talks but a ceasefire is needed first, a position supported by its European allies.",
      "Ukraine and its European allies have told Russia that it would have to accept an unconditional 30-day ceasefire from Monday or face new sanctions.",
      "The Kremlin replied, saying it would not respond to ultimatums.",
      "France said on Monday that European leaders, who met in Ukraine at the weekend, had asked the European Commission to put together new \"massive\" sanctions targeting Russia's oil and financial sector if Russia failed to agree a ceasefire."
    ],
    "topics": [
      "talks ukraine",
      "unconditional ceasefire",
      "ceasefire trump",
      "yermak said",
      "ready talks",
      "european allies",
      "president volodymyr",
      "volodymyr zelenskiy",
      "zelenskiy attend",
      "attend talks"
    ]
  },
  {
    "title": "Trump offers to join potential Russia-Ukraine talks in Turkey",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/europe/trump-offers-to-join-potential-russia-ukraine-talks-in-turkey-20250513-p5lym8",
    "publishedAt": "2025-05-12T17:08:31Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Kyiv/Washington | US President Donald Trump offered on Monday (Tuesday AEST) to join prospective Ukraine-Russia talks in Turkey later this week as European countries pushed to get the Kremlin to accept their demand for a 30-day ceasefire in the war in Ukraine.",
      "Trump spoke a day after Ukrainian President Volodymyr Zelensky, in a fresh twist to the stop-start peace talks process, said he would travel to Istanbul where he would be waiting to meet Russian counterpart Vladimir Putin.",
      "Reuters Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "Russia-China ties on full display on Victory Day - but all is not as well as Putin is making out",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/russia-china-ties-on-full-display-on-victory-day-but-all-is-not-as-well-as-putin-is-making-out-256385",
    "publishedAt": "2025-05-12T14:00:00Z",
    "sentences": [
      "Professor of International Security, University of Birmingham Stefan Wolff is a past recipient of grant funding from the Natural Environment Research Council of the UK, the United States Institute of Peace, the Economic and Social Research Council of the UK, the British Academy, the NATO Science for Peace Programme, the EU Framework Programmes 6 and 7 and Horizon 2020, as well as the EU's Jean Monnet Programme.",
      "He is a Trustee and Honorary Treasurer of the Political Studies Association of the UK and a Senior Research Fellow at the Foreign Policy Centre in London.",
      "University of Birmingham provides funding as a founding partner of The Conversation UK.",
      "View all partners Chinese troops participating in Russia’s Victory Day parade in Red Square, Moscow, on May 9 is a clear indication that President Xi Jinping is fully committed to his “no-limits” partnership with his Russian counterpart, Vladimir Putin.",
      "Xi’s own attendance of the parade, which came as part of a state visit to Russia, underlines that China is not only supporting Russia.",
      "It signified that Beijing wants this support to be understood clearly in Kyiv, Washington and European capitals.",
      "Travelling to Moscow and having his troops goose-step down Red Square was not a last-minute decision by Xi.",
      "Nor was the multitude of agreements signed by the two leaders and their joint declaration anything but part of a well established pattern of deepening relations between Russia and China.",
      "This trend has accelerated since Russia launched its full-scale invasion of Ukraine in February 2022.",
      "But the breadth and depth of China’s commitment to Russia at this particular moment is undoubtedly related to the broader upheaval in the international order that has been worsened since Donald Trump’s return to the White House.",
      "Get your news from actual experts, straight to your inbox.",
      "Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.",
      "The Trump administration, possibly spooked by market wobbles, has taken steps to restore stability.",
      "China and the US have agreed a deal to slash the import tariffs they have imposed on each other.",
      "But uncertainty remains – above all about how the complex relationships in the triangle of Washington, Beijing and Moscow will work out and where this will leave the rest of the world.",
      "Read more: Trump, Xi and Putin: a dysfunctional love triangle with stakes of global significance On May 8, in the wake of Xi and Putin’s meetings in Moscow, Russia and China released a joint statement.",
      "It stressed the intention of the two leaders to “enhance the coordination of their approaches and to deepen the practical cooperation on maintaining and strengthening global strategic stability, as well as to jointly address common challenges and threats in this sphere”.",
      "They reiterated this determination in their press statements afterwards.",
      "Putin emphasised that he and Xi “personally control all aspects of [the] Russia-China partnership and do all we can to expand the cooperation on bilateral issues and the international agenda alike”.",
      "A Chinese read-out from the talks was similarly clear on the alignment between the countries.",
      "Xi reportedly said that “in the face of unilateralist countercurrents, bullying and acts of power politics, China is working with Russia to shoulder the special responsibilities of major countries and permanent members of the UN Security Council”.",
      "This unequivocal display of how close Moscow and Beijing are – as well as Putin and Xi personally – is important for both nations.",
      "For Russia, it remains important to demonstrate that western attempts at international isolation have not succeeded.",
      "For China, the very public consolidation of ties with Russia is above all a signal to the US.",
      "China is keen to stress that Trump’s efforts to engineer a split between Moscow and Beijing, which the American president described as necessary to “un-unite” the two nations during an interview with US talk show host Tucker Carlson in November 2024, have largely failed.",
      "However, beyond the glossy surface of the celebrations in Moscow, all is not as well for Russia as Putin is trying to make out.",
      "For all the public displays of friendship between Xi and Putin, the relationship between the two countries remains highly asymmetrical.",
      "Russia would not be able to continue to wage its war against Ukraine without Chinese support.",
      "Trade between Russia and China is critical to propping up the Russian war economy, reaching a record high of nearly US$250 billion (£190 billion) in 2024.",
      "Their trade has increased by more than 60% since 2021, yet it is only marginally up since 2023.",
      "China’s diplomatic clout is also helpful for Russia.",
      "If Beijing had taken an unequivocal stance opposing Moscow’s aggression, fewer leaders in the developing world would have sided with Putin.",
      "In this case, Russia would probably have lost organisations like the Shanghai Cooperation Organisation and the Brics group of emerging economies as platforms to further its broader agenda of restoring its erstwhile status as a great power.",
      "In that agenda, Putin has been moderately successful.",
      "But with South Africa and India’s leaders absent from Russia’s Victory Day commemorations, the list of attendees was shorter than at the Brics summit in Kazan, Russia, in October 2024.",
      "Notably absent from the celebrations in Moscow was high-level representation from North Korea and Iran.",
      "These are two key allies of Russia with whom Moscow signed strategic partnership agreements in June 2024 and January 2025, respectively.",
      "Tehran simply sent its ambassador to Moscow to attend.",
      "However, it may have compensated Putin in a different and materially more significant way.",
      "According to reports, Iran is readying a delivery of launchers to enable Russia to use the short-range ballistic missiles already delivered last year.",
      "This would further add to Russia’s reliance on Iranian hardware in Ukraine, which has so far been most visible in the use of Iranian-made Shahed drones.",
      "North Korea dispatched a military delegation led by three-star general Kim Yong-bok.",
      "Kim is widely considered the commander of North Korean forces fighting alongside Russian troops in the Kursk region of western Russia, where Ukrainian forces seized territory in August 2024 as a possible bargaining chip in future negotiations with Russia.",
      "Putin officially acknowledged the participation of North Korean troops in this operation in a statement on April 28.",
      "This acknowledgment came two days after he had announced the defeat of Ukrainian forces there in a highly choreographed and televised meeting with his chief of general staff, Valery Gerasimov.",
      "The demonstration of Russia’s close relationships with its three core allies – China, Iran and North Korea – is a double-edged sword.",
      "On the one hand, it clearly indicates that Putin is far from isolated on the international stage.",
      "But it also signals that Russia has become a lot more dependent on these relationships than would befit Putin’s dreams of restoring Russia’s great-power status.",
      "Neither can be much comfort to Ukraine and its allies, unfortunately."
    ],
    "topics": [
      "russia china",
      "xi putin",
      "north korea",
      "university birmingham",
      "research council",
      "council uk",
      "conversation uk",
      "russia victory",
      "victory day",
      "red square"
    ]
  },
  {
    "title": "Zelenskyy calls for Russia to agree to 'lasting' ceasefire before peace talks",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-11/putin-proposes-direct-peace-talks-with-ukraine/105279076",
    "publishedAt": "2025-05-11T01:56:44Z",
    "sentences": [
      "Topic:World Politics Russian President Vladimir Putin has proposed peace talks with Ukraine during a visit to Istanbul on May 15.",
      "Ukrainian President Volodymyr Zelenskyy welcomed Mr Putin's proposal for direct talks, but said his team was expecting Moscow to agree to a \"lasting\" ceasefire starting May 12.",
      "Mr Putin said he would \"not rule out\" that Russia and Ukraine may \"be able to agree new ceasefires, a new truce\".",
      "Russian President Vladimir Putin has proposed direct peace talks with Ukraine to \"eliminate the root causes of the conflict\" after Ukraine proposed a 30-day ceasefire with the backing of NATO powers.",
      "Ukraine's president Volodymyr Zelenskyy has welcomed Mr Putin's proposal, but called for Moscow to agree to a \"lasting\" ceasefire, starting May 12, before talks take place.",
      "Russia invaded Ukraine in February 2022, sparking a conflict that has since seen about half a million casualties, according to estimates by US officials, and led to the displacement of an estimated 3.7 million people.",
      "Mr Putin said he would propose peace talks during a visit to Istanbul on May 15.",
      "Vladimir Putin says a meeting would be aimed at achieving durable peace between the two countries.",
      "(Reuters: Sergey Bobylev/RIA Novosti) \"It was not Russia that broke off negotiations in 2022.",
      "It was Kyiv.",
      "Nevertheless, we are proposing that Kyiv resume direct negotiations without any preconditions,\" Mr Putin said, referring to failed talks shortly after the Russian invasion of 2022.",
      "\"We offer the Kyiv authorities to resume negotiations already on Thursday, in Istanbul.",
      "\"Our proposal, as they say, is on the table, the decision is now up to the Ukrainian authorities and their curators, who are guided, it seems, by their personal political ambitions, and not by the interests of their peoples.\"",
      "Volodymyr Zelenskyy, Keir Starmer and Emmanuel Macron visited the Memorial Wall of Fallen Defenders of Ukraine in Kyiv on Saturday.",
      "(AP: Stefan Rousseau/PA) In a post on X, Ukrainian President Volodymyr Zelenskyy said it was a \"positive sign\" that Russia had \"finally begun to consider ending the war\".",
      "\"The entire world has been waiting for this for a very long time.",
      "And the very first step in truly ending any war is a ceasefire,\" he said.",
      "\"There is no point in continuing the killing even for a single day.\"",
      "However, he said he expected Moscow to agree to a \"lasting\" ceasefire, starting on Monday.",
      "Mr Zelenskyy's chief of staff Andriy Yermak said on Telegram there first had to a ceasefire, \"then everything else\".",
      "\"Russia should not disguise its desire to continue the war with vague statements,\" he said.",
      "The leaders of four major European countries visited Kyiv, amid a push for Moscow to agree to a truce and launch peace talks on ending the nearly three-year war.",
      "Mr Putin's peace talks proposal came mere hours after European powers threw their support behind Ukraine's proposal for a 30-day ceasefire, with the support of the United States.",
      "US President Donald Trump said Mr Putin would face \"massive\" sanctions if he did not accept the proposal within days.",
      "\"All of us here together with the US are calling Putin out,\" British Prime Minister Keir Starmer said.",
      "Russia dismissed the call for a ceasefire and the threat of sanctions.",
      "Hours after Mr Putin spoke, Ukraine's air force warned of a drone attack on the capital, Kyiv.",
      "The city's mayor said air defence units were trying to repel a Russian air attack, and Reuters witnesses heard blasts from what sounded like air defence units in operation.",
      "The Russian leader said he would speak to Turkish President Recep Tayyip Erdoğan on Sunday to discuss the details.",
      "Mr Putin said he would \"not rule out\" that Russia and Ukraine may \"be able to agree new ceasefires, a new truce\".",
      "Ukraine said it was the first time in its history that a Hungarian spy network had been found to be working against Kyiv's interests.",
      "\"We are committed to serious negotiations with Ukraine.",
      "Their purpose is to eliminate the root causes of the conflict, to establish a long-term, lasting peace for the historical perspective.\"",
      "In a 2021 essay pre-dating the full-scale invasion of Ukraine, the Russian president made the case for incorporating Ukraine into Russia.",
      "The 5,000-word document claimed that Russians and Ukrainians were \"one people\", and blamed poor ties between the two countries on foreign plots.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:Beef Cattle Farming European Union Russian Federation Ukraine United States World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr putin",
      "peace talks",
      "world politics",
      "volodymyr zelenskyy",
      "moscow agree",
      "putin said",
      "said would",
      "topic world",
      "russian president",
      "vladimir putin"
    ]
  },
  {
    "title": "European leaders say Donald Trump agreed to sanction Russia unless ceasefire agreed",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224",
    "publishedAt": "2025-05-10T12:04:18Z",
    "sentences": [
      "Topic:Unrest, Conflict and War The leaders discussed their peace efforts with Donald Trump on the phone.",
      "(Ludovic Marin/Pool via Reuters) Ukraine and European leaders have agreed to an unconditional 30-day ceasefire from May 12 with the backing of US President Donald Trump.",
      "The leaders threatened Russian President Vladimir Putin with new \"massive\" sanctions if he failed to comply.",
      "The leaders called for a 30-day ceasefire to start on Monday and asked Russia to engage in \"talks on a just and lasting peace.\"",
      "Ukraine and European leaders have agreed to an unconditional 30-day ceasefire from May 12 with the backing of US President Donald Trump, threatening Vladimir Putin with new \"massive\" sanctions if he failed to comply.",
      "The announcement was made by the leaders of Britain, France, Germany, Poland and Ukraine after a meeting in Kyiv, during which they held a phone call with Mr Trump.",
      "\"All of us here together with the US are calling Putin out,\" British Prime Minister Keir Starmer said.",
      "Soon after the European leaders' announcement, the Kremlin appeared to pour scorn on it.",
      "\"We hear many contradictory statements from Europe.",
      "They are generally confrontational in nature rather than aimed at trying to revive our relations.",
      "Nothing more,\" Kremlin spokesman Dmitry Peskov said, according to Russian news agency Interfax.",
      "The group of European leaders arrived in Kyiv on Saturday in a joint show of support, and the group spoke with US President Donald Trump on the phone, the Ukraine foreign minister said.",
      "Ukrainian President Volodymyr Zelenskyy and the visiting head of states Mr Starmer, Emmanuel Macron, Friedrich Merz and Donald Tusk discussed their peace efforts with Mr Trump.",
      "It was the first time the leaders of the four countries had met in Kyiv.",
      "(Stefan Rousseau/Pool via Reuters) \"We reiterate our backing for President Trump's calls for a peace deal and call on Russia to stop obstructing efforts to secure an enduring peace,\" the leaders said in a joint statement.",
      "\"Alongside the US, we call on Russia to agree a full and unconditional 30-day ceasefire to create the space for talks on a just and lasting peace.\"",
      "Australian Prime Minister Anthony Albanese said Australia would \"continue to stand with Ukraine\".",
      "In a statement on X, Ukrainian Minister for Foreign Affairs Andrii Sybiha said the phone call was \"productive\" and Ukraine and all its allies were ready for a 30-day ceasefire.",
      "In March, the United States proposed an immediate, limited 30-day truce which Ukraine accepted, but the Kremlin has held out for terms more to its liking.",
      "The leaders of France, Germany, Poland and the United Kingdom arrived together at the train station in Kyiv.",
      "Keir Starmer, Emmanuel Macron and Friedrich Merz travelled on a train together to Kyiv.",
      "(Stefan Rousseau/Pool via Reuters) They met President Zelenskyy shortly after to join a ceremony at Kyiv's Independence Square marking the 80th anniversary of the end of World War II.",
      "At a makeshift flag memorial for fallen Ukrainian soldiers and civilians slain since Russia's invasion, the leaders lit candles and paid tribute.",
      "The visit marked the first time the leaders of the four countries have travelled together to Ukraine, while Friedrich Merz is making his first visit to Ukraine as Germany's new chancellor.",
      "Multiple countries are joining forward to write a peace plan to present to US President Donald Trump, a vital step to deter Russia.",
      "\"What's happening with Poland, Germany and Great Britain is a historic moment for European defense and toward a greater independence for our security,\" French President Emmanuel Macron said.",
      "Their visit came on the last day of a unilateral three-day ceasefire declared by Moscow, to coincide with its own celebrations marking the defeat of Nazi Germany.",
      "Mr Sybiha on Thursday called that truce a \"farce,\" accusing Russian forces of violating it over 700 times less than a day after it formally came into effect.",
      "Both sides also said attacks on their troops had continued on Thursday.",
      "Reuters/AP Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:World Politics Topic:World Politics Ukraine Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "donald trump",
      "world politics",
      "european leaders",
      "us president",
      "president donald",
      "topic world",
      "politics topic",
      "via reuters",
      "unconditional ceasefire",
      "emmanuel macron"
    ]
  },
  {
    "title": "Surprisingly Advanced Ancient Spear Tip Was Not Made by Modern Humans",
    "source": "ScienceAlert",
    "url": "https://www.sciencealert.com/surprisingly-advanced-ancient-spear-tip-was-not-made-by-modern-humans",
    "publishedAt": "2025-05-10T12:00:41Z",
    "sentences": [
      "Researchers have found that a spear tip carved from bone, unearthed from Russia in 2003, is as old as 80,000 years.",
      "This means the hunting weapon could not have been created by modern humans.",
      "Homo sapiens didn't venture into Europe until about 45,000 years ago, so the most likely spear-wielders in this case were the Neanderthals (Homo neanderthalensis).",
      "Although examples are still rare, it seems our ancient cousins had advanced their technologies beyond stone tools, using techniques that, until recently, had only been credited to our species.",
      "The find was explored in a new paper from a team led by archeologist Liubov Golovanova of the Laboratory of Prehistory in Russia.",
      "\"The… specimen suggests that at least some groups of late Middle Paleolithic Neanderthals in Europe have started to develop bone-tipped hunting weapons,\" explain the authors.",
      "\"They made this invention independently and without influence from early Upper Paleolithic modern humans that started to arrive to the continent much later.\"",
      "The spear tip joins a few other recent finds that demonstrate Neanderthals developed techniques specific to working with bone, such as scraping and flat cutting.",
      "These include a 50,000-year-old cache of bone tools from Siberia and 40,000-year-old leather-softening tools from Europe.",
      "Bone tools as old as 400,000 years have also been found in Italy.",
      "This is about when Neanderthals first emerged, so it is possible this technology existed even before them.",
      "But the level of craftsmanship of these really early bone tools is not as advanced as those found in Europe after modern humans arrived, Golovanova and team note.",
      "The scarcity of Neanderthal bone tools, compared to stone ones, may be due to decay over time, without specific environmental conditions to preserve them.",
      "The Mezmaiskaya Cave, where the spear tip was found amongst a variety of animal remains, stone tools and signs of a campfire, likely provided the conditions required for the bone's long-term preservation.",
      "\"The preservation of bones is exceptional at Mezmaiskaya Cave,\" the researchers write.",
      "\"No evidence of weathering, chemical dissolution, sediment abrasion, root etching, or trampling have been observed on the specimen, indicating that post-depositional alteration or destruction did not affect the surfaces of the bone tool.\"",
      "Golovanova and team identified cracks in the Neanderthal's bone spear tip during their analysis.",
      "These, as well as lack of wear, suggest the weapon had been used to successfully strike something soon after it was carved and bound to a wooden shaft using tar.",
      "The bone was likely once part of a bison.",
      "This research was published in the Journal of Archaeological Science."
    ],
    "topics": [
      "spear tip",
      "bone tools",
      "modern humans",
      "old years",
      "stone tools",
      "golovanova team",
      "neanderthal bone",
      "mezmaiskaya cave",
      "researchers found",
      "found spear"
    ]
  },
  {
    "title": "Russia holds Victory Day parade featuring Xi Jinping",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/europe/russia-holds-victory-day-parade-featuring-xi-jinping-20250509-p5ly2m",
    "publishedAt": "2025-05-09T13:48:31Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Moscow | Russia on Friday celebrated the 80th anniversary of the defeat of Nazi Germany in World War II, as President Vladimir Putin presided over a massive parade of tanks, missiles and troops through Red Square and welcomed over two dozen world leaders — the most since Moscow sent troops into Ukraine.",
      "Victory Day, which Russia marks on May 9, is the country’s most important secular holiday.",
      "The parade and other festivities underline Moscow’s efforts to project its global power and cement the alliances it has forged while seeking a counterbalance to the West amid the conflict in Ukraine that is grinding through a fourth year.",
      "AP Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "I watched the Kremlin’s new Putin documentary (so you don’t have to) − here’s what it says about how the Russian leader views himself",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/i-watched-the-kremlins-new-putin-documentary-so-you-dont-have-to-heres-what-it-says-about-how-the-russian-leader-views-himself-256159",
    "publishedAt": "2025-05-08T14:00:00Z",
    "sentences": [
      "Professor of Government, Wesleyan University Peter Rutland does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "Wesleyan University provides funding as a member of The Conversation US.",
      "View all partners As the chances of President Donald Trump’s peace deal in Ukraine seemingly recede, attention turns back to the question of Vladimir Putin and his war aims.",
      "What does the Russian president want to achieve from the conflict?",
      "And when – and under what conditions – will he be willing to make peace?",
      "Thousands of lives and billions of dollars hinge on the answers to these questions.",
      "Important insights into Putin’s worldview on this and other matters can be gleaned from a new 90-minute documentary, “Russia.",
      "Kremlin.",
      "Putin.",
      "25 Years,” released by the state broadcaster Rossiya on May 4, 2025, and available on YouTube.",
      "The documentary looks back on Putin’s quarter century in power.",
      "I see the film as the Kremlin’s attempt to make its case to the Russian public.",
      "The film explains how Putin sees his place in history and why he is waging the war on Ukraine.",
      "Its release coincides with the commemoration of the 80th anniversary of the end of World War II in Europe, which Russia marks on May 9, as opposed to May 8 in the rest of Europe.",
      "As would be expected from a Kremlin-sponsored look at Russia’s leader, it is more hagiography than hard-hitting journalism.",
      "But as a scholar who has tracked Russia’s post-Soviet slide into authoritarianism, it is nonetheless revealing.",
      "It shows us the image that Putin wants to project to the Russian public, one that has been fairly consistent during his time in office.",
      "The film starts with the loyal and somewhat obsequious journalist Pavel Zarubin interviewing Putin at the end of his long working day in the Kremlin, at 1:30 a.m.",
      "The chat with Zarubin is interspersed with archival footage of key events and earlier speeches by Putin.",
      "Putin shows Zarubin around his apartment, which includes a chapel, a gym – Putin says he works out for 90 minutes every day – and a kitchen, in which Putin awkwardly prepares snacks for their chat.",
      "The rooms are immaculate but lifeless, albeit with a surfeit of gold leaf.",
      "The new documentary is carefully curated with clips showing Putin as a humble man of the people.",
      "“I don’t consider myself a politician, I breathe the same air as millions of citizens of Russia,” he says at one point.",
      "We do not see anything of his chain of lavish palaces, yachts and other assets.",
      "While Putin’s predominant image in the outside world is that of a ruthless strongman, for domestic audiences the Kremlin has tried to soften this image.",
      "Here, the documentary is treading familiar ground.",
      "On the eve of Putin’s election in May 2000, the Kremlin published an autobiography and released a documentary packed with heartwarming anecdotes about Putin’s childhood and daily life.",
      "The image being put forward contrasted to the realities of his early presidency, when Russia was waging a brutal war in Chechnya.",
      "A common thread running through the film is Putin’s commitment to restoring the sovereignty and independence of Russia, which he sees as under threat by the Western powers.",
      "Prominently displayed behind Putin in the apartment is a portrait of Czar Alexander III, apparently a role model for Putin.",
      "Alexander III is not well known in the West.",
      "An avowed nationalist, during his short rule from 1881 to 1894 he pursued economic modernization and avoided starting any foreign wars.",
      "The film is laden with anti-West propaganda.",
      "It argues that Western powers were behind the movement for independence in Chechnya, which threatened to break apart the Russian Federation.",
      "Putin goes on to blame the West for the current “special military operation” in Ukraine.",
      "In the Russian president’s telling, it was the West’s failure to implement the Minsk accords of 2014-2015, which were supposed to bring peace to the restive Donbas region in eastern Ukraine.",
      "He suggests that the West used the Minsk accords as “a pause in order to prepare for a war with Russia.” Zarubin asks Putin, “Why does the West hate us, do they envy us?” It’s a question that launches Putin into a potted summary of 1,000 years of Russian history.",
      "A similar thing happened during Putin’s notorious 2024 interview with former Fox News host Tucker Carlson.",
      "Putin argues that since the rift between the Roman Catholic Church and Byzantium in 1054, the West has prioritized material wealth, while in Russia spiritual values come first.",
      "The film has several prominent references to the role of the Russian Orthodox Church in Russian identity.",
      "Early in Putin’s presidency he had been open to cooperation with the West, taking tea with Queen Elizabeth at Buckingham Palace and developing close relationships with Italian Premier Silvio Berlusconi and German Chancellor Gerhard Schroder.",
      "But since the 2012 demonstrations protesting his return to the presidency, Putin has increasingly used the argument that the West has abandoned “traditional values” by promoting issues such as gay rights.",
      "This is the first major official biographical documentary of Putin since the 2022 full-scale invasion of Ukraine, and it may be the closest we will get to an explanation of why Putin launched this war.",
      "There is a long feel-good segment about the “unification” of Crimea with Russia in 2014, which is presented as the most important achievement of Putin’s time in office.",
      "The film shows images of destruction and suffering during the current war in Ukraine, without pointing out that it was Russia that started the war.",
      "It shows the devastated city of Mariupol and states incorrectly that the city was “destroyed” by Ukrainians.",
      "The documentary portrays the war in Ukraine as a direct continuation of World War II and a struggle against the “neo-Nazi” regime in Kyiv allegedly created by the West as part of its goal to inflict a “strategic defeat” on Russia.",
      "The film shows Putin visiting wounded soldiers and meeting the widows and mother of fallen warriors.",
      "Putin thanks the women for their sacrifice – and they thank him for the opportunity to serve the motherland.",
      "This illustrates one of the central themes of the Kremlin worldview: that Russia is strong because its people are ready to sacrifice themselves.",
      "Zarubin asks, “Is it possible to make peace with the Ukrainian part of the Russian people?” It’s phrasing that denies the existence of Ukraine as a sovereign nation.",
      "Putin replies, “It is inevitable despite the tragedy we are experiencing.” He expresses regret that there are only 150 million Russians – as a great power, Russia needs more people.",
      "He also suggests he may need more territory, something that will be alarming for Russia’s neighbors.",
      "In one clip, Putin asks a boy, “Where do the borders of Russia end?” The boy answers, “The Bering Strait with USA.” And Putin responds, “The borders of Russia never end.” This framing also suggests that Putin is not interested in a peace deal with Ukraine in which Russia would see only limited territorial gains, which puts the breakdown of talks over a potential U.S.-sponsored deal in context.",
      "Asked about the recent falling out between Trump and Europe sparked in part by Washington’s more pro-Russian stance, Putin answers, “Nothing has changed since Biden’s time,” adding that the “collective West” is still bent on destroying Russia.",
      "Toward the end of the documentary, Zarubin asks whether Putin is thinking about choosing a successor.",
      "The Russian president says he constantly thinks about succession and would prefer a choice between several candidates.",
      "But the program does not provide any clues as to who that successor could be – and none of the potential successors are given any exposure.",
      "The Russian people have been told for years that it is impossible to imagine Russia without Putin.",
      "This film lies firmly in that tradition.",
      "The main intended message is clear: Putin is willing and able to fight on until he achieves victory on his own terms."
    ],
    "topics": [
      "russian president",
      "war ukraine",
      "zarubin asks",
      "wesleyan university",
      "peace deal",
      "deal ukraine",
      "make peace",
      "new documentary",
      "russian public",
      "world war"
    ]
  },
  {
    "title": "Keep calm and carry on buying: how Ukrainian consumers are hitting back at Russia",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/keep-calm-and-carry-on-buying-how-ukrainian-consumers-are-hitting-back-at-russia-256000",
    "publishedAt": "2025-05-07T14:00:00Z",
    "sentences": [
      "Senior Lecturer in Marketing, The Open University Professor of Marketing, University of Bradford Senior Lecturer in Marketing, University of Exeter The authors do not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and have disclosed no relevant affiliations beyond their academic appointment.",
      "University of Bradford and The Open University provide funding as founding partners of The Conversation UK.",
      "University of Exeter provides funding as a member of The Conversation UK.",
      "View all partners Political conflicts and global tensions always affect people on the ground and across borders.",
      "Unable to influence events such as the ongoing war against Ukraine or proposed sweeping US tariffs, people turn to whatever resources are available for defending their livelihoods, institutions and communities.",
      "This explains the recent surge of boycotts and “buycotts” where consumers swerve a brand or actively support it for political reasons.",
      "For example, shoppers across the world are replacing US goods with local alternatives to protect national pride and economies.",
      "In the early days of Russia’s 2022 full-scale invasion of Ukraine, shoppers were making similar public commitments to boycott Russian products.",
      "But there are many other ways in which brands and consumers responded to the start of the invasion in 2014.",
      "Global and local reactions from brands included donations, divestment, the creation of new products or product names and advertising and social media content linked to the invasion.",
      "In turn, consumer responses to these brand initiatives are a form of civic action.",
      "In a study we undertook (along with our colleagues Carlo Mari, Verónica Martín Ruiz and Lizette Vorster), we analysed how marketing professionals and ordinary consumers create and interpret products and brands explicitly or implicitly acknowledging the war in Ukraine.",
      "To do this, we conducted in-depth interviews with marketing managers and consumers and analyses of brand and product imagery.",
      "Our findings highlight three ways that marketing resources and consumer responses support psycho-social and cultural resilience in war-affected communities.",
      "Humour and satire have long been used for addressing pressing societal issues, and many brands in Ukraine have embraced them in response to the invasion.",
      "For example, mayonnaise brand Ukrop Style, marketed by Ukrainian firm Olkom, leant on satire to boost consumer morale.",
      "The term “Ukrop” (meaning “dill” in Ukrainian) has been used by Russia as a slur against Ukrainians since the beginning of the war.",
      "Several “ukrop”-themed products and services then sprang up to reclaim the word and its imagery.",
      "It was used in new product names and packaging, as Olkom did.",
      "Several participants in our study discussed engagement with brands like this to mobilise the public spirit of defiance.",
      "For them, the use of humour helped lessen the insult directed at their nation.",
      "When people perceive that their society and way of life is under threat, they often turn to cultural symbols.",
      "These can help to assert connections with others.",
      "Several brands have incorporated symbolic references to Ukraine in their communication messages, with national flags and designs depicting vyshyvanka embroidery (which is specific to traditional Ukrainian shirts).",
      "A Samsung advert using vyshyvanka, traditional Ukrainian garments and the phrase “Evolution is beautiful” evokes Ukraine’s 2014 Revolution of Dignity and the shared Ukrainian identity built on dignity, freedom and togetherness.",
      "Between 2014 and 2022, Ukraine and Russia continued to trade in consumer goods.",
      "During this time, several major retail chains in Ukraine used flags to mark the origin of products.",
      "These marketing signals kept consumers informed, but potentially also supported boycotts and buycotts.",
      "Since 2022, Ukraine’s trade in consumer goods with Russia has ceased.",
      "But the labelling of Ukraine-made goods has grown.",
      "The Ukrainian ministry of economy has launched a “Made in Ukraine” trademark, encouraging people to support local manufacturers.",
      "Even when brand boycotts are no longer needed – as is the case with Ukraine and Russia, since the two countries no longer trade – consumers still use their collective power to support their local economy.",
      "Participants in our study shared the view that brand activism and marketing related to political shocks can offer people an outlet for a civic response.",
      "It also opens up conversations about the distressing events affecting them and their country.",
      "Some described these marketing activities as grassroot initiatives by fellow citizens – owners and managers of brands engaging in activism.",
      "Others stressed that their willingness to support brand activism is dependent on whether they perceive it as sincere or mere profit-seeking.",
      "Few interviewees separated private consumption from political views and actions.",
      "Brand activism and marketing related to conflict and political shocks could well be a trend that will grow in scale and scope.",
      "After all, consumption remains one domain where people have collective power.",
      "Boy/buycotting movements responding to the US tariffs are gaining momentum, while the #buyforukraine and #shopukrainian initiatives have stood the test of time.",
      "Brands and governments may be tempted to leverage this social sentiment, but here our research tells a cautionary tale.",
      "The consumers we interviewed were savvy in their assessment of the sincerity of brand activism.",
      "And they held different views about its appropriateness as a form of civic action.",
      "Brand activism merely seeking to encourage sales may backfire, evoking consumer cynicism rather than support.",
      "For example, brands like Unilever and Pepsi were criticised for appearing to be insincere in their announced suspension of sales and production in Russia.",
      "At the same time, brand activism increasingly requires careful, nuanced consideration.",
      "More widely, consumers are not united on whether companies should take positions on political and social issues.",
      "Whether brand activism proves to be this century’s “Keep Calm and Carry On” remains to be seen."
    ],
    "topics": [
      "brand activism",
      "senior lecturer",
      "lecturer marketing",
      "open university",
      "marketing university",
      "university bradford",
      "university exeter",
      "conversation uk",
      "war ukraine",
      "us tariffs"
    ]
  },
  {
    "title": "Russia looks to frame war as an inevitable part of life on Victory Day",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/russia-looks-to-frame-war-as-an-inevitable-part-of-life-on-victory-day-255751",
    "publishedAt": "2025-05-07T14:00:00Z",
    "sentences": [
      "Senior Lecturer in International Politics, Aberystwyth University Lecturer in Global Histories and International Relations, Bath Spa University The authors do not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and have disclosed no relevant affiliations beyond their academic appointment.",
      "Aberystwyth University provides funding as a member of The Conversation UK.",
      "View all partners Russia celebrates the 80th anniversary of the Soviet victory in the second world war on May 9.",
      "But while the cameras will focus on the assembled ranks of elderly war survivors watching the military parade in Red Square, Moscow, the focus of senior officials is on Russia’s children and young people.",
      "Patriotism in Vladimir Putin’s Russia is built on exaggerated respect for key moments in the country’s history.",
      "These moments have been chosen to create a specific story about Russia.",
      "This is a story about Russia’s military might, the ability of its citizens to endure almost unimaginable suffering for the motherland, and the inevitability of victory over its enemies.",
      "Victory Day gives the Kremlin a chance to retell that story.",
      "It also allows the state to assure Russians that they, like their ancestors, will be victorious in the so-called “special military operation” in Ukraine.",
      "Moscow describes this war as the modern-day equivalent of the fight against Nazi Germany.",
      "With fewer witnesses to that historic victory still alive, the Kremlin’s ability to manipulate society by drawing on this important memory depends on the willingness of the next generation to embrace the state’s official history.",
      "And Russian political figures are worried that young people nowadays are disconnected from their heritage.",
      "A poll conducted in December 2022 by the Russian Public Opinion Research Centre found that 76% of Russians aged 14 to 24 believe they have a good understanding of the history of their country.",
      "But the results of an alternative poll from June 2023 show that 70% of Russia’s young people do not know enough about their nation’s history.",
      "Vladimir Medinsky, the chairman of the Interdepartmental Commission of Historical Education of Russia, reflected on the issue at a forum on how to interest young people in Russian history in 2023.",
      "He said: “What needs to be done to make our children interested in history?",
      "To make interesting historical performances, to make historical films.” Russia’s leaders seek to address this perceived disconnect through military patriotic education.",
      "This is a system of surrounding children and young people with state-approved messages about Russia’s historic military victories and the role of its armed forces in making their country respected – and feared – around the world.",
      "These messages are conveyed through textbooks and in lessons at school.",
      "But one of the challenges for the Russian state is finding ways of making this material attractive enough for young people to want to engage with it.",
      "Putin himself has indicated that he understands this challenge.",
      "At a meeting with the Russian non-profit society Znaniye (Knowledge) on April 30, the Russian president argued that “it is crucial to have both an opportunity and skills to communicate the truth about past years and decades: sincerely, compellingly and – if I may say so – in a way that truly resonates”.",
      "Patriotic youth groups are an important vehicle for delivering military patriotic education in fun and exciting ways.",
      "These groups organise activities including games and competitions, as well as more immersive activities such as role-playing and re-enactments.",
      "These activities are designed to create a deeper engagement with the events of the past.",
      "One group, Victory Volunteers, emphasises collecting personal accounts from war veterans to add to the historical record.",
      "It also actively brings young people and war veterans together so that the heroes of future wars can be inspired by real-life stories of wartime heroism.",
      "Listening to these first-hand testimonials is intended to enable young people to deepen their understanding of the experience of war, including its hardships and tragedies.",
      "Yunarmiya (Young Army) is probably Russia’s best-known military patriotic youth group.",
      "It works with young people to develop their appreciation of history.",
      "But its focus on dressing its members in uniforms and training them in practical military skills has captured the attention of the world’s media.",
      "These skills include military-style activities such as marching in formation, learning how to assemble and disassemble weapons, and how to fire them.",
      "The Russian state also supports military patriotic education through the presidential grants fund.",
      "Hundreds of charities, youth groups and local societies apply to the fund twice a year, with the winners reportedly chosen by Putin himself.",
      "Many of the successful applications involve activities to raise young people’s awareness of historical memory, especially the memory of war.",
      "In 2022, for example, the historical reconstruction club Volnitsa received funding to organise a memorial march “in the footsteps of the winners” to mark the 80th anniversary of the liberation of the Bogucharsky region of Russia (near the border with Ukraine) from Nazi occupation.",
      "The successful application emphasised the emotional intensity of the reenactment and its educational effects on young participants.",
      "Events like the 80th anniversary of Victory Day have a significance for the Kremlin that goes beyond the speeches, parades and pageantry of the day itself.",
      "They are part of an effort by the Russian state to shape the expectations and behaviour of the next generation of its citizens.",
      "By encouraging young people to feel a personal connection to Russia’s history of war, Moscow hopes to ensure that society will regard war as an inevitable part of life.",
      "The scale of this effort suggests that Putin and other senior officials anticipate the need for a society willing to make sacrifices so that Russia can achieve victories in future wars."
    ],
    "topics": [
      "young people",
      "military patriotic",
      "80th anniversary",
      "patriotic education",
      "russian state",
      "aberystwyth university",
      "senior officials",
      "children young",
      "story russia",
      "russia military"
    ]
  },
  {
    "title": "Joe Biden likens Donald Trump's Ukraine war diplomacy to 'appeasement' of Russia",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-07/biden-accuses-trump-of-appeasing-russia/105266354",
    "publishedAt": "2025-05-07T11:23:09Z",
    "sentences": [
      "By Heloise Vyas Topic:World Politics Joe Biden has accused Donald Trump of \"appeasing\" Russia by pressuring Ukraine to cede territory as part of ceasefire negotiations.",
      "The former US president spoke to the BBC in a wide-ranging interview, his first since leaving office.",
      "He warned of the post-war world order backsliding amid America's deteriorating relationship with its global allies under Mr Trump.",
      "Former United States president Joe Biden warns that fragmentation between the US and Europe under Donald Trump's leadership threatens to \"change the modern history of the world\" for the worse, in his first interview since leaving the White House.",
      "Speaking to the BBC's Nick Robinson in his home state of Delaware, Mr Biden lamented the Trump administration's foreign policy, its treatment of American allies — particularly the European Union — and approach to the Ukraine war.",
      "\"It's a grave concern,\" he said of a future world without NATO, warning such a scenario would be exploited by anti-Western powers China and Russia.",
      "\"It would change the modern history of the world, if that occurs.",
      "Kamala Harris in her first major speech since losing the US election in November said President Donald Trump was \"counting on the notion that fear can be contagious.\"",
      "In the absence of the security alliance, Mr Biden argued, there would be no counterforce to Russia's invasion of Ukraine.",
      "\"Do you think Putin would have stopped at Ukraine?",
      "Do you think Putin would have stopped?\"",
      "he questioned.",
      "\"I just don't understand how they [the present US government] fail to understand that there's strength in alliances.",
      "There's benefits.",
      "The cost there, it saves us money overall.\"",
      "Mr Biden's interview coincides with commemorations of the 80th anniversary of the end of World War II, known as VE Day, in Europe this week.",
      "He expressed concern about waning confidence in the \"certainty of America\" to deal with the world's challenges, saying the US's allies would soon \"begin to doubt whether we're going to stay where we've always been in the last 80 years\".",
      "\"European leaders and European countries, they're wondering, 'Well, what do I do now?",
      "What's the best route for me to take?",
      "Can I rely on the United States?",
      "Are they going to be there?'\"",
      "On Mr Trump's handling of Ukraine peace talks and his efforts to make Kyiv cede territory to Russia, Mr Biden said it amounted to \"modern-day appeasement\".",
      "\"[Vladimir] Putin can't stand the fact that the Russian dictatorship that he runs, that the Soviet Union, has collapsed.",
      "And anybody [who] thinks he's going to stop is just foolish,\" he said.",
      "\"I just don't understand how people think that if we allow a dictator, a thug, to decide he's going to take significant portions of land that aren't his, that that's going to satisfy him.\"",
      "Donald Trump has appeared to favour some of the Russian president's views on the Ukraine war.",
      "(Reuters: Maxim Shemetov/Illustration/File Photo) As part of ceasefire negotiations, Moscow has repeatedly made demands for Kyiv to give up its claim to the Ukrainian territories Russia controls and officially recognise them as Russian.",
      "Crimea, the peninsula that Russia illegally annexed from Ukraine in 2014, has been a major sticking point, with the US proposing a peace framework that would require major territorial concessions from Ukraine and allow \"de jure\" American recognition of Russian control in Crimea.",
      "Ukraine has refused to recognise its occupied territories as Russian.",
      "Since Mr Trump and Mr Putin's phone call on February 12, analysis shows the US president's public comments have appeared to echo specific Russian talking points on the war.",
      "Donald Trump has made big promises on Russia's war in Ukraine but he's becoming an impatient broker.",
      "Asked if his own government's support for Ukraine's war effort had fallen short, Mr Biden said: \"We gave them everything they needed to provide for their independence and we were prepared to respond more aggressively if Putin moved again.\"",
      "Mr Biden also rebuked the televised meeting between Mr Trump and Ukrainian President Volodymyr Zelenskyy at the Oval Office in February that devolved into an explosive verbal spat.",
      "\"I found it beneath America, the way that took place,\" he said, while also taking aim at Mr Trump's desires to annex Greenland, Canada and the Panama Canal.",
      "Mr Biden's interview comes just over 100 days into Mr Trump's second presidency, which has been marked by an extraordinary flurry of events, most notably his sweeping imposition of trade tariffs.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Explainer Topic:Unrest, Conflict and War Topic:World Politics European Union Russian Federation Territorial Disputes Ukraine United States Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr biden",
      "mr trump",
      "world politics",
      "donald trump",
      "topic world",
      "united states",
      "ukraine war",
      "politics topic",
      "joe biden",
      "cede territory"
    ]
  },
  {
    "title": "Russia and Turkey are wielding religion as soft power - but one patriarch is standing in their way",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/russia-and-turkey-are-wielding-religion-as-soft-power-but-one-patriarch-is-standing-in-their-way-254247",
    "publishedAt": "2025-05-05T14:00:00Z",
    "sentences": [
      "Research Fellow Institute of Orthodox Christian Studies, University of Cambridge Katie Kelaidis does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Cambridge provides funding as a member of The Conversation UK.",
      "View all partners Turkish nationalists are calling on the government of President Recep Tayyip Erdoğan to revoke the passport of Archbishop Elpidophoros of America, the highest ranking Greek Orthodox cleric in the US.",
      "As a Turkish citizen, the archbishop is one of the few clerics eligible to become the next Patriarch of Constantinople.",
      "The holder of this position is often called the “spiritual leader” of Eastern Orthodox Christians, though this status is contested.",
      "Critics of Elpidophoros believe he should be stripped of his Turkish citizenship for repeatedly referring to the Patriarch of Constantinople as “ecumenical”.",
      "This, which means the position represents a number of different Christian Churches, is a nod to the potential global authority of the office.",
      "Turkey does not recognise the patriarch’s ecumenical status.",
      "They also criticise Elpidophoros for using the name Constantinople instead of Istanbul (most recently during a Greek Independence Day celebration at the White House).",
      "This was the name of the city when it was the capital of the Ottoman empire.",
      "The situation might seem somewhere between petty and parochial – the concerns of a small and relatively unimportant corner of the world, or a momentary flare-up in the Greek-Turkish conflict.",
      "But this could not be further from the truth.",
      "The Patriarchate of Constantinople is a critical player in two volatile regions: the Middle East and eastern Europe.",
      "Both Turkey and Russia, regional powers in these unstable areas, have made religion a central component of their propaganda.",
      "They have each sought to present themselves as the guardian of their respective religious tradition, despite having spent much of the 20th century in various forms of state-sponsored hostility to religion.",
      "For Russia and Turkey, the Patriarchate of Constantinople stands as an obstacle to their preferred narratives.",
      "Russia under Vladimir Putin and Turkey under Erdoğan have become deeply invested in promoting themselves as the guardians of traditional Christianity and Islam, respectively.",
      "By leveraging this position, they have garnered sympathy and support among people who were once indifferent or even hostile to them.",
      "Influential conservative commentators in the US such as Tucker Carlson and Rod Dreher have praised Putin’s “anti-woke” rhetoric.",
      "And some ultraconservative American men are reportedly converting to Russian Orthodoxy.",
      "Turkey, for its part, began establishing mosques and training imams abroad, including in western Europe, as early as the 1970s.",
      "But in the past 23 years, under the rule of the Justice and Development party (AKP), it has significantly expanded these efforts.",
      "The enemies Russia and Turkey claim to combat are both internal and external.",
      "Putin, Erdoğan and their aligned clerics, have been vocal in their denunciation of western “decadence”.",
      "This is usually represented by the liberal sexual and gender politics of western nations.",
      "Yet they have been just as adamant in opposing those within their own traditions.",
      "In Russia’s case, this has meant perceived liberalisers largely situated in the Hellenic world – not just the Patriarchate of Constantinople, but also the Patriarchate of Alexandria, as well as the Churches of Greece and Cyprus.",
      "For Turkey, this internal enemy has primarily taken the form of Saudi-backed Wahhabism, a strict, ultraconservative form of Sunni Islam.",
      "The international religious influence of Russia and Turkey depends on a specific national narrative.",
      "Russia must be not only a historically Orthodox nation, but the leading Orthodox nation – the rightful inheritor of the eastern Roman world.",
      "Likewise, Turkey must present itself as an explicitly and entirely Muslim nation, the heir to an Ottoman empire reimagined as far more homogeneous than it ever truly was.",
      "This requires both countries reject much of their 20th-century history.",
      "Neither Soviet communism nor the strict secularity of Turkey’s founder, Mustafa Kemal Atatürk, fits the current plot.",
      "It also demands the rewriting of medieval and early modern histories.",
      "And for both, the Patriarch of Constantinople poses a significant problem.",
      "This is especially true if he is seen as anything more than a local ethnic leader, hence the objection to the use of “ecumenical” in his title.",
      "If the Patriarch of Constantinople is a global religious leader, then Moscow is not the undisputed head of the Orthodox world, nor is Turkey a homogeneously Muslim nation with a homogeneously Muslim past.",
      "Patriarch Bartholomew, the current Patriarch of Constantinople, ascended to the throne in 1991.",
      "He has been a moderate and modernising force in the Orthodox world and beyond.",
      "Bartholomew has championed issues such as environmentalism, inter-religious dialogue and human rights, while also opposing Russian aggression in Ukraine.",
      "Now Bartholomew is 85 years old, the conversation has turned to the question of his successor.",
      "The options are limited, as the next patriarch must be a Turkish citizen.",
      "If the patriarchate is to continue serving as a kind of opposition to Russian and Turkish expansionism, the next leader must also be a moderate.",
      "Should a more reactionary figure take the office, there is a real danger this counterbalance will be lost.",
      "For those who hope to resist Russian and Turkish aggression and to promote values such as human rights in the Orthodox world and Middle East, there is simply no better choice than Archbishop Elpidophoros.",
      "He has challenged Russian expansionism in Ukraine, defended democracy and pluralism and has taken a pastoral approach to the inclusion of LGBTQ+ people and women in the Church.",
      "Though the patriarch is a relatively obscure position in global terms, it is precisely because of the current global situation that there may be no more important religious leader than one who can exert influence across eastern Europe and the Middle East.",
      "The fact that allies of Putin and Erdoğan have joined in attacking Elpidophoros suggests not only that they do not want him to become the next Patriarch of Constantinople.",
      "It also suggests that western democracies should take a deep interest in who does.",
      "The patriarchate is a rejection of the historical lies upon which both Russian and Turkish soft power rest.",
      "Thus, the man who occupies the office must be up to the task."
    ],
    "topics": [
      "patriarch constantinople",
      "next patriarch",
      "patriarchate constantinople",
      "middle east",
      "russia turkey",
      "orthodox world",
      "russian turkish",
      "university cambridge",
      "archbishop elpidophoros",
      "turkish citizen"
    ]
  },
  {
    "title": "Bulgarian spies nabbed for feeding information to Russia facing jail time in the UK",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-05-03/bulgarian-spy-ring-russia-kremlin-caught-uk-face-sentencing/105211652",
    "publishedAt": "2025-05-02T19:18:15Z",
    "sentences": [
      "Topic:Crime Vanya Gaberova wears glasses capable of recording video, which were seized during investigations into the spy ring.",
      "(Reuters: Metropolitan Police Service) It was as though it came straight from a spy novel.",
      "There was a beautician, a love triangle and a mixed-martial-arts fighter.",
      "The operations were run out of a dilapidated guesthouse in a British seaside town.",
      "Children's toys, car keys, water bottles and even a pair of glasses were used to hide covert surveillance devices.",
      "There were fake identities purporting to be those of accredited journalists, UN ambassadors, law enforcement officers and health workers.",
      "Members of the spy ring had fake IDs and uniforms to help them on their operations.",
      "(Supplied: UK Crown Prosecution Service) Some of the uniforms sourced to help the spies get into buildings undetected included those for paramedics and couriers from DHL, Uber, Deliveroo and Pizza Express.",
      "But this isn't a gripping espionage thriller.",
      "This is a story of a sophisticated spy ring, which was working on behalf of the Russian government.",
      "The Bulgarian spies operated for years, tracking people and sourcing information sought by the Kremlin.",
      "(Supplied: UK Crown Prosecution Service) For two-and-a-half years until they were caught in February 2023, a group of six Bulgarians spied on prominent individuals and gathered evidence of key locations that were of interest to the Kremlin.",
      "Their base was a 33-room former hotel in the resort town of Great Yarmouth, in Norfolk.",
      "Orlin Roussev was the ringleader.",
      "Orlin Roussev, the ringleader of the spies he called \"the Minions\".",
      "(Reuters: Metropolitan Police Service) Roussev reported to an Austrian-born Russian spymaster named Jan Marsalek, who is wanted in Germany and Austria for fraud and embezzlement.",
      "He acted as an intermediary for Russian intelligence.",
      "Marsalek gave instructions to Roussev, whose job was to wrangle his five operatives: Bizer Dzhambazov, Ivan Stoyanov, Katrin Ivanova, Vanya Gaberova and Tihomir Ivanchev.",
      "Using the messaging app Telegram, the group discussed plans, with codenames taken straight from Hollywood.",
      "On Roussev's phone police found messages in which he went by the codename \"Jackie Chan\", while Dzhambazov used \"Mad Max\" and \"Jean-Claude Van Damme\" as pseudonyms.",
      "They referred to their subordinate spies as \"the Minions\", named for the sidekicks to the lead character villain Gru in the film Despicable Me.",
      "GRU is also the name of the Russian defence ministry's military intelligence service — one of the country's main spy agencies.",
      "The \"Minions\" — Vanya Gaberova, Katrin Ivanova, and Tihomir Ivanchev — are due to be sentenced in May.",
      "(Reuters: Metropolitan Police Service) The spy ring was hired to conduct espionage on targets across the UK and Europe.",
      "Roussev pleaded guilty to spying on behalf of Russia before the trial of three of his co-accused, which was held earlier this year.",
      "Katrin Ivanova, Vanya Gaberova and Tihomir Ivanchev, the \"Minions\", were all found guilty in March.",
      "They are due to be sentenced in coming weeks.",
      "Dzhambazov was Roussev's right-hand man.",
      "Bizer Dzhambazov, Roussev's right hand man who went by the codenames \"Mad Max\" and \"Jean-Claude Van Damme\" on a messaging app.",
      "(Reuters: Metropolitan Police Service) He was in a relationship with fellow spy and \"Minion\", Ivanova.",
      "They lived together in a house in north-west London.",
      "Another \"Minion\", Gaberova, who worked as a beautician, was also in a relationship with Dzhambazov.",
      "Ivanchev, the third \"Minion\", was also previously in a relationship with Gaberova.",
      "All have pleaded guilty to conspiracy to spy — Ivanova was also found guilty of possessing fake ID's.",
      "The fifth comrade, Stoyanov, a mixed martial arts fighter, has pleaded guilty to spying.",
      "Ivan Stoyanov faces sentencing after pleading guilty to spying for Russia.",
      "(Suppliled: UK Crown Prosecution Service) When Roussev's base was raided, police found what they have described as an \"Aladdin's cave\" of espionage paraphernalia.",
      "Among the treasure trove of devices seized were 221 mobile phones, more than 250 hard drives, close to 500 SIM cards and hundreds of other items used for recording, surveillance and hacking.",
      "More than 90 bank cards were also found, along with 75 passports in 55 different names.",
      "A fake ID used by the Bulgarian spy ring.",
      "(Supplied: UK Crown Prosecution Service) They were used to help the spies with their work of following people, reconnaissance around important buildings and feeding detailed information back to Marsalek, who passed it onto Moscow.",
      "Paid handsomely for their work, the group carried out six key operations the UK's Crown Prosecution Service (CPS) used to build its case.",
      "Source: UK Crown Prosecution Service Its investigation was based on extensive communications between ring members on Telegram, with a UK court hearing detectives trawled through more than 200,000 messages.",
      "There was also evidence of financial transactions and travel, and hundreds of spy devices, many of which were found in the hotel Roussev used as the ring's headquarters.",
      "\"Sifting through thousands of messages, and then matching this up with physical travel, financial statements and surveillance reports and footage, meant detectives were able to build up a compelling picture of the group's activity, as well as identify those involved and their roles within the group,\" the Metropolitan Police Service said.",
      "During the court proceedings, the prosecution proved that by conspiring to obtain information that was of use to a foreign adversary, the agents were working against the safety and interests of the UK.",
      "\"It was clear that the activity was for the benefit of Russia, not just from the choice of targets but also from the nature of the Telegram messages that were exchanged between members of the group,\" the UK Crown Prosecution Service said.",
      "Investigative journalist and Russian security expert Andrei Soldatov said this operation was an example of how Moscow changed its military intelligence operations in 2014 following its annexation of Crimea.",
      "\"What we've seen ever since is a reliance on proxies, on criminals, on people who do not have diplomatic cover, and they can still be quite effective,\" he said.",
      "\"Russian military intelligence has become much more aggressive, much more adventurous, and the people they are recruiting now for operations are not spies in a traditional sense of the word.",
      "\"It's not about people who are trying to collect information secretly infiltrating Western society.",
      "The head of the CPS Special Crime and Counter Terrorism division, Frank Ferguson, described the espionage operation as \"high-level\" with \"significant\" financial reward for those involved.",
      "He said the spy ring's targeting of those who had fled persecution in Russia undermined the message that the UK was a safe place.",
      "Two of their main targets were investigative journalists Christo Grozev and Roman Dobrokhotov — both of whom have reported stories critical of Moscow.",
      "Bulgarian national Grozev uncovered Russian links to the 2018 Salisbury poisoning attacks and as a result was placed on a wanted list by the Russian Interior Ministry.",
      "Often referred to as the \"second oldest profession\", espionage is a tool used by many countries to keep tabs on their adversaries.",
      "So what were spies for Russia doing in Australia and how were they able to keep operating in secret?",
      "The spy ring followed Grozev around Europe, and spied on him in multiple countries including Austria, Montenegro and Spain.",
      "They provided Russia with information about his accommodation, his car and his contacts, according to the CPS.",
      "The group also considered a potential \"honey trap\" plot using Gaberova to target him.",
      "Dobrokhotov, a Russian journalist who lives in the UK working as editor in-chief of investigative outlet The Insider, was also tracked around Europe.",
      "On one flight from Budapest to Berlin, Ivanova sat next to him.",
      "Messages revealed the group had discussed kidnapping Dobrokhotov, but decided it was too risky.",
      "From late 2022 until February 2023, they spied on a US military base in the German city of Stuttgart.",
      "Some of the sophisticated technology that was used to spy on the US base, according to UK prosecutors.",
      "(Supplied: UK Crown Prosecution Service) It is understood to be a location where Ukrainian soldiers were being trained to use surface-to-air weapons.",
      "The plan was to secure key intelligence on those at the base so the information could then be used to locate members of the Ukrainian military when they returned to the battlefield.",
      "The operation was conducted from a car, which had been fitted out with surveillance equipment, that was later found near the military base.",
      "\"Surveillance images and videos of the base were recovered from devices along with general descriptions of security at the base,\" the CPS said.",
      "Some of the other operations simply sought to cause chaos.",
      "For example, they sprayed the Kazakhstan Embassy in London with fake pig blood, so they could then create a phoney opposition group and demonstrate outside.",
      "Roussev, Dzhambazov and Stoyanov were behind the fake pig blood operation, according to UK prosecutors.",
      "(Supplied: UK Crown Prosecution Service) They would then feed bogus intelligence about the group back to Kazakh security services, via their Russian connections.",
      "\"The aim of the operation was to increase the standing of their Russian clients in the eyes of the Kazakhs, for the benefit of Russia,\" the CPS said.",
      "Mr Soldatov said these kinds of plots didn't require \"extremely competent or professional operatives.\"",
      "\"What is enough is just to show that you are capable of something,\" he said.",
      "He said the group didn't need to \"kill a lot of people\" to achieve their objective, they just had to show intent and that it would have an impact.",
      "\"In this case, on the UK and European countries, because now they understand that we need to pay more for protection and for security,\" he said.",
      "\"So, in a way, even an unsuccessful operation raises a cost of protection and security, which is exactly the objective of such operations.",
      "Black Bag is the latest spy drama to grace our screens.",
      "But could our obsession with espionage reflect a deeper anxiety?",
      "\"The other objective has been always, at least since 2016, to show that Russian capabilities are still there, that they are still capable of doing things in Europe and in the United States and again, for that, you don't need to be extremely successful.\"",
      "Although Russian intelligence took a new direction in 2014, it was the expulsion of more than 700 Russian diplomats and spies after Moscow's invasion of Ukraine eight years later, that would lead to the real shift.",
      "Most of the agents are recruited online through messaging apps like Telegram.",
      "\"It's not only about Russian military intelligence, it's also other agencies like the SVR, which is a Russian Foreign Intelligence Agency, or the FSB, which is supposed to only be acting inside the country but it's getting more and more aggressive abroad\", Mr Soldatov said.",
      "Even though the Bulgarian spy ring was scuppered, Russia is still likely to consider its work a success.",
      "Moscow didn't have to sacrifice any nationals to gather the intelligence it did, and their operations sent a chilling message to Russian citizens critical of the Kremlin hiding out in the UK.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Earthquakes LIVE Topic:Beef Cattle Farming Austria Bulgaria Courts Crime England Foreign Affairs Germany Hungary Montenegro Police Russian Federation Spain Ukraine United Kingdom World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "uk crown",
      "crown prosecution",
      "prosecution service",
      "spy ring",
      "metropolitan police",
      "police service",
      "supplied uk",
      "vanya gaberova",
      "reuters metropolitan",
      "military intelligence"
    ]
  },
  {
    "title": "United States, Ukraine sign critical mineral deal as Donald Trump moves to secure peace with Russia",
    "source": "PerthNow",
    "url": "https://www.perthnow.com.au/politics/world-politics/us-ukraine-mineral-deal-trump-says-he-is-ready-to-sign-this-afternoon-as-last-minute-changes-hold-off-peace-c-18543518",
    "publishedAt": "2025-04-30T22:50:00Z",
    "sentences": [
      "The United States and Ukraine have signed a historic economic deal that will give the United States access to Ukraine’s rare minerals, something US President Donald Trump thinks will help establish peace in the region.",
      "The deal comes after Mr Trump called on Kyiv to repay the United States for billions spent on assistance given to repel Russian invasion.",
      "Treasury Secretary Scott Bessent said in a video posted to X that “this partnership allows the United States to invest alongside Ukraine, to unlock Ukraine’s growth assets, mobilise American talent, capital and governance standards that will improve Ukraine’s investment climate and accelerate Ukraine’s economic recovery”.",
      "Taking to social media, Ukraine’s Economy Minister Yulia Svyrydenko shared an image alongside US officials, also confirming the signing.",
      "“Thanks to the leadership and agreements between President Volodymyr Zelensky and President Donald Trump, Secretary of the Treasury Scott Bessant and I signed the agreement between Ukraine and the United States to establish the United States–Ukraine-Ukraine Reconstruction Investment Fund,” she wrote on X.",
      "“I thank everyone who contributed to this Agreement and helped make it stronger.",
      "“This document is capable of delivering success for both our countries — Ukraine and the United States.",
      "“God bless Ukraine and God bless the United States of America.",
      "Mr Trump indicated in February that he wanted access to Ukraine’s rare earth materials as a condition for continuing United States support in the war, describing it as reimbursement for the billions of dollars in aid the United States has given to Kyiv.",
      "But talks stalled after a tense Oval Office meeting of United States and Ukrainian leaders, and reaching an agreement since then has proven difficult and strained relations between Washington and Kyiv.",
      "Mr Bessent said during a cabinet meeting at the White House that the Trump Administration was ready to sign a deal, but that there was still work to do.",
      "“The Ukrainians decided last night to make some last-minute changes,” Bessent said when asked about reports that Ukraine was ready to agree to the pact.",
      "“We’re sure that they will reconsider that.",
      "And we are ready to sign this afternoon if they are.” He did not elaborate as to the late changes he said Ukraine had made.",
      "The United States is seeking access to more than 20 raw materials deemed strategically critical to its interests, including some non-minerals such as oil and natural gas.",
      "Among them are Ukraine’s deposits of titanium, which is used for making aircraft wings and other aerospace manufacturing, and uranium, which is used for nuclear power, medical equipment and weapons.",
      "Ukraine also has lithium, graphite and manganese, which are used in electric vehicle batteries.",
      "For Ukraine, the deal is seen as possibly key in getting future military aid from the United States.",
      "The Ukrainian cabinet approved the agreement on Wednesday, empowering Svyrydenko to sign it in Washington.",
      "Once signed by both sides, the deal would need to be ratified by the Ukrainian parliament before it could take effect.",
      "In Moscow, a senior Kremlin official said on Wednesday that clinching a deal to end the Russia-Ukraine war “is far too complex to be done quickly”, as the United States labours to bring momentum to peace efforts and expresses frustration over the slow progress.",
      "The negotiations come amid rocky progress in Washington’s push to stop the war.",
      "Russian President Vladimir Putin backs calls for a ceasefire before peace negotiations, “but before it’s done, it’s necessary to answer a few questions and sort out a few nuances,” Kremlin spokesman Dmitry Peskov said.",
      "Meanwhile, a night-time Russian drone attack on Kharkiv, Ukraine’s second-largest city, wounded at least 45 civilians, officials said.",
      "- with Rueters"
    ],
    "topics": [
      "united states",
      "bessent said",
      "access ukraine",
      "ukraine rare",
      "president donald",
      "donald trump",
      "mr trump",
      "ukraine united",
      "god bless",
      "aid united"
    ]
  },
  {
    "title": "Ukraine ready to sign rare-minerals deal sought by Trump",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/politics/federal/ukraine-ready-to-sign-rare-minerals-deal-sought-by-trump-20250501-p5lvk3",
    "publishedAt": "2025-04-30T20:07:46Z",
    "sentences": [
      "Copy link Copied Copy link Copied That’s a wrap Chalmers calls Taylor’s costings a ‘joke’ and a ‘sham’ No cost of living crisis with Coalition in charge, Taylor promises Hume says Coalition won’t squander windfalls Coalition will deliver biggest budget improvement in 15 years, says Taylor PM snaps at questions about Labor MP’s father Copy link Copied Copy link Copied That’s a wrap.",
      "Thanks for following The Australian Financial Review’s live coverage this Thursday, May 1, 2025.",
      "We will have more for you in our next coverage.",
      "Here are some of the stories we covered today: Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied wrap",
      "wrap chalmers",
      "chalmers calls",
      "calls taylor",
      "taylor costings",
      "costings joke",
      "joke sham"
    ]
  },
  {
    "title": "US-Ukraine minerals deal looks better for Kyiv than expected - but Trump is an unpredictable partner",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/us-ukraine-minerals-deal-looks-better-for-kyiv-than-expected-but-trump-is-an-unpredictable-partner-255723",
    "publishedAt": "2025-04-30T14:00:00Z",
    "sentences": [
      "Lecturer in History and International Studies, Leiden University Andrew Gawthorpe does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "Leiden University provides funding as a member of The Conversation UK.",
      "View all partners The United States and Ukraine have finally signed a long-awaited agreement on Ukraine’s postwar reconstruction – and, at first reading, the details appear more favourable for Kyiv than many observers expected.",
      "At the core of the “economic partnership agreement” is the exploitation of Ukraine’s mineral wealth.",
      "Ukraine will get access to US investment and technology, and the US will eventually get a share of the profits.",
      "The rest will finance the war-torn nation’s recovery if and when a peace agreement is signed with Russia.",
      "Several aspects of this deal stand out as positive for Ukraine.",
      "Unlike in previous drafts, the country retains ownership of its natural resources.",
      "All profits are to be invested in Ukraine for ten years after the agreement comes into force.",
      "Washington can also make its contribution in the form of new military aid, although it will be down to the US president to decide whether or not to do that.",
      "Earlier in the negotiations, a major sticking point was the demand from the US president, Donald Trump, that the agreement include compensation for past US aid to Ukraine, which he insisted amounted to US$350 billion (£260 billion).",
      "Many analysts estimate the figure is closer to US$120 billion.",
      "Before the deal was signed, Ukraine’s prime minister, Denys Shmyhal, said the deal would “not include assistance provided before its signing”.",
      "And the Ukrainian government announcement stated that the new agreement “focuses on further, not past US military assistance”.",
      "But when the US treasury secretary, Scott Bessent, spoke to journalists, he described the deal as “compensation” for “the funding and the weapons”.",
      "Sign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK.",
      "Every Thursday we’ll bring you expert analysis of the big stories in international relations.",
      "Whether Bessent’s statement represents political spin, or whether there is still distance between Washington and Kyiv on this critical point, remains to be seen.",
      "The formal text has not been released, and many details remain to be ironed out.",
      "Trump can be an erratic negotiator who is prone to sudden changes of direction.",
      "Indeed, the signing of this agreement is just the latest twist in a broader effort to bring the war in Ukraine to an end – one which probably still has many surprises ahead.",
      "Trump appears to be losing patience with what he views as Russia’s refusal to engage with the peace process.",
      "Signing the deal may have been intended as a warning to Moscow to get serious about ending the conflict.",
      "The new agreement reportedly states that the US and Ukraine share a “long-term strategic alignment”.",
      "That’s a far cry from Trump’s rhetoric only a few months ago, when he called Ukraine’s president, Vlodomyr Zelensky, a “dictator”“ and blamed Kyiv for starting the war with Russia.",
      "But given Trump’s changes of mood, this agreement is unlikely to be the final word on how he views the conflict.",
      "Despite talk of a long-term strategic alignment, one thing the deal doesn’t contain is any explicit security guarantees for Ukraine.",
      "But the White House argues – and other observers hope – that US investment in Ukraine will give the US an implicit stake in the country’s security.",
      "That might deter Russia from attacking Ukraine again, out of fear the US would act to protect its investment.",
      "However, once we move from the realm of politics and security to economics, several glaring flaws in this logic become apparent.",
      "They all come down to whether the mineral wealth at the heart of this agreement can be profitably exploited – and, indeed, whether it even exists.",
      "The American humorist Mark Twain is said to have once defined a mine as \"a hole in the ground owned by a liar”.",
      "Assessing the precise scale of underground mineral deposits is notoriously difficult – and not every deposit can be extracted in a profitable fashion.",
      "In Ukraine, the exploratory work has simply not been done.",
      "Even the supposed size of the deposits, which are based on old Soviet surveys conducted in a superficial fashion, is not certain.",
      "Many of the minerals that supposedly lie under Ukraine’s surface are so called “rare earths”, which are critical to hi-tech supply chains.",
      "But they are also expensive and time-consuming to exploit, requiring a massive upfront investment which may eventually be lost.",
      "Even in successful cases, it generally takes over a decade to get production onstream.",
      "Today, there are few rare-earth projects under development anywhere in the world outside China – even in countries that are not current (and possibly future) war zones.",
      "Most of Ukraine’s supposed deposits lie in the east of the country in areas vulnerable to Russian attack, making investment risky.",
      "All of this makes economic partnership agreement of doubtful long-term significance for the broader peace process.",
      "The potential gains from it are too hypothetical to make much difference within a meaningful timescale.",
      "The deal is unlikely to generate much real economic incentive for the US to defend Ukraine, and so is unlikely to become a new source of military assistance for Kyiv.",
      "For the Russian president, Vladimir Putin, the deal doesn’t change a lot.",
      "While it might indeed be a signal that Trump is running out of patience with Russia, it does little to change the underlying realities of the conflict.",
      "We can’t rule out the possibility that Trump, as unpredictable as ever, might make a more meaningful commitment to Ukraine in the future, one that changes the course of the war.",
      "But – at first glance, certainly – this minerals deal is not it."
    ],
    "topics": [
      "leiden university",
      "conversation uk",
      "economic partnership",
      "partnership agreement",
      "mineral wealth",
      "us investment",
      "us president",
      "past us",
      "new agreement",
      "military assistance"
    ]
  },
  {
    "title": "France accuses Russia of a decade’s worth of high-profile cyberattacks",
    "source": "The Verge",
    "url": "https://www.theverge.com/politics/658222/france-russia-cyberattacks-fancy-bear-apt28-macron-leaks",
    "publishedAt": "2025-04-29T23:15:07Z",
    "sentences": [
      "The accusation attributes ‘Macron-leaks’ to the Kremlin as the EU increases their pressure on Russia to exit Ukraine.",
      "The accusation attributes ‘Macron-leaks’ to the Kremlin as the EU increases their pressure on Russia to exit Ukraine.",
      "by Tina Nguyen In an unprecedented display of diplomatic aggression, French authorities publicly accused Russia of sponsoring several high-profile cyber attacks on French entities for over a decade to gather intelligence and destabilize the country.",
      "The incidents include everything from a faked Islamic State takeover of a French television broadcast signal in 2015 to the leak of President Emmanuel Macron’s emails in 2017.",
      "On Tuesday, France’s Foreign Ministry formally attributed those cyberattacks and several others to APT28, a Russian military intelligence (GRU) hacking unit also known as Fancy Bear, best known in America for leaking Hillary Clinton’s emails during the 2016 U.S. presidential election and sustained cyberattacks on U.S. political operations.",
      "APT28’s activities in France followed the same playbook: the “Macron leaks” were published the day before France’s presidential election in the hopes of swaying voters, and the faked ISIS broadcast hijacking, which took place in the wake of the 2015 Bataclan terrorist attacks, were intended to “create a panic in France.” According to the French government, the GRU has escalated its cyberattacks against France and other members of the European Union since 2021, shortly before Russia invaded Ukraine.",
      "(Ukraine itself has been a longtime frequent target of Russian cyberwarfare.)",
      "The intrusions targeted entities not just in government, but also in finance, aerospace and defense, sports organizations affiliated with the 2024 Paris Olympics, think tanks, and the media.",
      "To display its own cyber defense capacities, France revealed the geographical location of one of APT28’s units – a signal that its operators were able to trace the origins of Russian cyber incursions.",
      "This is the first time France has publicly attributed a cyber attack to a foreign government’s intelligence service, according to Le Monde.",
      "The diplomatic environment has shifted profoundly, however: Vladimir Putin refuses to end his years-long invasion of Ukraine without getting to keep the territory he’s seized – an untenable position for both Ukraine and the EU, which views Russian territorial gains as a threat to the EU’s geopolitical integrity.",
      "Russian cyberattacks pose an additional threat, both to their national security apparatus and election integrity.In an interview the day before the Ministry’s public declaration, Macron told the media that he believed that France and their Western allies – including President Donald Trump – would increase pressure on Russia “over the next eight to ten days” to accept their terms.",
      "He also announced that France and Poland would soon sign a “friendship treaty” that will include joint efforts to combat Russian election interference via cyberattacks and misinformation campaigns in both countries."
    ],
    "topics": [
      "pressure russia",
      "accusation attributes",
      "attributes kremlin",
      "kremlin eu",
      "eu increases",
      "increases pressure",
      "russia exit",
      "exit ukraine",
      "presidential election",
      "ukraine accusation"
    ]
  },
  {
    "title": "Trump is good at viral moments but Ukraine is waiting for real, war-ending diplomacy",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-04-30/ukraine-russia-donald-trump-diplomacy-vatican-meeting-zelenskyy/105228574",
    "publishedAt": "2025-04-29T22:51:02Z",
    "sentences": [
      "analysis By Barbara Miller Topic:World Politics Volodymyr Zelenskyy and Donald Trump meet at the Vatican.",
      "(Ukrainian Presidential Press Service via Reuters) Welcome to the wild and wacky ride of global diplomacy under America's 47th president, in which Donald Trump's opinions on the leaders of Ukraine and Russia can change in a heartbeat.",
      "Days after Volodymyr Zelenskyy and Trump created an image for the ages with their tete-a-tete at the Vatican, Vladimir Putin has grabbed the headlines back with the announcement of a three-day ceasefire in Ukraine.",
      "It's not just any three days Putin is proposing his troops, and the North Koreans he's now finally admitted are helping out, lay down their weapons.",
      "The ceasefire from May 8 would coincide with victory celebrations to mark the end of World War II.",
      "President Xi Jinping of China and India's Narendra Modi are among the guests invited to a military parade in Moscow.",
      "The announcement has been met with cutting scepticism from Ukraine.",
      "Zelenskyy called for a full and unconditional ceasefire for at least 30 days, beginning immediately.",
      "\"For some reason, everyone is supposed to wait for May 8 and only then have a ceasefire to ensure calm for Putin during the parade,\" he said.",
      "\"We value people's lives and not parades.\"",
      "Donald Trump says Ukraine is prepared to give up Crimea, territory that Russia annexed after 2014.",
      "So what do both sides of the conflict want to see before ending the war?",
      "A 30-hour ceasefire announced by Russia over Easter, and cautiously agreed to by Ukraine, did not hold.",
      "Both sides accused one another of violating it and Russia has previously rejected a US proposal for a 30-day ceasefire.",
      "This latest offer looks like an attempt by Putin to get back in Trump's good books after the Vatican meeting between Trump and Zelenskyy.",
      "That meeting was yet another viral moment involving Trump and a world leader, but Zelenskyy and Putin are not yet at the negotiating table and the people of Ukraine urgently need more than a promise of three days of peace.",
      "It was a striking piece of choreography, more like a scene in a minimalist play than a dialogue between two world leaders.",
      "The US and Ukrainian presidents sat directly across from one another in St Peter's Basilica on hastily procured chairs, their knees almost knocking.",
      "In the ornate surroundings on the sidelines of Pope Francis's funeral, Trump and Zelenskyy hunched towards one another, apparently locked in intense discussion.",
      "The imagery was all the more remarkable because it was their first encounter since the infamous Oval Office clash in late February, when the Ukrainian leader was dressed down by Trump and his Vice-President JD Vance.",
      "The US president, whose views can flip-flop depending on whom he last spoke to, emerged with nothing but praise for his Ukrainian counterpart, a man he had previously labelled a \"dictator\".",
      "Trump said it was \"a beautiful meeting\" and that Zelenskyy was \"working hard\" and \"wants to do something good for his country\".",
      "Donald Trump said the meeting with Zelenskyy was \"beautiful\".",
      "(Reuters: Ukrainian Presidential Press Service) As for the Oval Office blow-up, Trump dismissed that as \"a little dispute\".",
      "The US president also took the opportunity to reprimand Putin, suggesting the Russian leader might not actually want the war to stop and could be \"just tapping me along\".",
      "It was the second startling public rebuke of the Russian president in a matter of days.",
      "\"Vladimir, STOP!,\" Mr Trump posted late last week after a Russian missile attack on Ukraine's capital, which killed at least 12 people.",
      "The Vatican rendezvous also got glowing reviews from the Ukrainian side, with Zelenskyy describing it as \"potentially historic\".",
      "But perhaps, the word doing the most work there is \"potentially\".",
      "Despite his recent tough words for Vladimir Putin, the fact remains that Donald Trump has generally appeared to favour the Russian leader and has often echoed his talking points on the war.",
      "What's known of the deal the US is proposing, being negotiated by the ubiquitous envoy Steve Witkoff, suggests it would be deeply unpalatable to Ukraine.",
      "A major sticking point is the issue of Crimea, which Russia illegally annexed in 2014.",
      "It has been 11 years since Russia took control of the Crimean Peninsula.",
      "Here is what we know about what to expect next.",
      "The reported deal includes Washington accepting Russia's annexation of Crimea as well as recognising as Russian territory other areas in the east of Ukraine that have been occupied since the 2022 invasion began.",
      "Zelenskyy has signalled abandoning a claim to the southern peninsula is a red line, arguing that formally giving up the territory would breach the Ukrainian constitution.",
      "Yet, on his return home from the Vatican, Trump replied, \"I think so,\" when asked if he thought the Ukrainian president was ready to cede control of Crimea.",
      "That seems like a big assumption.",
      "Under the reported plan, Ukraine could continue to push for membership of the European Union but would have to relinquish its aspirations of becoming a NATO member.",
      "In return, Kyiv would \"be fully reconstructed and compensated financially\" and receive \"robust\" security guarantees, though it's unclear who would provide those and what form they would take.",
      "German Defence Minister Boris Pistorious has warned Ukraine not to agree to any territorial concessions included in the US proposals, saying it would be \"akin to capitulation\".",
      "It's hard to square Trump's apparent optimism with those obvious roadblocks.",
      "In recent days, the most tentative of signs have emerged that Ukraine and Russia could be willing to negotiate.",
      "In a BBC interview, Zelenskyy also suggested he'd be open to negotiations with a major caveat.",
      "\"A full and unconditional ceasefire opens up the possibility to discuss everything,\" the Ukrainian leader said.",
      "It's hard to know if the talk of talks represents a glimmer of hope or is just more tactical posturing.",
      "If at some point in the short to medium term Ukraine and Russia were to engage in high-level talks, that in itself would be a major achievement.",
      "Trump will take credit for any such development, even if he doesn't manage to stick with it that long.",
      "The US administration is obviously impatient, and this moment presents a test for the leader who famously claimed he'd end Russia's war in a day.",
      "Does he have the very real diplomacy — often the kind done behind closed doors — needed to broker a deal to end Russia's war in Ukraine, or is it all for show?",
      "US President Donald Trump meets with North Korean leader Kim Jong Un at the demilitarised zone separating the two Koreas.",
      "(Reuters: Kevin Lamarque) He is very good at making viral moments on the global stage.",
      "The Zelenskyy meeting in the Oval Office and now the Vatican are the latest, but the world has watched him run this strategy in the past.",
      "He stepped across the demarcation line and into the DMZ to meet North Korean leader Kim Jong Un in 2019.",
      "He met Putin in Helsinki the year before.",
      "He faced off with European leaders, including former German chancellor Angela Merkel, in moments captured in iconic images.",
      "Angela Merkel posted this image from the 2018 G7 Summit to her Instagram page.",
      "(Instagram: bundeskanzlerin) The US administration is amping up the pressure for a deal and has now repeatedly threatened to walk away if one can't be agreed.",
      "\"It needs to happen soon,\" US Secretary of State Marco Rubio told NBC on Sunday.",
      "\"We cannot continue to dedicate time and resources to this effort if it's not going to come to fruition.\"",
      "As they locked eyes in St Peter's Basilica, Trump and Zelenskyy may have realised they had more in common than either might care to admit.",
      "Both stood out in their sartorial choices.",
      "Trump opted for a blue suit, Zelenskyy for a black variation of the military-style fatigues he's favoured since the war began.",
      "Both masterful communicators, they appeared to instinctively lean into the drama of their encounter and talk up its significance afterwards.",
      "In time it may become clear that while 15 minutes on the fringes of a pope's funeral created a powerful image, it didn't move the needle in attempts to bring about a resolution to the three-year-long conflict.",
      "We may later recognise that when Volodymyr Zelenskyy hailed the meeting as \"potentially historic\" he chose those words very carefully.",
      "Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:World Politics Topic:World Politics Topic:Unrest, Conflict and War Topic:Explainer Foreign Affairs Russian Federation Ukraine United States War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "world politics",
      "donald trump",
      "topic world",
      "politics topic",
      "volodymyr zelenskyy",
      "ukraine russia",
      "one another",
      "trump zelenskyy",
      "oval office",
      "us president"
    ]
  },
  {
    "title": "Putin announces unilateral three-day ceasefire in Ukraine",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/putin-announces-unilateral-three-day-ceasefire-in-ukraine-c-18506446",
    "publishedAt": "2025-04-28T12:21:23Z",
    "sentences": [
      "Russian President Vladimir Putin has declared a three-day ceasefire in the war with Ukraine next month to mark the 80th anniversary of the victory of the Soviet Union and its allies in World War II.",
      "The Kremlin said the 72-hour ceasefire would run from the start of May 8 to the end of May 10, and Russia called on Ukraine to join it as well.",
      "The Kremlin said Russian President Vladimir Putin ordered the full cessation of hostilities on “humanitarian grounds” for the Victory Day on May 9.",
      "Know the news with the 7NEWS app: Download today In the event of violations by the Ukrainian side, Russia’s armed forces would give an “adequate and effective response”, the statement said.",
      "It comes as US President Donald Trump scaled up efforts to broker a peace deal in Ukraine.",
      "Moscow and Kyiv have not held direct negotiations since March 2022, soon after the start of Russia’s full-scale war in Ukraine.",
      "Later that year, Ukrainian President Volodymyr Zelensky adopted a decree that ruled out negotiations with Putin, after Russia claimed four regions of Ukraine as its own.",
      "Zelensky, who met Trump on the sidelines of Pope Francis’ funeral, has said Kyiv would be ready to hold talks with Moscow once a ceasefire deal has stopped the fighting.",
      "Zelensky’s chief of staff, Andriy Yermak, said on Monday that continuing Russian attacks contradicted the Kremlin’s statements about wanting peace.",
      "“Russia is not ceasing fire at the front and is attacking Ukraine with Shaheds right now,” Yermak wrote on Telegram, referring to Iranian-made drones widely used by Russian forces.",
      "“All the Russians’ statements about peace without ceasing fire are just plain lies.” Asked by a reporter if the signal for direct talks should come from Ukraine or the United States, Kremlin spokesman Dmitry Peskov said: “Well, from Kyiv, at least Kyiv should take some actions in this regard.",
      "They have a legal ban on this.",
      "But so far we don’t see any action.” Meanwhile, Moscow would continue its “special military operation”, he said.",
      "Moscow and Kyiv are under pressure from the US to find a settlement to end the war, the deadliest in Europe since WWII.",
      "Ukraine accuses Russia of playing for time in order to try to seize more of its territory, and has urged greater international pressure to get Moscow to stop fighting.",
      "Russia accuses Ukraine of being unwilling to make any concessions and of seeking a ceasefire only on its own terms.",
      "Putin told Witkoff on Friday that Russia was ready for talks with Kyiv without preconditions, according to a Kremlin aide.",
      "Trump said on Friday the two sides were “very close to a deal”.",
      "In recent days he has been more critical than usual of Moscow, saying there was no reason for it to fire missiles into civilian areas and voicing concern that Putin was “just tapping me along”.",
      "On Sunday, US Secretary of State Marco Rubio said the Trump administration might abandon its attempts to broker a deal if Russia and Ukraine do not make headway.",
      "“It needs to happen soon,” Rubio told the NBC program Meet the Press.",
      "“We cannot continue to dedicate time and resources to this effort if it’s not going to come to fruition.” Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 2",
      "2 min",
      "read 1",
      "read 0",
      "0 min",
      "russian president",
      "president vladimir",
      "vladimir putin"
    ]
  },
  {
    "title": "Russia declares temporary Ukraine ceasefire to mark 80th anniversary of the end of World War II",
    "source": "ABC News",
    "url": "https://www.abc.net.au/news/2025-04-28/russia-declares-temporary-ceasefire-putin-says/105226744",
    "publishedAt": "2025-04-28T11:26:34Z",
    "sentences": [
      "Topic:Unrest, Conflict and War Russian President Vladimir Putin has declared a temporary ceasefire.",
      "(Reuters: Sputnik/Alexander Kazakov) Russia has announced a three-day ceasefire in Ukraine to mark the 80th anniversary of the end of World War II in Europe.",
      "Ukraine and its European allies say they do not believe this, while pushing back against US proposals they see as skewed towards Russia.",
      "The 72-hour ceasefire would run for three days either side of May 9, when Vladimir Putin will be hosting international leaders including Chinese President Xi Jinping.",
      "Russia has announced a three-day ceasefire in Ukraine to mark the 80th anniversary of the end of World War II in Europe.",
      "The Kremlin said the 72-hour ceasefire would run for three days either side of May 9, when Vladimir Putin will be hosting international leaders including Chinese President Xi Jinping to celebrate victory by the Soviet Union and its allies over Nazi Germany.",
      "\"All military actions are suspended for this period.",
      "Russia believes that the Ukrainian side should follow this example,\" it said in a statement.",
      "\"In the event of violations by the Ukrainian side, Russia's armed forces will give an adequate and effective response.\"",
      "Ukrainian Foreign Minister Andrii Sybiha, in response, said: \"If Russia truly wants peace, it must cease fire immediately.",
      "Why wait until May 8th?\"",
      "A ceasefire should be \"real, not just for a parade,\" he posted on X.",
      "This is the second ceasefire announcement Mr Putin has made in quick succession, following a 30-hour Easter ceasefire that each side accused the other of violating countless times.",
      "Russia's attack on Ukraine, in central Sumy in April.",
      "(Reuters: Press service of the State Emergency Service of Ukraine/Handout) Against a background of increasing impatience from the United States, both moves appeared aimed by the Kremlin leader at signalling to US President Donald Trump that Russia is still interested in peace.",
      "Ukraine and its European allies say they do not believe this, while pushing back against US proposals they see as skewed towards Russia.",
      "The latest announcement came after Mr Trump criticised Mr Putin for a deadly Russian attack on Kyiv last week and voiced concern at the weekend that the Russian president was \"just tapping me along\".",
      "Washington has repeatedly threatened to abandon its peace efforts unless there is real progress.",
      "Mr Trump wants to see a permanent ceasefire to ending Russia's war in Ukraine, White House press secretary Karoline Leavitt said on Monday.",
      "Ms Leavitt told reporters that Trump was increasingly frustrated with Mr Putin and Ukrainian President Volodymyr Zelenskyy, and both needed to come to the negotiating table to end the war.",
      "Donald Trump, back in the US after visiting Rome, says he wants Russia to \"stop shooting\".",
      "(Reuters: Nathan Howard) She noted that Mr Putin had offered a temporary ceasefire on Monday, but reiterated that Mr Trump had made it clear that he was seeking a permanent ceasefire.",
      "Up until now, Mr Putin had refused to accept a complete unconditional ceasefire, linking it to a halt in Western arms supplies to Kyiv and Ukraine's mobilisation effort.",
      "Just before the ceasefire announcement, Ukraine and Russia targeted each other with long-range strikes.",
      "The war between Russia-Ukraine has lasted three years.",
      "(Reuters: Press service of the State Emergency Service of Ukraine/Handout) The Russian Defence Ministry said its forces downed 119 Ukrainian drones overnight, most of them over Russia's border region.",
      "In Ukraine, air raid sirens rang out across the country on Monday morning, local time.",
      "There were no immediate reports of casualties or damage.",
      "Mr Trump said he harbours doubts about Mr Putin's sincerity in pursuing a deal, as Russian forces have continued to strike civilian areas of Ukraine with cruise and ballistic missiles while the talks have proceeded.",
      "But on Friday, the US president described a brokered settlement on the war as \"close.\"",
      "Western European officials have accused the Kremlin of dragging its feet on peace talks so that Russian forces, which are bigger than Ukraine's and have battlefield momentum, can capture more Ukrainian land.",
      "Russian Foreign Minister Sergey Lavrov discussed the war in a phone call with Mr Rubio on Sunday, the Russian Foreign Ministry said.",
      "The two diplomats focused on \"consolidating the emerging prerequisites for starting negotiations,\" the statement said, without offering further details.",
      "Russia has effectively rejected a US proposal for an immediate and full 30-day halt in the fighting by imposing far-reaching conditions.",
      "Ukraine has accepted it, Mr Zelenskyy has said.",
      "A French diplomatic official said at the weekend that Mr Trump, Mr Zelenskyy and French President Emmanuel Macron agreed \"to pursue in the coming days the work of convergence\" to obtain \"a solid ceasefire.\"",
      "The diplomat said a truce is a \"prior condition for a peace negotiation that respects the interest of Ukraine and the Europeans.\"",
      "The official was not authorised to be publicly named in accordance with French presidential policy.",
      "Ukraine, meanwhile, has pushed back at the possibility of surrendering land to Russia in return for peace, which Washington has indicated could be necessary.",
      "A key point of leverage for Ukraine could be a deal with Washington that grants access to Ukraine's critical minerals wealth.",
      "Ukraine and the US have made progress on a mineral agreement, with both sides agreeing that American aid provided so far to Kyiv will not be taken into account under the terms of the deal, Ukrainian Prime Minister Denys Shmyhal said Sunday.",
      "\"We have good progress,\" he said after talks with US Treasury Under Secretary Scott Bessent in Washington.",
      "\"The main thing is that we clearly defined our red lines: The agreement must comply with Ukraine's Constitution, legislation, and European commitments, and must be ratified by Parliament,\" Shmyhal said.",
      "The US and Europe have been Kyiv's biggest backers.",
      "AP/Reuters Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Military Equipment Unrest, Conflict and War World Politics Topic:Unions Analysis by Laura Tingle Topic:World Politics Topic:Beef Cattle Farming Analysis by David Taylor Topic:Sport Topic:Indigenous Culture Topic:Animal Attacks Topic:Earthquakes"
    ],
    "topics": [
      "mr putin",
      "mr trump",
      "vladimir putin",
      "back us",
      "world politics",
      "politics topic",
      "unrest conflict",
      "conflict war",
      "russian president",
      "temporary ceasefire"
    ]
  },
  {
    "title": "North Korea confirms Russia troop deployment, hails ‘heroes’",
    "source": "7NEWS.com.au",
    "url": "https://7news.com.au/news/north-korea-confirms-russia-troop-deployment-hails-heroes-c-18507739",
    "publishedAt": "2025-04-28T01:51:12Z",
    "sentences": [
      "North Korea has confirmed for the first time that it has sent troops to fight for Russia in the war with Ukraine, under the order of leader Kim Jong-un.",
      "The victorious end of the battle to liberate Russia’s Kursk region showed the “highest strategic level of the firm militant friendship” between North Korea and Russia, KCNA state news agency cited the North’s ruling party as saying, and made an important contribution to the liberation of Russian territory occupied by Ukraine.",
      "Russia last week said Ukrainian forces had been expelled from the last Russian village they had been holding, although Kyiv denied the claim and said their troops were still operating in Belgorod, another Russian region bordering Ukraine.",
      "Know the news with the 7NEWS app: Download today The Central Military Commission of the North’s ruling Workers’ Party said Kim made the decision to deploy troops under the comprehensive strategic partnership treaty he signed with Vladimir Putin in 2024.",
      "“Under the order of the head of state, the sub-units of the armed forces of the Republic regarded the territory of Russia as the one of their country and proved the firm alliance between the two countries,” KCNA cited the Commission as saying.",
      "“They who fought for justice are all heroes and representatives of the honour of the motherland,” KCNA quoted Kim as saying.",
      "North Korea “regards it as an honour to have an alliance with such a powerful state as the Russian Federation,” KCNA said.",
      "North Korea sent an estimated total of 14,000 troops, including 3000 reinforcements to replace its losses, Ukrainian officials have said.",
      "Lacking armoured vehicles and drone warfare experience, they took heavy casualties but adapted quickly.",
      "Russia confirmed on Saturday for the first time that North Korean soldiers have been fighting alongside Russians in Kursk.",
      "Neither Russia nor North Korea had previously either confirmed or denied the deployment.",
      "0 min read 1 min read Stream free on 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read 1 min read 0 min read 0 min read 1 min read 2 min read 1 min read 2 min read 2 min read"
    ],
    "topics": [
      "min read",
      "1 min",
      "read 1",
      "read 2",
      "2 min",
      "north korea",
      "0 min",
      "read 0",
      "first time",
      "north ruling"
    ]
  }
]