[
  {
    "title": "Official says major prisoner swap underway",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/23/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway/",
    "publishedAt": "2025-05-23T10:53:13Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 23, 2025 at 2:55PM EDT Published: May 23, 2025 at 6:53AM EDT CHERNIHIV REGION, Ukraine — CHERNIHIV REGION, Ukraine — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase of the exchange brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia’s Defense Ministry said it had received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine’s Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn’t herald any halt in fighting.",
      "Battles continues along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow’s forces attacked settlements in Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming with joy.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to great his family following registration procedures inside the facility.",
      "“I am really glad and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that “this could lead to something big??",
      "?” -- apparently referring to other diplomatic efforts to stop the fighting.",
      "After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive” peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed both sides clearly remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to the AP on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20-23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ By Samya Kullab And Hanna Arhirova Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine and Katie Marie Davies in Manchester, England, contributed.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "may 23",
      "23 2025",
      "2025 edt",
      "region ukraine",
      "ukraine chernihiv",
      "prisoner exchange"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "GuelphToday",
    "url": "https://www.guelphtoday.com/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia's Defense Ministry said it received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
      "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
      "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
      "?” — apparently referring to other diplomatic efforts to stop the fighting.",
      "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
      "___ Follow AP’s coverage of the war in Ukraine at  Samya Kullab And Hanna Arhirova, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "associated press",
      "prisoner exchange",
      "soldiers civilians",
      "first phase",
      "russia defense",
      "diplomatic efforts"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "SooToday",
    "url": "https://www.sootoday.com/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "This website is using a security service to protect itself from online attacks.",
      "The action you just performed triggered the security solution.",
      "There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.",
      "You can email the site owner to let them know you were blocked.",
      "Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.",
      "Cloudflare Ray ID: 944aa2f4fecaf106 • Your IP: Click to reveal 46.158.207.205 • Performance & security by Cloudflare"
    ],
    "topics": [
      "cloudflare ray",
      "ray id",
      "website using",
      "using security",
      "security service",
      "service protect",
      "protect online",
      "online attacks",
      "attacks action",
      "action performed"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "BradfordToday",
    "url": "https://www.bradfordtoday.ca/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia's Defense Ministry said it received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
      "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
      "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
      "?” — apparently referring to other diplomatic efforts to stop the fighting.",
      "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
      "___ Follow AP’s coverage of the war in Ukraine at  Samya Kullab And Hanna Arhirova, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "associated press",
      "prisoner exchange",
      "soldiers civilians",
      "first phase",
      "russia defense",
      "diplomatic efforts"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "Vancouver Is Awesome",
    "url": "https://www.vancouverisawesome.com/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700377",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia's Defense Ministry said it received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
      "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
      "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
      "?” — apparently referring to other diplomatic efforts to stop the fighting.",
      "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
      "___ Follow AP’s coverage of the war in Ukraine at  Samya Kullab And Hanna Arhirova, The Associated Press"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "associated press",
      "prisoner exchange",
      "soldiers civilians",
      "first phase",
      "russia defense",
      "diplomatic efforts"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "ElliotLakeToday.com",
    "url": "https://www.elliotlaketoday.com/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia's Defense Ministry said it received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
      "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
      "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
      "?” — apparently referring to other diplomatic efforts to stop the fighting.",
      "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
      "___ Follow AP’s coverage of the war in Ukraine at  Samya Kullab And Hanna Arhirova, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "associated press",
      "prisoner exchange",
      "soldiers civilians",
      "first phase",
      "russia defense",
      "diplomatic efforts"
    ]
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/world-news/ukrainian-official-says-major-prisoner-swap-with-russia-is-underway-10700375",
    "publishedAt": "2025-05-23T10:42:53Z",
    "sentences": [
      "CHERNIHIV REGION, Ukraine (AP) — Russia and Ukraine began a major prisoner exchange Friday, swapping hundreds of soldiers and civilians in the first phase of an exchange that was a moment of cooperation in otherwise failed efforts to reach a ceasefire in the 3-year-old war.",
      "President Volodymyr Zelenskyy said the first phase brought home 390 Ukrainians, including soldiers and civilians, with further releases expected over the weekend that will make it the largest swap of the war.",
      "Russia's Defense Ministry said it received the same number from Ukraine.",
      "“It’s very important to bring everyone home,” Zelenskyy wrote on Telegram, thanking all who worked to secure their return and pledging to continue diplomatic efforts to make more exchanges possible.",
      "Dozens of relatives of prisoners cheered and chanted “Thank you!” as buses carrying the freed captives arrived at a medical facility in Ukraine's Chernihiv region.",
      "The men, some with expressionless faces and others unable to contain their emotions, got off the buses wrapped in Ukrainian flags for joyful reunions.",
      "Kyiv and Moscow agreed in Istanbul last week to the exchange of 1,000 prisoners from each side in their first direct peace talks since the early weeks of Russia’s 2022 invasion.",
      "That meeting lasted only two hours and brought no breakthrough in U.S.-led efforts efforts to stop the fighting.",
      "Exchanges at the Belarus-Ukrainian border The swap took place at the border with Belarus in northern Ukraine, according to a Ukrainian official who spoke on condition of anonymity because he was not authorized to speak publicly.",
      "The released Russians were taken to Belarus for medical treatment, the Russian Defense Ministry said.",
      "The exchange, which would be the latest of dozens of swaps since the war began and the biggest involving Ukrainian civilians at one time, didn't herald any halt in fighting.",
      "Battles continued along the roughly 1,000-kilometer (620-mile) front line, where tens of thousands of soldiers have been killed, and neither country has relented in its deep strikes.",
      "Russia launched two ballistic missiles at infrastructure targets in the southern Ukrainian port of Odesa, killing two workers and injuring eight others, according to regional Gov.",
      "Oleh Kiper.",
      "It was the first recorded attack on the port since March 11.",
      "Moscow's forces attacked settlements in the Kherson region with artillery, mortars and drones throughout the day, killing three civilians and injuring 10, according to the Kherson Regional Prosecutor’s Office.",
      "They also shelled Kostyantynivka with artillery, killing one civilian, said Serhii Horbunov, head of the city’s military administration.",
      "Emotional reunions for some, but others must wait As the freed men entered the medical facility, people holding signs and photos of their relatives shouted names or brigade numbers, seeking any news of a loved one.",
      "The returning men inspected the photos, and a serviceman said he shared a cell with one of those on the sea of portraits held out toward him.",
      "“Vanya!” cried Nataliia Mosych, among the gathered relatives, “My husband!” She hadn’t seen her husband, Ivan, for almost two years, she said, beaming.",
      "“It is an unbelievable feeling.",
      "I am still in shock,” Mosych said after he came outside to greet his family following registration procedures inside the facility.",
      "“I am really glad, and we were not forgotten, and we still mean something for Ukraine.” Many who were freed expressed shock and disbelief that they had been exchanged.",
      "Some had trouble remembering names and details of their lives before their capture.",
      "One released POW joked in a video call with his girlfriend that he got a bit older in his three-year absence, and she replied he was as beautiful as ever.",
      "Many relatives wept when it became clear their loved ones were not among those returning, and they hoped those who were released could at least offer some information about their husbands, brothers and sons.",
      "“Maybe my dad will come tomorrow,” one small boy cried.",
      "News of the prisoner release emerged when U.S. President Donald Trump said Russia and Ukraine had carried out a large exchange.",
      "“A major prisoners swap was just completed between Russia and Ukraine,” Trump said on the Truth Social platform.",
      "He said it would “go into effect shortly.” He added in the post that \"this could lead to something big??",
      "?” — apparently referring to other diplomatic efforts to stop the fighting.",
      "No new Russia-Ukraine talks are set After the May 16 talks, Turkish Foreign Minister Hakan Fidan called the prisoner swap a “confidence-building measure” and said the parties had agreed in principle to meet again.",
      "But Kremlin spokesman Dmitry Peskov said Friday that there has been no agreement yet on the venue for the next round of talks as diplomatic maneuvering continued.",
      "Russian Foreign Minister Sergey Lavrov said Friday night that Moscow would give Ukraine a draft document outlining its conditions for a “sustainable, long-term, comprehensive\" peace agreement once the ongoing prisoner exchange had finished.",
      "European leaders have accused Russian President Vladimir Putin of dragging his feet in peace efforts while he tries to press his larger army’s battlefield initiative and capture more Ukrainian land.",
      "The Istanbul meeting revealed that both sides remained far apart on key conditions for ending the fighting.",
      "One such condition for Ukraine, backed by its Western allies, is a temporary ceasefire as a first step toward a peaceful settlement.",
      "The Kremlin has pushed back on a temporary halt to hostilities, and Putin has said any such truce must come with a freeze on Western arms supplies to Ukraine and an end to Ukraine’s mobilization drive.",
      "A senior Ukrainian official said in Istanbul that Russia had introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory.",
      "The official, who was not authorized to make official statements, spoke to The Associated Press on condition of anonymity.",
      "The proposal had not been previously discussed, the official said.",
      "Putin has long demanded as a key condition for a peace deal that Ukraine withdraw its troops from the four regions that Russia annexed in September 2022 but never fully controlled.",
      "Zelenskyy has warned that if Russia continues to reject a ceasefire and make “unrealistic demands,” it will signal deliberate efforts to prolong the war — a move that should bring tougher international sanctions.",
      "Russia’s Defense Ministry said it had shot down 788 Ukrainian drones away from the battlefield between May 20 and May 23.",
      "Ukraine’s air force said Russia fired 175 Shahed and decoy drones, as well as a ballistic missile since late Thursday.",
      "___ Arhirova reported from Kyiv, Ukraine.",
      "Associated Press writer Aamer Madhani in Washington, Yehor Konovalov in Ukraine, Alex Babenko in Ukraine's Chernihiv region, and Katie Marie Davies in Manchester, England, contributed.",
      "___ Follow AP’s coverage of the war in Ukraine at  Samya Kullab And Hanna Arhirova, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "chernihiv region",
      "russia ukraine",
      "defense ministry",
      "ministry said",
      "associated press",
      "prisoner exchange",
      "soldiers civilians",
      "first phase",
      "russia defense",
      "diplomatic efforts"
    ]
  },
  {
    "title": "Kremlin says none scheduled",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/22/no-new-direct-russia-ukraine-peace-talks-scheduled-kremlin-says/",
    "publishedAt": "2025-05-22T12:21:32Z",
    "sentences": [
      "ADVERTISEMENT Published: May 22, 2025 at 8:21AM EDT Russia and Ukraine have no direct peace talks scheduled, the Kremlin said Thursday, nearly a week after their first face-to-face session since shortly after Moscow’s invasion in 2022 and days after U.S. President Donald Trump said they would start ceasefire negotiations “immediately.” “There is no concrete agreement about the next meetings,” Kremlin spokesman Dmitry Peskov told reporters.",
      "“They are yet to be agreed upon.” During two hours of talks in Istanbul on May 16, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, in what would be their biggest such swap.",
      "Apart from that step, the meeting delivered no significant breakthrough.",
      "Several months of intensified U.S. and European pressure on the two sides to accept a ceasefire and negotiate a settlement have yielded little progress.",
      "Meanwhile, Russia is readying a summer offensive to capture more Ukrainian land, Ukrainian government and military analysts say.",
      "Russian President Vladimir Putin said earlier this week that Moscow would “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” Putin has effectively rejected a 30-day ceasefire proposal that Ukraine has accepted.",
      "He has linked the possibility to a halt in Ukraine’s mobilization effort and a freeze on Western arms shipments to Kyiv as part of a comprehensive settlement.",
      "European leaders have accused Putin of dragging his feet in peace efforts while he tries to press his bigger army’s battlefield initiative and capture more Ukrainian land.",
      "The major prisoner swap is a “quite laborious process” that “requires some time,” Peskov said.",
      "But he added: “The work is continuing at a quick pace, everybody is interested in doing it quickly.” Peskov told Russia’s Interfax news agency that Moscow had provided Kyiv with a list of prisoners it wants released.",
      "“We have not yet received a counter list from Kyiv.",
      "We are waiting,” he told Interfax.",
      "Ukrainian President Volodymyr Zelenskyy said Thursday that preparations are underway for the potential prisoner exchange, which he described as “perhaps the only real result” of the talks in Turkey.",
      "Peskov disputed a report Thursday in The Wall Street Journal that Trump told European leaders after his phone call with Putin on Monday that the Russian leader wasn’t interested in talks because he thinks that Moscow is winning.",
      "“We know what Trump told Putin, we don’t know what Trump told the Europeans.",
      "We know President Trump’s official statement,” Peskov said.",
      "“What we know contrasts with what was written in the article you mentioned.” Apart from the continuing war of attrition along the roughly 1,000-kilometre (620-mile) front line, which has killed tens of thousands of troops on both sides, Russia and Ukraine have been firing dozens of long-range drones at each other’s territory almost daily.",
      "Russia’s Defense Ministry said it shot down 105 Ukrainian drones overnight, including 35 over the Moscow region.",
      "It was the second straight night that Kyiv’s forces have targeted the Russian capital.",
      "More than 160 flights were delayed at three of Moscow’s four main airports, the city’s transport prosecutor said, as officials grounded planes citing concerns for passenger safety.",
      "The attack prompted some regions to turn off mobile internet signals, including the Oryol region southwest of Moscow, which was targeted heavily Wednesday.",
      "The Defense Ministry claimed it downed 485 Ukrainian drones over several regions and the Black Sea between late Tuesday and early Thursday, including 63 over the Moscow region, in one of the biggest drone attacks.",
      "It was not possible to verify the numbers.",
      "Meanwhile, the Ukrainian air force said Russia launched 128 drones overnight.",
      "Among the targets were Ukraine’s central Dnipropetrovsk region, damaging an industrial facility, power lines, and several private homes, regional Gov.",
      "Serhii Lysak said on Telegram.",
      "In Kyiv, debris from a Russian drone fell onto the grounds of a school in the capital’s Darnytskyi district, according to Tymur Tkachenko, head of the Kyiv City Military Administration.",
      "No injuries were reported.",
      "Ukrainian shelling in Russia’s Kursk region killed a 50-year-old man and injured two others, acting regional Gov.",
      "Alexander Khinshtein said Thursday.",
      "Putin visited the Kursk region on Tuesday for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month.",
      "Kyiv officials denied the claim.",
      "“Despite the liberation of our territory, the border region is still subject to enemy attacks,” Khinshtein warned residents on Telegram.",
      "“It is still dangerous to be there.” Putin has said Russian forces have orders to create a “security buffer zone” along the border.",
      "That would help prevent Ukraine from striking areas inside Russia with artillery, Putin told a government meeting, but he gave no details of where the proposed buffer zone would be or how far it would stretch.",
      "Putin said a year ago that a Russian offensive at the time aimed to create a buffer zone in Ukraine’s northeastern Kharkiv region.",
      "That could have helped protect Russia’s Belgorod border region, where frequent Ukrainian attacks have embarrassed the Kremlin.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "said thursday",
      "putin said",
      "trump told",
      "buffer zone",
      "russia ukraine",
      "peskov told",
      "capture ukrainian",
      "ukrainian land",
      "european leaders",
      "peskov said"
    ]
  },
  {
    "title": "Fallen Manitoba soldier honoured",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/canada/2025/05/20/manitoba-man-who-died-fighting-for-ukraine-to-be-honoured/",
    "publishedAt": "2025-05-21T20:34:35Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 21, 2025 at 4:20PM EDT Published: May 20, 2025 at 2:49PM EDT A Manitoba man killed while fighting for Ukraine against Russia will be recognized posthumously on Wednesday.",
      "The Ukrainian Canadian Congress and the Ukrainian War Veterans Association of Canada will present the Ukrainian Canadian Sacrifice Medal to the family of Austin Lathlin-Bercier during a ceremony at the Manitoba legislative building.",
      "Joanne Lewandosky, president of the Ukrainian Canadian Congress – Manitoba Provincial Council, said Lathlin-Bercier‘s mother, Lucy Bercier, will be receiving the medal on her son’s behalf.",
      "Lathlin-Bercier, who was from Opaskwayak Cree Nation, was killed in combat in November 2023 in Avdiivka, Donetsk Oblast.",
      "He was 25 years old.",
      "“We, the Ukrainian community, are so proud of this Manitoba, young Indigenous boy who saw at the age of 25 to do what his heart asked him to do, and, in the end, we have to remember the 25-year-old Austin who gave his life for Ukraine,” Lewandosky said.",
      "Lathlin-Bercier had volunteered with Ukraine’s International Legion in March 2022.",
      "He had training with the Canadian Armed Forces in its Cadet and Bold Eagle program, which combined Indigenous teachings and military training.",
      "Taras Jackiw, the sacrifice medal committee chairperson from the Ukrainian War Veterans Association of Canada, has handed out five of these medals to Canadians who have been killed or wounded in action while fighting for Ukraine against Russia.",
      "He said Lathlin-Bercier‘s story is unique because he was an Indigenous man from a northern Manitoba First Nation.",
      "“The way we understand it, he was in Europe when the war started, and he contacted his mother and said, ‘I have to go fight for the defence of women and children,’” Jackiw said.",
      "“It’s just amazing that someone from there would understand and make a connection with the Ukrainian community in Manitoba and in Ukraine and was willing to defend it.",
      "Jackiw added that of all the medal recipients, only one had Ukrainian blood.",
      "“It’s almost to the level of believing in what is right and believing in the democratic values and freedom for everyone,” he said.",
      "“Regardless of where in the world they believe that is important, and they will defend that.” The medal features four Canadian maple leaves and the Ukrainian trident.",
      "Lathlin-Bercier‘s name and the date of his passing are engraved on the back.",
      "At the time of his death, Opaskwayak Cree Nation Chief and Council issued a statement of condolences to his family.",
      "“By all accounts, Austin was bright, compassionate, and extremely brave,” Chief Maureen Brown wrote.",
      "The statement went into Lathlin-Bercier‘s life, saying he left the community to teach English in Peru and he had been in Italy and Romania when the war broke out in Ukraine.",
      "He enlisted right away.",
      "“The way he lived his life unselfishly and for others is a beacon of bravery for such a young man.",
      "He lived and offered his life with honour.",
      "He made our nation proud.” Chief Brown commended his parents and other family members for raising a strong and compassionate man.",
      "“His life, light and sacrifice will never be forgotten.” -With files from The Canadian Press ADVERTISEMENT"
    ],
    "topics": [
      "ukrainian canadian",
      "2025 edt",
      "fighting ukraine",
      "ukraine russia",
      "canadian congress",
      "ukrainian war",
      "war veterans",
      "veterans association",
      "association canada",
      "sacrifice medal"
    ]
  },
  {
    "title": "Russian wrestler, former Olympic champion charged with doping",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/sports/2025/05/21/russian-wrestler-who-beat-future-ufc-star-cormier-at-olympics-is-charged-with-doping/",
    "publishedAt": "2025-05-21T12:14:51Z",
    "sentences": [
      "ADVERTISEMENT Published: May 21, 2025 at 7:58AM EDT LAUSANNE, Switzerland — Former Olympic champion wrestler Khadjimourat Gatsalov was charged with doping Wednesday as part of the state-backed cheating scheme in Russia.",
      "Gatsalov was a gold medalist at the 2004 Athens Olympics.",
      "He beat future UFC champion Daniel Cormier in a semifinals bout in the freestyle 96-kilogram class.",
      "The 42-year-old Russian is being prosecuted using evidence from investigations by Richard McLaren and the World Anti-Doping Agency, including data from the Moscow testing laboratory, the International Testing Agency said.",
      "He tested positive for the banned substance ipamorelin from a sample given in 2015, the ITA said in a statement.",
      "The drug “stimulates the body’s release of growth hormone, which, in turn, promotes muscle growth, fat loss and recovery,” said the agency based in Lausanne, Switzerland.",
      "Gatsalov’s provisional suspension during the prosecution also prevents him working as a coach or official at national or international events, the ITA said.",
      "He won the last of his five world titles in 2013, two years before the positive test.",
      "The Associated Press ADVERTISEMENT"
    ],
    "topics": [
      "lausanne switzerland",
      "ita said",
      "advertisement published",
      "published may",
      "may 21",
      "21 2025",
      "2025 edt",
      "edt lausanne",
      "switzerland former",
      "former olympic"
    ]
  },
  {
    "title": "Putin visits Russia's Kursk region",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/21/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces/",
    "publishedAt": "2025-05-21T09:17:57Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 21, 2025 at 7:26AM EDT Published: May 21, 2025 at 5:17AM EDT President Vladimir Putin visited Russia’s Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of their biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Putin has effectively rejected recent U.S. and European proposals for a ceasefire.",
      "Russian Foreign Minister Sergey Lavrov on Wednesday accused Kyiv’s allies of seeking a truce “so that they can calmly arm Ukraine, so that Ukraine can strengthen its defensive positions.” North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, according to Ukraine, the U.S. and South Korea.",
      "Russia announced on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "The Ukrainian Army General Staff said Wednesday that its forces repelled 13 Russian assaults in Kursk.",
      "Its map of military activity showed Ukrainian troops holding a thin line of land hard against the border but still inside Russia.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict, even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine’s surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv’s strategy aimed to show that Russia has weaknesses and that the war isn’t lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometre (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Kursk Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn’t return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Putin last visited the Kursk region in March, when Ukrainian troops still controlled some parts of the area.",
      "He wore military fatigues -- a rarely seen sight for the Russian leader, who usually wears a suit -- and visited the area’s military headquarters where he was filmed with top generals.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "Flights were temporarily grounded twice at Moscow’s Domodedovo and Zhukosky airports, according to Russia’s Federal Air Transport Agency, or Rosaviatsiya, as officials reported Ukrainian drones being shot down in the area.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "The Ukrainian army said that its drones struck a semiconductor plant overnight in Russia’s Oryol region, about 150 kilometres (90 miles) northeast of Ukraine.",
      "According to the General Staff, 10 drones hit the Bolkhov Semiconductor Devices Plant, one of Russia’s key producers of microelectronics for the military-industrial complex.",
      "It wasn’t possible to independently verify the claim.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "ukrainian army",
      "may 21",
      "21 2025",
      "2025 edt",
      "kursk region",
      "first time",
      "said wednesday",
      "russian army"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "GuelphToday",
    "url": "https://www.guelphtoday.com/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "Vancouver Is Awesome",
    "url": "https://www.vancouverisawesome.com/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687854",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "SooToday",
    "url": "https://www.sootoday.com/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "This website is using a security service to protect itself from online attacks.",
      "The action you just performed triggered the security solution.",
      "There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.",
      "You can email the site owner to let them know you were blocked.",
      "Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.",
      "Cloudflare Ray ID: 944aa34bacfebbae • Your IP: Click to reveal 46.158.207.205 • Performance & security by Cloudflare"
    ],
    "topics": [
      "cloudflare ray",
      "ray id",
      "website using",
      "using security",
      "security service",
      "service protect",
      "protect online",
      "online attacks",
      "attacks action",
      "action performed"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "ElliotLakeToday.com",
    "url": "https://www.elliotlaketoday.com/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "BradfordToday",
    "url": "https://www.bradfordtoday.ca/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited Russia's Kursk region for first time since Moscow said it drove out Ukrainian forces",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/world-news/putin-visited-russias-kursk-region-for-first-time-since-moscow-said-it-drove-out-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T08:28:23Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "GuelphToday",
    "url": "https://www.guelphtoday.com/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "ElliotLakeToday.com",
    "url": "https://www.elliotlaketoday.com/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "BradfordToday",
    "url": "https://www.bradfordtoday.ca/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "Vancouver Is Awesome",
    "url": "https://www.vancouverisawesome.com/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687854",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "SooToday",
    "url": "https://www.sootoday.com/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "This website is using a security service to protect itself from online attacks.",
      "The action you just performed triggered the security solution.",
      "There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.",
      "You can email the site owner to let them know you were blocked.",
      "Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.",
      "Cloudflare Ray ID: 944aa37d0f4ff141 • Your IP: Click to reveal 46.158.207.205 • Performance & security by Cloudflare"
    ],
    "topics": [
      "cloudflare ray",
      "ray id",
      "website using",
      "using security",
      "security service",
      "service protect",
      "protect online",
      "online attacks",
      "attacks action",
      "action performed"
    ]
  },
  {
    "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/world-news/putin-visited-the-kursk-region-for-the-first-time-since-russia-said-it-expelled-ukrainian-forces-10687852",
    "publishedAt": "2025-05-21T07:17:55Z",
    "sentences": [
      "President Vladimir Putin visited Russia's Kursk region for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month, the Kremlin said Wednesday.",
      "Putin visited the region bordering Ukraine the previous day, according to the Kremlin.",
      "Ukrainian forces made a surprise incursion into Kursk in August 2024 in one of its biggest battlefield successes in the more than three-year war.",
      "The incursion was the first time Russian territory was occupied by an invader since World War II and dealt a humiliating blow to the Kremlin.",
      "Since the end of 2023, Russia has mostly had the advantage on the battlefield, with the exception of Kursk.",
      "Ukraine, the U.S. and South Korea said that North Korea sent up to 12,000 troops to help the Russian army take back control of Kursk, and Russia said on April 26 that its forces had pushed out the Ukrainian army.",
      "Kyiv officials denied the claim.",
      "Putin’s unannounced visit appeared to be an effort to show Russia is in control of the conflict — even though its full-scale invasion of its neighbor has been slow and costly in terms of casualties and equipment — amid recent U.S. and European proposals for a ceasefire that Putin has effectively rejected.",
      "Video broadcast by Russian state media showed that Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and met with selected volunteers behind closed doors.",
      "Many of the volunteers wore clothes emblazoned with the Russian flag and the Latin letters “Z” and “V”, which are symbols of Russia’s invasion of Ukraine.",
      "“What you are doing now during this difficult situation for this region, for this area, and for the country, will remain with you for the rest of your life as, perhaps, the most meaningful thing with which you were ever involved,” Putin said as he drank tea with the volunteers.",
      "Ukraine's surprise thrust into Kursk and its ability to hold land there was a logistical feat, carried out in secrecy, that countered months of gloomy news from the front about Ukrainian forces being pushed backward by the bigger Russian army.",
      "Kyiv's strategy aimed to show that Russia has weaknesses and that the war isn't lost.",
      "It also sought to distract Russian forces from their onslaught in the eastern Donetsk region of Ukraine.",
      "The move was fraught with risk.",
      "Analysts noted that it could backfire and open a door for Russian advances in Ukraine by further stretching Ukrainian forces that are short-handed along the roughly 1,000-kilometer (620-mile) front line.",
      "The incursion didn’t significantly change the dynamics of the war.",
      "Putin told acting Gov.",
      "Alexander Khinshtein that the Kremlin supported the idea of continuing monthly payments to displaced families that still couldn't return to their homes.",
      "Putin said that he would back a proposal to build a museum in the region to celebrate what acting Gov.",
      "Alexander Khinshtein described as “the heroism of our defenders and the heroism of the region’s residents.” Disgruntled residents had previously shown their disapproval over a lack of compensation in rare organized protests.",
      "Russia’s Ministry of Defense said that its air defenses shot down 159 Ukrainian drones across the country overnight, including 53 over the Oryol region and 51 over the Bryansk region.",
      "In Ukraine, Russian drone attacks killed two people and wounded five others in the northern Sumy region, the regional administration said.",
      "In the Kyiv region, four members of a family were injured when debris from a downed drone hit their home, according to the regional administration.",
      "Russia launched 76 Shahed and decoy drones overnight at Ukraine, the Ukrainian air force said.",
      "___ Follow AP’s coverage of the war in Ukraine at  The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "ukrainian forces",
      "putin visited",
      "first time",
      "russian army",
      "forces pushed",
      "army kyiv",
      "show russia",
      "putin said",
      "region ukraine",
      "acting gov"
    ]
  },
  {
    "title": "European Union to impose new Russian sanctions",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/20/eu-britain-go-ahead-with-new-russia-sanctions-without-waiting-for-washington/",
    "publishedAt": "2025-05-20T12:13:03Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 20, 2025 at 8:12AM EDT Published: May 20, 2025 at 6:05AM EDT The EU and Britain announced new sanctions against Russia on Tuesday without waiting for the United States to join them, a day after President Donald Trump spoke to Vladimir Putin without winning a promise for a ceasefire in Ukraine.",
      "London and Brussels said their new measures would zero in on Moscow’s “shadow fleet” of oil tankers and financial companies that have helped it avoid the impact of other sanctions imposed over the war.",
      "But the new measures were announced without corresponding steps from Washington, despite intense public lobbying from leaders of European countries for the Trump administration to join them.",
      "The leaders of Britain, France, Germany and Poland had jointly traveled to Kyiv earlier this month and said they had new sanctions against Russia ready to go.",
      "European leaders then phoned Trump on the eve of his call with Putin to call for him to join them in imposing tougher measures.",
      "Russia and Ukraine held their first direct talks in more than three years on Friday but failed to agree a ceasefire.",
      "Ukraine says it is ready for an immediate ceasefire proposed by Trump, while Russia says it wants talks first.",
      "The Europeans say this is proof that Putin, who started the war by invading his neighbor in 2022, is not prepared to end it.",
      "“Putin is clearly playing for time, unfortunately we have to say Putin is not really interested in peace,” Germany’s Defence Minister Boris Pistorius said.",
      "After announcing their measures on Tuesday, Brussels and London both suggested that more sanctions could still follow, making clear they have not given up hope of persuading Washington to act.",
      "France’s Foreign Minister Jean-Noel Barrot called for “sanctions that are truly dissuasive.” “Let us push Vladimir Putin to put an end to his imperialist fantasy,” he said.",
      "Britain’s Foreign Minister David Lammy said “delaying peace efforts will only redouble our resolve to help Ukraine to defend itself and use our sanctions to restrict Putin’s war machine.” EU foreign policy chief Kaja Kallas said more sanctions were “in the works.” “The longer Russia wages war, the tougher our response,” she wrote on X.",
      "The latest sanctions are aimed mainly at cracking down on a shipping fleet that Russia uses to export oil, circumventing a $60 a barrel price cap imposed by the G7 group of industrialized countries to limit Russia’s income.",
      "Britain and the EU said they would also work to lower the cap, which imposes far less of a discount on Russian oil now that global prices have fallen this year.",
      "But the EU’s Kallas made clear that action was needed from the United States.",
      "“We all agreed and said ... that if they don’t agree to unconditional ceasefire, like Ukraine has agreed over 60 days ago, there will be strong action,” Kallas said.",
      "“And that is what we want to see from all the parties who have said that they will act in accordance.” Trump said on Monday that Russia and Ukraine were ready to start negotiations.",
      "Putin said the process would take time.",
      "Reporting by Julia Payne, Bart Meijer, Andrew Gray, Lili Bayer and Sam Tabahriti.",
      "Additional reporting by John Irish.",
      "Writing by Bart Meijer and Ingrid Melander.",
      "Editing by Peter Graff.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "may 20",
      "20 2025",
      "2025 edt",
      "new sanctions",
      "sanctions russia",
      "united states",
      "vladimir putin",
      "ceasefire ukraine",
      "said new",
      "new measures"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "GuelphToday",
    "url": "https://www.guelphtoday.com/national-business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682171",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "BRUSSELS (AP) — The European Union on Tuesday agreed to impose fresh sanctions on Russia, notably targeting almost 200 ships from the shadow fleet illicitly transporting oil to skirt Western restrictions put in place over Moscow's war in Ukraine.",
      "The 27-nation bloc targeted 189 ships in all, and imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "The measures were endorsed by EU foreign ministers in Brussels.",
      "EU foreign policy chief Kaja Kallas said that while President Vladimir “Putin feigns interest in peace, more sanctions are in the works.",
      "Russia’s actions and those who enable Russia face severe consequences.” Russia uses its “ shadow fleet ” of ships to transport oil and gas, or to carry stolen Ukrainian grain.",
      "The EU has now targeted almost 350 of the ships in total.",
      "The new measures are not obviously linked to Russian delays in agreeing to a ceasefire.",
      "Work on the measures began in the days after the last package was finalized three months ago.",
      "Ukrainian officials have said that the shadow fleet involves around 500 aging ships of uncertain ownership and safety practices that are dodging sanctions and keeping the oil revenue coming.",
      "Ratings agency S&P Global and the Kyiv School of Economics Institute, a think tank, have put the number at over 400 ships that can transport oil, or products made from crude such as diesel fuel and gasoline.",
      "Vessels from the shadow fleet have also come under suspicion of damaging undersea cables, particularly in the Baltic Sea.",
      "Finnish police on Dec. 26 seized the Eagle S, a tanker they said was part of the dark fleet, on suspicion it used its anchor to damage the Estlink 2 undersea power cable that supplies electricity from Finland to Estonia.",
      "The EU also said that it targeted people and companies, including an insurer, that make it possible for the shadow fleet to operate, hitting interests in the United Arab Emirates, Turkey and Hong Kong.",
      "In parallel, the U.K. targeted the shadow fleet in a raft of 100 new sanctions that it said are aimed at “ramping up pressure” on the Kremlin.",
      "In a statement Tuesday, Britain’s Foreign Office said the sanctions will hit entities supporting Russia’s military, energy exports and information war, as well as financial institutions helping to fund its war against Ukraine.",
      "It added that the sanctions will target the supply chains of Russian weapons, including Iskander missiles which have been fired into civilian areas in Ukraine during the war.",
      "The U.K. will also sanction 18 more ships in the “shadow fleet” carrying Russian oil.",
      "“Putin’s latest strikes once again show his true colors as a warmonger,” Foreign Secretary David Lammy said.",
      "“We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.” The EU has slapped several rounds of sanctions on Russia since President Vladimir Putin ordered his troops into Ukraine on Feb. 24, 2022.",
      "Around 2,400 officials and “entities” — often government agencies, banks and organizations — have been hit.",
      "The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "shadow fleet",
      "sanctions russia",
      "ships shadow",
      "war ukraine",
      "eu foreign",
      "president vladimir",
      "vladimir putin",
      "ships transport",
      "transport oil",
      "village report"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "Vancouver Is Awesome",
    "url": "https://www.vancouverisawesome.com/national-business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682173",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "BRUSSELS (AP) — The European Union on Tuesday agreed to impose fresh sanctions on Russia, notably targeting almost 200 ships from the shadow fleet illicitly transporting oil to skirt Western restrictions put in place over Moscow's war in Ukraine.",
      "The 27-nation bloc targeted 189 ships in all, and imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "The measures were endorsed by EU foreign ministers in Brussels.",
      "EU foreign policy chief Kaja Kallas said that while President Vladimir “Putin feigns interest in peace, more sanctions are in the works.",
      "Russia’s actions and those who enable Russia face severe consequences.” Russia uses its “ shadow fleet ” of ships to transport oil and gas, or to carry stolen Ukrainian grain.",
      "The EU has now targeted almost 350 of the ships in total.",
      "The new measures are not obviously linked to Russian delays in agreeing to a ceasefire.",
      "Work on the measures began in the days after the last package was finalized three months ago.",
      "Ukrainian officials have said that the shadow fleet involves around 500 aging ships of uncertain ownership and safety practices that are dodging sanctions and keeping the oil revenue coming.",
      "Ratings agency S&P Global and the Kyiv School of Economics Institute, a think tank, have put the number at over 400 ships that can transport oil, or products made from crude such as diesel fuel and gasoline.",
      "Vessels from the shadow fleet have also come under suspicion of damaging undersea cables, particularly in the Baltic Sea.",
      "Finnish police on Dec. 26 seized the Eagle S, a tanker they said was part of the dark fleet, on suspicion it used its anchor to damage the Estlink 2 undersea power cable that supplies electricity from Finland to Estonia.",
      "The EU also said that it targeted people and companies, including an insurer, that make it possible for the shadow fleet to operate, hitting interests in the United Arab Emirates, Turkey and Hong Kong.",
      "In parallel, the U.K. targeted the shadow fleet in a raft of 100 new sanctions that it said are aimed at “ramping up pressure” on the Kremlin.",
      "In a statement Tuesday, Britain’s Foreign Office said the sanctions will hit entities supporting Russia’s military, energy exports and information war, as well as financial institutions helping to fund its war against Ukraine.",
      "It added that the sanctions will target the supply chains of Russian weapons, including Iskander missiles which have been fired into civilian areas in Ukraine during the war.",
      "The U.K. will also sanction 18 more ships in the “shadow fleet” carrying Russian oil.",
      "“Putin’s latest strikes once again show his true colors as a warmonger,” Foreign Secretary David Lammy said.",
      "“We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.” The EU has slapped several rounds of sanctions on Russia since President Vladimir Putin ordered his troops into Ukraine on Feb. 24, 2022.",
      "Around 2,400 officials and “entities” — often government agencies, banks and organizations — have been hit.",
      "The Associated Press"
    ],
    "topics": [
      "shadow fleet",
      "sanctions russia",
      "ships shadow",
      "war ukraine",
      "eu foreign",
      "president vladimir",
      "vladimir putin",
      "ships transport",
      "transport oil",
      "brussels ap"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "ElliotLakeToday.com",
    "url": "https://www.elliotlaketoday.com/national-business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682171",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "BRUSSELS (AP) — The European Union on Tuesday agreed to impose fresh sanctions on Russia, notably targeting almost 200 ships from the shadow fleet illicitly transporting oil to skirt Western restrictions put in place over Moscow's war in Ukraine.",
      "The 27-nation bloc targeted 189 ships in all, and imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "The measures were endorsed by EU foreign ministers in Brussels.",
      "EU foreign policy chief Kaja Kallas said that while President Vladimir “Putin feigns interest in peace, more sanctions are in the works.",
      "Russia’s actions and those who enable Russia face severe consequences.” Russia uses its “ shadow fleet ” of ships to transport oil and gas, or to carry stolen Ukrainian grain.",
      "The EU has now targeted almost 350 of the ships in total.",
      "The new measures are not obviously linked to Russian delays in agreeing to a ceasefire.",
      "Work on the measures began in the days after the last package was finalized three months ago.",
      "Ukrainian officials have said that the shadow fleet involves around 500 aging ships of uncertain ownership and safety practices that are dodging sanctions and keeping the oil revenue coming.",
      "Ratings agency S&P Global and the Kyiv School of Economics Institute, a think tank, have put the number at over 400 ships that can transport oil, or products made from crude such as diesel fuel and gasoline.",
      "Vessels from the shadow fleet have also come under suspicion of damaging undersea cables, particularly in the Baltic Sea.",
      "Finnish police on Dec. 26 seized the Eagle S, a tanker they said was part of the dark fleet, on suspicion it used its anchor to damage the Estlink 2 undersea power cable that supplies electricity from Finland to Estonia.",
      "The EU also said that it targeted people and companies, including an insurer, that make it possible for the shadow fleet to operate, hitting interests in the United Arab Emirates, Turkey and Hong Kong.",
      "In parallel, the U.K. targeted the shadow fleet in a raft of 100 new sanctions that it said are aimed at “ramping up pressure” on the Kremlin.",
      "In a statement Tuesday, Britain’s Foreign Office said the sanctions will hit entities supporting Russia’s military, energy exports and information war, as well as financial institutions helping to fund its war against Ukraine.",
      "It added that the sanctions will target the supply chains of Russian weapons, including Iskander missiles which have been fired into civilian areas in Ukraine during the war.",
      "The U.K. will also sanction 18 more ships in the “shadow fleet” carrying Russian oil.",
      "“Putin’s latest strikes once again show his true colors as a warmonger,” Foreign Secretary David Lammy said.",
      "“We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.” The EU has slapped several rounds of sanctions on Russia since President Vladimir Putin ordered his troops into Ukraine on Feb. 24, 2022.",
      "Around 2,400 officials and “entities” — often government agencies, banks and organizations — have been hit.",
      "The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "shadow fleet",
      "sanctions russia",
      "ships shadow",
      "war ukraine",
      "eu foreign",
      "president vladimir",
      "vladimir putin",
      "ships transport",
      "transport oil",
      "village report"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "SooToday",
    "url": "https://www.sootoday.com/national-business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682171",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "This website is using a security service to protect itself from online attacks.",
      "The action you just performed triggered the security solution.",
      "There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.",
      "You can email the site owner to let them know you were blocked.",
      "Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.",
      "Cloudflare Ray ID: 944aa3a7e9d5ee48 • Your IP: Click to reveal 46.158.207.205 • Performance & security by Cloudflare"
    ],
    "topics": [
      "cloudflare ray",
      "ray id",
      "website using",
      "using security",
      "security service",
      "service protect",
      "protect online",
      "online attacks",
      "attacks action",
      "action performed"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "BradfordToday",
    "url": "https://www.bradfordtoday.ca/national-business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682171",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "BRUSSELS (AP) — The European Union on Tuesday agreed to impose fresh sanctions on Russia, notably targeting almost 200 ships from the shadow fleet illicitly transporting oil to skirt Western restrictions put in place over Moscow's war in Ukraine.",
      "The 27-nation bloc targeted 189 ships in all, and imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "The measures were endorsed by EU foreign ministers in Brussels.",
      "EU foreign policy chief Kaja Kallas said that while President Vladimir “Putin feigns interest in peace, more sanctions are in the works.",
      "Russia’s actions and those who enable Russia face severe consequences.” Russia uses its “ shadow fleet ” of ships to transport oil and gas, or to carry stolen Ukrainian grain.",
      "The EU has now targeted almost 350 of the ships in total.",
      "The new measures are not obviously linked to Russian delays in agreeing to a ceasefire.",
      "Work on the measures began in the days after the last package was finalized three months ago.",
      "Ukrainian officials have said that the shadow fleet involves around 500 aging ships of uncertain ownership and safety practices that are dodging sanctions and keeping the oil revenue coming.",
      "Ratings agency S&P Global and the Kyiv School of Economics Institute, a think tank, have put the number at over 400 ships that can transport oil, or products made from crude such as diesel fuel and gasoline.",
      "Vessels from the shadow fleet have also come under suspicion of damaging undersea cables, particularly in the Baltic Sea.",
      "Finnish police on Dec. 26 seized the Eagle S, a tanker they said was part of the dark fleet, on suspicion it used its anchor to damage the Estlink 2 undersea power cable that supplies electricity from Finland to Estonia.",
      "The EU also said that it targeted people and companies, including an insurer, that make it possible for the shadow fleet to operate, hitting interests in the United Arab Emirates, Turkey and Hong Kong.",
      "In parallel, the U.K. targeted the shadow fleet in a raft of 100 new sanctions that it said are aimed at “ramping up pressure” on the Kremlin.",
      "In a statement Tuesday, Britain’s Foreign Office said the sanctions will hit entities supporting Russia’s military, energy exports and information war, as well as financial institutions helping to fund its war against Ukraine.",
      "It added that the sanctions will target the supply chains of Russian weapons, including Iskander missiles which have been fired into civilian areas in Ukraine during the war.",
      "The U.K. will also sanction 18 more ships in the “shadow fleet” carrying Russian oil.",
      "“Putin’s latest strikes once again show his true colors as a warmonger,” Foreign Secretary David Lammy said.",
      "“We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.” The EU has slapped several rounds of sanctions on Russia since President Vladimir Putin ordered his troops into Ukraine on Feb. 24, 2022.",
      "Around 2,400 officials and “entities” — often government agencies, banks and organizations — have been hit.",
      "The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "shadow fleet",
      "sanctions russia",
      "ships shadow",
      "war ukraine",
      "eu foreign",
      "president vladimir",
      "vladimir putin",
      "ships transport",
      "transport oil",
      "village report"
    ]
  },
  {
    "title": "New EU and UK sanctions target Russia's shadow fleet of tankers illicitly transporting oil",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/business/new-eu-and-uk-sanctions-target-russias-shadow-fleet-of-tankers-illicitly-transporting-oil-10682171",
    "publishedAt": "2025-05-20T11:59:30Z",
    "sentences": [
      "BRUSSELS (AP) — The European Union on Tuesday agreed to impose fresh sanctions on Russia, notably targeting almost 200 ships from the shadow fleet illicitly transporting oil to skirt Western restrictions put in place over Moscow's war in Ukraine.",
      "The 27-nation bloc targeted 189 ships in all, and imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "The measures were endorsed by EU foreign ministers in Brussels.",
      "EU foreign policy chief Kaja Kallas said that while President Vladimir “Putin feigns interest in peace, more sanctions are in the works.",
      "Russia’s actions and those who enable Russia face severe consequences.” Russia uses its “ shadow fleet ” of ships to transport oil and gas, or to carry stolen Ukrainian grain.",
      "The EU has now targeted almost 350 of the ships in total.",
      "The new measures are not obviously linked to Russian delays in agreeing to a ceasefire.",
      "Work on the measures began in the days after the last package was finalized three months ago.",
      "Ukrainian officials have said that the shadow fleet involves around 500 aging ships of uncertain ownership and safety practices that are dodging sanctions and keeping the oil revenue coming.",
      "Ratings agency S&P Global and the Kyiv School of Economics Institute, a think tank, have put the number at over 400 ships that can transport oil, or products made from crude such as diesel fuel and gasoline.",
      "Vessels from the shadow fleet have also come under suspicion of damaging undersea cables, particularly in the Baltic Sea.",
      "Finnish police on Dec. 26 seized the Eagle S, a tanker they said was part of the dark fleet, on suspicion it used its anchor to damage the Estlink 2 undersea power cable that supplies electricity from Finland to Estonia.",
      "The EU also said that it targeted people and companies, including an insurer, that make it possible for the shadow fleet to operate, hitting interests in the United Arab Emirates, Turkey and Hong Kong.",
      "In parallel, the U.K. targeted the shadow fleet in a raft of 100 new sanctions that it said are aimed at “ramping up pressure” on the Kremlin.",
      "In a statement Tuesday, Britain’s Foreign Office said the sanctions will hit entities supporting Russia’s military, energy exports and information war, as well as financial institutions helping to fund its war against Ukraine.",
      "It added that the sanctions will target the supply chains of Russian weapons, including Iskander missiles which have been fired into civilian areas in Ukraine during the war.",
      "The U.K. will also sanction 18 more ships in the “shadow fleet” carrying Russian oil.",
      "“Putin’s latest strikes once again show his true colors as a warmonger,” Foreign Secretary David Lammy said.",
      "“We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.” The EU has slapped several rounds of sanctions on Russia since President Vladimir Putin ordered his troops into Ukraine on Feb. 24, 2022.",
      "Around 2,400 officials and “entities” — often government agencies, banks and organizations — have been hit.",
      "The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "shadow fleet",
      "sanctions russia",
      "ships shadow",
      "war ukraine",
      "eu foreign",
      "president vladimir",
      "vladimir putin",
      "ships transport",
      "transport oil",
      "village report"
    ]
  },
  {
    "title": "No major breakthroughs dampen hopes",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/20/slow-progress-and-no-major-breakthroughs-dampen-hopes-for-russia-ukraine-peace-deal/",
    "publishedAt": "2025-05-20T11:25:45Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 20, 2025 at 11:50AM EDT Published: May 20, 2025 at 6:25AM EDT KYIV, Ukraine -- Kyiv’s European allies slapped new sanctions Tuesday on Moscow, a day after a phone call between U.S. President Donald Trump and Russian President Vladimir Putin failed to produce a breakthrough on ending the three-year-old war in Ukraine.",
      "“We have made clear again and again that we simply expect one thing from Russia now: namely, a ceasefire, unconditional and immediate,” German Foreign Minister Johann Wadephul said in addressing the sanctions.",
      "“We welcome the fact that Ukraine is still prepared to do this.",
      "We note with disappointment that Russia has not yet taken this decisive step, and we will have to react to this.” Diplomatic efforts have seen little progress in halting the fighting, including Monday’s phone call between Trump and Putin, and Friday’s direct talks between Russian and Ukrainian delegations in Istanbul.",
      "In the phone call, Putin promised Trump that Russia is “ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” “It appears that Putin has devised a way to offer Trump an interim, tangible outcome from Washington’s peace efforts without making any real concessions,” said Tatiana Stanovaya, a senior fellow at the Carnegie Russia Eurasia Centre, in a post on X. Russian media struck a triumphal tone in reporting Putin’s conversation with Trump.",
      "Ukrainian President Volodymyr Zelenskyy said on his Telegram channel that “it is obvious that Russia is trying to buy time to continue the war and occupation.",
      "We are working with partners to put pressure on the Russians to behave differently.” The new European Union sanctions targeted almost 200 ships from Russia’s “shadow fleet” illicitly transporting oil to skirt Western restrictions It also imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "Ukrainian officials have said about 500 aging ships of uncertain ownership and safety practices are dodging sanctions and keeping oil revenues flowing to Moscow.",
      "The U.K. also targeted the shadow fleet with 100 new sanctions and also aimed at disrupting the supply chains of Russian weapons, officials said.",
      "“Putin’s latest strikes once again show his true colours as a warmonger,” British Foreign Secretary David Lammy said.",
      "But Russian Foreign Ministry spokesperson Maria Zakharova said Tuesday: “Russia never responds to ultimatums.” Trump has threatened to step up sanctions and tariffs on Russia but hasn’t acted so far.",
      "Ukraine has offered a comprehensive 30-day ceasefire, which Moscow has effectively rejected by imposing far-reaching conditions, and Zelenskyy proposed a face-to-face meeting with Putin last week but the Russian leader spurned that offer.",
      "Trump, who had pledged during his campaign to end the war in one day, said his personal intervention was needed to push peace efforts forward.",
      "He held separate phone calls with both Putin and Zelenskyy, and said the two countries would “immediately” begin ceasefire negotiations, but there were no details on when or where such talks might take place.",
      "“The status quo has not changed,” Mykhailo Podoliak, a senior adviser to Zelenskyy, wrote on the social platform X on Tuesday.",
      "Russia launched 108 Shahed and decoy drones at Ukraine overnight, the Ukrainian air force said.",
      "One drone dropped explosives on a passenger bus in the Dniprovskyi district of the Kherson region, injuring two people, the local administration said.",
      "Putin wants Ukraine to renounce joining NATO, sharply cut its military, and withdraw its forces from the four Ukrainian regions Moscow has seized but doesn’t fully control, among other demands to curb the country’s sovereignty.",
      "After the phone call, the Russian state news agency RIA Novosti published an article headlined, “Europe’s hopes crushed: Trump refuses to go to war with Putin.” In the pro-Kremlin tabloid Moskovsky Komsomolets, columnist Mikhail Rostovsky also portrayed the call as a blow for Ukraine’s European allies.",
      "“Kyiv will agree to a serious, fully fledged conversation with Russia only if it has no other options left.",
      "Trump is gradually cutting off these other options for Zelenskyy,” he wrote.",
      "“And this is very, very good.” Since Trump took office, Washington has urged Russia and Ukraine to end Europe’s biggest conflict since World War II.",
      "After Monday’s phone calls, European officials remained skeptical about Russia’s intentions.",
      "“Putin has never changed his position,” Estonian Defence Minister Hanno Pevkur said in Brussels.",
      "“Russia actually doesn’t want to end this war.” EU foreign policy chief, Kaja Kallas, said Russia’s failure to negotiate in good faith should trigger the threatened U.S. sanctions.",
      "“We really haven’t seen, you know, the pressure on Russia from these talks,” she said.",
      "In Kyiv, there was skepticism about Putin’s motives.",
      "Peace “is not possible now.",
      "Only when (the Russians) run out of resources and army manpower.",
      "They are ready to fight, at least for this summer,” Svitlana Kyryliuk, 66, told The Associated Press.",
      "Putin will “stall for time, and that’s it,” she said.",
      "Volodymyr Lysytsia, a 45-year-old serviceman visiting the capital for rehabilitation, said Putin has made the front lines in eastern Ukraine a wasteland, with “nothing there, only scorched earth, everything bombed.” Some were unconvinced by Putin’s promise to Trump that Russia is “ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions to end the fighting.",
      "------ By Illia Novikov And Yehor Konovalov, The Associated Press Lorne Cook in Brussels, Katie Marie Davies in Manchester, England, and Geir Moulson in Berlin contributed.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "phone call",
      "said putin",
      "may 20",
      "20 2025",
      "2025 edt",
      "european allies",
      "new sanctions",
      "monday phone",
      "trump russia",
      "russia ready"
    ]
  },
  {
    "title": "Ukraine’s allies hit Russia with new sanctions as little progress made on ending war after talks",
    "source": "The Globe and Mail",
    "url": "https://www.theglobeandmail.com/world/article-zelensky-accuses-russia-of-playing-for-time-to-be-able-to-continue-war/",
    "publishedAt": "2025-05-20T11:16:23Z",
    "sentences": [
      "Ukrainian Foreign Minister Andrii Sybiha arrives for a meeting of EU foreign ministers at the European Council building, in Brussels, Belgium, on May 20.Virginia Mayo/The Associated Press Kyiv’s European allies slapped new sanctions Tuesday on Moscow, a day after a phone call between U.S. President Donald Trump and Russian President Vladimir Putin failed to produce a breakthrough on ending the three-year-old war in Ukraine.",
      "“We have made clear again and again that we simply expect one thing from Russia now: namely, a ceasefire, unconditional and immediate,” German Foreign Minister Johann Wadephul said in addressing the sanctions.",
      "“We welcome the fact that Ukraine is still prepared to do this.",
      "We note with disappointment that Russia has not yet taken this decisive step, and we will have to react to this.” Diplomatic efforts have seen little progress in halting the fighting, including Monday’s phone call between Trump and Putin, and Friday’s direct talks between Russian and Ukrainian delegations in Istanbul.",
      "In the phone call, Putin promised Trump that Russia is “ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” “It appears that Putin has devised a way to offer Trump an interim, tangible outcome from Washington’s peace efforts without making any real concessions,” said Tatiana Stanovaya, a senior fellow at the Carnegie Russia Eurasia Center, in a post on X. Russian media struck a triumphal tone in reporting Putin’s conversation with Trump.",
      "Ukrainian President Volodymyr Zelensky said on his Telegram channel that “it is obvious that Russia is trying to buy time to continue the war and occupation.",
      "We are working with partners to put pressure on the Russians to behave differently.” The new European Union sanctions targeted almost 200 ships from Russia’s “shadow fleet” illicitly transporting oil to skirt Western restrictions It also imposed asset freezes and travel bans on several officials as well as on a number of Russian companies.",
      "Ukrainian officials have said about 500 aging ships of uncertain ownership and safety practices are dodging sanctions and keeping oil revenues flowing to Moscow.",
      "The U.K. also targeted the shadow fleet with 100 new sanctions and also aimed at disrupting the supply chains of Russian weapons, officials said.",
      "“Putin’s latest strikes once again show his true colours as a warmonger,” British Foreign Secretary David Lammy said.",
      "But Russian Foreign Ministry spokesperson Maria Zakharova said Tuesday: ”Russia never responds to ultimatums.” Trump has threatened to step up sanctions and tariffs on Russia but hasn’t acted so far.",
      "Ukraine has offered a comprehensive 30-day ceasefire, which Moscow has effectively rejected by imposing far-reaching conditions, and Zelensky proposed a face-to-face meeting with Putin last week but the Russian leader spurned that offer.",
      "Trump, who had pledged during his campaign to end the war in one day, said his personal intervention was needed to push peace efforts forward.",
      "He held separate phone calls with both Putin and Zelensky, and said the two countries would “immediately” begin ceasefire negotiations, but there were no details on when or where such talks might take place.",
      "“The status quo has not changed,” Mykhailo Podoliak, a senior adviser to Zelensky, wrote on the social platform X on Tuesday.",
      "Russia launched 108 Shahed and decoy drones at Ukraine overnight, the Ukrainian air force said.",
      "One drone dropped explosives on a passenger bus in the Dniprovskyi district of the Kherson region, injuring two people, the local administration said.",
      "Putin wants Ukraine to renounce joining NATO, sharply cut its military, and withdraw its forces from the four Ukrainian regions Moscow has seized but doesn’t fully control, among other demands to curb the country’s sovereignty.",
      "After the phone call, the Russian state news agency RIA Novosti published an article headlined, “Europe’s hopes crushed: Trump refuses to go to war with Putin.“ In the pro-Kremlin tabloid Moskovsky Komsomolets, columnist Mikhail Rostovsky also portrayed the call as a blow for Ukraine’s European allies.",
      "“Kyiv will agree to a serious, fully fledged conversation with Russia only if it has no other options left.",
      "Trump is gradually cutting off these other options for Zelensky,” he wrote.",
      "“And this is very, very good.” Since Trump took office, Washington has urged Russia and Ukraine to end Europe’s biggest conflict since World War II.",
      "After Monday’s phone calls, European officials remained skeptical about Russia’s intentions.",
      "“Putin has never changed his position,” Estonian Defense Minister Hanno Pevkur said in Brussels.",
      "“Russia actually doesn’t want to end this war.” EU foreign policy chief, Kaja Kallas, said Russia’s failure to negotiate in good faith should trigger the threatened U.S. sanctions.",
      "“We really haven’t seen, you know, the pressure on Russia from these talks,” she said.",
      "In Kyiv, there was skepticism about Putin’s motives.",
      "Peace “is not possible now.",
      "Only when (the Russians) run out of resources and army manpower.",
      "They are ready to fight, at least for this summer,” Svitlana Kyryliuk, 66, told The Associated Press.",
      "Putin will “stall for time, and that’s it,” she said.",
      "Volodymyr Lysytsia, a 45-year-old serviceman visiting the capital for rehabilitation, said Putin has made the front lines in eastern Ukraine a wasteland, with “nothing there, only scorched earth, everything bombed.” Some were unconvinced by Putin’s promise to Trump that Russia is “ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions to end the fighting.",
      "Report an editorial error Report a technical issue Authors and topics you follow will be added to your personal news feed in Following."
    ],
    "topics": [
      "phone call",
      "said putin",
      "foreign minister",
      "eu foreign",
      "associated press",
      "european allies",
      "new sanctions",
      "monday phone",
      "trump russia",
      "russia ready"
    ]
  },
  {
    "title": "Trump says Russia and Ukraine will ‘immediately’ start ceasefire talks after phone call with Putin",
    "source": "The Globe and Mail",
    "url": "https://www.theglobeandmail.com/world/article-trump-putin-phone-call-russia-ukraine-ceasefire-negotiations/",
    "publishedAt": "2025-05-19T19:59:24Z",
    "sentences": [
      "Russia's President Vladimir Putin and U.S. President Donald Trump talk during a bilateral meeting at the G20 leaders summit in Osaka, Japan, June 28, 2019.Kevin Lamarque/Reuters U.S. President Donald Trump said Russia and Ukraine will begin negotiating a ceasefire right away, after a two-hour phone call with Russian President Vladimir Putin that did not seem to result in any concessions on Moscow’s part.",
      "Mr. Trump posted on social media Monday that conditions of a ceasefire would be negotiated between the two countries, and that the Vatican, represented by the Pope, had indicated it is interested in hosting those discussions.",
      "He later told reporters that he believes “something is going to happen,” but that there are “very big egos involved.” And he said that if a ceasefire is not agreed upon, he would back away, and the war would continue: “This is a European situation.",
      "It should have remained a European situation,” he told reporters.",
      "Mr. Trump said in his social media post that “Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.",
      "The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of.” Meanwhile, Mr. Putin told reporters that Russia was ready to work with Ukraine on a “memorandum” about a future peace accord and thanked Mr. Trump for supporting direct talks between Moscow and Kyiv.",
      "But Mr. Putin also signalled that Russia was not prepared to make significant concessions: “The main thing for us is to eliminate the root causes of this crisis,” he said.",
      "Ukrainian President Volodymyr Zelensky said in a statement posted to social media that he spoke with Mr. Trump twice on Monday: once before Mr. Trump’s call with Mr. Putin, and again after the call when Mr. Trump briefed him and other European leaders.",
      "“This is a defining moment.",
      "The world can now see whether its leaders are truly capable of securing a ceasefire and achieving real, lasting peace,” Mr. Zelensky wrote.",
      "He said he reaffirmed to Mr. Trump that Ukraine is ready for “a full and unconditional ceasefire,” in line with the U.S. President.",
      "“It is important not to dilute this proposal.",
      "If the Russians are not ready to stop the killings, there must be stronger sanctions.",
      "Pressure on Russia will push it toward real peace – this is obvious to everyone around the world.” Mr. Trump has previously threatened sanctions on Russia and demanded an immediate ceasefire.",
      "At other times, he has blamed Ukraine for starting the war.",
      "On Monday, he repeatedly said that he believes Mr. Putin wants to end it.",
      "When Mr. Trump was asked by reporters why he didn’t increase sanctions on Russia, he said he believes there is a chance of “getting something done,” and that he doesn’t want to make the situation worse.",
      "Mr. Zelensky said he also reiterated that Ukraine is ready for direct negotiations with Russia, whether they are facilitated by Turkey, the Vatican or Switzerland.",
      "In conversation with European leaders, he said, they also discussed possible next steps, such as meetings between negotiators and assessments of each side‘s proposals.",
      "“Every proposal at the table deserves an honest evaluation, that’s why the negotiation process must involve both American and European representatives at the appropriate level,” Mr. Zelensky said.",
      "“It is crucial for all of us that the United States does not distance itself from the talks and the pursuit of peace, because the only one who benefits from that is Putin.” He added: “Russia must end the war it started, and it can begin doing so any day.",
      "Ukraine has always been ready for peace.” Russian and Ukrainian officials met in Istanbul last week, marking their first face-to-face meeting since March, 2022.",
      "They agreed to a large prisoner exchange but remained at odds on conditions to end Russia’s war.",
      "Mr. Trump wrote on Truth Social that the “tone and spirit” of Monday’s conversation with Mr. Putin was excellent, and that if it wasn’t, he would have said so.",
      "He said Russia wants to do significant trade with the United States when “this catastrophic ‘bloodbath’ ” is over, and that Ukraine could also benefit.",
      "Mr. Trump said the European leaders he briefed after the call were Mr. Zelensky, President of the European Commission Ursula von der Leyen, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz and Finnish President Alexander Stubb.",
      "Russia has so far rejected calls from Ukraine and its allies to agree to a 30-day ceasefire.",
      "Michael Bociurkiw, global affairs analyst and senior fellow at the Atlantic Council, said he believes that Mr. Putin’s rhetoric around eliminating “root causes” means that he will string out the war as long as possible and push for the capitulation of Ukraine.",
      "He said Russia wants to push for its maximalist demands.",
      "For Russia, that means, among other demands, Ukraine ceding territory, abandoning its ambitions to join NATO, limiting the size of its army and changing its constitution.",
      "“In the meantime, Putin will use this time to continue grabbing more territory but also inflicting as much damage on Ukrainian cities, towns and villages as possible,” Mr. Bociurkiw said.",
      "With a report from Reuters Report an editorial error Report a technical issue Editorial code of conduct Authors and topics you follow will be added to your personal news feed in Following."
    ],
    "topics": [
      "trump said",
      "said russia",
      "social media",
      "told reporters",
      "zelensky said",
      "european leaders",
      "said believes",
      "president vladimir",
      "vladimir putin",
      "president donald"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks to start immediately",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/19/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin/",
    "publishedAt": "2025-05-19T18:17:59Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 19, 2025 at 6:02PM EDT Published: May 19, 2025 at 5:59AM EDT WASHINGTON — Russia and Ukraine will “immediately” begin ceasefire negotiations, U.S. President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, “If it wasn’t, I would say so now, rather than later.” Later speaking to reporters in the Oval Office, he noted the process has “got very big egos involved, I tell you.” “Big egos involved.",
      "But I think something’s going to happen and, if it doesn’t I’d just back away and they have to keep going,” Trump said.",
      "“This was a European situation.",
      "It should have remained a European situation.” Trump also said he told Putin, “We’ve got to get going.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.” Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.” Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded -- our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, `Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,”' he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump sought to use financial incentives to broker some kind of agreement after Russia’s invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow’s ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump’s treasury secretary, Scott Bessent, said Sunday on NBC’s “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia’s oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia’s oil revenues while preserving the country’s petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn’t there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” Article by Zeke Miller, Josh Boak And Katie Marie Davies.",
      "Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price and Will Weissert in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine, contributed to this report.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "white house",
      "vance said",
      "also said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "ElliotLakeToday.com",
    "url": "https://www.elliotlaketoday.com/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680411",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "Vancouver Is Awesome",
    "url": "https://www.vancouverisawesome.com/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680416",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680411",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "BradfordToday",
    "url": "https://www.bradfordtoday.ca/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680411",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "SooToday",
    "url": "https://www.sootoday.com/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680411",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "This website is using a security service to protect itself from online attacks.",
      "The action you just performed triggered the security solution.",
      "There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.",
      "You can email the site owner to let them know you were blocked.",
      "Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.",
      "Cloudflare Ray ID: 944aa3fcae24e921 • Your IP: Click to reveal 46.158.207.205 • Performance & security by Cloudflare"
    ],
    "topics": [
      "cloudflare ray",
      "ray id",
      "website using",
      "using security",
      "security service",
      "service protect",
      "protect online",
      "online attacks",
      "attacks action",
      "action performed"
    ]
  },
  {
    "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
    "source": "GuelphToday",
    "url": "https://www.guelphtoday.com/world-news/trump-says-russia-ukraine-ceasefire-talks-will-begin-immediately-following-call-with-putin-10680411",
    "publishedAt": "2025-05-19T17:52:32Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  },
  {
    "title": "Pope, JD Vance meet; Leo invited to U.S.",
    "source": "CP24 Toronto",
    "url": "https://www.cp24.com/news/world/2025/05/19/jd-vance-gives-pope-leo-xiv-an-invitation-from-trump-to-visit-us/",
    "publishedAt": "2025-05-19T16:16:14Z",
    "sentences": [
      "ADVERTISEMENT Updated: May 19, 2025 at 2:53PM EDT Published: May 19, 2025 at 5:41AM EDT U.S.",
      "Vice-President JD Vance extended an invitation to Pope Leo XIV to visit the United States during a meeting at the Vatican on Monday ahead of the U.S.-led push for ceasefire negotiations in Russia’s war in Ukraine.",
      "Vance gave the first American pope a letter from U.S. President Donald Trump and the first lady inviting him.",
      "The Chicago-born pope took the letter and put it on his desk and was heard saying “at some point,” in the video footage of the meeting provided by Vatican Media.",
      "Vance, who converted to Catholicism in 2019, also gave the Augustinian pope a copy of two of St. Augustine’s most seminal works, “The City of God” and ”On Christian Doctrine,” the vice-president’s office said.",
      "Another gift: A Chicago Bears T-shirt with Leo’s name on it.",
      "“As you can probably imagine, people in the United States are extremely excited about you,” Vance told Leo as they exchanged gifts.",
      "Leo gave Vance a bronze sculpture with the words in Italian “Peace is a fragile flower,” and a coffee-table sized picture book of the papal apartments in the Apostolic Palace.",
      "Leo noted that Francis had chosen not to live in them and added, “And I may live in, but it’s not totally decided.” Vance led the U.S. delegation to Sunday’s formal Mass opening the pontificate of the first American pope.",
      "Joining him at the meeting on Monday was Secretary of State Marco Rubio, also a Catholic, Vance spokesperson said.",
      "The two then also met with the Vatican foreign minister, Archbishop Paul Gallagher.",
      "“There was an exchange of views on some current international issues, calling for respect for humanitarian law and international law in areas of conflict and for a negotiated solution between the parties involved,” according to a Vatican statement after their meeting.",
      "The White House said Vance and Gallagher “discussed religious freedom, the persecution of Christians around the world and the shared commitment of President Trump and Pope Leo XIV to stop the killing in Ukraine and the Middle East.” According to the photo of the visits released by the Vatican, Leo’s brother, Louis Prevost, a self-described “MAGA-type,” and his wife, Deborah, joined the delegation during the visit.",
      "The Vatican, which was largely sidelined during the first three years of Russia’s invasion of Ukraine, has offered to host any peace talks while continuing humanitarian efforts to facilitate prisoner swaps and reunite Ukrainian children taken by Russia.",
      "Trump said Monday that Russia and Ukraine will “immediately” begin ceasefire negotiations after what he described as an “excellent” call with Russian President Vladimir Putin that lasted more than two hours.",
      "He noted that the Vatican “as represented by the Pope, has stated that it would be very interested in hosting the negotiations.” Leo, the former Cardinal Robert Prevost, is a Chicago-born Augustinian missionary who spent the bulk of his ministry in Chiclayo, a commercial city of around 800,000 on Peru’s northern Pacific coast.",
      "Before his election, Prevost shared news articles on X that were critical of the Trump administration’s plans for mass deportations of migrants.",
      "Vance was one of the last foreign officials to meet with Francis before the Argentine pope’s April 21 death.",
      "The two had tangled over migration, with Francis publicly rebuking the Trump administration’s deportation plan and correcting Vance’s theological justification for it.",
      "ADVERTISEMENT"
    ],
    "topics": [
      "may 19",
      "19 2025",
      "2025 edt",
      "pope leo",
      "leo xiv",
      "united states",
      "ceasefire negotiations",
      "first american",
      "american pope",
      "trump administration"
    ]
  },
  {
    "title": "Trump call with Putin underway as he hopes for ceasefire progress in Russia-Ukraine war",
    "source": "BayToday",
    "url": "https://www.baytoday.ca/world-news/trump-call-with-putin-underway-as-he-hopes-for-ceasefire-progress-in-russia-ukraine-war-10680411",
    "publishedAt": "2025-05-19T14:35:24Z",
    "sentences": [
      "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
      "The conversations did not appear to yield a major breakthrough.",
      "It was not clear when or where any talks might take place or who would participate.",
      "Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022.",
      "Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "Ahead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war.",
      "Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict.",
      "Trump later told reporters that he believed Putin was serious about wanting peace.",
      "“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.",
      "Trump said the call with Putin was “excellent,” adding, \"If it wasn’t, I would say so now, rather than later.” Trump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.",
      "“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.",
      "“He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.” The Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.",
      "He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.",
      "After the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump.",
      "Putin said the warring countries should “find compromises that would suit all parties.\"",
      "Moscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.” But indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear.",
      "The main thing for us is to eliminate the root causes of this crisis.\"",
      "Ukrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire.",
      "He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.",
      "“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions.",
      "What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.",
      "Trump and Putin addressed each other by first names Russian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.",
      "“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.",
      "Ushakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.",
      "Putin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each.",
      "Ushakov did not offer any other details.",
      "Speaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.",
      "“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV.",
      "Vance said Trump has been clear that the U.S. “is not going to spin its wheels here.",
      "We want to see outcomes.” Zelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv.",
      "He also said that he discussed the potential for “serious sanctions” on Russia.",
      "Trump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.",
      "Trump tries the carrot — and stick — with Putin Trump sought to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow's ability to grow.",
      "“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post.",
      "“There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth.",
      "Its potential is UNLIMITED.” Trump's treasury secretary, Scott Bessent, said Sunday on NBC's “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.",
      "Bessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices.",
      "The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.",
      "Trump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.",
      "No ceasefire but an exchange of prisoners Putin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.",
      "Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.",
      "Those talks ended Friday after less than two hours, without a ceasefire in place.",
      "But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.",
      "While wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.",
      "“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One.",
      "“At least we’ll know.",
      "And if we don’t solve it, it’ll be very interesting.” ___ Davies reported from Manchester, England.",
      "Associated Press writers Michelle L. Price in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine contributed to this report.",
      "Zeke Miller, Josh Boak And Katie Marie Davies, The Associated Press Check out Village Report - the news that matters most to Canada, updated throughout the day.",
      "Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.",
      "Subscribe More Spotlight >"
    ],
    "topics": [
      "trump said",
      "said trump",
      "told reporters",
      "trump putin",
      "exchange prisoners",
      "white house",
      "vance said",
      "putin said",
      "sanctions russia",
      "united states"
    ]
  }
]