[
  {
    "title": "Kyiv, Moscow to hold direct 1st talks",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/world-news/314590622/kyiv-moscow-to-hold-direct-1st-talks.html",
    "publishedAt": "2025-05-15T13:05:00Z",
    "sentences": [
      "ISTANBUL, Turkey – War rivals Ukraine and Russia are set to go into their first direct talks in more than three years on Thursday, with Russian President Vladimir Putin not included on the list of attendees.",
      "Ukraine’s President Volodymyr Zelenskyy had challenged Putin to meet him in person in Istanbul, but the Russian delegation names only a lower-level team.",
      "Putin’s absence would diminish the importance of the first direct negotiations since a failed effort in the weeks after Russia’s 2022 invasion.",
      "Tens of thousands have been killed since the offensive started in February 2022.",
      "Russia has occupied about a fifth of Ukraine’s territory in what is now Europe’s worst conflict since World War II.",
      "Putin had proposed holding talks on May 15 in Istanbul as a counter-offer after Ukraine and European nations last week called for a 30-day unconditional ceasefire.",
      "Zelenskyy agreed, but said this week that if Putin did not attend himself, it would signal he was not genuinely interested in peace.",
      "“This is his war… Therefore, the negotiations should be with him,” Zelenskyy said.",
      "The Kremlin delegation is set to be headed by Vladimir Medinsky, a hardline aide to Putin and ex-culture minister who was involved in the 2022 negotiations.",
      "Putin, Foreign Minister Sergei Lavrov and Kremlin foreign policy aide Yuri Ushakov — who had all been rumored as top negotiators after leading previous talks with the United States — were not named in the Kremlin’s delegation list.",
      "Medinsky is seen as influential in advancing Russia’s historical claims over Ukrainian territory.",
      "The other three negotiators were named as Deputy Foreign Minister Mikhail Galuzin, Deputy Defence Minister Alexander Fomin and Igor Kostyukov, director of Russia’s GRU military intelligence agency.",
      "European leaders have said new sanctions will be quickly imposed on Russia if the Istanbul talks do not produce results.",
      "On the eve of the talks, Zelenskyy said he would decide Ukraine’s next “steps” based on who represents Moscow.",
      "“Ukraine is ready for any format of negotiations, and we are not afraid of meetings.",
      "Tomorrow – in Turkey,” Zelenskyy said.",
      "“I am waiting to see who will arrive from Russia.",
      "Then I will decide what steps Ukraine should take.” Russia insists the talks address what it calls the “root causes” of the conflict, including the “denazification” and demilitarisation of Ukraine, two vague terms Moscow has used to justify its invasion.",
      "It has also repeated that Ukraine must cede territory occupied by Russian troops.",
      "Kyiv said it will not recognize its territories as Russian — though Zelensky has acknowledged that Ukraine might only get them back through diplomatic means.",
      "US Secretary of State, Marco Rubio, will be in Istanbul on Friday.",
      "Rubio met Ukraine’s Foreign Minister Andriy Sybiga at a NATO meeting in Turkey on Wednesday.",
      "And US President Donald Trump on Wednesday indicated he could take a mediation role in Turkey.",
      "“I don’t know that he (Putin) would be there if I’m not there,” Trump told reporters accompanying him on a Middle East tour.",
      "“I know he would like me to be there, and that’s a possibility.",
      "If we could end the war, I’d be thinking about that,” he said.",
      "US President Donald Trump on Wednesday offered to go to Turkey if Putin also showed up.",
      "US Secretary of State Marco Rubio is expected in Istanbul on Friday for part of the talks.",
      "Rubio met with Ukraine’s Foreign Minister Andriy Sybiga on Wednesday on the sidelines of a NATO foreign ministers’ meeting in Antalya, Turkey.",
      "Sybiga said on X that he explained Zelenksyy’s “vision of further peace efforts” during “this critical week”.",
      "“We discussed in detail the logic of further steps and shared our approaches,” he added.",
      "Medinsky is seen as influential in advancing Russia’s historical claims over swathes of Ukraine and has written text-books advancing a nationalist view of Russian history that has been questioned by independent historians.",
      "The other three negotiators were named as Deputy Foreign Minister Mikhail Galuzin, Deputy Defence Minister Alexander Fomin and Igor Kostyukov, director of Russia’s GRU military intelligence agency.",
      "Putin last weekend proposed direct negotiations and had come under intense international pressure — including from some allies — to meet with Zelenskyy.",
      "Trump floated the idea of mediating if Putin attended.",
      "“I don’t know that he (Putin) would be there if I’m not there,” Trump told reporters while on his Middle East tour.",
      "“I know he would like me to be there, and that’s a possibility.",
      "If we could end the war, I’d be thinking about that,” he said.",
      "He said he had a packed schedule but added: “That doesn’t mean I wouldn’t do it to save a lot of lives.” © All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "foreign minister",
      "zelenskyy said",
      "ukraine russia",
      "first direct",
      "direct negotiations",
      "kremlin delegation",
      "medinsky seen",
      "seen influential",
      "influential advancing",
      "advancing russia"
    ]
  },
  {
    "title": "Macron says France does not want ‘World War III’ over Ukraine strife",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314590030/macron-says-france-does-not-want-world-war-iii-over-ukraine-strife.html",
    "publishedAt": "2025-05-14T12:50:00Z",
    "sentences": [
      "PARIS – President Emmanuel Macron has said France did not want to unleash “World War III” over Russia’s invasion of Ukraine and vowed referendums on key issues as he outlined his aims for for the remaining two years of his mandate in a marathon television appearance.",
      "Macron, who came to power in 2017 promising radical change, will step down in 2027 after serving the maximum two terms allowed under the Constitution.",
      "Meanwhile, in Brussels, the EU Wednesday approved a fresh package of sanctions on Russia, clamping down on its “shadow” oil fleet, as Europe threatens further punishment if Moscow does not agree to a Ukraine truce.",
      "The new measures against the Kremlin — the 17th round of sanctions from the EU since Russia’s 2022 full-scale invasion of Ukraine — were in the pipeline before European leaders issued their latest ultimatum to Moscow over US-led peace efforts.",
      "Diplomats representing the EU’s 27 member states approved the package at a meeting in Brussels, according to the Polish presidency of the bloc.",
      "The package — set to be formally adopted on Tuesday — includes blacklisting some 200 oil tankers used to circumvent curbs on Russian oil exports.",
      "Companies in countries including Vietnam, Serbia and Turkey accused of helping supply goods to the Russian military are also set to face restrictions.",
      "On occasion over the last year, Macron has appeared as a lame duck especially after his decision to hold snap legislative elections backfired, leaving the far-right as the biggest party in parliament and his own party a diminished, minority presence.",
      "But recent months have seen a newly energized Macron, boosted by his presence on the international front as he seeks to bring an end to the three-year-war sparked by Russia’s invasion of Ukraine.",
      "“We must help Ukraine defend itself but we do not want to unleash a Third World War,” Macron said in the interview that lasted more than three hours.",
      "“The war must cease and Ukraine must be in the best possible situation to go into negotiations,” he added.",
      "But Macron said France was ready to start discussing with other European countries deploying French warplanes armed with nuclear weapons on their territory, as the United States does.",
      "“The Americans have the bombs on planes in Belgium, Germany, Italy, Turkey,” Macron said.",
      "“We are ready to open this discussion.",
      "I will define the framework in a very specific way in the weeks and months to come,” he said.",
      "Those who put their points of view in front of Macron ranged from the head of the hardline CGT union, Sophie Binet, to Tibo Inshape, a muscular and massively followed fitness influencer.",
      "Amid concern about some 600 jobs in France, Macron told Binet that the French operations of steelmaker ArcelorMittal would not be nationalized but vowed to save its two plants in the country.",
      "In a key announcement, he said he favored holding several referendums on the same day for voters to decide on French social and economic “reforms”.",
      "“I want us to organize a series of consultations,” Macron said, adding that the votes would take place on one day in coming months and address “major” economic and social reforms.",
      "While he would not go into details, he was open to a suggestion by Prime Minister Francois Bayrou, who has proposed holding a referendum on a plan to reduce France’s debt.",
      "Referendums could also address social reforms such as access to social media for under-15s and assisted dying.",
      "However, Macron rejected the idea of putting immigration issues to a popular vote despite repeated requests from the right and far right.",
      "Tackling delicate social issues, the French president spoke out against the wearing of religious symbols, such as the Islamic veil, in sports competitions, but he added that for non-competitive sports practice it was up to sports federations to decide.",
      "While Macron, 47, must step down in 2027 after serving two consecutive terms, he could in theory return in 2032, something no French leader has ever done before.",
      "But he said at the end of the TV marathon he had not yet thought about his future after 2027 and was only thinking of France in his daily work.",
      "“When I’m done (with the current term), I’ll think about what’s next.",
      "Then I’ll be able to answer you.",
      "But today, I haven’t thought about it,” he said.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "macron said",
      "invasion ukraine",
      "said france",
      "want unleash",
      "world war",
      "russia invasion",
      "step 2027",
      "2027 serving",
      "ukraine must",
      "social reforms"
    ]
  },
  {
    "title": "UN aviation agency: Russia responsible for plane downing",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314589628/un-aviation-agency-russia-responsible-for-plane-downing.html",
    "publishedAt": "2025-05-13T12:50:00Z",
    "sentences": [
      "MONTREAL—The United Nations aviation agency said Monday that Russia was responsible for the downing of a Malaysia Airlines jetliner over Ukraine in 2014, leading to the deaths of 298 people.",
      "The International Civil Aviation Organization, based in Montreal, said claims brought by Australia and the Netherlands over the shooting down of Flight MH17 on July 17 of that year were “well founded in fact and in law.” “The Russian Federation failed to uphold its obligations under international air law in the 2014 downing of Malaysia Airlines Flight MH17,” the agency said in a statement issued Monday evening.",
      "The ICAO said this was the first time in its history that its council has made a determination on the merits of a dispute between member states.",
      "On July 17, 2014 the Malaysia Airlines Boeing 777 — en route from Amsterdam to Kuala Lumpur — crashed in eastern Ukraine’s Donetsk region where pro-Russian separatist rebels were battling Ukrainian forces.",
      "The plane was hit by a Russian-made BUK surface-to-air missile.",
      "Dutch nationals accounted for two-thirds of the dead, along with 38 Australians and about 30 Malaysians, with many victims having dual nationalities.",
      "Then-Ukrainian President Petro Poroshenko called it a “terrorist act.” Pro-Russian rebels in the area claimed the airliner was shot down by a Ukrainian military jet.",
      "Russian President Vladimir Putin says Ukraine “bears responsibility.” The following day, then US president Barack Obama said a missile fired from separatist-held territory was to blame and the rebels would not have been able to hit the airliner without Russian support.",
      "In 2022 a Dutch court sentenced three men to life in prison over the downing, among them two Russians, but Russia refused to extradite them.",
      "Russia has consistently denied any involvement in the tragedy.",
      "The governments of Australia and the Netherlands welcomed the UN agency’s decision Monday night.",
      "“This is a historic moment in the pursuit of truth, justice and accountability for the victims of the downing of Flight MH17, and their families and loved ones,” the Australian government said in a statement.",
      "It called on the agency to “move swiftly to determine remedies” for Russia’s violation of international law.",
      "“We call upon Russia to finally face up to its responsibility for this horrific act of violence and make reparations for its egregious conduct, as required under international law,” the statement added.",
      "International investigators suspended their probe of the downing last year, saying there was not enough evidence to identify more suspects.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "malaysia airlines",
      "flight mh17",
      "agency said",
      "downing malaysia",
      "australia netherlands",
      "july 17",
      "said statement",
      "international law",
      "united nations",
      "nations aviation"
    ]
  },
  {
    "title": "Drone attacks halt traffic in Russia",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314586866/drone-attacks-halt-traffic-in-russia.html",
    "publishedAt": "2025-05-06T12:35:00Z",
    "sentences": [
      "MOSCOW – More than a dozen Russian airports had to restrict their traffic due to drone attacks overnight to Tuesday, Russian authorities reported, including in Moscow days before a planned military parade.",
      "A total 19 drones were downed around the Russian capital, where several world leaders are expected to attend a parade and address by President Vladimir Putin on May 9 as part of World War II anniversary celebrations, authorities said.",
      "Flight restrictions were introduced at four airports in Moscow, Russian news agencies reported, citing the Federal Air Transport Agency — though traffic at the city’s main Sheremetyevo airport remained largely unaffected.",
      "Airports were also affected in other cities including Volgograd and Nizhny Novgorod.",
      "In a post on Telegram, Moscow Mayor Sergei Sobyanin said debris had fallen on a major avenue in southern Moscow but there was “no damage or casualties” in the city.",
      "Russian media broadcast images of a cracked supermarket window and a blackened residential building facade.",
      "The governors of Voronezh and Penza reported that 18 and 10 Ukrainian drones had been intercepted in their regions respectively, without causing any casualties.",
      "In the Kursk region, acting governor Alexander Khinshtein said an attack was carried out on an electrical substation in the city of Rylsk late Monday, injuring two teenagers.",
      "“As a result of the attack on the city, two transformers were damaged, and the power was completely cut off,” he said on Telegram.",
      "Russian authorities earlier on Monday said defense forces had repelled four drones heading towards Moscow, where the conflict in Ukraine often feels distant.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "russian authorities",
      "moscow dozen",
      "dozen russian",
      "russian airports",
      "airports restrict",
      "restrict traffic",
      "traffic due",
      "due drone",
      "drone attacks",
      "attacks overnight"
    ]
  },
  {
    "title": "Russia bans Elton John AIDS Foundation to defend 'spiritual and moral values'",
    "source": "Rappler",
    "url": "https://www.rappler.com/entertainment/celebrities/russia-bans-elton-john-aids-foundation-defend-moral-values/",
    "publishedAt": "2025-04-05T02:42:21Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "Elton John and David Furnish attend the Elton John AIDS Foundation Academy Awards Viewing Party, to celebrate the 97th Oscars Academy Awards in West Hollywood, California, U.S., March 2, 2025.",
      "REUTERS/Jeenah Moon/File Photo MOSCOW, Russia – Russia’s general prosecutor on Thursday, April 3, banned the activities of the Elton John AIDS Foundation, accusing it of taking a negative stance towards countries like Russia that protect “traditional spiritual and moral values.” The prosecutor’s office said the ban applied specifically to two non-governmental organizations, one registered in the United States and the other in Britain and both called the Elton John AIDS Foundation.",
      "It officially designated them as “undesirable organizations.” The foundation was set up by Elton John, the gay British singer and songwriter who in the past has given sell-out concerts in Russia and spoken out against what he has said is unacceptable discrimination against gay people by the Russian authorities.",
      "President Vladimir Putin has rejected such assertions.",
      "He has cast Russia as a bastion of “traditional values” locked in an existential struggle with a decadent West.",
      "The Elton John AIDS Foundation said it was “devastated” by the decision, which it said would prevent it from providing lifesaving care to people living with HIV in Russia.",
      "“For more than two decades, we have worked in collaboration with federal and non-governmental partners in Russia to provide hundreds of thousands of people with vital HIV services, including testing, treatment, and care,” it said in a statement.",
      "“This work is urgent: in 2024, there were over 1.2 million people living with HIV in Russia, with over 430,000 not receiving treatment.",
      "Today’s decision…will undoubtedly endanger lives and disrupt critical HIV prevention efforts.” The prosecutor’s office cast the foundation as a malign influence on Russian society on its official Telegram channel.",
      "“When a musician plays along with the promoters of democracy, you get propaganda.",
      "And if Elton John is at the piano, it is not just anti-Russian propaganda,” it said.",
      "“The NGOs actively participate in an information campaign orchestrated by the ‘collective West’ to discredit traditional values and escalate social tensions,” it added.",
      "In a separate statement on its website, the prosecutor’s office complained about the foundation’s promotion of “non-traditional sexual relationships, Western family models, and gender reassignment”.",
      "Without citing examples, the statement accused the foundation of taking part in what it called a Western campaign to “denigrate Russia” over its war in Ukraine, which the prosecutor called a “special military operation.” Putin has encouraged women to have at least three children to battle a birth rate dip in the country, and a 2022 law widened a ban on “LGBT propaganda” to effectively ban any public expressions regarding homosexuality.",
      "In November, Russia’s lower house of parliament voted unanimously to ban what authorities cast as pernicious propaganda for a child-free way of life.",
      "In a mission statement on its website, the Elton John AIDS Foundation said it had raised more than $600 million to support over 3,100 projects in 95 countries globally to increase access to health care, tackle LGBTQ+ stigma, and end AIDS.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "elton john",
      "john aids",
      "aids foundation",
      "prosecutor office",
      "academy awards",
      "traditional values",
      "foundation said",
      "people living",
      "living hiv",
      "hiv russia"
    ]
  },
  {
    "title": "France, Britain: Russia still striking Ukraine",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314576205/france-britain-russia-still-striking-ukraine.html",
    "publishedAt": "2025-04-04T12:45:00Z",
    "sentences": [
      "BRUSSELS– The foreign ministers of France and Britain on Friday said Russia was still striking Ukraine’s energy infrastructure and accused President Vladimir Putin of dragging its heels over US peace efforts.",
      "At the same time, Paris said the military chiefs from the two countries were visiting Kyiv to discuss a possible deployment of troops to secure any ceasefire.",
      "“Over the past three weeks, Russia has been flip flopping, continuing its strikes on energy infrastructure, continuing its war crimes,” French foreign minister Jean-Noel Barrot alongside his British counterpart at a NATO meeting.",
      "“There will at some point be a need for military capacity or reassurance, whenever peace is reached — and this is the reason why our army chiefs will be in Kyiv today in order to advance this work,” Barrot said.",
      "Kyiv and Moscow have accused each other of breaking a supposed US-backed deal to stop firing on energy sites, though a formal agreement has not been put in place and what commitments each side has undertaken remain unclear.",
      "“Our judgment is that Putin continues to obfuscate, continues to drag his feet.",
      "He could accept a cease fire now, but he continues to bombard Ukraine, its civilian population, its energy supplies,” British foreign minister David Lammy said.",
      "“We see, Vladimir Putin.",
      "We know what you’re doing.” Both ministers insisted that now was the time to bolster support for Ukraine and step up pressure on Russia to try to force it to negotiate in good faith.",
      "“We are pledged to continue to put Ukraine in the strongest possible position, militarily, economically,” Lammy said.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "energy infrastructure",
      "vladimir putin",
      "foreign minister",
      "lammy said",
      "foreign ministers",
      "ministers france",
      "france britain",
      "britain friday",
      "friday said",
      "said russia"
    ]
  },
  {
    "title": "Russia hopes for ‘progress’ at Saudi talks",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/world-news/314571691/russia-hopes-for-progress-at-saudi-talks.html",
    "publishedAt": "2025-03-23T12:55:00Z",
    "sentences": [
      "MOSCOW—Moscow is hoping to achieve “some progress” at talks in Saudi Arabia on Monday, a Russian negotiator told state media before the United States meets delegations from both Ukraine and Russia in a bid to halt the three-year conflict.",
      "Moscow has rejected a joint US-Ukraine proposal for a full and unconditional 30-day ceasefire, suggesting instead halting aerial strikes on energy facilities.",
      "Despite that offer, both sides have continued to launch aerial attacks in the run-up to the negotiations.",
      "A Russian strike on the southern Ukrainian city of Zaporizhzhia on Friday night killed a family of three, triggering anger among Ukrainian officials.",
      "Russia also launched drone attacks on Kyiv that hit apartment buildings and caused fires, killing at least two people, Ukraine’s emergency service said early Sunday.",
      "Kyiv mayor Vitali Klitschko said Sunday a “massive attack by enemy UAVs” caused falling debris in several districts of the city, wounding seven.",
      "US negotiators will meet separately with Ukrainian and Russian delegations in Saudi Arabia on Monday, in what US envoy Keith Kellogg described as “shuttle diplomacy” between hotel rooms.",
      "Despite the flurry of diplomacy and push from US President Donald Trump, a breakthrough has so far proved elusive.",
      "“We hope to achieve at least some progress,” Russian senator Grigory Karasin, who will lead the Russian delegation, told the Zvezda TV channel, without specifying on what issue.",
      "He said he and fellow negotiator, FSB advisor Sergey Beseda would take a “combative and constructive” mood into the talks.",
      "A senior Ukrainian official told AFP a day earlier that Kyiv hopes to secure agreement “at least” on a partial ceasefire covering attacks on energy, infrastructure and at sea.",
      "Kyiv is sending its defence minister to the negotiations.",
      "“We are going with the mood to fight for the solution of at least one issue,” Karasin told Zvezda, which is owned by Russia’s defense ministry.",
      "He said they were leaving for Saudi Arabia on Sunday and would return on Tuesday.",
      "Russia’s choice of negotiators for the talks has raised questions.",
      "Both are outside of traditional diplomatic decision-making institutions such as the Kremlin, foreign ministry or defense ministry.",
      "Karasin is a career diplomat who now sits in Russia’s upper house of parliament, while Beseda is a long-time FSB officer and now an advisor to the security service’s director.",
      "The FSB in 2014 admitted that Beseda was in Kyiv during a bloody crackdown in the Ukrainian capital in the midst of the country’s pro-EU revolution.",
      "Ukraine has accused Russia of not genuinely seeking peace and condemned its ongoing attacks, despite Russian President Vladimir Putin saying on Tuesday he had ordered his army to stop targeting Ukrainian energy sites.",
      "In contrast, a US official close to Trump, White House envoy Steve Witkoff, has praised Putin — whom he met in Moscow last week — as a “great” leader seeking to end the conflict with Kyiv.",
      "“I thought he was straight up with me,” Witkoff told an American right-wing podcast host, Tucker Carlson, in an interview aired Friday.",
      "“I don’t regard Putin as a bad guy.",
      "That is a complicated situation, that war, and all the ingredients that led up to it,” Trump’s envoy said.",
      "Russia fired 179 drones at Ukraine in its latest overnight barrage, the Ukrainian air force said Saturday.",
      "In the southern city of Zaporizhzhia, an entire family, including a 14-year-old girl, was killed when a drone crashed into their house Friday, the regional authorities said.",
      "An AFP photographer at the scene of one strike saw rescue workers sifting through the rubble of a destroyed building, as smoke and fog hung in the night air.",
      "In the eastern Donetsk region, Russian strikes on Saturday killed at least two people and wounded three, according to the local governor.",
      "Ukraine also targeted Russia with drone attacks overnight, wounding two in the southern city of Rostov-on-Don.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "saudi arabia",
      "arabia monday",
      "city zaporizhzhia",
      "drone attacks",
      "least two",
      "two people",
      "told zvezda",
      "defense ministry",
      "southern city",
      "hoping achieve"
    ]
  },
  {
    "title": "Zelenskyy, Putin agreed to a limited ceasefire",
    "source": "SunStar Philippines",
    "url": "https://www.sunstar.com.ph/network/zelenskyy-and-putin-have-agreed-to-a-limited-ceasefire-but-implementation-is-work-in-progress",
    "publishedAt": "2025-03-19T23:53:25Z",
    "sentences": [
      "KYIV, Ukraine — Ukraine and Russia agreed in principle to a limited ceasefire after President Donald Trump spoke with the countries' leaders this week, though it remains to be seen when it might take effect and what possible targets would be off limits to attack.",
      "The tentative deal to partially rein in the grinding war came after Russian President Vladimir Putin rebuffed Trump’s push for a full 30-day ceasefire.",
      "The difficulty in getting the combatants to agree not to target one another's energy infrastructure highlights the challenges Trump will face in trying to fulfill his campaign pledge to quickly end to the war.",
      "After a roughly hourlong call with Trump on Wednesday that both leaders said went well, Ukrainian President Volodymyr Zelenskyy told reporters that “technical” talks in Saudi Arabia this weekend would seek to resolve what types of infrastructure would be protected under the agreement.",
      "But it was immediately clear that the three parties had different views about what the pact entailed, with the White House saying “energy and infrastructure” would be covered, the Kremlin saying the agreement referred more narrowly to “energy infrastructure,” and Zelenskyy saying he'd also like railways and ports to be protected.",
      "“One of the first steps toward fully ending the war could be ending strikes on energy and other civilian infrastructure,” Zelenskyy said on social media following his call with Trump, which came a day after the U.S. president held similar talks with Putin.",
      "“I supported this step, and Ukraine confirmed that we are ready to implement it.” During their call, Trump suggested that Zelenskyy should consider giving the U.S. ownership of Ukraine's power plants to ensure their long-term security, according to a White House statement from Secretary of State Marco Rubio and national security adviser Mike Waltz.",
      "Trump told Zelenskyy that the U.S could be “very helpful in running those plants with its electricity and utility expertise,\" the statement said.",
      "Trump suggested “American ownership of those plants could be the best protection for that infrastructure,” according to White House officials.",
      "The idea was floated even as the Trump administration looks to finalize an agreement to gain access to Ukraine's critical minerals as partial repayment for U.S. support for Ukraine during the war.",
      "Zelenskyy, though, said the conversation focused on the Zaporizhzhia nuclear power plant — which is the largest of its kind in Europe and has been under Russian control since early in the war.",
      "He said Trump posed the idea of “an understanding\" in which \"the United States can recover” the plant.",
      "The call, which Zelenskyy described as “fruitful,” came just weeks after a disastrous Oval Office meeting between the two leaders that led to Trump temporarily pausing intelligence sharing and military aid to Ukraine.",
      "During the call, Zelenskyy requested additional Patriot defense missile systems.",
      "Rubio and Waltz said Trump “agreed to work with him to find what was available, particularly in Europe.\"",
      "On Tuesday, Putin told Trump that he would agree not to target Ukraine’s energy infrastructure but refused to back a full 30-day ceasefire that Trump proposed.",
      "According to the Kremlin, Putin made clear to Trump that there must be a cessation of foreign military aid and intelligence sharing as part of any deal.",
      "But White House press secretary Karoline Leavitt on Wednesday underscored that U.S. “intelligence sharing in terms of defense for Ukraine” would continue.",
      "The Kremlin says Kyiv isn't upholding its end of the bargain Prior to his call with Trump, Zelenskyy said Putin’s limited ceasefire pledge was “very much at odds with reality” after Russia launched an overnight barrage of drone strikes across Ukraine, including some that struck Ukrainian energy facilities.",
      "Russia responded by saying it had halted its targeting of Ukraine's energy facilities and accused Kyiv of attacking Russian equipment near one of its pipelines.",
      "“Unfortunately, we see that for now there is no reciprocity on the part of the Kyiv regime,\" Kremlin spokesman Dmitry Peskov said.",
      "The White House described Tuesday's call between Trump and Putin as the first step in a “movement to peace.\"",
      "But there was no indication that Putin is ready to back away from his conditions for a prospective peace deal, which are fiercely opposed by Kyiv.",
      "Zelenskyy even while agreeing to work on the limited ceasefire said Putin is not seriously pursuing peace talks, and wants to prolong the war until he is in a stronger position.",
      "Technical experts to gather soon in Saudi Arabia The White House also confirmed that technical experts from the U.S., Ukraine and Russia would gather in Saudi Arabia in the coming days to discuss implementing the partial ceasefire.",
      "It was not immediately clear if the U.S. would meet together or separately with the Ukrainian and Russian officials.",
      "Waltz spoke with his Russian counterpart, Yuri Ushakov, on Wednesday to discuss the coming talks.",
      "Ukraine and Russia trade accusations Shortly after the call between Trump and Putin on Tuesday, air raid sirens sounded in Kyiv, followed by explosions as residents took shelter.",
      "Despite efforts to repel the attack, several strikes hit civilian infrastructure, including two hospitals, a railway and more than 20 houses, Zelenskyy said.",
      "Russian drones were reported over Kyiv, Zhytomyr, Sumy, Chernihiv, Poltava, Kharkiv, Kirovohrad, Dnipropetrovsk, and Cherkasy regions.",
      "The Russian Defense Ministry said its military had launched seven drones at power facilities related to the military-industrial complex in Ukraine’s southern Mykolaiv region, but that it shot them down after receiving Putin’s order to not hit energy infrastructure.",
      "Moscow accused Ukraine of targeting its energy facility in the Krasnodar region bordering the Crimean Peninsula, which Russia annexed in 2014, several hours after the Putin and Trump talks.",
      "The ministry said three drones targeted oil transfer equipment that feeds the Caspian Pipeline Consortium, causing a fire and leading one oil tank to lose pressure.",
      "“It is absolutely clear that we are talking about yet another provocation deliberately concocted by the Kyiv regime, aimed at derailing the peace initiatives of the U.S. president,” the Russian Defense Ministry said.",
      "Russia said its air defenses intercepted 57 Ukrainian drones over the Azov Sea and several Russian regions — the border provinces of Kursk and Bryansk and the nearby regions of Oryol and Tula.",
      "Zelenskyy said that “words of a ceasefire” weren't enough.",
      "“If the Russians don’t hit our facilities, we definitely won’t hit theirs,” Zelenskyy said.",
      "Meanwhile, the two combatants said Wednesday that they had each swapped 175 prisoners in one of the largest exchanges of the war.",
      "Ukraine's red line Zelenskyy rejected Putin’s key condition that Western allies stop providing military aid and intelligence to Ukraine.",
      "He said doing so would endanger lives if citizens were blind to incoming air raids and lead to the continuation of the war.",
      "“I don’t think anybody should make any concessions in terms of helping Ukraine, but rather, assistance to Ukraine should be increased,\" Zelenskyy said.",
      "\"This will be a signal that Ukraine is ready for any surprises from the Russians.” Zelenskyy said one of the most difficult issues in future negotiations would be the issue of territorial concessions.",
      "“For us, the red line is the recognition of the Ukrainian temporarily occupied territories as Russian,\" he said.",
      "“We will not go for it.” (AP)"
    ],
    "topics": [
      "zelenskyy said",
      "call trump",
      "white house",
      "energy infrastructure",
      "ukraine russia",
      "limited ceasefire",
      "saudi arabia",
      "said trump",
      "intelligence sharing",
      "military aid"
    ]
  },
  {
    "title": "Trump says he will speak with Putin on March 18 about ending war in Ukraine",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/us-canada/donald-trump-speak-vladimir-putin-about-ending-ukraine-war/",
    "publishedAt": "2025-03-17T10:26:06Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "TRUMP.",
      "US President Donald Trump speaks to reporters, watched by National Security Advisor Mike Waltz, aboard Air Force One on his return to Washington, DC, USA, March 16, 2025.",
      "Kevin Lamarque/Reuters WASHINGTON, USA – US President Donald Trump said he plans to speak to Russian President Vladimir Putin on Tuesday, March 18, and discuss ending the war in Ukraine, after positive talks between US and Russian officials in Moscow.",
      "“We want to see if we can bring that war to an end,” Trump told reporters on Air Force One during a flight back to the Washington area from Florida.",
      "“Maybe we can, maybe we can’t, but I think we have a very good chance.",
      "“I’ll be speaking to President Putin on Tuesday.",
      "A lot of work’s been done over the weekend.” Trump is trying to win Putin’s support for a 30-day ceasefire proposal that Ukraine accepted last week, as both sides continued trading heavy aerial strikes through the weekend and Russia moved closer to ejecting Ukrainian forces from their months-old foothold in the western Russian region of Kursk.",
      "When asked about what concessions are being considered in ceasefire negotiations, Trump said: “We’ll be talking about land.",
      "We’ll be talking about power plants…We’re already talking about that, dividing up certain assets.” Trump did not elaborate but was most likely referring to the Russian-occupied Zaporizhzhia facility in Ukraine, Europe’s largest nuclear plant.",
      "Russia and Ukraine have accused each other of risking an accident at the plant with their actions.",
      "There was no immediate response from the Kremlin to a request for comment from Reuters.",
      "The Kremlin said on Friday that Putin had sent Trump a message about his ceasefire plan via US envoy Steve Witkoff, who held talks in Moscow, expressing “cautious optimism” that a deal could be reached to end the three-year conflict.",
      "In separate appearances on Sunday TV shows in the United States, Witkoff, Secretary of State Marco Rubio, and Trump’s national security adviser, Mike Waltz, emphasized that there were still challenges to be worked out before Russia agrees to a ceasefire, much less a final peaceful resolution to the war.",
      "Asked on ABC whether the US would accept a peace deal in which Russia was allowed to keep stretches of eastern Ukraine that it has seized, Waltz replied, “Are we going to drive every Russian off of every inch of Ukrainian soil?” He added that the negotiations had to be grounded in “reality.” Rubio told CBS a final peace deal would involve “concessions from both Russia and Ukraine,” and that it would be difficult to even begin those negotiations “as long as they’re shooting at each other”.",
      "An overnight Ukrainian drone attack targeted energy facilities in Russia’s southern Astrakhan region, injuring one person and sparking a fire, the regional governor said.",
      "Kyiv’s mayor said on Monday Russia had carried out an overnight drone attack on the Ukrainian capital.",
      "Ukraine’s President Volodymyr Zelenskyy said on Friday that he saw a good chance to end the Russian war after Kyiv accepted the US proposal for a 30-day interim ceasefire.",
      "However, Zelenskyy has consistently said the sovereignty of his country is not negotiable and that Russia must surrender the territory it has seized.",
      "Russia seized the Crimea peninsula in 2014 and now controls most of four eastern Ukrainian regions since it invaded the country in 2022.",
      "Russia will seek “ironclad” guarantees in any peace deal that NATO nations exclude Kyiv from membership and that Ukraine will remain neutral, a Russian deputy foreign minister said in remarks published on Monday.",
      "In an interview with the Russian media outlet Izvestia that made no reference to the ceasefire proposal, Deputy Foreign Minister Alexander Grushko said that any long-lasting peace treaty on Ukraine must meet Moscow’s demands.",
      "“We will demand that ironclad security guarantees become part of this agreement,” Izvestia cited Grushko as saying.",
      "“Part of these guarantees should be the neutral status of Ukraine, the refusal of NATO countries to accept it into the alliance.” Putin has said his military incursion into Ukraine was because NATO’s creeping expansion threatened Russia’s security.",
      "He has demanded that Ukraine drop its NATO ambitions, that Russia keeps control of all Ukrainian territory seized, and that the size of the Ukrainian army be limited.",
      "He also wants Western sanctions eased and a presidential election in Ukraine, which Kyiv says is premature while martial law is in force.",
      "The European Union’s foreign policy chief, Kaja Kallas, said on Monday that the conditions demanded by Russia to agree to a ceasefire showed that Moscow does not really want peace.",
      "Trump, who has upended US policy by shifting closer to Moscow, berated Zelenskyy in a meeting in Washington last month that ended with the Ukrainian leader leaving the White House early.",
      "But Ukraine’s acceptance of a proposed ceasefire has now put the onus on Russia to cede to Trump’s demands and will test the US president’s more positive view of Putin.",
      "British Prime Minister Keir Starmer said on Saturday that Western allies other than the US were stepping up preparations to support Ukraine in the event of a ceasefire with Russia, with defense chiefs set to firm up “robust plans” next week.",
      "Britain and France both have said that they are willing to send a peacekeeping force to monitor any ceasefire in Ukraine.",
      "Russia has ruled out peacekeepers until the war has ended.",
      "“If they appear there, it means that they are deployed in the conflict zone with all the consequences for these contingents as parties to the conflict,” Russia’s Grushko said.",
      "“We can talk about unarmed observers, a civilian mission that would monitor the implementation of individual aspects of this agreement, or guarantee mechanisms.",
      "In the meantime, it’s just hot air.” – Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "us president",
      "peace deal",
      "president donald",
      "donald trump",
      "national security",
      "mike waltz",
      "air force",
      "force one",
      "trump said",
      "putin tuesday"
    ]
  },
  {
    "title": "Wary Russia awaits details from US on Ukraine ceasefire plan",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-awaits-details-united-states-ukraine-ceasefire-plan/",
    "publishedAt": "2025-03-12T13:01:58Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "AGREE.",
      "US Secretary of State Marco Rubio and US National Security Advisor Mike Waltz speak with the media following meetings with a Ukrainian delegation in Jeddah, Saudi Arabia, March 11, 2025.",
      "In the Saudi-hosted talks, Ukraine is to present the US with a plan for a partial ceasefire with Russia, hoping to restore support from its key benefactor, which under President Donald Trump has demanded concessions to end the three-year war.",
      "Saul Loeb/Pool via REUTERS MOSCOW, Russia – The Kremlin said on Wednesday, March 13, it was awaiting details from Washington about a proposal for a 30-day ceasefire in Ukraine, while senior Moscow sources said a deal would have to take account of Russia’s advances and address its concerns.",
      "After Russian forces made gains in 2024, US President Donald Trump reversed US policy on the war, launching bilateral talks with Moscow and suspending military assistance to Ukraine, demanding that it take steps to end the conflict.",
      "The United States agreed on Tuesday to resume weapons supplies and intelligence sharing after Kyiv said at talks in Saudi Arabia that it was ready to support a ceasefire proposal.",
      "The Kremlin said it was carefully studying the results of the meeting and would await details from US Secretary of State Marco Rubio and White House National Security Adviser Mike Waltz.",
      "Kremlin spokesman Dmitry Peskov suggested a reporter was getting “a little ahead” of himself by asking if Russia intended to tie a ceasefire proposal to the lifting of international sanctions imposed over the war in Ukraine.",
      "“Rubio and Waltz said that they would pass on detailed information to us through various channels about the essence of the conversation that took place in Jeddah.",
      "First, we must receive this information,” Peskov said.",
      "Rubio said the United States was hoping for a positive response, and that if the answer was “no” then it would tell Washington a lot about the Kremlin’s true intentions.",
      "He said there would be contacts with Moscow on Wednesday, that Europe would have to be involved in any security guarantee for Ukraine, and that the sanctions Europe has imposed would also be on the table.",
      "Russia’s invasion of Ukraine in early 2022 has left hundreds of thousands of dead and injured, displaced millions of people, reduced towns to rubble and triggered the biggest confrontation between Moscow and the West in six decades.",
      "President Vladimir Putin has repeatedly said that he is ready to talk about an end to the war and Trump says he thinks Putin is serious, though other Western leaders disagree.",
      "Trump said on Tuesday that he hoped Russia would agree to a ceasefire and that he would talk to Putin this week.",
      "Reuters reported in November that Putin was ready to negotiate a deal with Trump, but would refuse to make major territorial concessions and would insist Kyiv abandon ambitions to join NATO.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "us secretary",
      "secretary state",
      "state marco",
      "marco rubio",
      "national security",
      "mike waltz",
      "saudi arabia",
      "president donald",
      "donald trump",
      "end war"
    ]
  },
  {
    "title": "US to resume security support to Ukraine as Kyiv says it is ready to accept ceasefire proposal",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/us-resume-security-support-ukraine-kyiv-ready-accept-ceasefire-proposal/",
    "publishedAt": "2025-03-12T02:50:50Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "ZELENSKYY IN JEDDAH.",
      "Ukrainian President Volodymyr Zelenskyy meets Saudi Crown Prince, Mohammed bin Salman, during his visit to Jeddah, Saudi Arabia, March 10, 2025.",
      "Saudi Press Agency/Handout via Reuters JEDDAH, Saudi Arabia – The United States agreed on Tuesday, March 11, to resume military aid and intelligence sharing with Ukraine after talks where Kyiv said it would accept a US proposal for a 30-day ceasefire in its conflict with Russia, the countries said in a joint statement.",
      "US Secretary of State Marco Rubio said the US would now take the offer to Russia, and the ball is in Moscow’s court.",
      "“Our hope is that the Russians will answer ‘yes’ as quickly as possible, so we can get to the second phase of this, which is real negotiations,” Rubio told reporters, referring to US President Donald Trump, after more than eight hours of talks in Jeddah, Saudi Arabia.",
      "The Kremlin launched a full-scale invasion of Ukraine three years ago, and Russia, which has been making advances, now holds around a fifth of Ukraine’s territory, including Crimea, which it annexed in 2014.",
      "Rubio said Washington wanted a full agreement with both Russia and Ukraine “as soon as possible.” “Every day that goes by, this war continues, people die, people are bombed, people are hurt on both sides of this conflict,” he said.",
      "How Moscow would respond was far from certain.",
      "Russian President Vladimir Putin has said he is open to discussing a peace deal, but he and his diplomats have repeatedly stated they are against a ceasefire and would seek a deal that safeguards Russia’s “long-term security.” Putin has ruled out territorial concessions and said Ukraine must withdraw fully from four Ukrainian regions claimed and partly controlled by Russia.",
      "On Tuesday, Russia’s foreign ministry said only that it did not rule out contacts with US representatives.",
      "Ukrainian President Volodymyr Zelenskyy, who was in Saudi Arabia but did not participate in the talks, said the ceasefire was a “positive proposal,” that covers the frontline in the conflict, not just fighting by air and sea.",
      "The Ukrainian leader said the ceasefire would take effect as soon as Russia agreed.",
      "“When the agreements come into force, during these 30 days of ‘silence,’ we will have time to prepare with our partners at the level of working documents all the aspects for reliable peace and long-term security,” Zelenskyy said.",
      "Rubio said the plan would be delivered to the Russians through multiple channels.",
      "Trump’s national security adviser, Mike Waltz, was due to meet his Russian counterpart in the coming days and Trump’s special envoy Steve Witkoff plans to visit Moscow this week to meet Putin.",
      "On Tuesday, Trump said he hoped for a swift ceasefire and thought he would talk to Putin this week.",
      "“I hope it’ll be over the next few days,” he told reporters at a White House event to promote his close adviser Elon Musk’s Tesla car company.",
      "The US-Ukraine agreement was a sharp turnaround from an acrimonious White House meeting on February 28 between the new Republican US president, who has long been a Ukraine aid skeptic, and Zelenskyy.",
      "In Tuesday’s joint statement, the two countries said they agreed to conclude as soon as possible a comprehensive agreement for developing Ukraine’s critical mineral resources, which had been in the works and was thrown into limbo by that meeting.",
      "Following that encounter, the United States cut off intelligence sharing and weapons shipments to Ukraine, underlining Trump’s willingness to pressure a US ally as he pivots to a more conciliatory approach to Moscow.",
      "Trump said on Tuesday he would invite Zelenskyy back to the White House.",
      "Ukrainian officials said late on Tuesday that both US military assistance and intelligence sharing had resumed.",
      "A top aide to Zelenskyy said options for security guarantees to Ukraine were discussed with U.S. officials.",
      "Security guarantees have been one of Kyiv’s key aims, and some European countries have expressed willingness to explore sending peacekeepers.",
      "In the joint statement, Ukraine reiterated that European partners should be involved in the peace process.",
      "NATO Secretary General Mark Rutte will be at the White House on Thursday.",
      "“It seems like the Americans and Ukrainians have taken an important step towards peace.",
      "And Europe stands ready to help reach a just and lasting peace,” Polish Prime Minister Donald Tusk said on X. Waltz said the initial resumption of military assistance for Ukraine would involve equipment from US stockpiles approved by former US President Joe Biden and stopped by Trump.",
      "As the diplomacy plays out, Ukraine’s battlefield positions have been under heavy pressure, particularly in Russia’s Kursk region where Moscow’s forces have launched a push to flush out Kyiv’s troops, which had been trying to hold a patch of land as a bargaining chip.",
      "Ukraine overnight launched its biggest drone attack on Moscow and the surrounding region yet, showing Kyiv can also land major blows after a steady stream of Russian missile and drone attacks, one of which killed 14 people on Saturday.",
      "The attack, in which 337 drones were downed over Russia, killed at least three employees of a meat warehouse and caused a short shutdown at Moscow’s four airports.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "saudi arabia",
      "white house",
      "jeddah saudi",
      "intelligence sharing",
      "joint statement",
      "rubio said",
      "us president",
      "ukrainian president",
      "president volodymyr",
      "volodymyr zelenskyy"
    ]
  },
  {
    "title": "Kyiv fires largest drone barrage at Moscow",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/03/12/world/americas-emea/kyiv-fires-largest-drone-barrage-at-moscow/2071257",
    "publishedAt": "2025-03-11T16:04:00Z",
    "sentences": [
      "SAPRONOVO, Russia — Ukrainian drones smashed into high-rise apartment blocks on the outskirts of Moscow in the early hours of Tuesday, with both sides saying it was the largest attack on the Russian capital of the three-year conflict.",
      "The Kremlin condemned the attack, which came just hours before top United States and Ukrainian officials sat down for talks in Saudi Arabia and after three years of Russian aerial barrages on Ukrainian cities.",
      "Ad-free access"
    ],
    "topics": [
      "sapronovo russia",
      "russia ukrainian",
      "ukrainian drones",
      "drones smashed",
      "smashed apartment",
      "apartment blocks",
      "blocks outskirts",
      "outskirts moscow",
      "moscow early",
      "early hours"
    ]
  },
  {
    "title": "Ukraine to present partial truce after row",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314567383/ukraine-to-present-partial-truce-after-row.html",
    "publishedAt": "2025-03-11T13:05:00Z",
    "sentences": [
      "JEDDAH – Ukraine will present the United States on Tuesday with a plan for a partial ceasefire with Russia, hoping to restore support from its key benefactor, which under President Donald Trump has demanded concessions to end the three-year war.",
      "The talks in Saudi Arabia will be the most senior since a disastrous White House meeting on February 28, when Trump berated Ukraine’s President Volodymyr Zelenskyy for purported ingratitude.",
      "Since Trump’s dressing down of Zelenskyy, Washington has suspended military aid to Ukraine as well as intelligence sharing and access to satellite imagery in a bid to force it to the negotiating table.",
      "Zelenskyy, who wrote a repentant letter to Trump, flew to the port city of Jeddah to meet Saudi rulers, but was leaving the talks to three top aides.",
      "US Secretary of State Marco Rubio, who will be joined by Trump’s national security advisor Mike Waltz, said the aid suspension was “something I hope we can resolve” in the talks on Tuesday.",
      "“Hopefully, we’ll have a good meeting and good news to report,” Rubio said.",
      "Rubio said that the United States had not cut off intelligence for defensive operations.",
      "Zelenskyy left the White House without signing an agreement demanded by Trump that would give the United States access to much of Ukraine’s mineral wealth as compensation for past weapons supplies.",
      "Zelensky has said he is still willing to sign, although Rubio said it would not be the focus of Tuesday’s talks.",
      "Russia has since ramped up its attacks, striking hard against Ukrainian infrastructure and taking back villages in its Kursk region that Ukraine had captured in a bid for bargaining leverage.",
      "In the White House meeting, Zelenskyy refused to bite his tongue in the face of criticism from Vice President JD Vance, with the Ukrainian leader questioning why his country should trust promises from Russia which launched a full-scale invasion in 2022 despite previous diplomacy.",
      "But faced with Washington’s pressure, Ukraine will lay out its support for a limited ceasefire.",
      "“We do have a proposal for a ceasefire in the sky and ceasefire at sea,” a Ukrainian official told AFP on Monday, speaking on condition of anonymity.",
      "“Because these are the ceasefire options that are easy to install and to monitor, and it’s possible to start with them.” Rubio signalled that the Trump administration would likely be pleased by such a proposal.",
      "“I’m not saying that alone is enough, but it’s the kind of concession you would need to see in order to end the conflict,” he told reporters.",
      "“You’re not going to get a ceasefire and an end to this war unless both sides make concessions.” “The Russians can’t conquer all of Ukraine and obviously it will be very difficult for Ukraine in any reasonable time period to force the Russians all the way back to where they were back in 2014,” Rubio said, referring to the time of a partial offensive and Russian seizure of the Crimea peninsula.",
      "In a meeting with Saudi Crown Prince Mohammed bin Salman ahead of the US-Ukraine talks, Zelensky discussed Ukraine’s conditions for any permanent peace deal, including the release of prisoners and the return of children Kyiv accuses Moscow of abducting, the Ukrainian leader’s office said in a statement Monday.",
      "The two leaders “discussed the possible mediation of Saudi Arabia in the release of military and civilian prisoners and the return of deported children”, the statement said.",
      "“The leaders exchanged views on the formats of security guarantees and what they should be for Ukraine so that war does not return again.” Rubio said he did not expect to sit in a room in Jeddah with the Ukrainians “drawing lines on a map” towards a final deal.",
      "But Rubio said he would bring the ideas back to Russia.",
      "Rubio and Waltz met last month, also in Saudi Arabia, with counterparts from Russia, ending a freeze in high-level contacts imposed by former president Joe Biden after Russia defied Western warnings and launched its invasion.",
      "Trump last week also threatened further sanctions against Russia to force it to the table as it carried out strikes on Ukraine.",
      "But Trump’s abrupt shift in US policy has stunned many allies.",
      "Rubio said the United States was objecting to “antagonistic” language on Russia at a gathering of Group of Seven foreign ministers later this week in Canada.",
      "German Foreign Minister Annalena Baerbock called the scene from the White House “unspeakable” and described a “new age of infamy” that will require Europeans to shoulder more responsibility.",
      "French senator Claude Malhuret, in a speech that went viral in the United States even in translation, said that Trump had failed to see through Kremlin propaganda and that Russia was failing in Ukraine, picking up only small pockets of land after three years attacking a smaller country.",
      "“The American lifeline to Putin is the biggest strategic mistake ever made during a war,” he said.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "rubio said",
      "united states",
      "white house",
      "saudi arabia",
      "end war",
      "house meeting",
      "said united",
      "said would",
      "ukrainian leader",
      "launched invasion"
    ]
  },
  {
    "title": "Russia scolds Macron for pushing Europe towards the abyss of world war",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-scolds-macron-pushing-europe-towards-abyss-world-war/",
    "publishedAt": "2025-03-06T09:58:50Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "HAWK.",
      "In this file photo, Russia's Deputy head of the Security Council Dmitry Medvedev, accompanied by Deputy Defence Minister Nikolay Pankov, visits the Prudboi military training ground in Volgograd region, Russia June 1, 2023.",
      "Sputnik/Yekaterina Shtukina/Pool via REUTERS MOSCOW, Russia – Russian officials and lawmakers on Thursday, March 6, poured scorn on French President Emmanuel Macron for saying that Russia threatened Europe, and cautioned that such talk could lead the West towards the abyss of a new world war.",
      "Russia’s invasion of Ukraine triggered the biggest confrontation between the West and Russia since the 1962 Cuban Missile Crisis, and both the Kremlin and the White House have cautioned against missteps that could trigger World War Three.",
      "But the advance of Russian forces in Ukraine in 2024 and US President Donald Trump’s upending of US policy towards Ukraine and Russia and demand for a peace deal to end the war have triggered a crisis among European powers who fear the United States is turning its back on Europe.",
      "Macron said in an address to the nation on Wednesday that Russia was “a threat for France and Europe”, that the Ukraine was already a “global conflict” and that he would open a debate about extending the French nuclear umbrella to allies in Europe.",
      "“Such an erroneous analysis leads to fatal errors,” said Konstantin Kosachev, a senior Russian senator, who said Macron had mistaken Russia’s reaction to the enlargement and aggression of the US-led military alliance towards Russia.",
      "“Macron maniacally imposes on his citizens, allies and the entire world a completely false concept of what is happening — ‘the Russians are coming!’ Such false conclusions and false suggestions lead to the abyss.” Russia and the United States are by far the world’s biggest nuclear powers, with over 5,000 nuclear warheads each, followed by China with about 500 and then France with 290 and the United Kingdom with 225, according to the Federation of American Former Russian president Dmitry Medvedev, who once presented himself as a moderniser and now tries to outhawk the Kremlin’s most ardent hawks, said “Micron” posed no threat at all and predicted he would lose power by 2027.",
      "Russian officials say the tough rhetoric from Macron, British Prime Minister Keir Starmer and other European powers over recent days is simply not backed up by hard military power and point to Russia’s advance on the battlefield in Ukraine.",
      "President Vladimir Putin last year ordered the regular size of the Russian army to be increased by 180,000 troops to 1.5 million active servicemen in a move that would make it the second largest in the world after China’s.",
      "Maria Zakharova, spokeswoman for Russia’s foreign ministry, mocked Macron’s remarks that France had the most effective army in Europe suggesting that he should perhaps engage in a measurement exercise of some sort.",
      "Sergei Markov, a former Kremlin adviser, said Macron had slandered Russia with lies and military propaganda.",
      "Putin has repeatedly dismissed as nonsense Western claims that Russia could one day attack a NATO member, which under the NATO charter would be considered an attack on all 32 members of the alliance.",
      "Ukraine and the West say Putin is engaged in an imperial-style land grab in Ukraine, and have repeatedly vowed to defeat Russia, which currently controls just under 20% of Ukraine, including Crimea, and a chunk of eastern and southern Ukraine.",
      "Putin casts the war as part of a historic struggle with the West, which he says humiliated Russia after the Soviet Union fell in 1991 by enlarging NATO and encroaching on what he considers Moscow’s sphere of influence, including Ukraine.",
      "Kosachev said that Macron was moving away from the legacy of former president Charles de Gaulle and said Macron was clearly seeking to shift the blame for all France and Europe’s problems solely on Russia’s shoulders.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "said macron",
      "dmitry medvedev",
      "russian officials",
      "world war",
      "european powers",
      "united states",
      "france europe",
      "summary ai",
      "ai generated",
      "generated summarization"
    ]
  },
  {
    "title": "UK, European leaders join forces to draft Ukraine peace plan to take to US",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/united-kingdom-european-leaders-join-forces-draft-ukraine-peace-plan/",
    "publishedAt": "2025-03-03T00:42:53Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "UKRAINE-UK TIES.",
      "Britain's Prime Minister Keir Starmer and Ukrainian President Volodymyr Zelenskyy shake hands during a bilateral meeting at 10 Downing Street ahead of a summit of European leaders, on March 1, 2025 in London, Britain.",
      "Peter Nicholls/Reuters LONDON, United Kingdom – British Prime Minister Keir Starmer said on Sunday European leaders had agreed to draw up a Ukraine peace plan to take to the United States, a vital step for Washington to be able to offer security guarantees Kyiv says are vital to deter Russia.",
      "At a summit in London just two days after Volodymyr Zelenskyy clashed with US President Donald Trump and cut short a visit to Washington, world leaders offered a strong show of support to the Ukrainian president and promised to do more to help his nation.",
      "European leaders agreed they must spend more on defence to show Trump the continent can protect itself.",
      "And the European Commission chief, with many EU nations struggling with already stretched public finances, suggested the bloc could ease its rules that limit debt levels.",
      "Starmer, who welcomed a visibly shaken Zelenskyy on Saturday with a warm hug, said Britain, Ukraine, France and some other nations would form a “coalition of the willing” and draw up a peace plan to take to Trump.",
      "He did not name other nations, but said more countries were willing to join.",
      "“We are at a crossroads in history today,” Starmer said.",
      "“This is not a moment for more talk.",
      "It’s time to act.",
      "Time to step up and lead and to unite around a new plan for a just and enduring peace.” Zelenskyy said after the summit that European unity was “at an extremely high level not seen for a long time.” “We are all working together in Europe in order to find a basis for cooperation with America for a true peace and guaranteed security,” Zelenskyy wrote on Telegram.",
      "Europe is scrambling to ensure that Kyiv is not squeezed out of any talks after Trump’s shouting match with Zelenskyy in the Oval Office raised fears that the US could pull support for Ukraine and impose a peace plan negotiated with Russia.",
      "Several leaders said they must increase defence spending — something that could help bring Trump on side to offer a US security guarantee in the event of peace.",
      "“After a long time of underinvestment, it is now of utmost importance to step up the defence investment for a prolonged period of time,” Ursula von der Leyen, president of the European Commission, the EU’s executive body, told reporters.",
      "“Member states need more fiscal space to do a surge in defence spending,” she said, adding that Europe needed to turn “Ukraine into a steel porcupine that is indigestible for potential invaders”.",
      "Polish Prime Minister Donald Tusk said leaders agreed Europe needed to take on more responsibility and start bearing the burden of “more spending on its defence budgets within NATO”.",
      "He added the leaders all agreed they must keep close ties with the US.",
      "Europe, which lacks the weaponry and depth of ammunition stocks of the US, hopes to convince Trump that it can defend itself but that Russia will only adhere to a peace deal if it comes with the backing of the United States.",
      "Talks with the US have centred on Washington providing a so-called backstop for a European peacekeeping role, possibly in the form of air cover, intelligence and surveillance and a greater but unspecified threat if Russian President Vladmir Putin again sought to take more territory Crucial to getting any agreement from Trump is for European nations to increase defence spending and signal they would take part in any peacekeeping role — something Starmer acknowledged was difficult to get unanimity on.",
      "Starmer increased the UK’s defence spending before his visit to Washington last week, and NATO Secretary General Mark Rutte said some European leaders had privately set out new plans on defence spending at the meeting but he declined to give details.",
      "Trump has upended US policy on the three-year-old war since he returned to the White House in January, casting doubt on U.S. military and political support for Ukraine — and Europe — and ending the isolation of Moscow.",
      "Trump had blindsided Europe by calling Putin without warning and sending a delegation to Saudi Arabia for talks with Russia without including Ukraine or Europe.",
      "Trump has falsely suggested that Kyiv was responsible for starting the war, and on Friday, he criticised Zelenskyy for not being grateful for US aid.",
      "Zelenskyy’s clash with Trump on Friday ended a week when Europe had appeared to be in a better position in its drive to encourage Trump to continue to offer support to Ukraine after cordial visits to Washington by French President Emmanuel Macron and Starmer.",
      "Starmer described watching the spat between Zelenskyy and Trump in the Oval Office as uncomfortable viewing, but was keen to push the conversation forward by offering himself as a go-between for Europe and the United States.",
      "In a further show of support for the Ukrainian leader, Zelenskyy later on Sunday flew to meet King Charles at his private residence in eastern England.",
      "The Trump administration on Sunday continued to criticise Zelenskyy.",
      "White House national security adviser Mike Waltz told CNN that the US needs a Ukranian leader who is willing to secure a lasting peace with Russia, but that it is not clear Zelenskyy is prepared to do so.",
      "Russian Foreign Minister Sergei Lavrov praised Trump’s “common sense” approach and accused European countries of seeking to prolong the conflict by propping up Zelenskyy “with their bayonets in the form of peacekeeping units”.",
      "Starmer said the leaders on Sunday also agreed to work to ensure Kyiv is at the table of any peace talks and boost the country’s own defence capabilities.",
      "“Europe must do the heavy lifting, but to support peace in our continent and to succeed, this effort must have strong US backing,” Starmer told a news conference.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "defence spending",
      "european leaders",
      "leaders agreed",
      "prime minister",
      "starmer said",
      "peace plan",
      "united states",
      "support ukraine",
      "minister keir",
      "keir starmer"
    ]
  },
  {
    "title": "After Trump clash, Ukraine's Zelenskyy gets warm UK welcome before European summit",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/ukraine-volodymyr-zelenskyy-warm-welcome-united-kingdom-march-1-2025/",
    "publishedAt": "2025-03-02T02:05:02Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "UKRAINE-UK TIES.",
      "Britain's Prime Minister Keir Starmer and Ukrainian President Volodymyr Zelenskyy shake hands during a bilateral meeting at 10 Downing Street ahead of a summit of European leaders, on March 1, 2025 in London, Britain.",
      "Peter Nicholls/Reuters LONDON, United Kingdom – British Prime Minister Keir Starmer greeted President Volodymyr Zelenskyy with a warm embrace on Saturday, March 1, after the Ukrainian leader flew to London for talks following his clash at the White House with US President Donald Trump.",
      "In an extraordinary Oval Office meeting on Friday, February 28, Trump threatened to withdraw support for Ukraine, three years after Russia invaded its smaller neighbor.",
      "French President Emmanuel Macron spoke to Zelenskyy and Trump on Saturday and called for calm in an interview following Friday’s White House clash.",
      "In London, a crowd cheered as Zelenskyy arrived for talks with Starmer at his Downing Street office before a summit of European leaders that the Ukrainian president will attend on Sunday, March 2, to discuss a peace plan for Ukraine.",
      "“I hope you heard some of that cheering in the street.",
      "That is the people of the United Kingdom coming out to demonstrate how much they support you…and our absolute determination to stand with you,” Starmer told him.",
      "Starmer told Zelenskyy he had “full backing across the United Kingdom.” “We stand with you and Ukraine for as long as it may take,” Starmer said.",
      "Zelenskyy said on Saturday he had “important and warm” talks with Starmer, with a discussion on strengthening Ukraine’s position and obtaining reliable security guarantees.",
      "“During our talks we discussed the challenges standing before Ukraine and all of Europe, coordination with our partners, concrete steps to strengthen Ukraine’s position and ending the war in a just fashion, with reliable security guarantees,” Zelenskyy wrote on the Telegram messaging app.",
      "Other European leaders also issued messages of support for Zelenskyy and Ukraine after his meeting with Trump, highlighting differences between traditional allies the United States and Europe over the war since Trump returned to office.",
      "Senior Russian politicians have reacted with glee to what they see as Zelenskyy’s White House humiliation, saying the Ukrainian leader got what he deserved and that US military aid to Kyiv must now be cut.",
      "The French presidency said Macron had also spoken to British Starmer, European Council President Antonio Costa, and NATO chief Mark Rutte, on the eve of the London summit.",
      "“I think that beyond the frayed nerves, everybody needs to calm down, show respect and gratitude, so we can move forward concretely, because what’s at stake is too important,” Macron said in an interview with several Sunday newspapers.",
      "Macron said Zelenskyy had told him he was willing to “restore dialogue” with the United States, including on a deal giving the US access to revenues from Ukraine’s natural resources, but did not say what Trump told him in the call.",
      "The White House had no immediate comment.",
      "In an interview with CNN on Friday, Trump’s Secretary of State Marco Rubio called on Zelenskyy to “apologize for turning this thing into the fiasco for him that it became.” In an interview with Fox News on Friday Zelenskyy said he believed his relationship with Trump could be salvaged and appeared to express some regret, saying “I’m sorry for this.” The falling-out meant that Ukraine and the United States failed to sign a much-vaunted minerals deal Kyiv hoped would spur Trump to back Ukraine’s war effort and potentially win support from Republicans in Congress for a new round of aid.",
      "Trump is not interested in revisiting the minerals deal at the moment, a senior White House official told Reuters on Friday evening.",
      "Starmer spoke to both Trump and Zelenskyy on Friday, and French President Emmanuel Macron also visited Trump in Washington this week.",
      "Zelenskyy is also due to meet King Charles on Sunday.",
      "Britain’s Sun newspaper said the meeting would take place at the monarch’s Sandringham estate in eastern England.",
      "“I’m very happy that His Majesty the King accepted my meeting tomorrow,” Zelenskyy told Starmer at the start of their meeting.",
      "Britain has been a vocal backer of Ukraine and Charles has previously expressed his support for Zelenskyy, speaking of the “determination and strength” of the Ukrainian people in the face of an unprovoked attack from Russia.",
      "During Starmer’s visit to the White House, he presented Trump with a written invitation from the King for a state visit, which would make the US president the first elected political leader in modern times to be hosted for two state visits by a British monarch.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "white house",
      "european leaders",
      "united states",
      "prime minister",
      "minister keir",
      "keir starmer",
      "ukrainian president",
      "president volodymyr",
      "volodymyr zelenskyy",
      "downing street"
    ]
  },
  {
    "title": "Minerals deal off as Trump, Zelenskyy talks end in shouting match",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/03/01/world/americas-emea/minerals-deal-off-as-trump-zelenskyy-talks-end-in-shouting-match/2065161",
    "publishedAt": "2025-02-28T23:26:00Z",
    "sentences": [
      "WASHINGTON, United States — US President Donald Trump erupted at Volodymyr Zelenskyy on Friday, angrily sending the Ukrainian leader out of the White House after an extraordinary Oval Office meltdown because he was \"not ready\" for peace with Russia.",
      "The abrupt exit, cutting short what was meant to be a day of Ukraine-US diplomacy, meant Zelenskyy left without a deal for joint development of his country's mineral resources that was to be part of a post-war recovery in a potential US-brokered truce.",
      "Ad-free access"
    ],
    "topics": [
      "washington united",
      "united states",
      "states us",
      "us president",
      "president donald",
      "donald trump",
      "trump erupted",
      "erupted volodymyr",
      "volodymyr zelenskyy",
      "zelenskyy friday"
    ]
  },
  {
    "title": "Rupture grows as US sides with Russia",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314561786/rupture-grows-as-us-sides-with-russia.html",
    "publishedAt": "2025-02-25T13:00:00Z",
    "sentences": [
      "UNITED NATIONS, New York – The United States sided with Russia twice Monday (Tuesday in Manila) at the United Nations, as they sought to avoid any condemnation of Moscow’s invasion of its neighbor three years ago.",
      "The two votes highlighted a seismic shift in the balance of power at the UN, where Washington had steadfastly voted for resolutions that favored Ukraine and condemned Russia, until the abrupt rupture with Kyiv.",
      "As US President Donald Trump stakes out a new position on the Ukraine war, Washington and Russia aligned first at a morning vote at the General Assembly and again at an afternoon vote of the Security Council.",
      "A European-backed text won 93 votes for at the General Assembly and 18 votes against, with 65 abstentions and Washington sided with Moscow and Russian allies Belarus, North Korea and Sudan to vote against the text.",
      "The resolution — which won far less support compared to previous ones on the war — strongly criticizes Russia, and emphasizes Ukraine’s territorial integrity and inviolability of its borders.",
      "Washington drafted a rival resolution amid an intensifying feud between Trump and Ukrainian President Volodymyr Zelenskyy.",
      "But Ukraine’s European allies pushed to heavily reword the US text to say that the “full-scale invasion of Ukraine” had been carried out by Russia, meaning Washington ultimately did not vote in favor of its own text.",
      "Undeterred, the United States brought the earlier, unchanged text to a vote at the Security Council in the afternoon, securing its passage with 10 votes for and none against — alongside five abstentions.",
      "The abstentions were France, Britain, Denmark, Greece, and Slovenia.",
      "France and Britain notably could have vetoed the resolution, which merely “implores a swift end to the conflict” without blaming Russia.",
      "Several amendments, brought respectively by Russia and European nations, did not pass.",
      "“We acknowledge the constructive changes in the United States position when it comes to the Ukrainian conflict,” said Russia’s UN envoy Vassily Nebenzya following the vote.",
      "Relations between Washington and Kyiv have rapidly deteriorated following Trump’s return to the White House, with the US president claiming Zelenskyy is highly unpopular and a “dictator.” Trump’s growing rupture with Ukraine has caused panic on a continent that has relied on US security assurance for 80 years.",
      "The International Crisis Group’s Richard Gowan said the EU won a “moral victory” in the General Assembly, but warned European diplomats will “worry that Russia and the US will route more resolutions on Ukraine through the Security Council — potentially including asking for an endorsement of whatever deal Trump and Putin cook up.” Ahead of the Security Council vote, there was speculation on whether France or Britain would be prepared to wield their first vetoes in more than 30 years.",
      "Their respective leaders, Emmanuel Macron and Keir Starmer, are visiting the White House this week for key talks on Ukraine.",
      "The inviolability of Ukrainian territorial integrity was a cornerstone of previous resolutions passed at the UN, with the United States under former president Joe Biden among its strongest supporters.",
      "“Neither these amendments, nor the resolution offered by Ukraine will stop the killing.",
      "The UN must stop the killing.",
      "We urge all Member States to join us in returning the UN to its core mission of international peace and security,” said Washington’s envoy to the UN, Dorothy Shea, ahead of the votes.",
      "She later hailed the Security Council’s passage of “an historic landmark agreement on Ukraine.” “We call on all other UN member states to join the United States in pushing for a durable peace that will bring stability to Europe and deter further aggression,” said Shea.",
      "UN chief Antonio Guterres on Sunday called for a peace that “fully upholds Ukraine’s territorial integrity” and respects the UN Charter.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "united states",
      "security council",
      "general assembly",
      "territorial integrity",
      "france britain",
      "united nations",
      "us president",
      "vote security",
      "ukraine territorial",
      "white house"
    ]
  },
  {
    "title": "Three years of war: What Ukraine stands to lose - and the world stands to learn",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/02/21/opinion/columns/three-years-of-war-what-ukraine-stands-to-lose-and-the-world-stands-to-learn/2059674",
    "publishedAt": "2025-02-20T16:05:00Z",
    "sentences": [
      "ON Feb. 24, 2022, the world watched in disbelief as Russia unleashed the largest military invasion in Europe since World War II.",
      "It was not a regional skirmish or a geopolitical misunderstanding; it was a brutal, unprovoked war of conquest.",
      "Three years later, Ukraine stands, battered but unbowed, fighting for its survival and the very principles of sovereignty, democracy and international law.",
      "But as this war drags on, what is truly at stake?",
      "It is not just Ukraine's future, but the world's.",
      "What happens to Ukraine will determine whether global politics is governed by rules or by force.",
      "And, perhaps more tangibly, it will decide who controls some of the world's most valuable resources — resources that power economies, fuel industries and, if taken by force, fund future aggression.",
      "Ad-free access"
    ],
    "topics": [
      "24 2022",
      "2022 world",
      "world watched",
      "watched disbelief",
      "disbelief russia",
      "russia unleashed",
      "unleashed largest",
      "largest military",
      "military invasion",
      "invasion europe"
    ]
  },
  {
    "title": "EU envoys OK more sanctions vs Russia",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/02/20/world/americas-emea/eu-envoys-ok-more-sanctions-vs-russia/2058456",
    "publishedAt": "2025-02-19T16:06:00Z",
    "sentences": [
      "BRUSSELS — European Union envoys have approved a new raft of sanctions against Russia, with the measures set to enter into force next week on the third anniversary of its full-scale invasion of Ukraine, a top EU official and diplomats confirmed on Wednesday.",
      "The move comes with the Europeans sidelined from United States-led talks to end the war.",
      "Ad-free access"
    ],
    "topics": [
      "brussels european",
      "european union",
      "union envoys",
      "envoys approved",
      "approved new",
      "new raft",
      "raft sanctions",
      "sanctions russia",
      "russia measures",
      "measures set"
    ]
  },
  {
    "title": "Trump bashes Zelenskyy for invasion",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314559604/trump-bashes-zelenskyy-for-invasion.html",
    "publishedAt": "2025-02-19T13:05:00Z",
    "sentences": [
      "PALM BEACH – US President Donald Trump has effectively blamed Ukrainian leader Volodymyr Zelenskyy for Russia’s invasion, as French President Emmanuel Macron prepares for another round of talks with EU and non-European partners on Wednesday.",
      "Zelenskyy previously criticized the US-Russia talks for excluding Kyiv, saying efforts to end the war must be “fair and involve European countries.",
      "The Ukrainian leader’s comments appeared to incense Trump, who launched a series of verbal attacks on Zelenskyy.",
      "“I’m very disappointed, I hear that they’re upset about not having a seat,” Trump told reporters at his Mar-a-Lago resort in Florida on Tuesday.",
      "“Today I heard, ‘oh, well, we weren’t invited.’ Well, you’ve been there for three years… You should have never started it.",
      "You could have made a deal.” Trump also suggested he could meet Russian President Vladimir Putin before the end of the month in Saudi Arabia as he overhauls Washington’s stance towards Moscow — a shift that has alarmed European leaders.",
      "Earlier Tuesday, Russia and the United States had agreed to establish teams to negotiate a path to ending the war in Ukraine after talks that drew a strong rebuke from Kyiv, with Zelenskyy postponing his own trip to Saudi Arabia.",
      "France’s Macron announced another meeting in Paris on Ukraine after the US-Russia talks, adding that Trump “can restart a useful dialogue” with Putin.",
      "Trump also increased pressure on Zelenskyy to hold elections — echoing one of Moscow’s key demands.",
      "Asked whether the United States would support demands that Russia wanted to force Zelenskyy to hold new elections as part of any deal, Trump began by criticizing what he said were the Ukrainian’s approval ratings.",
      "“They want a seat at the table, but you could say… wouldn’t the people of Ukraine have a say?",
      "It’s been a long time since we’ve had an election,” said Trump.",
      "“That’s not a Russian thing, that’s something coming from me, from other countries.” Zelenskyy was elected in 2019 for a five-year term, but has remained in office as Ukraine is still under martial law.",
      "Trump’s latest remarks are unlikely to allay fears among some European leaders, already worried that Washington will make serious concessions to Moscow and re-write the continent’s security arrangement in a Cold War-style deal.",
      "Washington noted European nations would have to have a seat at the negotiating table “at some point”.",
      "The US-Russia talks — the first high-level official talks between the two countries since the 2022 invasion of Ukraine — drew a fiery response from Kyiv.",
      "“This will only be feeding Putin’s appetite,” a Ukrainian senior official requesting anonymity told AFP, referring to the launch of talks without Ukraine.",
      "Trump for his part said he was “much more confident” of a deal after the Riyadh talks, telling reporters Tuesday at his Mar-a-Lago estate: “I think I have the power to end this war.” US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov agreed to “appoint respective high-level teams to begin working on a path to ending the conflict in Ukraine as soon as possible”, the State Department said.",
      "Washington added that the sides had also agreed to “establish a consultation mechanism” to address “irritants” to the US-Russia relationship, noting the sides would lay the groundwork for future cooperation.",
      "Riyadh marks a diplomatic coup for Moscow, which had been isolated for three years under the previous US administration of Joe Biden.",
      "Moscow’s economic negotiator, Kirill Dmitriev, said Western attempts to isolate Russia had “obviously failed”.",
      "“We did not just listen but heard each other, and I have reason to believe the American side has better understood our position,” Lavrov told reporters.",
      "The veteran diplomat noted that Russia opposed any deployment of NATO-nation troops to Ukraine as part of an eventual ceasefire.",
      "European allies publicly diverged this week over whether they would be open to sending truce peacekeepers to Ukraine.",
      "Macron, in an interview with French regional newspapers, appeared open to the idea of sending troops to Ukraine but only in the most limited fashion and away from conflict zones.",
      "He said new talks would take place “with several European and non-European states”, after an emergency meeting on Monday in Paris which brought together a small number of key European countries.",
      "Moscow has long called for the withdrawal of NATO forces from eastern Europe, viewing the alliance as an existential threat on its flank.",
      "The Kremlin on Tuesday said Ukraine had the right to join the European Union, but not the NATO military alliance.",
      "It also said Putin was “ready” to negotiate with Zelenskyy “if necessary.” © All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "ukrainian leader",
      "european countries",
      "told reporters",
      "trump also",
      "saudi arabia",
      "european leaders",
      "united states",
      "agreed establish",
      "path ending",
      "ukraine talks"
    ]
  },
  {
    "title": "American Marc Fogel greeted by Trump after being released from prison by Russia",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/us-canada/marc-fogel-greeted-donald-trump-after-being-released-from-prison-russia/",
    "publishedAt": "2025-02-12T05:16:53Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "FREE.",
      "US President Donald Trump and released American schoolteacher Marc Fogel react during an event to welcome back Fogel, who had been held in Russia since 2021, at the White House in Washington, DC, USA, February 11, 2025.",
      "Kevin Lamarque/Reuters WASHINGTON, USA – American schoolteacher Marc Fogel, freed by Russia after three and a half years in prison, got a flag-waving welcome from US President Donald Trump at a snowy White House on Tuesday, February 11, after a flight home from Moscow.",
      "“I feel like the luckiest man on earth right now,” said Fogel, an American flag draped around his shoulders.",
      "“I’m a middle-class school teacher who’s now in a dream world.” Trump, standing alongside Fogel in the White House Diplomatic Reception Room, said: “To me he looks damned good.” The release of 63-year-old Fogel, who had been detained in Russia since August 2021 and was serving a 14-year sentence, came as Trump seeks to improve relations with Moscow as part of an effort to secure an end to the war in Ukraine.",
      "Trump said Fogel’s release “could be a big important part” of ending the Ukraine war.",
      "He and Fogel both thanked Russian President Vladimir Putin for his release.",
      "“We just wanted to get him back home,” Trump said, adding that he would take Fogel on a tour of the Lincoln Bedroom upstairs in the White House.",
      "Trump said another person would be released on Wednesday, without identifying who it would be.",
      "He called the terms of Fogel’s release “very fair.” Fogel was released into the custody of Trump’s Middle East envoy, Steve Witkoff, who made an unannounced stop in Moscow on Tuesday to pick him up.",
      "On a plane home, Fogel, who is from Pennsylvania, was shown with a raised glass, a cheese plate and his US passport in a photo posted on social media by Trump’s chief hostage envoy Adam Boehler.",
      "Asked what the United States gave up in exchange for Fogel, Trump told reporters earlier: “Not much” and called the release a show of good faith from the Russians.",
      "“We were treated very nicely by Russia.",
      "Actually, I hope that’s the beginning of a relationship where we can end that (Ukraine) war and millions of people can stop being killed,” Trump said.",
      "Fogel was sentenced to 14 years in prison for drug smuggling after he was detained in Moscow’s Sheremetyevo airport in August 2021 with 17 grams of marijuana in his luggage.",
      "The marijuana had been medically prescribed in Pennsylvania, where it is legal, said Martin De Luca, a member of Fogel’s legal team.",
      "Witkoff’s plane was on the ground in Moscow for a few hours before leaving with Fogel onboard, flying through central Europe and back to Washington, De Luca told Reuters.",
      "“We are beyond grateful, relieved, and overwhelmed that after more than three years of detention, our father, husband, and son, Marc Fogel, is finally coming home,” the Fogel family said in a statement.",
      "“This has been the darkest and most painful period of our lives, but today, we begin to heal.” Dmitry Ovsyannikov, who had served as Fogel’s Russian lawyer in the past,told Russia’s Interfax news agency that Fogel was last week transferred from a prison in Rybinsk, north of Moscow, to a pre-trial detention center in Moscow ahead of his release.",
      "Fogel was left out of a historic swap of prisoners in August that involved 24 prisoners — 16 sent from Russia to the West, including Wall Street Journal reporter Evan Gershkovich, and eight sent back to Russia from the West.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "white house",
      "trump said",
      "marc fogel",
      "said fogel",
      "release fogel",
      "us president",
      "president donald",
      "donald trump",
      "american schoolteacher",
      "schoolteacher marc"
    ]
  },
  {
    "title": "'NKorea troops not fighting in Kursk since mid-Jan'",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/02/05/world/asia-oceania/nkorea-troops-not-fighting-in-kursk-since-mid-jan/2049803",
    "publishedAt": "2025-02-04T16:26:00Z",
    "sentences": [
      "SEOUL — North Korean soldiers previously fighting alongside Russia's army on the Kursk front line appear not to have been engaged in combat since mid-January, South Korea's spy agency told Agence France-Presse (AFP) on Tuesday, after Ukraine claimed they had been withdrawn following heavy losses.",
      "\"Since mid-January, it appears that the North Korean troops deployed to the Kursk region of Russia have not engaged in combat,\" South Korea's National Intelligence Service said in a statement.",
      "Ad-free access"
    ],
    "topics": [
      "north korean",
      "engaged combat",
      "south korea",
      "seoul north",
      "korean soldiers",
      "soldiers previously",
      "previously fighting",
      "fighting alongside",
      "alongside russia",
      "russia army"
    ]
  },
  {
    "title": "Ukraine losing ground to Russia’s armed forces",
    "source": "SunStar Philippines",
    "url": "https://www.sunstar.com.ph/network/ukraine-losing-ground-to-russias-armed-forces",
    "publishedAt": "2025-02-04T12:40:48Z",
    "sentences": [
      "POKROVSK REGION, Ukraine — A dire shortage of infantry troops and supply routes coming under Russian drone attacks are conspiring against Ukrainian forces in Pokrovsk, where decisive battles in the nearly three-year war are playing out — and time is running short.",
      "Ukrainian troops are losing ground around the crucial supply hub, which lies at the confluence of multiple highways leading to key cities in the eastern Donetsk region as well as an important railway station.",
      "Moscow is set on capturing as much territory as possible as the Trump administration is pushing for negotiations to end the war and recently froze foreign aid to Ukraine, a move that has shocked Ukrainian officials already apprehensive about the intentions of the new US president, their most important ally.",
      "Military aid has not stopped, Ukrainian President Volodymyr Zelenskyy has said.",
      "“The war is won by logistics.",
      "If there is no logistics, there is no infantry, because there is no way to supply it,” said the deputy commander of the Da Vinci Wolves battalion, known by the call sign Afer.",
      "“(Russians) have learned this and are doing it quite well.” / AP"
    ],
    "topics": [
      "pokrovsk region",
      "region ukraine",
      "ukraine dire",
      "dire shortage",
      "shortage infantry",
      "infantry troops",
      "troops supply",
      "supply routes",
      "routes coming",
      "coming russian"
    ]
  },
  {
    "title": "Ukraine claims drone attack, Russia says it captured town",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314551278/ukraine-claims-drone-attack-russia-says-it-captured-town.html",
    "publishedAt": "2025-01-27T12:55:00Z",
    "sentences": [
      "KYIV – Ukraine on Sunday claimed a night-time drone attack on a Russian oil refinery south of Moscow, in the second attack on the same site in less that two weeks.",
      "Kyiv has been launching drones into Russia throughout Moscow’s almost three years invasion.",
      "Ukraine’s army said “the Defence Intelligence of Ukraine had hit the facilities of the Ryazan Oil Refining Company again.” Kyiv said the refinery is one of the four largest in Russia and is used by Moscow’s air force.",
      "“Explosions and a fire were recorded in the targeted area,” it said.",
      "The regional governor in Ryazan — Pavel Malkov — said Russian air defence had “destroyed” drones over the regin and that authorities were assessing the damage.",
      "Both sides in the war in Ukraine have rushed to seek an advantage on the battlefield with Donald Trump — who has vowed to hold talks on the conflict — now back in the White House.",
      "Menwhile, Russia said its forces had captured the east Ukrainian town of Velyka Novosilka in the embattled Donetsk region, almost three years into their offensive.",
      "Russia’s military has been making steady advances on the battlefield in eastern Ukraine for months.",
      "Moscow’s defene ministry said Russian troops led “active offensive actions” and “liberated the settlement of Velyka Novosilka”, which lies in the west of the Donetsk region.",
      "Moscow regularly claims the capture of small villages, but rarely announces claims to bigger towns.",
      "According to Ukrainian data, Velyka Novosilka had a population of around 6,000 people before Moscow’s 2022 offensive — but only around 300 people remain.",
      "Velyka Novosilka is close to the southern front line in Ukraine — which has remained largely static but where fears of a fresh Russian offensive have risen for weeks.",
      "Russia’s defense ministry later released images of two soldiers waving Russian flags on top of a damaged building.",
      "It also said that Defence Minister Andrei Belousov had congratulated units who took part in the advance on the town.",
      "Kyiv has not yet commented on the claims.",
      "Both sides have raced to gain an advantage in the almost three-year as Donald Trump — who has vowed to hold talks to end the conflict — returns to the White House.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "velyka novosilka",
      "almost three",
      "three years",
      "said defence",
      "said russian",
      "donald trump",
      "trump vowed",
      "vowed hold",
      "hold talks",
      "white house"
    ]
  },
  {
    "title": "'300 NKoreans killed in Ukraine war'",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2025/01/14/world/asia-oceania/300-nkoreans-killed-in-ukraine-war/2037654",
    "publishedAt": "2025-01-13T16:12:00Z",
    "sentences": [
      "SEOUL — Around 300 North Korean soldiers were killed and 2,700 were injured while fighting in Russia's war against Ukraine, a South Korean lawmaker said on Monday, citing information from Seoul's spy agency.",
      "Seoul previously claimed that North Korean leader Kim Jong Un had sent more than 10,000 soldiers as \"cannon fodder\" to help Moscow fight Kyiv, in return for Russian technical assistance for Pyongyang's heavily sanctioned weapons and satellite programs.",
      "Ad-free access"
    ],
    "topics": [
      "north korean",
      "seoul around",
      "around 300",
      "300 north",
      "korean soldiers",
      "soldiers killed",
      "killed injured",
      "injured fighting",
      "fighting russia",
      "russia war"
    ]
  },
  {
    "title": "Seoul says 300 North Korean soldiers killed fighting Ukraine",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314546378/seoul-says-300-north-korean-soldiers-killed-fighting-ukraine.html",
    "publishedAt": "2025-01-13T13:45:00Z",
    "sentences": [
      "SEOUL—Around 300 North Korean soldiers have been killed and 2,700 wounded while fighting in Russia’s war against Ukraine, a South Korean lawmaker said Monday, citing information from Seoul’s spy agency.",
      "Seoul has previously claimed North Korean leader Kim Jong Un has sent more than 10,000 soldiers as “cannon fodder” to help Moscow fight Kyiv, in return for Russian technical assistance for Pyongyang’s heavily sanctioned weapons and satellite programs.",
      "Over the weekend, Ukrainian President Volodymyr Zelenskyy said Kyiv had captured two North Korean soldiers, releasing video of the injured combatants being interrogated and raising the possibility of a prisoner swap for captured Ukrainian troops.",
      "“The deployment of North Korean troops to Russia has reportedly expanded to include the Kursk region, with estimates suggesting that casualties among North Korean forces have surpassed 3,000,” lawmaker Lee Seong-kweun told reporters after a briefing from the spy agency.",
      "This includes “approximately 300 deaths and 2,700 injuries,” Lee said, after a briefing from Seoul’s National Intelligence Service.",
      "The soldiers, reportedly from North Korea’s elite Storm Corps, have been ordered to kill themselves rather than be taken prisoner, Lee said.",
      "“Notably, memos found on deceased soldiers indicate that the North Korean authorities pressured them to commit suicide or self-detonate before capture,” he said.",
      "He added that some of the soldiers had been granted “amnesty” or wanted to join North Korea’s ruling Workers’ Party, hoping to improve their lot by fighting.",
      "One North Korean soldier who was about to be captured shouted “General Kim Jong Un” and attempted to detonate a grenade, Lee said, adding that he was shot and killed.",
      "The NIS analysis also revealed that the North Korean soldiers have “a lack of understanding of modern warfare,” and are being used by Russia in a manner leading to “the high number of casualties,” the lawmaker said.",
      "Lee — speaking for South Korea’s intelligence committee in parliament — said in the coming year US president-elect Donald Trump, who has previously tried to woo North Korean leader Kim Jong Un, “may push for dialogue… once again”.",
      "He also said Kim may “weigh the possibility of a visit to Russia in the first half of this year” after meeting Russian President Vladimir Putin in late 2023.",
      "In a post on social media platform X Sunday, Zelenskyy said: “Ukraine is ready to hand over Kim Jong Un’s soldiers to him if he can organize their exchange for our warriors who are being held captive in Russia.” There would “undoubtedly be more” North Korean soldiers captured by Kyiv, he added.",
      "“For those North Korean soldiers who do not wish to return, there may be other options available,” said Zelenskyy.",
      "Ukraine, the United States and South Korea have accused nuclear-armed North Korea of sending more than 10,000 soldiers to help bolster Russian forces.",
      "Neither Moscow nor Pyongyang has acknowledged that North Koreans have been deployed to fight against Ukraine.",
      "The two countries have boosted their military cooperation since Russia launched its 2022 invasion of Ukraine.",
      "On a visit to Seoul this month, US Secretary of State Antony Blinken said Washington believed Russia was expanding space cooperation with North Korea in exchange for its troop contribution in fighting Ukraine.",
      "Washington’s top diplomat said the United States also believed Russia “may be close” to formally accepting North Korea’s status as a nuclear power.",
      "The video posted by Zelenskyy of the interrogation of the two North Korean prisoners of war shows one lying in a bunk bed and the other sitting up with a bandage around his jaw.",
      "One man can be heard speaking to a Ukrainian official through an interpreter, saying that he did not know he was going to fight in a war with Ukraine and that his commanders “told him it was just training”.",
      "In translated comments, one of the men says he wants to return to North Korea.",
      "The other says he will do what he is told but, if given the chance, wants to live in Ukraine.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "north korean",
      "north korea",
      "korean soldiers",
      "kim jong",
      "jong un",
      "lee said",
      "war ukraine",
      "lawmaker said",
      "spy agency",
      "korean leader"
    ]
  },
  {
    "title": "Seoul confirms Ukraine captured 2 North Korean soldiers",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314545822/seoul-confirms-ukraine-captured-2-north-korean-soldiers.html",
    "publishedAt": "2025-01-12T02:32:03Z",
    "sentences": [
      "South Korea’s National Intelligence Service said Sunday it confirmed Ukraine captured two wounded North Korean soldiers this week in Russia, after Ukrainian President Volodymyr Zelensky said they were being questioned.",
      "“The NIS, through real-time cooperation with Ukraine’s intelligence agency (SBU) has identified battlefield situations, including the capture of North Korean soldiers, and confirmed that the Ukrainian military captured two North Korean soldiers on January 9 in the Kursk battlefield in Russia,” the National Intelligence Service (NIS) said in a statement.",
      "Kyiv, the United States and South Korea have accused nuclear-armed North Korea of sending more than 10,000 soldiers to help Russia fight Ukraine.",
      "Kyiv on Saturday did not present direct evidence that the captured men were North Korean and AFP was unable to independently verify their nationality.",
      "But the South Korean confirmation adds weight to Kyiv’s account, while neither Russia nor North Korea has reacted.",
      "The NIS said one of the captured soldiers revealed during his interrogation that he received military training from Russian forces after arriving there in November.",
      "“He initially believed he was being sent for training, realising upon arrival in Russia that he had been deployed,” the NIS said.",
      "The soldier said North Korean forces had experienced “significant losses during battle”.",
      "The SBU also said the men had told interrogators they were experienced army soldiers, and one said he was sent to Russia for training, not to fight.",
      "The NIS said it would continue to work with the SBU to share information on North Korean fighters in Ukraine.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "north korean",
      "nis said",
      "korean soldiers",
      "south korea",
      "national intelligence",
      "intelligence service",
      "captured two",
      "north korea",
      "korea national",
      "service said"
    ]
  },
  {
    "title": "Russia says Ukraine fired US-made missiles at border",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/world-news/314543534/russia-says-ukraine-fired-us-made-missiles-at-border.html",
    "publishedAt": "2025-01-05T13:30:00Z",
    "sentences": [
      "MOSCOW – Russia has vowed to retaliate after it accused Ukraine of firing US-supplied ATACMS missiles at the border region of Belgorod the previous day.",
      "Outgoing US President Joe Biden authorized Kyiv to use the long-range weapons against Russia last year, in a move Moscow denounced as a grave escalation of the nearly three-year conflict.",
      "“On Jan. 3, an attempt was made from Ukrainian territory to launch a missile strike against the Belgorod region using US-made ATACMS operational-tactical missiles,” the Russian defense ministry said.",
      "“These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation,” it added, saying all the missiles were shot down.",
      "Kyiv’s use of the missile systems has infuriated the Kremlin, which has threatened to hit central Kyiv with a hypersonic ballistic missile in response to the strikes.",
      "ATACMS missiles have a maximum range of 300 kilometres (190 miles), according to publicly available data.",
      "US President-elect Donald Trump said in an interview published last month he was “very vehemently” opposed to Ukraine using the arms, which he said were “escalating” the conflict.",
      "In Ukraine’s eastern Donetsk region, a Ukrainian “kamikaze” drone killed a reporter from Russia’s Izvestia newspaper as he was travelling on a highway between two Russian-held cities, the paper said.",
      "Alexander Martemyanov, who worked freelance for the paper, was returning from covering shelling in the Russian-held city of Gorlivka with colleagues when their car was hit, Russia’s state RIA news agency said.",
      "A journalist from RIA and four other media workers were wounded in the attack, the agency added.",
      "Both Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.",
      "A Russian strike on a village in Ukraine’s northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional governor Oleg Synegubov said.",
      "Moscow also struck a town in Ukraine’s northern Sumy region, destroying part of an apartment building and wounding seven including a two-year-old girl, according to Ukrainian President Volodymyr Zelenskyy.",
      "In the Russian-occupied part of Ukraine’s southern Zaporizhzhia region, a 10-year-old boy was killed and his parents injured when a drone hit their car, the region’s Moscow-installed head Yevgeny Balitsky said.",
      "Russia’s defence ministry meanwhile said on Saturday it had captured the Ukrainian village of Nadiia, one of the few settlements in the eastern Lugansk region still under Kyiv’s control.",
      "Moscow advanced by almost 4,000 square kilometers in Ukraine in 2024, according to an AFP analysis, as Kyiv’s army struggled with chronic manpower shortages and exhaustion.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "atacms missiles",
      "kyiv use",
      "moscow russia",
      "russia vowed",
      "vowed retaliate",
      "retaliate accused",
      "accused ukraine",
      "ukraine firing",
      "firing atacms",
      "missiles border"
    ]
  },
  {
    "title": "Zelenskyy vows Ukraine will do everything in 2025 to stop Russia",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314542389/zelenskyy-vows-ukraine-will-do-everything-in-2025-to-stop-russia.html",
    "publishedAt": "2025-01-01T13:40:00Z",
    "sentences": [
      "KYIV – Ukraine’s President Volodymyr Zelenskyy has vowed his country will use 2025 to fight for an end to Russia’s nearly three-year-long invasion by any means necessary.",
      "The Ukrainian leader’s address caps a difficult year for the war-battered country which has been fending off a better-resourced Russian army for nearly three years.",
      "“May 2025 be our year,” Zelenskyy said in an address to the nation just before the clock struck midnight in Kyiv.",
      "“We know that peace will not be given to us as a gift but we will do everything to stop Russia and end the war.” Ukraine lost seven times more territory to Russia this year than in 2023, according to an AFP analysis, and is facing the possibility of a reduction in US military and political backing when Donald Trump takes over the White House.",
      "Incumbent US President Joe Biden’s administration unveiled almost $6 billion in military and budget aid for Ukraine on Monday in a race to support Kyiv before Trump takes office in January.",
      "The Republican has promised to end the conflict in “24 hours” once in power, raising fears in Ukraine that it will be forced to give up all the land the Kremlin currently controls in exchange for peace.",
      "In his new year’s address Zelenskyy said that Ukraine had to continue to fight to gain the upper hand — both on the battlefield and ahead of any prospective peace talks.",
      "“Every day in the coming year, I, and all of us, must fight for a Ukraine that is strong enough,” the Ukrainian leader said.",
      "“Because only such a Ukraine is respected and heard.",
      "Both on the battlefield and at the negotiating table.” But Zelenskyy appeared sanguine about Trump’s return.",
      "“I have no doubt that the new American President is willing and capable of achieving peace and ending (Russian President Vladimir) Putin’s aggression,” Zelenskyy said.",
      "In his own New Year’s Eve address on Tuesday, Putin did not explicitly mention the war in Ukraine but praised Russia’s soldiers for their “courage and bravery”.",
      "“You are true heroes who have undertaken the great military labour to defend Russia,” he said.",
      "Russian Defense Minister Andrei Belousov paid tribute to “fallen soldiers” in his address, saying that they had died fighting “Nazism” — a pretext Putin used to launch his invasion.",
      "Since that began in February 2022, Moscow has launched overnight aerial attacks on Ukraine almost every day.",
      "Those have targeted military and civilian infrastructure, including the power grid.",
      "Ukraine has stepped up its own attacks inside Russian territory in response, and urged its Western allies to supply more air defence systems.",
      "A Ukrainian drone strike in western Russia caused a fuel spill and fire at an oil depot, a Russian regional governor said earlier on Tuesday.",
      "Zelenskyy has urged his war-battered country’s allies to help end the invasion and bring lasting peace in 2025.",
      "Those hopes were echoed to AFP on the streets of Kyiv ahead of the turn of the new year.",
      "“I want peace to finally be obtained for Ukraine, for people to stop dying, for all our soldiers to return to their homes and celebrate next year and next Christmas with their families,” said Kateryna Chemeryz, a teacher.",
      "“It seems to me that everyone has one wish, one dream: that Ukraine will win, and all our territories are regained,” said Tetiana, a civil servant who declined to give her family name.",
      "The incoming US president has vowed to end the war but has not outlined any roadmap and there are concerns a deal could come at the expense of Ukrainian territory.",
      "Zelensky has sought to build bridges with Trump and his team, amid fears the Republican could slow vital US military aid or halt it entirely.",
      "“For me personally, there is some anxiety, because I was hoping for a different outcome,” Chemeryz, the teacher, said of Trump’s return to the White House.",
      "Tetiana was dismissive, saying Ukraine should work to determine its own fate “without Trump or anyone else.” © All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "zelenskyy said",
      "new year",
      "ukrainian leader",
      "us military",
      "trump takes",
      "white house",
      "us president",
      "said ukraine",
      "every day",
      "trump return"
    ]
  },
  {
    "title": "US imposes sanctions on entities in Iran, Russia over election interference",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/us-canada/us-sanctions-iran-russia-election-interference/",
    "publishedAt": "2024-12-31T15:52:16Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "2024 US PRESIDENTIAL ELECTIONS.",
      "Voting booths stand during the 2024 US presidential election on Election Day at the Detroit Police Department, Twelfth Precinct in Detroit, Michigan, US, on November 5, 2024.",
      "Emily Elconin/Reuters WASHINGTON, DC, USA – The United States on Tuesday, December 31, imposed sanctions on entities in Iran and Russia, accusing them of attempting to interfere in the 2024 US election.",
      "The US Treasury Department in a statement said the entities — a subsidiary of Iran’s Revolutionary Guards Corps and an organization affiliated with Russia’s military intelligence agency — aimed to “stoke socio-political tensions and influence the US electorate during the 2024 US election.” “The Governments of Iran and Russia have targeted our election processes and institutions and sought to divide the American people through targeted disinformation campaigns,” Treasury’s Acting Under Secretary for Terrorism and Financial Intelligence, Bradley Smith said in the statement.",
      "“The United States will remain vigilant against adversaries who would undermine our democracy.” Iran’s mission to the United Nations in New York and Russia’s embassy in Washington did not immediately respond to requests for comment.",
      "Republican Donald Trump was elected president in November, beating Democratic candidate Kamala Harris and capping a remarkable comeback four years after he was voted out of the White House.",
      "The Treasury said the Cognitive Design Production Center planned influence operations since at least 2023 designed to incite tensions among the electorate on behalf of the IRGC.",
      "The Treasury accused the Moscow-based Center for Geopolitical Expertise (CGE) of circulating disinformation about candidates in the election as well as directing and subsidizing the creation of deepfakes.",
      "The Treasury said CGE also manipulated a video to produce “baseless accusations concerning a 2024 vice presidential candidate.” It did not specify which candidate was targeted.",
      "The Moscow-based center, at the direction of the GRU, used generative AI tools to quickly create disinformation distributed across a network of websites that were designed to look like legitimate news outlets, the Treasury said.",
      "It accused the GRU of providing financial support to CGE and a network of US-based facilitators in order to build and maintain its AI-support server and maintain a network of at least 100 websites used in its disinformation operations.",
      "CGE’s director was also hit with sanctions in Tuesday’s action.",
      "An annual US threat assessment released in October 2024 said the United States sees a growing threat of Russia, Iran, and China attempting to influence the elections, including by using artificial intelligence to disseminate fake or divisive information.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "2024 us",
      "united states",
      "treasury said",
      "us presidential",
      "iran russia",
      "summary ai",
      "ai generated",
      "generated summarization",
      "summarization may",
      "may errors"
    ]
  },
  {
    "title": "China, Russia always moving forward 'hand in hand,' Xi tells Putin",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/asia-pacific/china-russia-new-year-greetings-2024/",
    "publishedAt": "2024-12-31T05:02:31Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "ALLIES.",
      "Russian President Vladimir Putin and Chinese President Xi Jinping speak during a plenary session in the outreach/BRICS Plus format at the BRICS summit in Kazan, Russia October 24, 2024.",
      "REUTERS/Maxim Shemetov/Pool BEIJING, China – Chinese President Xi Jinping said China and Russia have always moved forward “hand in hand” on the right path, the official Chinese news agency Xinhua said on Tuesday, December 31, months after the two countries struck a “new era strategic partnership” on key issues.",
      "The two leaders agreed in May to deepen bilateral ties and cooperate on areas of mutual interest such as Taiwan, Ukraine, and mutual rival the United States.",
      "Russia’s state-run RIA news agency also quoted Moscow’s ambassador to Beijing as saying last Friday that Xi will visit Russia in 2025.",
      "In an exchange of New Year greetings with Russian President Vladimir Putin, Xi lauded the mutual trust and strategic coordination between both countries and expressed his desire to maintain close ties with Putin.",
      "China-Russia cooperation in various fields will continue to lead to new development opportunities, Xi added.",
      "The Chinese president was received in the Kremlin as a “dear friend” in 2023 after he obtained an unprecedented third term in office.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "chinese president",
      "russian president",
      "president vladimir",
      "vladimir putin",
      "president xi",
      "xi jinping",
      "news agency",
      "summary ai",
      "ai generated",
      "generated summarization"
    ]
  },
  {
    "title": "The Russian billionaires whose chemical factories fuel Russia's war machine",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-billionaires-chemical-factories-fuel-war-machine/",
    "publishedAt": "2024-12-30T13:51:22Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "CHEMICAL PLANT.",
      "A satellite image shows the Sverdlov plant in Dzerzhinsk, Russia, on September 13, 2022.",
      "Open Source Centre/Handout via Reuters LONDON, United Kingdom – Chemicals factories founded or owned by some of Russia‘s wealthiest men are supplying ingredients to plants that manufacture explosives used by Moscow’s military during the war in Ukraine, an analysis of railway and financial data shows.",
      "Reuters identified five chemical companies, in which five Western-sanctioned billionaires hold stakes, that provided more than 75% of the key chemicals shipped by rail to some of Russia’s largest explosives factories from the start of the war until September this year, according to the railway data.",
      "The news agency’s analysis demonstrates for the first time how heavily factories forming part of Russia’s war machine rely on these men and their companies.",
      "The billionaires include Roman Abramovich, former owner of Chelsea Football Club, and Vagit Alekperov, who was ranked by Forbes in April as Russia’s richest man with a fortune estimated at $28.6 billion.",
      "Abramovich and Alekperov did not respond to requests for comment sent via their companies or lawyers.",
      "London-listed Evraz, in which Ambramovich holds a 28% stake, said it supplied the chemicals for “civilian use only.” Lukoil, a refiner in which Alekperov retains a shareholding, said it “does not manufacture explosives or any related components.” Anna Nagurney, a University of Massachusetts professor who closely studies supply chain networks related to the Ukraine-Russia war and reviewed Reuters’ findings, said the five companies were aiding Moscow not only by providing essential chemical ingredients for munitions but also by earning much-needed hard currency from exports of civilian products, including fertilizers.",
      "“These chemical companies may be operating as civilian ones, but they are sustaining the war effort,” Nagurney said.",
      "To determine from where Russia’s main munitions factories received their supplies, Reuters analyzed the movement of more than 600,000 rail shipments that carried the chemicals needed to make explosives from the invasion of Ukraine in February 2022 through September 2024.",
      "The railway data from two commercial databases in Russia was supplied to Reuters by the Open Source Centre, a British-based NGO devoted to collecting publicly-available intelligence and monitoring potential sanctions violations.",
      "It detailed the type of cargo in every railway wagon, the weight, origin and destination, and the names of the company that sent the goods and the company that received them.",
      "Reuters cross-checked the data from the two databases to confirm its accuracy.",
      "However, the news agency was unable to confirm whether the data included every rail shipment to the explosives factories, or the extent to which the plants received deliveries by road.",
      "The data showed that the billionaires’ companies supplied vital ingredients to five explosive and gunpowder factories in Russia that are subject to Western sanctions.",
      "The plants are subsidiaries of the giant Russian state arms manufacturer and automaker Rostec.",
      "Using leaked tax invoices covering parts of 2023, Reuters was also able to verify that four of the chemicals firms were suppliers to four of the explosives manufacturers.",
      "Neither the Kremlin, the defense ministry, nor Rostec responded to Reuters’ questions about civilian companies’ role in supplying Russia’s munitions industry.",
      "Before the war, all the explosives plants, as part of efforts to diversify, also used to make explosives or gunpowder for civilian use.",
      "Reuters could not determine whether such civilian sales continue and whether the chemicals supplied might be earmarked for civilian usage.",
      "Thomas Klapotke, a professor of energetics at the University of Munich, who helped Reuters analyze the data, said that, while all the raw materials had many potential uses, the combination of wagon-loads of specific chemicals needed for explosives manufacturing arriving at particular plants provided “red flags.” The analysis provides fresh evidence that the West’s strategy of imposing sanctions on Russia as punishment for its invasion of Ukraine has failed to curb its military production, according to several experts interviewed by Reuters.",
      "While the billionaires themselves are all under Western sanctions, the chemical companies involved have largely escaped major financial penalties or bans on their import of critical goods from the USA or the European Union.",
      "Most of the output of these chemical plants are civilian products like fertilizer that are critical to farming.",
      "Long-standing Western policies exempt food from sanctions to prevent famine and diplomatic blowback from developing nations.",
      "Peter Harrell, a former senior White House official who worked on Russia sanctions during the war’s first year and is now a scholar at the Carnegie Endowment for International Peace, said perhaps it’s time to review those 2022 decisions now that nations that once relied on Ukraine and Russia for wheat and fertilizer have had time to find alternative sources.",
      "“Potentially, the calculus would weigh towards imposing sanctions on these companies today,” Harrell said, commenting on Reuters’ findings.",
      "However, Manish N. Raizada, an agriculture professor at the University of Guelph in Canada, warned that imposing sanctions on Russian chemical companies could put hundreds of millions of small-scale farmers at risk, in return for a minor economic impact on Russia.",
      "Spokespersons for the US Treasury Department, which coordinates Washington’s sanctions, and the United Nations Development Program declined to comment on Reuters findings.",
      "A European Commission spokesperson, in response to questions about the chemicals companies, said: “We are actively exploring the possibilities for additional measures to step up pressure and close loopholes in a manner that would avoid negative implications for food security.” The spokesperson stressed that any action would only come after careful analysis of the effectiveness of any measures and their impact on European companies.",
      "However, he noted that EU sanctions would already apply to the companies, even if they were not specifically designated, if they were controlled or owned by a sanctioned individual.",
      "The war in Ukraine has become an artillery duel where a shortage of high explosives available to NATO and Ukraine has allowed Russian forces to gain swathes of territory this year, according to multiple Ukraine commanders interviewed by Reuters.",
      "Moscow is investing heavily in military production and seeking to replenish its munitions stockpiles.",
      "In 2024, Russia produced about 2.4 million artillery rounds and imported 3 million from North Korea, according to a Ukraine security official.",
      "The North Korean embassy in London didn’t return calls from Reuters seeking comment.",
      "The five munitions plants supplied by the billionaires’ companies include the massive Sverdlov facility in Dzerzhinsk.",
      "The plant is the only significant maker in Russia of the plastic explosives HMX and RDX used in artillery and missiles, according to a Ukrainian intelligence official.",
      "Two factories run by Eurochem — founded by Russian billionaire Andrey Melnichenko — supply chemicals to Sverdlov, according to the railway data.",
      "Eurochem is one of the world’s largest manufacturers of mineral fertilizers.",
      "Its Nevinnomysskiy Nitrogen plant in southwest Russia has sent at least 38,000 metric tons of acetic acid to Sverdlov during the Ukraine war, according to a Reuters analysis of the railway data.",
      "A second Eurochem facility, Novomoskovskiy Nitrogen sent nearly 5,000 metric tons of nitric acid to Sverdlov in the same period, the railway data showed.",
      "Both acetic acid and nitric acid are used to make HMX and RDX.",
      "According to Reuters calculations, based on scientific literature and reviewed by an explosives expert, 5,000 tons of nitric acid could be used to make 3,000 tons of RDX, enough to fill 500,000 large-caliber artillery shells.",
      "The tax invoices reviewed by Reuters confirmed that Eurochem was a supplier to Sverdlov last year.",
      "In response to detailed questions, Eurochem said Reuters’ reporting contained “numerous material factual errors.” Specifically, “EuroChem is not part of the defense sector of the Russian economy and none of our products are designed for military purposes,” read a statement from the company, which is headquartered in Switzerland.",
      "Eurochem said that any suggestion Melnichenko controlled the company was false.",
      "Melnichenko did not respond to questions.",
      "The billionaire, said by Forbes to be worth $17.5 billion, placed his controlling stake in Eurochem into a trust that benefits his wife, as Reuters has reported, after the imposition of sanctions on him by the EU and Nato following the invasion of Ukraine.",
      "The statement said that while 97% of its output is fertilizer, Eurochem supplies other industrial products, including these chemicals, to a wide number of clients in Russia and abroad.",
      "The company didn’t answer Reuters’ questions about the chemical shipments to Sverdlov.",
      "Questions sent to the email address on Sverdlov’s website went unanswered.",
      "Another fertilizer giant, Uralchem, founded by sanctioned billionaire Dmitry Mazepin, provided Sverdlov more than 27,000 metric tons of ammonium nitrate, the railway data showed.",
      "Ammonium nitrate is used to make HMX and RDX, and is also mixed with TNT to produce an explosive called Amatol.",
      "Uralchem also supplied 6,000 metric tons of nitric acid from its nitrogen fertilizer plant in Berezniki to Sverdlov, the data showed.",
      "Two other state-owned munitions plants, the Tambov Gunpowder Plant and Kazan Gunpowder Plant, received shipments of acids from Uralchem, the rail data showed.",
      "The leaked Russian tax invoices, reviewed by Reuters, also revealed that Uralchem supplied the Sverdlov, Tambov, and Kazan factories as well as the state-owned Perm Powder plant last year.",
      "Asked in detail about the shipments, Uralchem said the information was “incorrect.” It did not provide further details or explanation.",
      "Mazepin, who reduced his ownership of the company from 100% to 48% just after the invasion of Ukraine, couldn’t be reached for comment.",
      "The Tambov, Perm, and Kazan plants didn’t reply to questions sent to email addresses listed on their websites or on corporate filings.",
      "A steel plant in Siberia owned by London-listed Evraz supplied 5,000 metric tons of toluene — an ingredient for TNT — to the Biysk Oleum Plant, according to the rail data.",
      "Evraz was sanctioned in 2022 by the British government which said it supplied steel to the Russian military.",
      "In a statement, Evraz said it only supplied toluene for “civilian use only.” The Biysk Oleum plant, a unit of Sverdlov, didn’t respond to requests for comment.",
      "In April 2024, the government of Altai region, which includes the city of Biysk, listed the plant among manufacturers that “significantly increased” their 2023 production in fulfilment of state defense procurement contracts.",
      "Reuters identified two other billionaire-linked companies supplying chemicals to munitions factories.",
      "The Sredneuralsk Copper Smelting Plant (SUMZ) in the Ural mountains, founded by metals magnate Iskander Makhmudov, provides oleum — also known as fuming sulphuric acid — used in the Tambov, Kazan, and Perm powder plants.",
      "The Lukoil refinery in Perm provided 6,500 metric tons of toluene to the Perm powder plant, Kazan, and Biysk.",
      "Lukoil is part-owned by billionaire Alekperov, the company’s former president.",
      "Like others, he divested many shares in 2022 but retained an 8.55% stake.",
      "The tax invoices reviewed by Reuters showed that the Lukoil plant was a supplier to the Perm powder plant last year.",
      "They also document shipments from SUMZ to the Kazan and Perm plants.",
      "In a statement, Lukoil said its Perm refinery “does not manufacture explosives or any related components” and that questions from Reuters about shipments from there contained “absurd speculations.” SUMZ did not respond to detailed questions.",
      "Its parent company, UMMC, which is under sanctions by the US and Britain, did not respond to a request for comment.",
      "Makhmudov, who divested his controlling stake in 2022, according to Forbes, also couldn’t be reached for comment.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "railway data",
      "metric tons",
      "data showed",
      "chemical companies",
      "reviewed reuters",
      "invasion ukraine",
      "tax invoices",
      "used make",
      "nitric acid",
      "perm powder"
    ]
  },
  {
    "title": "Crashed jetliner was shot down by Russia unintentionally",
    "source": "SunStar Philippines",
    "url": "https://www.sunstar.com.ph/network/azerbaijans-president-says-crashed-jetliner-was-shot-down-by-russia-unintentionally",
    "publishedAt": "2024-12-30T00:53:11Z",
    "sentences": [
      "Azerbaijan’s President Ilham Aliyev said Sunday that the Azerbaijani airliner that crashed last week was shot down by Russia, albeit unintentionally, and criticized Moscow for trying to “hush up” the issue for days.",
      "Related story: Plane crash in Kazakhstan kills 38 \"We can say with complete clarity that the plane was shot down by Russia.",
      "(...) We are not saying that it was done intentionally, but it was done,” he told Azerbaijani state television.",
      "Aliyev said that the airliner, which crashed Wednesday in Kazakhstan, was hit by fire from the ground over Russia and “rendered uncontrollable by electronic warfare.\"",
      "Aliyev accused Russia of trying to “hush up” the issue for several days, saying he was “upset and surprised” by versions of events put forward by Russian officials.",
      "“Unfortunately, for the first three days we heard nothing from Russia except delirious versions,” he said.",
      "The crash killed 38 of 67 people on board.",
      "The Kremlin said that air defense systems were firing near Grozny, the regional capital of the Russian republic of Chechnya, where the plane attempted to land, to deflect a Ukrainian drone strike.",
      "Aliyev said Azerbaijan made three demands to Russia in connection with the crash.",
      "“First, the Russian side must apologize to Azerbaijan.",
      "Second, it must admit its guilt.",
      "Third, punish the guilty, bring them to criminal responsibility and pay compensation to the Azerbaijani state, the injured passengers and crew members,” he said.",
      "Aliyev noted that the first demand was “already fulfilled” when Russian President Vladimir Putin apologized to him on Saturday.",
      "Putin called the crash a “tragic incident\" though stopped short of acknowledging Moscow’s responsibility.",
      "He said that an investigation into the crash was ongoing, and that “the final version (of events) will be known after the black boxes are opened.” He noted that Azerbaijan was always “in favor of a group of international experts” investigating the crash, and had “categorically refused” Russia’s suggestion that the Interstate Aviation Committee, which oversees civil aviation in the Commonwealth of Independent States, investigate it.",
      "“It is no secret that this organization consists mostly of Russian officials and is headed by Russian citizens.",
      "The factors of objectivity could not be fully ensured here,” Aliyev said.",
      "Kremlin spokesman Dmitry Peskov told Russian state media on Sunday that Putin had spoken to Aliyev over the phone again, but did not provide details of the conversation.",
      "The Kremlin also said a joint investigation by Russia, Azerbaijan and Kazakhstan was underway at the crash site near the city of Aktau in Kazakhstan.",
      "The plane was flying from Azerbaijan’s capital, Baku, to Grozny when it turned toward Kazakhstan, hundreds of kilometers (miles) across the Caspian Sea from its intended destination, and crashed while making an attempt to land.",
      "Passengers and crew who survived the crash told Azerbaijani media that they heard loud noises on the aircraft as it was circling over Grozny.",
      "Dmitry Yadrov, head of Russia’s civil aviation authority Rosaviatsia, said Friday that as the plane was preparing to land in Grozny in deep fog, Ukrainian drones were targeting the city, prompting authorities to close the area to air traffic.",
      "The crash is the second deadly civil aviation accident linked to fighting in Ukraine.",
      "Malaysia Airlines Flight 17 was downed with a Russian surface-to-air missile, killing all 298 people aboard, as it flew over the area in eastern Ukraine controlled by Moscow-backed separatists in 2014.",
      "Russia has denied responsibility, but a Dutch court in 2022 convicted two Russians and a pro-Russia Ukrainian man for their role in downing the plane with an air defense system brought into Ukraine from a Russian military base.",
      "(AP)"
    ],
    "topics": [
      "aliyev said",
      "civil aviation",
      "airliner crashed",
      "shot russia",
      "trying hush",
      "hush issue",
      "told azerbaijani",
      "azerbaijani state",
      "russian officials",
      "air defense"
    ]
  },
  {
    "title": "Azerbaijan's president says crashed plane was shot at from Russia",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/azerbaijan-president-says-crashed-plane-shot-from-russia/",
    "publishedAt": "2024-12-29T13:10:54Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "PLANE CRASH.",
      "Azerbaijan's President Ilham Aliyev attends an interview with Azerbaijan Television at Heydar Aliyev International Airport outside Baku, Azerbaijan, on December 29, 2024.",
      "Official website of the President of the Republic of Azerbaijan/ Handout via REUTERS Azerbaijani President Ilham Aliyev said on Sunday, December 29, that a passenger plane that crashed last week, killing 38 people, had been damaged by shooting from the ground in Russia, and he said some in Russia had lied about the cause of the disaster.",
      "President Vladimir Putin on Saturday, December 28, apologized to Aliyev for Wednesday’s, December 25, “tragic incident” in Russian airspace involving the plane after Russian air defenses engaged Ukrainian attack drones.",
      "A Kremlin statement did not say Russia had shot down the plane, only noting a criminal case had been opened.",
      "“Our plane was shot down by accident,” Aliyev told state television on Sunday, adding that the plane had come under some sort of electronic jamming and had then been shot at while it was approaching the southern Russian city of Grozny.",
      "“Unfortunately, in the first three days we heard only absurd versions from Russia,” Aliyev said, citing statements in Russia that attributed the crash to birds or the explosion of some sort of gas cylinder.",
      "“We witnessed clear attempts to cover up the matter,” said the Azerbaijani leader, who has close ties to Russia and was educated at one of Moscow’s top universities.",
      "Aliyev said he wanted Russia to accept it was guilty of downing the plane and punish those responsible for fatally damaging the aircraft.",
      "Putin and Aliyev held another telephone call on Sunday, the Kremlin said.",
      "It gave no details but on Saturday it said that both civilian and military specialists were being questioned about what had taken place.",
      "The chief of Russia’s Investigative Committee, Alexander Bastrykin, on a phone call assured Azerbaijan’s Prosecutor General that Moscow had assigned the investigation to the most experienced experts and that actions were being taken to establish the cause and circumstances of the incident.",
      "The plane crashed on Wednesday, December 25, near the city of Aktau in Kazakhstan after diverting from southern Russia where Ukrainian drones were attacking several cities at the time, according to the Kremlin.",
      "The extremely rare publicized apology from Putin on Saturday, December 28, is the closest Moscow has come to accepting some blame for the disaster.",
      "Four sources with knowledge of the preliminary findings of Azerbaijan’s investigation into the disaster told Reuters on Thursday, December 26, that Russian air defenses had mistakenly shot it down.",
      "Aliyev’s remarks came as Azerbaijan paid tribute to the pilots and passengers of the plane.",
      "Captain Igor Kshnyakin and co-pilot Alexander Kalyaninov, both ethnic Russians with Azerbaijan citizenship, and Hokuma Aliyeva, a flight attendant, were given full honors at a ceremony at the Alley of Honour in central Baku attended by Aliyev and his wife, Mehriban.",
      "“The pilots were experienced and knew they would not survive this crash landing,” Aliyev said, praising them for sacrificing themselves by putting the nose down first in an attempt to save some of the passengers.",
      "“In order to save the passengers, they acted with great heroism and as a result of this there were survivors,” he said.",
      "Aliyev awarded the crew posthumously with the titles of National Hero of Azerbaijan.",
      "Kazakhstan’s President Kassym-Jomart Tokayev also awarded citizens who helped rescue the survivors, including emergency workers, medics, police and employees at the airport and a local power company.",
      "The Embraer passenger jet had flown from Azerbaijan’s capital Baku to Grozny, in Russia’s southern Chechnya region, before veering off hundreds of miles across the Caspian Sea.",
      "Azerbaijan’s presidential office said that after the yet-to-be explained incident over Russian airspace, the pilots battled to control the plane — desperately trying to find a landing spot.",
      "With holes in the fuselage, some crew injured, passengers praying for their lives in a de-pressurized cabin and the plane spiralling out of control, the pilots flew across the Caspian Sea towards their death in a crash landing.",
      "The Alley of Honour is Azerbaijan’s most sacred modern burial ground — where prominent politicians, poets and scientists are laid to rest, including Heydar Aliyev, the late father of the current president.",
      "Captain Kshnyakin’s daughter, Anastasia Kshnyakina, said her father was a dedicated pilot who took his responsibilities to his passengers extremely seriously.",
      "“My father always said: when I take off, I am responsible not only for my life, but also for the lives of all passengers and crew members,” Kshnyakina said.",
      "“With his last flight, he proved what a true hero should be.” – Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "aliyev said",
      "president ilham",
      "ilham aliyev",
      "heydar aliyev",
      "december 29",
      "plane crashed",
      "putin saturday",
      "saturday december",
      "december 28",
      "wednesday december"
    ]
  },
  {
    "title": "Azerbaijan accuses Russia of trying to hide causes of plane crash",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/world-news/314541202/azerbaijan-accuses-russia-of-trying-to-hide-causes-of-plane-crash.html",
    "publishedAt": "2024-12-29T12:39:05Z",
    "sentences": [
      "Baku, Azerbaijan—Azerbaijan’s president Ilham Aliyev on Sunday said the Azerbaijan Airlines jet that crashed this week was shot at from Russia and called for Moscow to admit “guilt” in the disaster.",
      "He said the jet which crashed this week, killing 38 of the 67 people onboard, was hit “by accident” by Russia.",
      "On Saturday, Russian President Vladimir Putin apologized over the crash, but stopped short of accepting that it might have been hit by Russian fire.",
      "“The facts are that the Azerbaijani civilian plane was damaged from the outside over Russian territory, near the city of Grozny, and almost lost control,” Aliyev said in televised comments, according to state news agency, Azertag.",
      "“We also know that electronic warfare systems put our plane out of control,” he said, adding that “at the same time, as a result of fire from the ground, the tail of the plane was also severely damaged.” He said Baku regretted that Moscow “put forward theories” that “clearly showed the Russian side wanted to cover” up the issue.",
      "“Of course, our plane was hit by accident.",
      "Of course, there can be no talk of a deliberate act of terror here,” Aliyev said.",
      "“Therefore, admitting the guilt, apologizing in a timely manner to Azerbaijan, which is considered a friendly country, and informing the public about this—all these were measures and steps that should have been taken,” he said.",
      "Moscow had earlier said that Grozny, where the plane was due to land but instead crashed in western Kazakhstan, was attacked by Ukrainian drones that day.",
      "Speculation has swirled for days that Russia accidentally shot down the plane, with the United States weighing in Friday saying it had “early indications” the plane was shot.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "jet crashed",
      "crashed week",
      "hit accident",
      "aliyev said",
      "baku president",
      "president ilham",
      "ilham aliyev",
      "aliyev sunday",
      "sunday said",
      "said azerbaijan"
    ]
  },
  {
    "title": "Russia's Putin apologizes to Azerbaijan over 'tragic' airliner crash",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/vladimir-putin-apologizes-azerbaijan-president-plane-incident-russian-airspace/",
    "publishedAt": "2024-12-28T13:43:12Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "PUTIN.",
      "Russian President Vladimir Putin chairs a meeting with members of the Security Council via video link in Moscow, Russia, on December 28, 2024.",
      "Kremlin via Reuters MOSCOW, Russia – Russian President Vladimir Putin on Saturday, December 28, apologized to Azerbaijan‘s leader for what the Kremlin called a “tragic incident” over Russia in which an Azerbaijan Airlines plane crashed after Russian air defenses were fired against Ukrainian drones.",
      "The extremely rare publicized apology from Putin was the closest Moscow had come to accepting some blame for Wednesday’s disaster, although the Kremlin statement did not say Russia had shot down the plane, only noting that a criminal case had been opened.",
      "Flight J2-8243, en route from Baku to the Chechen capital Grozny, crash-landed on Wednesday, December 25, near Aktau in Kazakhstan after diverting from southern Russia, where Ukrainian drones were reported to be attacking several cities.",
      "At least 38 people were killed.",
      "Four sources with knowledge of the preliminary findings of Azerbaijan’s investigation told Reuters on Thursday, December 26, that Russian air defenses had mistakenly shot it down.",
      "Passengers said they heard a loud bang outside the plane.",
      "Putin called President Ilham Aliyev and “apologized for the tragic incident that occurred in Russian airspace and once again expressed his deep and sincere condolences to the families of the victims and wished a speedy recovery to the injured,” the Kremlin said.",
      "“At that time, Grozny, Mozdok, and Vladikavkaz were being attacked by Ukrainian unmanned aerial vehicles, and Russian air defense systems repelled these attacks.” The Kremlin said “civilian and military specialists” were being questioned.",
      "Putin also phoned Kassym-Jomart Tokayev, his counterpart in Kazakhstan, to express his condolences over the loss of life in the crash, the Kremlin said.",
      "On Saturday, US President Joe Biden responded to a shouted question about whether Putin should take responsibility for the crash while he was leaving church in St. Croix in the US Virgin Islands, where he is on vacation.",
      "“Apparently he did, but I haven’t spoken to him or my team,” Biden replied.",
      "The White House said on Friday it had seen early indications suggesting the airliner was possibly brought down by Russian air defense systems and added that Washington had offered assistance to the investigation into the crash.",
      "MSNBC on Friday cited two unidentified US military sources as saying that there was American intelligence that Russia may have mistakenly shot down the airliner after misidentifying it as an incoming drone.",
      "Ukrainian President Volodymyr Zelenskiy also said he had called Aliyev to offer condolences, and in his statement on the X platform demanded that Russia provide “clear explanations.” Azerbaijan for its part said Aliyev had noted to Putin that the plane had been “subjected to external physical and technical interference in Russian airspace, resulting in a complete loss of control and redirection to the Kazakh city of Aktau.” Until Saturday, Russia’s last working day before a long New Year holiday, the Kremlin had said it was improper to comment on the incident before official investigations were concluded.",
      "The Embraer jet had flown from Azerbaijan’s capital Baku to Grozny, in Russia’s southern Chechnya region, where the incident occurred, and then travelled, badly damaged, another 280 miles (450 km) across the Caspian Sea.",
      "Footage shot by passengers before the plane crashed showed oxygen masks down and people wearing life jackets.",
      "Later videos showed bloodied and bruised passengers climbing out of the wreckage.",
      "There were 29 survivors.",
      "Baku cited injuries from objects that had penetrated the aircraft’s fuselage from outside and testimonies from survivors as evidence of “external physical and technical interference”.",
      "The crash underscored the risks to civil aviation even when aircraft are flying hundreds of miles from a war zone, especially when Ukraine has deployed drones en masse to try to hit back at Russia behind the front lines.",
      "Russia uses electronic jamming to confuse the geolocation and communication systems of Ukrainian drones, which it also targets with air defence systems.",
      "In 2020, Iranian Revolutionary Guards mistakenly shot down a Ukrainian airliner, killing all 176 on board.",
      "And in 2014, Malaysian Airlines Flight MH17 was shot down over eastern Ukraine, with the loss of 298 passengers and crew, by what Dutch investigators said was a Russian BUK missile system.",
      "Russia denied involvement.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "russian air",
      "kremlin said",
      "ukrainian drones",
      "mistakenly shot",
      "russian president",
      "president vladimir",
      "vladimir putin",
      "moscow russia",
      "december 28",
      "tragic incident"
    ]
  },
  {
    "title": "Japan's Cabinet OKs record $55-B defense budget",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2024/12/28/world/asia-oceania/japans-cabinet-oks-record-55-b-defense-budget/2027906",
    "publishedAt": "2024-12-27T16:11:00Z",
    "sentences": [
      "TOKYO — Japan's Cabinet approved on Friday a record 8.7-trillion-yen ($55-billion) defense budget for 2025 as the country accelerates building up its strike-back capability and starts deploying Tomahawks to fortify itself against growing threats from China, North Korea and Russia.",
      "The Cabinet-endorsed draft defense budget marks the third year of Japan's ongoing five-year military buildup under the national security strategy it adopted in 2022.",
      "The defense spending is part of the more than 115-trillion-yen ($730 billion) national budget bill — also a record — that requires parliamentary approval by March to be enacted.",
      "Ad-free access"
    ],
    "topics": [
      "defense budget",
      "tokyo japan",
      "japan cabinet",
      "cabinet approved",
      "approved friday",
      "friday record",
      "record defense",
      "budget 2025",
      "2025 country",
      "country accelerates"
    ]
  },
  {
    "title": "Japan's Cabinet OKs record $55-B defense budg",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2024/12/28/world/asia-oceania/japans-cabinet-oks-record-55-b-defense-budg/2027906",
    "publishedAt": "2024-12-27T16:11:00Z",
    "sentences": [
      "TOKYO — Japan's Cabinet approved on Friday a record 8.7-trillion-yen ($55-billion) defense budget for 2025 as the country accelerates building up its strike-back capability and starts deploying Tomahawks to fortify itself against growing threats from China, North Korea and Russia.",
      "The Cabinet-endorsed draft defense budget marks the third year of Japan's ongoing five-year military buildup under the national security strategy it adopted in 2022.",
      "The defense spending is part of the more than 115-trillion-yen ($730 billion) national budget bill — also a record — that requires parliamentary approval by March to be enacted.",
      "Ad-free access"
    ],
    "topics": [
      "defense budget",
      "tokyo japan",
      "japan cabinet",
      "cabinet approved",
      "approved friday",
      "friday record",
      "record defense",
      "budget 2025",
      "2025 country",
      "country accelerates"
    ]
  },
  {
    "title": "NKorean soldier in Ukraine war captured, later dies",
    "source": "The Manila Times",
    "url": "https://www.manilatimes.net/2024/12/28/world/asia-oceania/nkorean-soldier-in-ukraine-war-captured-later-dies/2027909",
    "publishedAt": "2024-12-27T16:11:00Z",
    "sentences": [
      "SEOUL — A North Korean soldier who was captured while fighting in Russia's war on Ukraine died of his wounds, South Korea's spy agency said on Friday.",
      "Pyongyang has deployed thousands of troops to reinforce Russia's military, including in the Kursk border region, where Ukraine mounted a shock border incursion in August.",
      "Ad-free access"
    ],
    "topics": [
      "seoul north",
      "north korean",
      "korean soldier",
      "soldier captured",
      "captured fighting",
      "fighting russia",
      "russia war",
      "war ukraine",
      "ukraine died",
      "died wounds"
    ]
  },
  {
    "title": "FACT CHECK: No statement from Putin backing calls for Mindanao secession",
    "source": "Rappler",
    "url": "https://www.rappler.com/newsbreak/fact-check/russia-no-statement-vladimir-putin-backs-calls-mindanao-secession/",
    "publishedAt": "2024-12-20T10:58:14Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "Claim: Russian President Vladimir Putin supports calls for an independent Mindanao.",
      "Why we fact-checked this: The TikTok video containing the claim has 1.2 million views, 92,700 likes, 2,123 shares, and 12,600 comments as of writing.",
      "Text in the video states: “Ready na ba [kayo] taga Mindanao na magiging independent country na [tayo]?",
      "The most supporter [sic] president in Russia, Putin to be independent country in Mindanao.” (Are you ready, people of Mindanao, for us to become an independent country?",
      "Putin, the president of Russia, is the biggest supporter of Mindanao becoming an independent country.)",
      "Some social media users seem to believe the video, posting comments like “Yes to the Republic of Mindanao!” and “Yes to Mindanao’s independence!” The facts: No documented evidence, official government statement, or credible news report shows that Putin has expressed support for Mindanao becoming an independent country.",
      "The TikTok post merely shows a photo of Putin and Philippine Vice President Sara Duterte with the superimposed text but provides no evidence or reliable sources to back up this claim.",
      "Russia’s stance: According to analysts, Russia selectively supports separatist movements and ultra-nationalist parties to promote its geopolitical interests.",
      "In 2022, Putin recognized the two Russian-backed separatist regions of eastern Ukraine as independent entities, with analysts saying this move could be used as a pretext for war.",
      "Russia has since invaded Ukraine, with the ongoing crisis considered as the biggest attack by one state against another in Europe since World War Two.",
      "Secession calls: In February 2024, former president Rodrigo Duterte called for Mindanao’s independence after accusing the Marcos administration of being behind the so-called people’s initiative to amend the 1987 Constitution and perpetuate the Marcos family in power.",
      "The former president later walked back his remarks after Mindanao leaders and President Ferdinand Marcos Jr. opposed the secession calls, citing concerns over national stability.",
      "Duterte-Marcos rift: The misleading video surfaced amid rising tensions between the Marcoses and Dutertes.",
      "After forming an alliance to secure electoral victories in 2022, the relationship between the country’s top officials has since deteriorated.",
      "Duterte, who resigned from Marcos’ Cabinet in June 2024, has since criticized his administration for its handling of national issues.",
      "The Vice President now faces three impeachment complaints accusing her of financial mismanagement and betrayal of public trust.",
      "This follows congressional inquiries into her use of confidential funds and her assassination threat against Marcos.",
      "False claims: Amid the controversy surrounding the Vice President, several posts on social media have circulated alleging shows of support for her.",
      "Rappler has recently debunked a claim that North Korea had expressed support for Duterte.",
      "Other posts misrepresented mass gatherings and public events as pro-Duterte protests: – Marjuice Destinado/Rappler.com Marjuice Destinado is a Rappler intern.",
      "She is a third-year political science student at Cebu Normal University (CNU), serving as feature editor of Ang Suga, CNU’s official student publication.",
      "Keep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com.",
      "Let us battle disinformation one Fact Check at a time.",
      "There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "independent country",
      "vice president",
      "president russia",
      "mindanao becoming",
      "becoming independent",
      "social media",
      "mindanao independence",
      "expressed support",
      "secession calls",
      "former president"
    ]
  },
  {
    "title": "Putin says Russia is ready to compromise with Trump on Ukraine war",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/putin-says-russia-ready-compromise-with-trump-ukraine-war/",
    "publishedAt": "2024-12-19T15:37:23Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "PUTIN.",
      "Russian President Vladimir Putin speaks during his annual televised year-end press conference and phone-in held in Moscow, Russia December 19, 2024.",
      "Sputnik/Gavriil Grigorov/Pool via REUTERS MOSCOW, Russia – Russian President Vladimir Putin said on Thursday, December 19 that he was ready to compromise over Ukraine in possible talks with US President-elect Donald Trump on ending the war and had no conditions for starting talks with the Ukrainian authorities.",
      "Trump, a self-styled master of brokering agreements and author of the 1987 book Trump: the Art of the Deal, has vowed to swiftly end the conflict, but has not yet given any details on how he might achieve that.",
      "Putin, fielding questions on state TV during his annual question and answer session with Russians, told a reporter for a US news channel that he was ready to meet Trump, whom he said he had not spoken to for years.",
      "Asked what he might be able to offer Trump, Putin dismissed an assertion that Russia was in a weak position, saying that Russia had got much stronger since he ordered troops into Ukraine in 2022.",
      "“We have always said that we are ready for negotiations and compromises,” Putin said, after saying that Russian forces, advancing across the entire front, were moving towards achieving their primary goals in Ukraine.",
      "“Soon, those Ukrainians who want to fight will run out, in my opinion, soon there will be no one left who wants to fight.",
      "We are ready, but the other side needs to be ready for both negotiations and compromises.” Reuters reported last month that Putin was open to discussing a Ukraine ceasefire deal with Trump, but ruled out making any major territorial concessions and insisted Kyiv abandon its ambitions to join NATO.",
      "Putin said on Thursday that Russia had no conditions to start talks with Ukraine and was ready to negotiate with anyone, including President Volodymyr Zelenskiy.",
      "But he said any deal could only be signed with Ukraine’s legitimate authorities, which for now the Kremlin considered to be only the Ukrainian parliament.",
      "Zelenskiy, whose term has technically expired but who has delayed an election because of the war, would need to be re-elected for Moscow to consider him a legitimate signatory to any deal to ensure it was legally watertight, said Putin.",
      "Putin dismissed the idea of agreeing a temporary truce with Kyiv, saying only a long-lasting peace deal with Ukraine would suffice.",
      "Any talks should take as their starting point a preliminary agreement reached between Russian and Ukrainian negotiators in the early weeks of the war at talks in Istanbul, which was never implemented, he added.",
      "Some Ukrainian politicians regard that draft deal as akin to a capitulation which would have neutered Ukraine’s military and political ambitions.",
      "Russia’s 2022 invasion of Ukraine has left tens of thousands of dead, displaced millions and triggered the biggest crisis in relations between Moscow and the West since the 1962 Cuban Missile Crisis.",
      "Russia, which casts the conflict as a defensive special military operation designed to stop dangerous NATO expansion to the east, controls around a fifth of Ukraine and has taken several thousand square kilometres of territory this year.",
      "Determined to incorporate four Ukrainian regions into Russia, Moscow’s forces have taken village after village in the east and are now threatening strategically important cities such as Pokrovsk, a major road and rail hub.",
      "Putin said the fighting was complex, so it was “difficult and pointless to guess what lies ahead… (but) we are moving, as you said, towards solving our primary tasks, which we outlined at the beginning of the special military operation.” Discussing the continued presence of Ukrainian forces in Russia’s Kursk region, Putin said Kyiv’s troops would be forced out, but declined to say exactly when that would happen.",
      "The war has transformed the Russian economy and Putin said it was showing signs of overheating which was stoking worryingly high inflation.",
      "But he said growth was higher than many other economies such as Britain.",
      "Asked if he’d do anything differently, he said he should have sent troops into Ukraine sooner than 2022 and that Russia should have been better prepared for the conflict.",
      "Asked by a BBC reporter if he’d looked after Russia, something that Boris Yeltsin had asked him to do before handing over the presidency at the end of 1999, Putin said he had.",
      "“We have moved back from the edge of the abyss,” Putin said.",
      "“I have done everything to ensure that Russia is an independent and sovereign power that is able to make decisions in its own interests.” Russia, Putin said, had made proposals to Syria’s new rulers about Russia’s military bases there and most people that Moscow had spoken to on the issue favoured them staying.",
      "Russia would need to think about whether the bases should remain or not, he added, but rumors about the death of Russian influence in the Middle East were exaggerated.",
      "Putin touted what he said was the invincibility of the “Oreshnik” hypersonic missile that Russia has already test-fired at a Ukrainian military factory, saying he was ready to organise another launch at Ukraine and see if Western air defence systems could shoot it down.",
      "In Brussels, Zelenskiy addressed Putin’s missile suggestion during a press conference at a European Council meeting, remarking of Putin: “Do you think he is a sane person?” – Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "putin said",
      "russian president",
      "president vladimir",
      "vladimir putin",
      "press conference",
      "moscow russia",
      "december 19",
      "said thursday",
      "putin dismissed",
      "troops ukraine"
    ]
  },
  {
    "title": "Russia detains suspect in general’s slay, say probers",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314537599/russia-detains-suspect-in-generals-slay-say-probers.html",
    "publishedAt": "2024-12-18T12:30:00Z",
    "sentences": [
      "MOSCOW – Russia has detained a suspect in the killing of the head of the army’s chemical weapons division, investigators said Wednesday, a day after the general and his aide were killed by a blast in Moscow.",
      "“A national of Uzbekistan, born in 1995, was arrested on suspicion of having committed the attack that cost the life of the commander of Russian radiological, chemical and biological defence forces, Igor Kirillov, and his assistant, Ilya Polikarpov”, the Investigative Committee said in a statement.",
      "The man said he had been “recruited by Ukrainian special forces,” it added.",
      "Kirillov and his assistant were killed on Tuesday as they walked out of a Moscow apartment building early in the morning, after an explosive device attached to a scooter went off.",
      "The statement said that the suspect told interrogators that he had come to Moscow to carry out the attack and that a camera mounted on the dashboard of a rented car parked outside the building had filmed the attack and streamed it “live to the attack organizers, in the (Ukrainian) city of Dnipro”.",
      "The man was promised $100,000 to carry out the attack, as well as the possibility to settle “in a European country”, the statement said.",
      "Kirillov was the most senior military figure assassinated in Russia since Kremlin sent troops into Ukraine nearly three years ago.",
      "The blast went off in a residential area in southeast Moscow a day after President Vladimir Putin hailed Russian troop successes in Ukraine.",
      "Kirillov, 54, was the head of the Russian army’s chemical, biological and radiological weapons unit and was recently sanctioned by Britain over the alleged use of chemical weapons in Ukraine.",
      "A source in Ukraine’s SBU security service told AFP on Tuesday that it was behind the early morning explosion in what it called a “special operation”, calling Kirillov a “war criminal”.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "army chemical",
      "chemical weapons",
      "chemical biological",
      "kirillov assistant",
      "early morning",
      "statement said",
      "carry attack",
      "moscow russia",
      "russia detained",
      "detained suspect"
    ]
  },
  {
    "title": "Trump vows to speak to Zelenskyy, Putin",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314537162/trump-vows-to-speak-to-zelenskyy-putin.html",
    "publishedAt": "2024-12-17T12:45:00Z",
    "sentences": [
      "WASHINGTON, DC—Donald Trump said Monday that he would speak to Ukraine’s Volodymyr Zelenskyy and Russia’s Vladimir Putin to end the “carnage” of almost three years of war, as the Kremlin leader lauded Russian army successes on the ground.",
      "Both sides have rushed to gain an advantage on the battlefield ahead of Trump entering the White House in January, and there has been some alarm in Ukraine that it will be forced to make territorial concessions in exchange for peace.",
      "Trump has been highly critical of billions of dollars of aid that Joe Biden’s administration provided to Kyiv to battle Moscow’s invasion.",
      "He spoke Monday at his Mar-a-Lago resort in Florida as Putin hailed his army’s accelerating advance in Ukraine in what he called a “landmark” year.",
      "“We’ll be talking to President Putin, and we’ll be talking to the representatives, Zelenskyy and representatives from Ukraine,” Trump said.",
      "“We gotta stop it, it’s carnage,” he added, referring to the war.",
      "Trump has repeatedly claimed he could swiftly end the conflict but has not provided concrete details on how.",
      "His comments Monday come after he called for an “immediate ceasefire” earlier this month and said “negotiations should begin.” Trump met Zelenskyy in a meeting hosted by French leader Emmanuel Macron in Paris this month, after which the Ukrainian leader said he had argued that Kyiv is seeking an “enduring” peace and “security guarantees.” Poland, Ukraine’s ally and neighbour, urged Monday that Kyiv should not be “forced” into peace talks, with its Foreign Minister Radoslaw Sikorski saying that it was “the aggressor and not the victim should be encouraged and forced” to do so.",
      "AFP Ukraine is entering another winter of war as its energy grid is already badly damaged by Russian attacks and Trump spoke as Russian forces were almost at the gates of the key eastern city of Pokrovsk.",
      "Addressing top military generals in an end-of-year meeting on Monday, Putin struck a defiant and optimistic tone, claiming his troops had the upper hand across the entire front line.",
      "The comments come with Russia’s army advancing across eastern Ukraine at their fastest pace since the first weeks of the offensive.",
      "“Russian troops are firmly holding the strategic initiative along the entire line of contact,” Putin said.",
      "He said Russia’s army had seized 189 Ukrainian settlements this year and called 2024 a “landmark year in the achievement of the goals of the special military operation”, using Moscow’s official language for its campaign.",
      "Speaking after Putin at the same meeting, Russian Defense Minister Andrei Belousov said Russia’s troops had seized a total of almost 4,500 square kilometers of Ukrainian territory in this year and were now gaining around 30 square kilometers a day.",
      "Russia’s army said Monday that it had captured another small village in the Donetsk region as part of its latest advance.",
      "AFP analysis of Institute for the Study of War data found that in November Russian troops advanced at their fastest pace since March 2022 — the first full month of the offensive.",
      "AFP © All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "russia army",
      "trump said",
      "said monday",
      "landmark year",
      "fastest pace",
      "pace since",
      "russian troops",
      "said russia",
      "square kilometers",
      "washington trump"
    ]
  },
  {
    "title": "Ukraine kills top Russian general in Moscow it accuses of chemical weapons crimes",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/ukraine-kills-russian-general-igor-kirillov/",
    "publishedAt": "2024-12-17T09:52:21Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "IGOR KIRILLOV.",
      "Lieutenant General Igor Kirillov, chief of Russia's Nuclear, Biological and Chemical Protection Troops, attends a press conference in Moscow, Russia, in this still image from video released November 5, 2024.",
      "Russian Defense Ministry/Handout via Reuters MOSCOW, Russia – A top Russian general accused by Ukraine of being responsible for the use of chemical weapons against Ukrainian troops was assassinated in Moscow by Ukraine’s SBU intelligence service on Tuesday morning, December 17, in the most high-profile killing of its kind.",
      "Lieutenant General Igor Kirillov, who was chief of Russia’s Nuclear, Biological and Chemical Protection Troops, was killed outside an apartment building along with his assistant when a bomb hidden in an electric scooter went off, Russia’s Investigative Committee, which probes serious crimes, said.",
      "An SBU source confirmed to Reuters that the Ukrainian intelligence agency had been behind the hit.",
      "“The liquidation of the chief of the radiation and chemical protection troops of the Russian Federation is the work of the SBU,” the source said.",
      "The source said that a scooter containing explosives was detonated, killing both Kirillov and his aide, as they stepped into the entrance of a house on Ryazansky Prospekt in Moscow.",
      "Kirillov, 54, is the most senior Russian military officer to be assassinated inside Russia by Ukraine and his murder is likely to prompt the Russian authorities to review security protocols for the army’s top brass and to find a way to avenge his killing.",
      "Former president Dmitry Medvedev, now a senior Russian security official, was cited by the state RIA news agency as saying that Ukraine’s military and political leadership now faced imminent revenge for Kirillov’s murder.",
      "Moscow holds Ukraine responsible for a string of high-profile assassinations on its soil designed to weaken morale and punish those Kyiv regards guilty of war crimes.",
      "Ukraine, which says Russia’s war against it poses an existential threat to the Ukrainian state, has made clear it regards such targeted killings as a legitimate tool.",
      "Reuters photographs and video from the scene showed a shattered entrance to an apartment building with bomb-blackened bricks and the doors hanging off their hinges and what looked like two bodies lying beneath black plastic sheets on the snow.",
      "Investigators said they had opened a criminal case into the murder of two servicemen.",
      "Law enforcement sources told Russian media a terrorism case was likely to be opened.",
      "Russia denies Ukrainian allegations it uses chemical weapons on the battlefield and Kirillov, who was married with two sons, was himself sometimes shown on state TV giving briefings at the Defence Ministry in which he accused Ukraine of violating nuclear safety protocols or the West of various alleged crimes.",
      "Maria Zakharova, a spokeswoman for Russia’s Foreign Ministry, paid tribute to Kirillov, saying he had worked “fearlessly” for “the Motherland” to expose what she said were the West’s chemical weapons-related and other crimes and what Moscow says were cover-ups in Syria and elsewhere.",
      "Britain in October imposed sanctions on Kirillov and his nuclear defence forces for using riot control agents and over multiple reports of the use of the toxic choking agent chloropicrin on the battlefield.",
      "Such agents, Ukraine has alleged, are used to disorientate its troops leaving them unable to defend themselves against Russian attacks.",
      "Kirillov was murdered a day after Ukrainian state prosecutors were reported to have charged him in absentia with the alleged use of banned chemical weapons, the Kyiv Independent cited the SBU as saying at the time.",
      "The Lieutenant General was also listed in a sprawling unofficial Ukrainian database of people considered to be enemies of the country called Myrotvorets (Peacemaker).",
      "A photograph of Kirillov on the website was overwritten with the word “Liquidated” in red letters on Tuesday morning.",
      "Russia says Ukraine has carried out a string of targeted assassinations on its soil since the start of Moscow’s full-scale war on Ukraine in February 2022.",
      "The most high-profile cases include the 2022 killing of Darya Dugina, the daughter of Russian nationalist ideologue Alexander Dugin, in a car bomb attack, the murder of pro-war blogger Vladlen Tatarsky in a 2023 cafe bombing, and the shooting last year of a Russian submarine commander accused of war crimes by Kyiv.",
      "Russia’s radioactive, chemical and biological defense troops, known as RKhBZ, which Kirillov commanded, are special forces who operate under conditions of radioactive, chemical and biological contamination and who are tasked with protecting ground forces operating in extreme conditions.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "igor kirillov",
      "lieutenant general",
      "chemical protection",
      "protection troops",
      "chemical weapons",
      "general igor",
      "kirillov chief",
      "chief russia",
      "russia nuclear",
      "nuclear biological"
    ]
  },
  {
    "title": "30 Nokor soldiers killed, wounded in Kursk",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314536676/30-nokor-soldiers-killed-wounded-in-kursk.html",
    "publishedAt": "2024-12-16T12:40:00Z",
    "sentences": [
      "KYIV—Ukraine said Monday its troops killed or wounded at least 30 North Korean soldiers who had been deployed by Russia to its western Kursk region, where Ukraine has seized territory.",
      "Thousands of troops from North Korea have come to reinforce Russian forces, including in the Kursk border region where Russia has been clawing back territory after a surprise offensive from Ukrainian forces this summer.",
      "“On Dec 14 and 15, army units from the Democratic People’s Republic of Korea suffered significant losses near the villages of Plekhovo, Vorozhba, Martynovka in the Kursk region of Russia — at least 30 soldiers were killed and wounded,” Ukraine’s military intelligence said.",
      "The units are “being replenished with fresh personnel” from North Korea, which Western officials estimate has sent at least 10,000 soldiers to help Moscow.",
      "Russia and North Korea have boosted their military ties since Moscow’s invasion.",
      "Russia has begun deploying “a noticeable number” of North Koreans in assaults to push Ukrainian troops out of the Kursk region, Volodymir Zelenskyy said on Saturday.",
      "He said that according to his information, “the Russians include (North Koreans) in combined units and use them in operations in the Kursk region”, where Ukraine launched an incursion in August.",
      "Zelenskyy said he has also heard the North Koreans “may be used in other parts of the front line”, and that “losses among this category are also already noticeable”.",
      "Russia’s defense ministry said last week its troops recaptured some small settlements in the Kursk region.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "kursk region",
      "north korea",
      "north koreans",
      "killed wounded",
      "least 30",
      "region ukraine",
      "region russia",
      "zelenskyy said",
      "said monday",
      "monday troops"
    ]
  },
  {
    "title": "Russia launches major missile attack on Ukrainian power facilities, Kyiv says",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-launches-major-missile-attack-ukrainian-power-facilities/",
    "publishedAt": "2024-12-13T10:47:02Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "FILE PHOTO: The sky over a Ukrainian air defence volunteer unit in the Kyiv region, Ukraine November 30, 2024.",
      "REUTERS/Valentyn Ogirenko/File Photo REUTERS/Valentyn Ogirenko/File Photo KYIV, Ukraine – Russia launched a large-scale missile attack on Ukrainian energy facilities during the morning rush hour on Friday, December 13, Kyiv said, while explosions were heard in the Black Sea port of Odesa and other cities in western Ukraine.",
      "Russian forces have been targeting Ukraine’s electricity system for most of the year and it renewed its strike campaign last month, causing lengthy power cuts for millions of civilians as the war with Russia nears the 34-month mark.",
      "“Russia aims to deprive us of energy.",
      "Instead, we must deprive it of the means of terror.",
      "I reiterate my call for the urgent delivery of 20 NASAMS, HAWK, or IRIS-T air defense systems,” Foreign Minister Andrii Sybiha wrote in a post on X.",
      "An industry source told Reuters that Friday’s attack had targeted Ukrainian power substations and that it had included more strikes on gas infrastructure than in past assaults.",
      "As the attack unfolded, energy officials announced longer, emergency power cuts, but they did not make clear whether that was because of new damage or whether it was a precautionary measure.",
      "There were no immediate reports of casualties.",
      "Around a half of power company Yasno’s 3.5 million consumers were without power on Friday morning, their CEO said.",
      "The extent of any damage was hard to assess.",
      "After repeated Russian attacks on the power grid, officials reveal little detailed information about the outcome of strikes and the state of the network.",
      "Authorities in the western region of Lviv confirmed there had been attacks on energy facilities there and that the schedule of power cuts would have to be changed, implying there had been damage.",
      "Russia says it does not target civilian infrastructure, but that it sees the power system as a military target.",
      "Ukraine’s energy system has already suffered 11 waves of attacks this year, which have caused widespread damage and lengthy power cuts all over the country.",
      "The morning missile strike was preceded by an overnight attack involving dozens of drones.",
      "Russian troops, meanwhile, are notching up their fastest battlefield gains in eastern Ukraine since 2022 in their drive to seize the entire industrial Donbas region.",
      "“The enemy continues its terror.",
      "Once again, the energy sector across Ukraine is under massive attack,” Galushchenko wrote in a post on Facebook.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "power cuts",
      "energy facilities",
      "lengthy power",
      "wrote post",
      "summary ai",
      "ai generated",
      "generated summarization",
      "summarization may",
      "may errors",
      "errors context"
    ]
  },
  {
    "title": "Russia in contact with Syrian rebels, hopes to keep military bases, Interfax reports",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-contact-syria-rebels-hope-keep-military-bases/",
    "publishedAt": "2024-12-13T07:35:04Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "REBELS IN SYRIA.",
      "Rebels led by the Islamist militant group Hayat Tahrir al-Sham drive a military vehicle in al-Rashideen, Aleppo province, Syria November 29, 2024.",
      "Mahmoud Hasano/Reuters MOSCOW, Russia – Russia has established direct contact with the political committee of Syria’s Islamist rebel group, Hayat Tahrir al-Sham, the Interfax news agency quoted Russian Deputy Foreign Minister Mikhail Bogdanov as saying on Thursday, December 12.",
      "Interfax reported that Bogdanov, speaking to journalists, also said Moscow aimed to maintain its military bases in Syria.",
      "Bogdanov said contacts with HTS, the most powerful force in the country after the overthrow of President Bashar al-Assad, were “proceeding in constructive fashion”.",
      "Russia, he said, hoped the group would fulfil its pledges to “guard against all excesses”, maintain order and ensure the safety of diplomats and other foreigners.",
      "Bogdanov said Russia hoped to maintain its two bases in Syria — a naval base in Tartous and the Khmeimim Air Base near the port city of Latakia — to keep up efforts against international terrorism.",
      "“The bases are still there, where they were on Syrian territory.",
      "No other decisions have been made for the moment,” he was quoted as saying.",
      "“They were there at the Syrians’ request with the aim of fighting terrorists from the Islamic State.",
      "I am proceeding on the basis of the notion that everyone agrees that the fight against terrorism, and what remains of IS, is not over.” Maintaining that fight, he said, “requires collective efforts and in this connection, our presence and the Khmeimim base played an important role in the context of the overall fight against international terrorism.” Another Russian Deputy Foreign Minister, Sergei Vershinin, and the UN’s special envoy for Syria Geir Pedersen, called for measures to stabilize the situation in and around Syria, according to a statement on the foreign ministry’s website.",
      "The statement said the two diplomats discussed by telephone finding a political settlement in a way to be determined by the Syrian people and ensuring Syria’s sovereignty and territorial integrity.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "group hayat",
      "hayat tahrir",
      "russian deputy",
      "deputy foreign",
      "foreign minister",
      "bases syria",
      "bogdanov said",
      "summary ai",
      "ai generated",
      "generated summarization"
    ]
  },
  {
    "title": "US announces new arms aid package for Ukraine worth $500 million",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/us-canada/united-states-announces-new-arms-aid-package-ukraine/",
    "publishedAt": "2024-12-13T00:21:53Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "ANTONY BLINKEN.",
      "US Secretary of State Antony Blinken speaks to reporters on the tarmac before his departure from King Hussein International Airport in Jordan's southern Red Sea coastal city of Aqaba on December 12, 2024.",
      "Andrew Caballero-Reynolds/Pool via Reiters WASHINGTON, USA – The administration of Democratic US President Joe Biden announced another package of weapons aid for Ukraine on Thursday, December 12, valued at $500 million, Secretary of State Antony Blinken said in a statement.",
      "White House spokesperson John Kirby said earlier the US would continue to provide additional packages for Ukraine “right up to the end of this administration.” Washington said 10 days ago it would send Ukraine $725 million worth of missiles, ammunition, anti-personnel mines and other weapons.",
      "Biden’s outgoing administration is seeking to bolster Ukraine in tackling Russia’s invasion, before Biden’s term ends in January when Republican President-elect Donald Trump would take office.",
      "Thursday’s package worth about $500 million included ammunition for High Mobility Artillery Rocket Systems (HIMARS) and High-speed Anti-radiation missiles (HARMs), among other assistance, according to Blinken.",
      "After Thursday, about $5.6 billion worth of Presidential Drawdown Authority (PDA) to rush weapons from US stocks to the front lines remains available to Biden without requiring congressional approval.",
      "Moscow’s troops have been capturing village after village in Ukraine’s east, part of a drive to seize the industrial Donbas region, while Russian air strikes target a hobbled Ukrainian energy grid as winter sets in.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "antony blinken",
      "secretary state",
      "state antony",
      "december 12",
      "500 million",
      "summary ai",
      "ai generated",
      "generated summarization",
      "summarization may",
      "may errors"
    ]
  },
  {
    "title": "Russia says it will definitely respond to Ukraine's latest ATACMS strike",
    "source": "Rappler",
    "url": "https://www.rappler.com/world/europe/russia-will-respond-ukraine-latest-atacms-strike/",
    "publishedAt": "2024-12-12T10:35:01Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "Rescuers work with a dog at the site where a building was heavily damaged by yesterday's Russian missile strike, amid Russia's attack on Ukraine, in Zaporizhzhia, Ukraine December 11, 2024.",
      "REUTERS/Stringer MOSCOW, Russia – Russia will definitely respond to Ukraine’s latest use of US-made ATACMS missiles to strike Russian territory, the Kremlin said on Thursday, December 12.",
      "Russia said on Wednesday that Ukraine had struck a military airfield on the Azov Sea with six US-made ATACMS ballistic missiles, a move that could prompt Moscow to launch another experimental intermediate-range hypersonic missile at Ukraine.",
      "Russia’s defense ministry said on Wednesday that the “attack by Western long-range weapons will not go unanswered and appropriate measures will be taken.” It is unclear exactly how Russia will respond.",
      "“I would like to recall the absolutely unambiguous and direct statement of the defense ministry of the Russian Federation made yesterday, where it was clearly stated that a response would follow,” Kremlin spokesman Dmitry Peskov said.",
      "“The response will follow in a manner deemed appropriate.",
      "But it will definitely follow,” Peskov said.",
      "Russia fired a new intermediate-range hypersonic ballistic missile known as “Oreshnik”, or Hazel Tree, at Ukraine on November 21 in what President Vladimir Putin said was a direct response to strikes on Russia by Ukrainian forces with US and British missiles.",
      "A US official said on Wednesday that Russia could launch another hypersonic ballistic missile against Ukraine in the coming days, but Washington does not consider the Oreshnik weapon a game-changer in the war.",
      "– Rappler.com There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "said wednesday",
      "launch another",
      "missile ukraine",
      "defense ministry",
      "peskov said",
      "hypersonic ballistic",
      "ballistic missile",
      "summary ai",
      "ai generated",
      "generated summarization"
    ]
  }
]