[
  {
    "title": "Gazprom's grandeur fades as Europe abandons Russian gas",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/gazproms-grandeur-fades-europe-abandons-070342076.html",
    "publishedAt": "2025-03-13T07:03:42Z",
    "sentences": [
      "Oops, something went wrong (Reuters) -When the CEO of Russian state gas giant Gazprom, Alexei Miller, opened a lavish Italian palazzo-styled building in central St Petersburg to house the company's export arm 11 years ago, he augured a future funded by European sales.",
      "\"This is symbolic,\" he said, referring to the modern new offices in Russia's most European city.",
      "\"Europe will increasingly need Russian gas.\"",
      "Instead, the opulent offices have come to symbolize Gazprom's rapid decline, dragged down by the almost total loss of European markets after the war in Ukraine ruptured Russia's ties with the West.",
      "Reeling under multi-billion-dollar losses and scrambling for savings, the company is now considering putting the palazzo up for sale along with other luxury properties it owns, according to a Gazprom executive and another source with knowledge of internal discussions at Gazprom.",
      "Gazprom is arguably the Russian business hardest hit by the international sanctions imposed after Russia's full-scale invasion of Ukraine three years ago.",
      "Although Russia's economy has been resilient, growing signs of strain have appeared in several industries.",
      "Reuters has previously reported that President Vladimir Putin is concerned as heavy military spending distorts the wider economy.",
      "The number of staff at Gazprom Export, once the most prosperous unit of the company, overseeing Soviet and Russia's gas sales to Europe for over half a century, has shrunk to just a few dozen employees, the same two sources told Reuters.",
      "That's down from 600 employees five years ago, at the peak of Russian exports to Europe.",
      "The possible sale of the building and cuts at the unit have not been previously reported.",
      "Gazprom's media department and the Russian energy ministry did not respond to detailed requests for comment on the story's findings.",
      "With no European sales, the remaining workers are focused mainly on litigation with former EU buyers, the sources told Reuters.",
      "Gazprom Export is \"just a shell,\" one of the sources said.",
      "Alexei Grivach, from pro-Kremlin think tank the National Energy Security Fund, said Gazprom's less glamorous focus in the near future will be to bring gas to more Russian homes.",
      "\"Gazprom has been handed the social task of gasification and secure gas supply to the economy and the population at low regulated prices,\" he said.",
      "Reuters spoke to three executives and half a dozen former and current employees for this story on the depth of change at what used to be Russia's most valuable company.",
      "All requested anonymity, citing fear of professional repercussions.",
      "WIDER CUTS Gazprom's problems extend well beyond the export unit, the conversations with the employees reveal.",
      "Two of the sources told Reuters that Miller has now approved plans to cut 1,500 jobs at the parent company's headquarters in Russia and Europe's tallest skyscraper, the British-designed Lakhta Centre, also in St Petersburg.",
      "The dismissals at Gazprom headquarters have yet to be announced but staff have been asked to prepare individual presentations about why they should keep their jobs, according to one of the sources, who said employees were told to write up a description of their job functions in case of overlaps.",
      "The source said the process was expected to be completed within a few weeks.",
      "The cuts add up to about 40% of the staff at Gazprom's headquarters, but a small fraction of its half million strong work force, spread across Russia.",
      "Management misjudged how resolute European capitals would be, according to one of the executives, who said the thinking inside the company was that Europe would quickly be back \"begging\" for Russian gas supplies to resume.",
      "Despite the economic pain of higher energy costs, the EU has not rolled back sanctions.",
      "\"We proved to be wrong,\" the executive said.",
      "U.S. gas exporters quickly moved to replace Russian gas in Europe.",
      "The U.S. has become the biggest exporter of LNG to the continent, with supplies tripling since 2021.",
      "Europe still buys Russia's sea-borne liquefied natural gas (LNG), but mainly from Gazprom's rivals, Novatek's Yamal LNG plant.",
      "The European Union aims to end its use of Russian fossil fuels by 2027 and its overall gas consumption has decreased in part due to a shift to renewable energy sources.",
      "Last year, Gazprom posted a net loss of $7 billion for 2023, its first since 1999, the year Putin came to power.",
      "It posted another loss in the first 9 months of 2024, the latest period for which figures are available.",
      "Gazprom's share price fell in mid-December to its lowest since January 2009, touching 106.1 roubles, a decline of more than a third since the start of 2024.",
      "A few months after announcing the annual loss, Gazprom said last year it was selling a portfolio of high-end properties that include well-known luxury hotels in Moscow and in Armenia's Valley of Flowers.",
      "Gazprom has a long history of investing in luxury property, which it uses to reward employees with holidays, and to host conferences and events such as the 2014 Olympic Games.",
      "TRUMP TRADE The return of Donald Trump to the White House has helped Gazprom's share price recover to around 180 roubles on hopes a swift Ukrainian peace deal would lead to the restoration of exports to Europe, Alpha Bank said in a note last month.",
      "However, there are few signs the continent will rush to again tie itself to Russian gas, despite a Financial Times report that a long-time ally of Putin is lobbying the United States to allow investors to restart the $11 billion Nord Stream 2 pipeline that carried gas from Russia via Germany.",
      "Germany says it will stick with its policy of independence from Russian energy.",
      "Even if there were appetite, Nord Stream is out of service and partly damaged.",
      "Cederic Cremers, executive vice president of integrated gas at Shell, said in late February at the International Energy week conference in London in response to whether Russian pipeline gas could return to Europe: \"That depends on a lot of things.\"",
      "He cited multiple arbitration cases with Gazprom and asked \"will customers and Europe still want the same dependence on Russian gas?\"",
      "Gazprom's share in EU markets has shrunk to 7% from over 35% before EU sanctions, European Commission data shows.",
      "Its market capitalisation as of Wednesday stands at around $46 billion, down from the all-time high of $330.9 billion in 2007, according to the Moscow stock exchange, Gazprom and Reuters calculations.",
      "MILLER'S TIME As the company adjusts to its new role as a domestic gas supplier, the lofty ambitions of CEO Miller have been dashed.",
      "In 2007, Miller said the company would eventually have a market capitalisation of $1 trillion.",
      "At the time this seemed possible.",
      "Russia holds a fifth of the planet's gas resources, rendering Gazprom the world's largest natural gas company by reserves.",
      "At its height, Gazprom - formed in the Soviet Union from the Ministry of the Gas Industry - generated revenues that accounted for over 5 percent of Russia's $2 trillion annual gross domestic product.",
      "The company has been run by Miller, a close friend of Putin since the Russian president was mayor of St Petersburg in 1990s, for the past 24 years.",
      "Miller has been on the U.S. sanctions list since 2018, barring U.S. citizens and entities from any dealings with him.",
      "Gazprom controls entire towns in Siberia and the Arctic such as Nadym where tens of thousands of employees and their families depend on it as the sole employer.",
      "Yury Shafranik, Russian fuel and energy minister from 1993 to 1996, told Reuters in 2023 that Gazprom had been a \"state within a state.\"",
      "The sources Reuters spoke to did not describe plans for job cuts or the closure of production assets in such company towns.",
      "A STEPPE TOO FAR?",
      "Putin's long-term promise to replace Europe's markets with exports to China look optimistic at best.",
      "Even the most ambitious projects currently being considered to pipe gas eastward would not amount to half of the previous annual peak exports of 180 billion cubic meters (bcm) Much of Russia's gas went through pipelines to Europe.",
      "When Germany and other European countries stopped buying it, there was nowhere else for the surplus to go.",
      "In contrast, Russia's oil exporters have been able to redirect tankers to refineries in Asian countries that have not imposed sanctions.",
      "Although gas production recovered slightly last year from a record low in 2023 on increased domestic demand and exports to China, there is little pipeline capacity to expand that trade.",
      "For now there is only one route for Russia to supply pipeline gas to China – the Power of Siberia pipeline, which transports 38 bcm per year.",
      "A second smaller pipeline with a capacity of 10 bcm per year is under construction, set to connect the Pacific island of Sakhalin to China by 2027.",
      "Russia and China have been in talks for over a decade about building a third pipeline, the Power of Siberia 2, to carry 50 bcm and meet over a tenth of Chinese gas consumption.",
      "This plan would take years to fully develop and discussions have stalled due to price differences, according to media reports.",
      "In May, Russian Deputy Prime Minister Alexander Novak said Russia and China expected to a sign a contract \"in the near future\" on the Power of Siberia 2 gas pipeline.",
      "Putin and China's President Xi Jinping discussed Power of Siberia-2 in January, news agency Interfax reported, but no agreement has been reached.",
      "China National Petroleum Corporation, which is dealing with Gazprom, declined to comment on the talks.",
      "The government of Russia did not respond to a request for comment.",
      "Even if the Power of Siberia 2 pipeline were completed quickly, volumes and pricing terms are likely to be much lower than past exports to Europe, analysts from the Center on Global Energy Policy at Columbia University.",
      "\"By 2030, Russian gas export revenues might fall by 55–80 percent compared to 2022, a year of record-high revenues for the Russian gas industry, at $165 billion,\" they said in a research note last year.",
      "(Reporting by Reuters; Editing by Simon Webb and Frank Jack Daniel) Sign in to access your portfolio"
    ],
    "topics": [
      "russian gas",
      "told reuters",
      "last year",
      "power siberia",
      "st petersburg",
      "years ago",
      "sources told",
      "exports europe",
      "gazprom share",
      "siberia 2"
    ]
  },
  {
    "title": "Serbia shores up oil reserves as seeks delay of U.S. sanctions on oil company NIS",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/serbia-shores-oil-reserves-seeks-080034264.html",
    "publishedAt": "2025-02-26T08:00:34Z",
    "sentences": [
      "Oops, something went wrong By Aleksandar Vasovic BELGRADE (Reuters) - Russia's Gazprom Neft transferred stakes of around 5.15% in Serbia's NIS oil company to Gazprom, in an attempt to ward off U.S. sanctions that could result in crude supply cuts for the Balkan country.",
      "The U.S. placed sanctions on Russia's oil sector on January 10, and gave Gazprom Neft 45 days to exit ownership of NIS.",
      "The deadline expires at 0600 local time (0500 GMT) on Thursday.",
      "According to notices made public by Belgrade stock exchange BELEX, Gazprom Neft reduced its stake in NIS to 44.85% from 50%.",
      "At the same time, Gazprom increased its stake in the Serbian oil company to 11.3% from 6.15%.",
      "The changes mean Gazprom Neft no longer has an absolute majority in NIS, which operates Serbia's sole crude oil refinery in Pancevo, just outside the capital Belgrade.",
      "They follow a similar cosmetic change in 2022 when the company was trying to avoid EU sanctions.",
      "It unclear whether they will satisfy U.S. authorities.",
      "\"We are continuing talks with both the United States and Russia to reach a solution,\" Serbia's Energy Minister Dubravka Djedovic Handanovic said in a live TV broadcast on Wednesday.",
      "The Serbian government holds a further 29.87% stake in NIS, with small shareholders accounting for the remainder.",
      "Serbia, an historical ally of Russia, has submitted a formal request to the U.S. Treasury Department for a waiver of sanctions for 90 days to allow it to consider a \"sustainable solution that would lead to the lifting of sanctions\".",
      "Following efforts to store fuel and find alternative supplies, Handanovic said the government has enough to supply the market for at least three months.",
      "But in the absence of a waiver, Serbia could face a shortfall as NIS, which supplies about 80% of the domestic retail market with crude oil and gas derivatives, would be unable to import crude oil through Croatia's pipeline operator Janaf.",
      "The Belgrade stock exchange suspended trading of NIS shares on January 14, citing the introduction of the U.S. sanctions.",
      "(Reporting by Aleksandar Vasovic; Writing by Angeliki Koutantou; Editing by Louise Heavens, Edward McAllister and Barbara Lewis) Sign in to access your portfolio"
    ],
    "topics": [
      "gazprom neft",
      "crude oil",
      "aleksandar vasovic",
      "oil company",
      "belgrade stock",
      "stock exchange",
      "stake nis",
      "handanovic said",
      "oops something",
      "something went"
    ]
  },
  {
    "title": "UNSC adopts US resolution taking neutral stance on Ukraine war",
    "source": "BOL News",
    "url": "https://www.bolnews.com/latest/2025/02/unsc-adopts-us-resolution-taking-neutral-stance-on-ukraine-war/",
    "publishedAt": "2025-02-25T04:58:01Z",
    "sentences": [
      "25th Feb, 2025.",
      "09:58 am Share Listen Font size Dark Mode Save Print UNSC adopts US resolution taking neutral stance on Ukraine war UNITED NATIONS: The UN Security Council adopted a US resolution on the third anniversary of Russia’s military intervention in Ukraine that softens Washington’s stance on the conflict as President Donald Trump pushes for a peace deal.",
      "Ten of the 15 Council members, including Pakistan, voted for the resolution, which omitted mention of Russian aggression, in a stunning shift from years of US policy.",
      "There was no vote against the resolution, while five Western members — Denmark, France, Greece, Slovenia, United Kingdom — abstained.",
      "Earlier, the UN General Assembly rejected the US-drafted resolution, which passed only after it was amended to state that the conflict was the result of a “full-scale invasion of Ukraine by the Russian Federation.” But at the Security Council, the Western members failed in their attempt to include any reference to Russia’s invasion as their motions to seeking to amend the resolution failed to garner enough votes — exposing a sharp split in transatlantic relations.",
      "The short US resolution mourns the loss of life in the “Russia-Ukraine conflict”, reiterates the UN’s purpose is to maintain international peace and security and peacefully settle disputes, and calls for a swift end to the conflict and a lasting peace.",
      "Among others who supported the resolution were China and Russia.",
      "Explaining his vote in the Security Council, Ambassador Asim Iftikhar Ahmad, the alternate permanent representative of Pakistan to the UN, said that he had voted in favour of the US resolution as it was in line with Pakistan’s clear and consistent position on the conflict in Ukraine, and its repeated calls for immediate cessation of hostilities and a negotiated settlement of the conflict.",
      "Noting that the “priority of peace has remained largely absent and elusive”, even as the security, humanitarian and economic crises have intensified, he said: “A different approach was perhaps required.” The Pakistani envoy therefore expressed hope that today’s resolution will “lend impetus to an inclusive peace process that yields a durable solution in accordance with international law”.",
      "Pakistan, he said, remained deeply concerned by this tragic conflict, which has already left in its wake immense human suffering and massive damage to infrastructure, economy and the society, highlighting geo-political tensions and the economic consequences that have been particularly severe especially for developing countries.",
      "Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "us resolution",
      "security council",
      "western members",
      "bol news",
      "25th feb",
      "feb 2025",
      "2025 share",
      "share listen",
      "listen font",
      "font size"
    ]
  },
  {
    "title": "Trump teases 'economic development' with Russia as he marks the third year of the war in Ukraine",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/trump-teases-economic-development-with-russia-as-he-marks-the-third-year-of-the-war-in-ukraine-215643953.html",
    "publishedAt": "2025-02-24T21:56:43Z",
    "sentences": [
      "Oops, something went wrong President Donald Trump added a new wrinkle to ongoing talks that he says may help end the war in Ukraine: new \"economic development\" with Russia that the president says could come in addition to ongoing discussions between the US and Ukraine.",
      "\"I am in serious discussions with President Vladimir Putin of Russia concerning the ending of the War, and also major Economic Development transactions which will take place between the United States and Russia,\" Trump posted on Monday, adding, \"Talks are proceeding very well!\"",
      "Details were unclear on exactly what goods President Trump has in mind, but he signaled later in the day during a back-and-forth with reporters that it could be similar to the ongoing talks with Ukraine over access to that country's rare earth minerals.",
      "\"The first element of the overall transaction is ending the war,\" Trump said, adding, \"but, just as we're doing with Ukraine, if we could do some economic development in terms of Russia and getting things that we want.\"",
      "Like Ukraine, Russia has valuable rare earth minerals that US businesses would love to access.",
      "A recent US Geological Survey report on rare earth elements found that China has the largest reserves of the crucial ingredients in many modern electronics.",
      "Russia is fifth.",
      "Previous US-led sanctions on Russia, from export controls on many manufactured goods to a price cap and embargo on Russian oil, could give Trump additional economic inducements to tempt Putin.",
      "The varied commentary from Trump on Monday came on the third anniversary of Russia's invasion of Ukraine and during French President Emmanuel Macron's visit to the White House.",
      "Any effort to spur the Russian economy would mark yet another stark reversal of three years of Western policy that has tried to isolate and starve that country's economy with mixed success.",
      "It was also just the latest friendly move by Trump toward Russia after years of Joe Biden trying to shun the Russian president.",
      "At another point Monday, Trump was asked if he considered Putin a dictator after he called Ukrainian President Volodymyr Zelensky a \"dictator without elections\" last week.",
      "Trump declined to clarify whether Putin merited the same designation, saying, \"I don't use those words lightly.\"",
      "Trump didn't offer any additional detail about any economic developments when he appeared alongside Macron at a formal press conference late on Monday afternoon, but he did say he saw signs of a new openness from Russia.",
      "\"I do deals,\" Trump said at one point, adding, \"I know when somebody wants to make\" a deal.",
      "\"I think it's very much to the benefit of Russia to make a deal and I feel that we will do that,\" he added.",
      "Trump did offer a bit more detail about ongoing talks with Ukraine that could see the country sign over at least some of its mineral rights in exchange for security.",
      "\"A report was just handed to me,\" Trump told reporters, saying, \"We've made a great deal of progress,\" and even suggesting Zelensky could travel to Washington in the coming days or weeks to sign an agreement.",
      "But Trump repeated Monday that the talks on a variety of fronts — economic and otherwise — are ongoing and noted at one point, \"It's a negotiation that's just starting.\"",
      "Ben Werschkul is Washington correspondent for Yahoo Finance.",
      "Every Friday, Yahoo Finance's Rick Newman and Ben Werschkul bring you a unique look at how US policy and government affects your bottom line on Capitol Gains.",
      "Watch or listen to Capitol Gains on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.",
      "Click here for political news related to business and money policies that will shape tomorrow's stock prices Read the latest financial and business news from Yahoo Finance Sign in to access your portfolio"
    ],
    "topics": [
      "ongoing talks",
      "economic development",
      "rare earth",
      "yahoo finance",
      "ending war",
      "talks ukraine",
      "earth minerals",
      "trump said",
      "ukraine could",
      "trump offer"
    ]
  },
  {
    "title": "Goldman Sachs says it does not see Ukraine ceasefire boosting Russia output",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/goldman-sachs-says-does-not-065441358.html",
    "publishedAt": "2025-02-19T06:54:41Z",
    "sentences": [
      "Oops, something went wrong (Reuters) - A potential Ukraine ceasefire and the associated easing in sanctions on Russia are unlikely to substantially increase Russia's oil flows, Goldman Sachs said on Wednesday.",
      "U.S. President Donald Trump's administration said on Tuesday it had agreed to hold more talks with Russia on ending the war in Ukraine.",
      "\"We believe that Russia crude oil production is constrained by its OPEC+ 9.0 million barrels per day (mbpd) production target rather than current sanctions, which are affecting the destination but not the volume of oil exports,\" Goldman Sachs said.",
      "OPEC+, a grouping of the Organization of the Petroleum Exporting Countries along with Russia and other allies, pumps about half the world's oil.",
      "The bank assumes that OPEC+ is likely to postpone its planned gradual ramp-up in oil production to July this year from April, on increased compliance with OPEC+ targets by Russia and several other OPEC+ producers, as well as continued uncertainty surrounding U.S. policy.",
      "OPEC+ pushed the plan to begin raising output to April, extending its latest layer of cuts through the first quarter of 2025 in December due to weak demand and rising supply outside the group.",
      "On Monday, Russia's RIA state news agency reported Russian Deputy Prime Minister Alexander Novak saying that OPEC+ producers were not considering further delays in the monthly oil supply increases.",
      "Russia, as one of the world's top oil suppliers, holds substantial sway over global oil markets and prices.",
      "Goldman Sachs continues to expect potential recoveries in positioning and valuation to nudge Brent up to $79 per barrel later this month.",
      "Brent crude prices were trading at about $76 a barrel as of 0537 GMT on Wednesday.",
      "[O/R] (Reporting by Anushree Mukherjee and Swati Verma in Bengaluru; Editing by Janane Venkatraman) Sign in to access your portfolio"
    ],
    "topics": [
      "goldman sachs",
      "sachs said",
      "oil production",
      "oops something",
      "something went",
      "went wrong",
      "wrong reuters",
      "reuters potential",
      "potential ukraine",
      "ukraine ceasefire"
    ]
  },
  {
    "title": "Brent oil prices tick down after gaining on Caspian pump station attack",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/brent-oil-prices-tick-down-020104801.html",
    "publishedAt": "2025-02-18T02:01:04Z",
    "sentences": [
      "Oops, something went wrong By Shariq Khan (Reuters) -Oil prices settled higher on Tuesday as supply disruptions mounted in Russia and the U.S., while talks to end the war in Ukraine capped gains as this could boost supply from Moscow.",
      "Brent crude futures rose 62 cents, or 0.8% to settle at $75.84 a barrel.",
      "U.S. West Texas Intermediate crude futures rose $1.11, or 1.6%, to settle at $71.85 a barrel, catching up with the gains Brent registered on Monday, when the U.S. contract traded without settlement due to a holiday.",
      "Brent rose 48 cents in the previous session after Ukrainian drones attacked a pumping station in Russia on the Caspian Pipeline Consortium pipeline, which moves crude from Kazakhstan to world markets.",
      "Oil flows through the pipeline were reduced by 30-40% on Tuesday, Russian Deputy Prime Minister Alexander Novak said.",
      "A 30% cut would equate to a 380,000 barrels per day reduction in oil supply, per Reuters calculations.",
      "\"Brent already benefited yesterday from the CPC supply disruptions, but generally it will come down to how long and how big the disruption is,\" UBS analyst Giovanni Staunovo said.",
      "Oil markets received another supply shock on Tuesday as Russia's Black Sea port of Novorossiisk suspended loadings due to a storm, two sources familiar with the matter said.",
      "Exports from the port in February were revised up by 0.24 million metric tons from an initial plan to 2.25 million tons or some 590,000 barrels per day, sources said Monday.",
      "A cold snap in the U.S. has hit oil supply.",
      "The North Dakota Pipeline Authority estimated that production in the country's No.",
      "3 producing state would be down by as much as 150,000 barrels per day.",
      "Keeping prices in check, U.S. and Russian delegates held a 4-1/2-hour meeting in Saudi Arabia to discuss ways to halt the deadliest conflict in Europe since World War II.",
      "Ukraine was not represented and Russia hardened its demands.",
      "If a deal is reached, Washington and its allies could drop sanctions on Russian oil supplies.",
      "\"Everyone is waiting on what is going to happen with Russia and Ukraine,\" Mizuho oil analyst Robert Yawger said.",
      "\"That's not something that's going to happen in the next 15 minutes, so the market is going to stay cautious,\" he added.",
      "In a potential boost for oil prices, U.S. inventories and trade data due on Thursday could show lower net-imports for crude oil last week, Staunovo said.",
      "However, expectations of a heavy refinery maintenance season could weigh on demand in the weeks ahead.",
      "\"There is plenty of crude out here on the offer with refinery turnarounds beginning in March seen as heavy,\" United ICAP Energy Specialist Scott Shelton told clients in a note on Tuesday.",
      "U.S. crude oil and gasoline stockpiles likely rose last week, a preliminary Reuters poll showed on Tuesday.",
      "Traders are also waiting for clarity on whether OPEC+ will proceed with plans to boost oil supply from April, or delay that to a later date.",
      "(Reporting by Shariq Khan; Additional reporting by Paul Carsten, Colleen Howe and Trixie Yap; Editing by David Goodman, Jan Harvey and David Gregorio) Sign in to access your portfolio"
    ],
    "topics": [
      "barrels per",
      "per day",
      "oil supply",
      "shariq khan",
      "supply disruptions",
      "crude futures",
      "futures rose",
      "settle barrel",
      "staunovo said",
      "going happen"
    ]
  },
  {
    "title": "Crypto exchange platform BestChange in the dark over Russia block",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/crypto-exchange-platform-bestchange-dark-092352634.html",
    "publishedAt": "2025-02-11T09:23:52Z",
    "sentences": [
      "Oops, something went wrong (Reuters) - Cryptocurrency exchange platform BestChange has said it is unsure why its website was blocked by Russia's communications watchdog Roskomnadzor, but that it is in touch with the central bank to try to lift the ban.",
      "Circulating and advertising digital currencies is banned in Russia, although using cryptocurrency for international payments is now legal, as is cryptocurrency mining.",
      "\"bestchange.ru has been restricted in Russia by Roskomnadzor,\" the platform said late on Monday in response to a request for comment.",
      "\"Unfortunately, we cannot account for the exact reason why this has happened.",
      "\"We are communicating with the central bank to pinpoint the reason and interacting with the regulator to clarify the situation and lift the block.\"",
      "Roskomnadzor's website lists bestchange.ru as blocked.",
      "The RIA news agency cited Roskomnadzor as saying that the ban was due to legal violations \"in the financial sphere\".",
      "Roskomnadzor did not immediately respond to a request for comment.",
      "BestChange said new regulations around crypto could be behind the ban, or an issue with an entity using its service.",
      "Last year, Russia legalised cryptocurrency mining and introduced taxes that could bring in up to 200 billion roubles ($2 billion) a year from miners.",
      "Moscow has since restricted crypto mining in some Siberian regions to prevent power shortages.",
      "As part of that legislation, Russia has allowed businesses to use cryptocurrencies in international trade as Moscow looks to circumvent Western sanctions causing payment delays, although a trial period is yet to get under way.",
      "($1 = 96.2000 roubles) (Reporting by Alexander Marrow; Editing by Christina Fincher) Sign in to access your portfolio"
    ],
    "topics": [
      "bestchange said",
      "central bank",
      "cryptocurrency mining",
      "request comment",
      "oops something",
      "something went",
      "went wrong",
      "wrong reuters",
      "reuters cryptocurrency",
      "cryptocurrency exchange"
    ]
  },
  {
    "title": "Serbian oil company NIS asks U.S. Treasury for a 90-day waiver of sanctions",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/serbian-oil-company-nis-asks-101938459.html",
    "publishedAt": "2025-02-04T10:19:38Z",
    "sentences": [
      "Oops, something went wrong BELGRADE (Reuters) - Serbian oil company NIS, which is majority-owned by Russia's Gazprom Neft and Gazprom, has submitted a formal request to the U.S. Treasury Department for a waiver of sanctions for 90 days, Serbia's energy ministry said on Tuesday.",
      "In a statement, the ministry said that the NIS request has the backing of the Serbian and Hungarian governments.",
      "\"We urgently request that OFAC (Office of Foreign Assets Control) consider immediate assistance, in the form of a suspension of sanctions for a minimum of 90 days, while a sustainable solution that would lead to the lifting of sanctions is considered,\" the statement said.",
      "It also said that NIS's request concerns obtaining licenses that would allow it to continue operating while a solution to the ownership structure and management is sought.",
      "\"The (Serbian) government ... supports the request ... because sanctions would impair the company's ability to supply Serbian citizens with oil and oil derivatives,\" the ministry said.",
      "Gazprom Neft and Gazprom have 50% and 6.15% stakes respectively in the company which operates the sole oil refinery in Serbia.",
      "The Serbian government holds a further 29.87% with small shareholders accounting for the remainder.",
      "On Jan. 10, Serbia's President Aleksandar Vucic said Russian companies were given 45 days to 45 days to exit their ownership in NIS and that any deal would have to be approved by OFAC.",
      "On Jan. 14, Russian Foreign Minister Sergei Lavrov said that Moscow was in contact with Belgrade about NIS.",
      "Serbia receives most of its crude oil through Croatia's pipeline operator Janaf, through which Hungary also imports some of its oil.",
      "NIS, one of the biggest contributors to Serbia's state budget, had signed a contract with Janaf for the transport of 10 million tons of oil through Croatia from Jan. 1, 2024 until Dec. 31, 2026.",
      "(Reporting by Aleksandar Vasovic; Writing by Angeliki Koutantou; Editing by Susan Fenton) Sign in to access your portfolio"
    ],
    "topics": [
      "ministry said",
      "gazprom neft",
      "neft gazprom",
      "90 days",
      "said nis",
      "nis request",
      "serbian government",
      "45 days",
      "oil croatia",
      "oops something"
    ]
  },
  {
    "title": "L3Harris forecasts upbeat annual sales on strong defense demand",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/l3harris-forecasts-upbeat-annual-sales-130819150.html",
    "publishedAt": "2025-01-30T13:08:19Z",
    "sentences": [
      "Oops, something went wrong (Reuters) - L3Harris Technologies forecast 2025 sales above estimates and posted higher-than-expected fourth-quarter results on Thursday, bolstered by strong demand for weapons due to higher defense spending amid global geopolitical tensions.",
      "Demand for arms and military equipment has ballooned as a result of the Russia-Ukraine war and ongoing conflicts in the Middle East, benefiting defense contractors such as L3Harris.",
      "The company also raised its cost-saving goal to $1.2 billion by the end of 2025, a year ahead of its previously disclosed timeline.",
      "L3Harris said it had achieved $800 million in cost savings in 2024.",
      "A slower recovery in supply chain issues has led to higher costs, denting margins and leading companies in the sector to look for other ways to cut expenses.",
      "Last year, L3Harris cut 5% of its workforce, or about 2,500 employees, as part of a cost-saving measure.",
      "L3Harris reported a per-share adjusted profit of $3.47 for the quarter, surpassing analysts' average estimate of $3.42, according to data compiled by LSEG.",
      "Revenue rose 3% to $5.52 billion, while analysts had expected $5.50 billion.",
      "The defense contractor, which makes solid rocket motors used in missiles on the battlefield in Ukraine, said it expects 2025 sales in the range of $21.8 billion to $22.2 billion, the midpoint of which is above expectations of $21.86 billion.",
      "(Reporting by Utkarsh Shetti in Bengaluru) Sign in to access your portfolio"
    ],
    "topics": [
      "2025 sales",
      "oops something",
      "something went",
      "went wrong",
      "wrong reuters",
      "reuters l3harris",
      "l3harris technologies",
      "technologies forecast",
      "forecast 2025",
      "sales estimates"
    ]
  },
  {
    "title": "Iran confirms Sukhoi-35 jet deal as military cooperation with Russia expands",
    "source": "BOL News",
    "url": "https://www.bolnews.com/international/2025/01/iran-confirms-sukhoi-35-jet-deal-as-military-cooperation-with-russia-expands/",
    "publishedAt": "2025-01-28T14:12:58Z",
    "sentences": [
      "28th Jan, 2025.",
      "07:12 pm Share Listen Font size Dark Mode Save Print Iran confirms Sukhoi-35 iet deal as military cooperation with Russia expands Iran has officially confirmed the purchase of Russian-made Sukhoi-35 fighter jets, as announced by a senior commander of the Revolutionary Guards on Monday.",
      "According to sources, Ali Shadmani did not reveal how many jets were purchased or their delivery status.",
      "He emphasized Iran’s commitment to strengthening its air, land, and naval forces, saying the production of military equipment has also been accelerated.",
      "Shadmani issued a warning to Israel, stating that any hostile actions would result in severe retaliation, leaving no Israeli interests in the occupied territories safe.",
      "In November 2023, Iran’s news agency reported that the deal for the Sukhoi-35 jets had been finalized.",
      "This comes as part of a broader strategic partnership between Iran and Russia, which focuses on enhancing military and technical cooperation, though specific arms transfers were not mentioned.",
      "Catch all the International News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "bol news",
      "28th jan",
      "jan 2025",
      "2025 pm",
      "pm share",
      "share listen",
      "listen font",
      "font size",
      "size dark",
      "dark mode"
    ]
  },
  {
    "title": "Kazakhstan's daily oil output at record high amid Chevron-led expansion",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/kazakhstans-daily-oil-output-record-114304809.html",
    "publishedAt": "2025-01-27T11:43:04Z",
    "sentences": [
      "Oops, something went wrong MOSCOW (Reuters) - Oil production in Kazakhstan reached a daily record high of 278,499 metric tons on Sunday just after it embarked on an expansion of its largest oilfield, Chevron-led Tengiz, according to official data.",
      "Kazakhstan - which relies on Tengiz and two other major fields, Karachaganak and Kashagan, for most of its production - is subject to output targets as a member of OPEC+, an alliance of OPEC and other top producers led by Russia OPEC+ has named top 10 global oil producer Kazakhstan along with Iraq and Russia as countries that have repeatedly failed to comply with pledges to curb oil production.",
      "Sunday's record high Kazakh output equates to around 2 million barrels per day (bpd) if a barrels per ton ratio of 7.5 is applied.",
      "According to the Situational and Analytical Center for the Fuel and Energy Complex, this was 10.5% more than on the same day of 2024.",
      "The expansion at Tengiz is expected to reach full capacity of 260,000 bpd by June, lifting overall production at the project to around 1 million barrels of oil equivalent per day.",
      "Tengiz is one of the world's deepest and most complex fields due to high levels of sulphur and harsh weather conditions.",
      "Kazakhstan plans to boost its oil and gas condensate production this year to 96.2 million tons from 87.56 million tons in 2024.",
      "(Reporting by Reuters; Editing by Mark Potter) Sign in to access your portfolio"
    ],
    "topics": [
      "oil production",
      "record high",
      "million barrels",
      "barrels per",
      "per day",
      "million tons",
      "oops something",
      "something went",
      "went wrong",
      "wrong moscow"
    ]
  },
  {
    "title": "The Russian war economy is facing a ‘moment of truth’ as Putin’s dwindling cash reserves raise odds of a financial crash, expert says",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/russian-war-economy-facing-moment-223309337.html",
    "publishedAt": "2025-01-26T22:33:09Z",
    "sentences": [
      "Oops, something went wrong Nearly three years after Russia invaded Ukraine, Vladimir Putin’s economy is entering a critical phase as inflation, shortages, and shrinking cash reserves constrain his war effort soon, a Russia expert said.",
      "Russia’s economy is facing a “moment of truth” as high inflation, an ailing private sector, and critical shortages are poised to constrain Vladimir Putin’s war on Ukraine, according to economist and author Anders Åslund.",
      "Nearly three years after launching its invasion, Russia is headed for stagflation, meaning high inflation combined with minimal growth, he wrote at Project Syndicate on Jan. 14.",
      "While official statistics show inflation quickened to an annual pace of 9.5% in December from 8.9% in November, other measures suggest it’s far higher.",
      "For example, independent research firm Romir has calculated that prices for a basket of certain consumer goods jumped by 22% in September.",
      "“His war on Ukraine has caused both high and rising prices and labor shortages, because many workers have been mobilized or killed, while many others have fled the country,” said Åslund, who wrote Russia’s Crony Capitalism: The Path From Market Economy to Kleptocracy.",
      "Meanwhile, defense spending is rising while the government’s ability to raise funds via tax hikes and bond offerings is limited, he added.",
      "That leaves Moscow’s oft-tapped National Wealth Fund, which has already seen liquid assets plunge to $31 billion from $117 billion before the war, to fill any gaps.",
      "Åslund estimated that what’s left in the fund is only enough to finance three-quarters of Russia’s budget deficit this year.",
      "On top of that, the ruble’s recent plunge is adding inflationary pressure, and exports are unlikely to offer much help, he said.",
      "Sanctions that are keeping Western technology out of Russia are weighing on businesses as well.",
      "“Strained by these factors, the Russian economy is approaching its moment of truth,” Åslund wrote.",
      "“Inflation will continue to rise in 2025, and people will get even angrier over higher food prices.",
      "Major bankruptcies are looming, and the Russian state cannot afford large bailouts.",
      "Business leaders are fiercely objecting to high interest rates, and the shortage of labor—and soldiers—is reaching a crisis stage.” The worst shortage, however, is budget cash as liquid reserves are on pace to run out this fall, he predicted.",
      "By then, budget cuts will be necessary, while the Kremlin may have to resort to the “Soviet sins” of price controls and rationing.",
      "“As the risk of a financial crash rises, Russia’s imperiled economy is about to pose serious constraints on Putin’s war,” he added.",
      "Åslund and other Russia watchers have previously said that the economy will be unable to sustain the war on Ukraine for much longer.",
      "For instance, Russia already can’t manufacture certain weapons at a high enough rate to replace battlefield losses and is dipping into Cold War–era inventories.",
      "That means Russia may not be able to wage war beyond late 2025, when it will begin running out of key weapons.",
      "But Alexandra Prokopenko, a fellow at the Carnegie Russia Eurasia Center and former Russian central bank advisor, said economic challenges aren’t yet severe enough to force a quick end to the war.",
      "To be sure, the economy is struggling and Putin’s guns-and-butter strategy is unsustainable, she wrote in Foreign Affairs magazine on Tuesday.",
      "But the West is betting on false hopes.",
      "“For at least the next year, the Kremlin should be able to keep its overheating economy from exploding into a full-blown crisis,” Prokopenko said.",
      "“Putin will likely still have the resources to sustain his brutal campaign in Ukraine—and perhaps the incentive to wait out the West.” This story was originally featured on Fortune.com Sign in to access your portfolio"
    ],
    "topics": [
      "war ukraine",
      "nearly three",
      "three years",
      "vladimir putin",
      "moment truth",
      "high inflation",
      "putin war",
      "åslund wrote",
      "oops something",
      "something went"
    ]
  },
  {
    "title": "Oil prices decreases as Russia sanctions stay in focus",
    "source": "BOL News",
    "url": "https://www.bolnews.com/pakistan/2025/01/oil-prices-decreases-as-russia-sanctions-stay-in-focus/",
    "publishedAt": "2025-01-14T16:46:35Z",
    "sentences": [
      "14th Jan, 2025.",
      "09:46 pm Share Listen Font size Dark Mode Save Print Oil prices decreases as Russia sanctions stay in focus Oil prices dropped on Tuesday from the previous day’s four-month highs, but the market remained supported by ongoing concerns about the impact of new US sanctions on Russian oil exports to major buyers, India and China.",
      "Brent crude futures fell by 58 cents, or 0.72%, to $80.43 per barrel by 1421 GMT, while U.S. West Texas Intermediate (WTI) crude dropped 62 cents, or 0.79%, to $78.20 per barrel.",
      "Prices surged 2% on Monday after the U.S. Treasury Department imposed sanctions on Gazprom Neft and Surgutneftegas, along with 183 vessels involved in Russia’s shadow fleet of oil tankers.",
      "Charalampos Pissouros, a senior investment analyst at XM brokerage, noted, “As several nations seek alternative fuel supplies to cope with the sanctions, there could be further price advancements, even if prices correct a bit lower following tomorrow’s U.S. CPI data, should it come in hotter than expected.” While analysts anticipated a significant impact on Russian oil supplies from the new sanctions, they suggested the effect on the physical market might not be as pronounced as initially thought.",
      "ING analysts estimated that the new sanctions could erase the 700,000 barrel-per-day surplus they had predicted for this year, but they believed the actual reduction in flows would likely be less, as Russia and its buyers find ways to circumvent the sanctions.",
      "Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "oil prices",
      "russian oil",
      "cents per",
      "per barrel",
      "sanctions could",
      "new sanctions",
      "bol news",
      "14th jan",
      "jan 2025",
      "2025 pm"
    ]
  },
  {
    "title": "Oil prices jump to 5-month high over increasing worries of supply crunch stemming from sanctions",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/oil-prices-jump-to-5-month-high-over-increasing-worries-of-supply-crunch-stemming-from-sanctions-182258000.html",
    "publishedAt": "2025-01-13T18:22:58Z",
    "sentences": [
      "Oops, something went wrong Oil extended gains to hit a five-month high on Monday as worries grew over supply disruptions impacting big importers China and India following wide-ranging sanctions against Russian crude.",
      "West Texas Intermediate crude (CL=F) rose nearly 3% to settle at $78.82 per barrel, the highest level since August, while Brent futures (BZ=F) settled at $81.01.",
      "The move higher comes after almost a 4% surge on Friday in reaction to wide-ranging sanctions against Moscow imposed by the US, targeting oil executives, traders, and more than 180 vessels, bringing the total number of ships sanctioned to 451, according to JPMorgan analysis.",
      "\"There are indications that, similar to Indian refiners who avoid taking Russian oil in tankers under sanctions or in ships insured by sanctioned Russian insurers, China is also becoming a less-permissive buyer,\" JPMorgan head of global commodities research Natasha Kaneva wrote in a recent note.",
      "Despite the recent rally, Kaneva and her team expect Brent prices to average $73 for 2025.",
      "Oil has been on an upward trend since the start of the year, with WTI gaining nearly 8% while Brent has surged almost 7% amid colder-than-expected temperatures and falling stockpiles.",
      "\"The low temperatures have heightened energy demand for heating, leading to increased consumption of fossil fuels,\" Antonio Di Giacomo, senior market analyst at foreign exchange trading platform XS.com, said in a recent note.",
      "The Organization of Oil Producing Countries and their allies, or OPEC+, have signaled more barrels will be added to the market later this year when they begin to unwind their production cuts.",
      "The move was repeatedly postponed last year.",
      "Ines Ferre is a senior business reporter for Yahoo Finance.",
      "Follow her on X at @ines_ferre.",
      "Click here for in-depth analysis of the latest stock market news and events moving stock prices Read the latest financial and business news from Yahoo Finance Sign in to access your portfolio"
    ],
    "topics": [
      "recent note",
      "yahoo finance",
      "oops something",
      "something went",
      "went wrong",
      "wrong oil",
      "oil extended",
      "extended gains",
      "gains hit",
      "hit high"
    ]
  },
  {
    "title": "Gas pipeline to Turkey targeted by Ukraine, claims Russia",
    "source": "BOL News",
    "url": "https://www.bolnews.com/international/2025/01/gas-pipeline-to-turkey-targeted-by-ukraine-claims-russia/",
    "publishedAt": "2025-01-13T16:07:20Z",
    "sentences": [
      "13th Jan, 2025.",
      "09:07 pm Share Listen Font size Dark Mode Save Print Gas pipeline to Turkey targeted by Ukraine, claims Russia On Monday, Russia accused Ukraine of attempting a drone attack on the Turk Stream gas pipeline infrastructure, which transports Russian gas to Europe via Turkey.",
      "According to a statement by Russia’s defense ministry, Ukraine deployed nine drones on January 11 in an effort to disrupt gas supplies to European countries.",
      "The attack targeted a gas compressor station in the village of Gai-Kodzor, near Russia’s southern Black Sea coast.",
      "This facility supplies the TurkStream pipeline.",
      "All the drones were reportedly intercepted and destroyed, with debris causing minor damage to a building and equipment at a gas measuring station.",
      "Despite the attack, the ministry confirmed that the facility remains operational, and gas supplies were not disrupted.",
      "The Turk Stream pipeline, spanning 930 kilometers under the Black Sea, is currently the sole active conduit for Russian gas deliveries to Europe.",
      "It has an annual capacity of 31.5 billion cubic meters and supplies gas through Turkey and the Balkans.",
      "This incident comes amid heightened tensions, with Ukraine halting Russian gas transit on January 1, ending a decades-long route for delivering Russian gas to Europe.",
      "Meanwhile, the European Union has been working to reduce its reliance on Russian energy since Moscow’s full-scale military offensive against Ukraine began in February 2022.",
      "While pipeline imports have decreased, some European nations have increased purchases of Russian liquefied natural gas (LNG), which is transported by sea.",
      "Catch all the International News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "russian gas",
      "gas pipeline",
      "turk stream",
      "gas europe",
      "gas supplies",
      "black sea",
      "bol news",
      "13th jan",
      "jan 2025",
      "2025 pm"
    ]
  },
  {
    "title": "Oil touches $80 per barrel as sweeping sanctions against Russia rattle markets",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/oil-touches-80-per-barrel-as-sweeping-sanctions-against-russia-rattle-markets-162612572.html",
    "publishedAt": "2025-01-10T16:26:12Z",
    "sentences": [
      "Oops, something went wrong Oil prices jumped to a three-month high on Friday, with traders digesting new sweeping sanctions against Russia as the Biden administration tries to cut off Moscow from crude revenue amid the ongoing war in Ukraine.",
      "West Texas Intermediate crude (CL=F) rose more than 3.5% to settle at $76.57 per barrel while Brent crude futures (BZ=F), the international benchmark price, briefly hit $80 before settling at $79.76, the highest level since October.",
      "More than 180 vessels, two oil companies, traders, insurers, and top Russian executives were named in the sanctions.",
      "\"The United States is taking sweeping action against Russia’s key source of revenue for funding its brutal and illegal war against Ukraine,” Secretary of the Treasury Janet Yellen said in a statement.",
      "Oil prices were already on an upward trend since late December, with traders uncertain over President-elect Donald Trump's policy toward Iran.",
      "Tehran currently produces more than 3 million barrels of crude per day.",
      "\"News continues to filter in about [the] Trump administration's hard stance on Iran that may come very quickly,\" Dennis Kissler, senior vice president at BOK Financial, wrote in a note to clients on Friday.",
      "\"Add in the freezing temps across most of the US, along with shrinking storage numbers, and crude has now become a new 'fund favorite,'\" he added.",
      "JPMorgan analysts said global oil demand is expected to remain strong through January due to colder-than-expected weather in the Northern Hemisphere \"boosting heating fuel consumption\" and early travel activities in China for the country's Lunar New Year holiday.",
      "Despite Friday's sharp rise, many analysts expect that oil prices will move lower this year than in 2024.",
      "\"Despite ongoing geopolitical conflicts, a combination of bearish factors will likely keep oil prices structurally low in 2025, with a likely price range of $60-$80 per barrel for Brent spot crude oil.",
      "That would be below the $70-$90 per barrel range that dominated 2024,\" Eurasia Group wrote in a note on Thursday.",
      "Ines Ferre is a senior business reporter for Yahoo Finance.",
      "Follow her on X at @ines_ferre.",
      "Click here for in-depth analysis of the latest stock market news and events moving stock prices Read the latest financial and business news from Yahoo Finance Sign in to access your portfolio"
    ],
    "topics": [
      "oil prices",
      "per barrel",
      "war ukraine",
      "barrel brent",
      "wrote note",
      "yahoo finance",
      "oops something",
      "something went",
      "went wrong",
      "wrong oil"
    ]
  },
  {
    "title": "Oil prices up on tighter OPEC supply, US jobs data",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/oil-prices-tighter-opec-supply-013939663.html",
    "publishedAt": "2025-01-08T01:39:39Z",
    "sentences": [
      "Oops, something went wrong By Nicole Jao NEW YORK (Reuters) -Oil prices fell more than 1% on Wednesday as a stronger dollar and large builds in U.S. fuel inventories last week pressured prices, reversing earlier gains driven by tightening supplies from Russia and other OPEC members.",
      "Brent crude settled down 89 cents, or 1.16%, to $76.23 a barrel.",
      "U.S. West Texas Intermediate crude fell 93 cents, or 1.25%, to $73.32.",
      "Both benchmarks had risen more than 1% earlier in the session.",
      "\"The oil market is being weighed down by the significant increases in gasoline and diesel inventories that we've seen over the last couple of weeks,\" said Andrew Lipow, president of Lipow Oil Associates.",
      "Fuel inventories swelled as refiners continued ramping up production, he added.",
      "Gasoline stocks rose by 6.3 million barrels last week to 237.7 million barrels, compared with analysts' expectations in a Reuters poll for a 1.5 million-barrel build, according to data released on Wednesday from the U.S. Energy Information Administration.",
      "Distillate stockpiles rose by 6.1 million barrels in the week to 128.9 million barrels, versus expectations for a 600,000-barrel rise.",
      "\"I would be concerned if we saw more substantial products builds over the next few weeks.",
      "And in the meantime, the cold snap could constrain crude oil supply and increase heating oil demand,\" said Josh Young, chief investment officer at Bison Interests.",
      "Crude inventories fell by 959,000 barrels to 414.6 million barrels in the week, compared with analysts' expectations for a 184,000-barrel draw.",
      "A stronger dollar also pressured prices by making oil more expensive for holders of other currencies.",
      "Limiting the losses, oil output from the Organization of the Petroleum Exporting Countries fell in December after two months of increases as field maintenance in the United Arab Emirates offset a Nigerian output hike and gains elsewhere in the group.",
      "In Russia, oil output averaged 8.971 million barrels a day in December, below the country's target, Bloomberg reported, citing the energy ministry.",
      "Analysts expect oil prices to be down on average this year from 2024 due in part to production increases from non-OPEC countries.",
      "\"We are holding to our forecast for Brent crude to average $76/bbl in 2025, down from an average of $80/bbl in 2024,\" BMI, a division of Fitch Group, said in a client note.",
      "(Reporting by Nicole Jao in New York, Katya Golubkova in Tokyo, Jeslyn Lerh in Singapore and Arunima Kumar in Bengaluru; Editing by Elaine Hardcastle, Nick Zieminski and Nia Williams) Sign in to access your portfolio"
    ],
    "topics": [
      "million barrels",
      "nicole jao",
      "jao new",
      "new york",
      "stronger dollar",
      "fuel inventories",
      "last week",
      "pressured prices",
      "brent crude",
      "rose million"
    ]
  },
  {
    "title": "Russia's new car sales up 47% in 2024, agencies cite industry ministry",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/russias-car-sales-47-2024-085540545.html",
    "publishedAt": "2025-01-04T08:55:40Z",
    "sentences": [
      "Oops, something went wrong (Reuters) - Sales of new passenger cars in Russia increased by 47% year on year to 1.55 million units in 2024, Russian news agencies reported on Saturday, citing industry and trade ministry data.",
      "New sales in 2025 are seen dropping by around 10% to 1.43 million units, Sergei Tselikov, head of Russian analytical agency Autostat, said in December, as high inflation and scrappage fees push prices up.",
      "Moscow's invasion of Ukraine in February 2022 drastically reshaped Russia's car market, with Western carmakers abandoning the country and Chinese ones swooping in to plug the production gap.",
      "Sales slumped in 2022 but have been steadily recovering.",
      "(Reporting by Alexander Marrow; Editing by Toby Chopra) Sign in to access your portfolio"
    ],
    "topics": [
      "million units",
      "oops something",
      "something went",
      "went wrong",
      "wrong reuters",
      "reuters sales",
      "sales new",
      "new passenger",
      "passenger cars",
      "cars russia"
    ]
  },
  {
    "title": "Shafqat Ali Khan appointed as foreign office spokesperson",
    "source": "BOL News",
    "url": "https://www.bolnews.com/pakistan/2025/01/shafqat-ali-khan-appointed-as-foreign-office-spokesperson/",
    "publishedAt": "2025-01-02T15:09:12Z",
    "sentences": [
      "02nd Jan, 2025.",
      "08:09 pm Share Listen Font size Dark Mode Save Print Shafqat Ali Khan appointed as foreign office spokesperson Career diplomat and former ambassador to Russia Shafqat Ali Khan on Thursday was appointed the new spokesperson for the Ministry of Foreign Affairs.",
      "Shafqat has been appointed as the new spokesperson for Pakistan’s Foreign Office, replacing Mumtaz Zahra Baloch, who has been designated as the country’s ambassador to France.",
      "Deputy Prime Minister and Foreign Minister Ishaq Dar announced the appointment during a press conference.",
      "He commended Mumtaz Baloch’s contributions as the outgoing spokesperson and stated that her posting as ambassador to France was a recognition of her exemplary service.",
      "Mumtaz Baloch initially assumed the role of Foreign Office spokesperson in November 2022, succeeding senior diplomat Asim Iftikhar Ahmed, who was also posted as ambassador to Paris.",
      "Interestingly, she has now replaced Iftikhar once again, as he has taken charge as the additional permanent representative (APR) of Pakistan at the United Nations headquarters in New York.",
      "Currently serving as additional secretary for Europe in the Ministry of Foreign Affairs, Shafqat Ali Khan has served as Pakistan’s ambassador to Russia and Poland, DG Europe at MoFA and deputy permanent representative to the United Nations in Geneva.",
      "Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "shafqat ali",
      "ali khan",
      "foreign office",
      "office spokesperson",
      "ambassador russia",
      "appointed new",
      "new spokesperson",
      "ministry foreign",
      "foreign affairs",
      "affairs shafqat"
    ]
  },
  {
    "title": "Shafqat Ali Khan appointed new MoFA spokesperson",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1267904-shafqat-ali-khan-appointed-new-mofa-spokesperson",
    "publishedAt": "2025-01-01T19:00:00Z",
    "sentences": [
      "ISLAMABAD: Shafqat Ali Khan, a career diplomat and former ambassador to Russia, was appointed as the Ministry of Foreign Affairs' new spokesperson on Thursday.",
      "The new spokesperson has replaced Mumtaz Zahra Baloch who has been posted as the country's ambassador to France.",
      "Deputy Prime Minister and Foreign Minister Ishaq Dar, during a press conference, made the announcement of Shafqat's appointment.",
      "He also hailed the services of the outgoing spokesperson, saying that in recognition of her services, the Government of Pakistan had posted her as Pakistan’s ambassador to France.",
      "Baloch was appointed as the Foreign Office spokesperson in November 2022, replacing senior diplomat Asim Iftikhar Ahmed who was also given the ambassadorial job in Paris.",
      "She has once again replaced him as Iftikhar has assumed charge as additional permanent representative (APR) of Pakistan at the United Nations (UN) headquarters in New York.",
      "Currently serving as additional secretary for Europe in the Ministry of Foreign Affairs, Shafqat Ali Khan has served as Pakistan’s ambassador to Russia and Poland, DG Europe at MoFA and deputy permanent representative to the United Nations in Geneva.",
      "Efforts to contain the flames underway while blaze has been extinguished at some of the sites “Deeply saddened by the tragic loss of lives due to landslides in Guizhou,\" says premier Remarks, replete with misrepresentations, inflammatory rhetoric, clearly aimed at stoking regional tensions, says FO \"India will never forget this defeat.",
      "And InshaAllah, the day will dawn when Kashmir becomes part of Pakistan,” says... Pakistan will have to pay a heavy price for every terrorist attack, warns Modi at a public rally in Rajasthan Imran Khan ready to hold negotiations for sake of Pakistan, says chief minister"
    ],
    "topics": [
      "shafqat ali",
      "ali khan",
      "ambassador russia",
      "ministry foreign",
      "foreign affairs",
      "new spokesperson",
      "ambassador france",
      "pakistan ambassador",
      "permanent representative",
      "united nations"
    ]
  },
  {
    "title": "Moscow, Kyiv end Russian gas transit to Europe via Ukraine",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1267531-moscow-kyiv-end-russian-gas-transit-to-europe-via-ukraine",
    "publishedAt": "2024-12-31T19:00:00Z",
    "sentences": [
      "Russia's gas transit to Europe via Ukraine stopped on Wednesday, Moscow and Kyiv said, ending a decades-long arrangement and marking the latest casualty of the war between the neighbours.",
      "Russian gas has been supplied to Europe via pipelines crossing Ukraine since the end of the Soviet Union in 1991 in an arrangement that earned revenues for Moscow from the gas and for Kyiv from the transit fees.",
      "The latest transit contract expired on Wednesday with Ukraine opting not to extend the deal following Russia's 2022 invasion.",
      "Russian gas accounted for less than 10% of the European Union's gas imports in 2023 — down from more than 40% before the war.",
      "But some EU members, mostly in the east, still depend heavily on Russian gas for geographical and political reasons.",
      "\"We have stopped the transit of Russian gas,\" Ukraine's Energy Minister German Galushchenko said in a statement, calling it \"a historical event.\"",
      "\"Russia is losing its markets, it will suffer financial losses,\" he added Russia's Gazprom energy giant said in a separate statement that \"Russian gas has not been supplied for transit via Ukraine since 8:00am (0500 GMT)\".",
      "It said it had lost the \"technical and legal right\" to ship its gas across Ukraine to Europe.",
      "European natural gas prices climbed above 50 euros ($51.78) per megawatt hour for the first time in over a year on Tuesday as buyers in Eastern Europe braced for the halt in supplies.",
      "EU and NATO members Hungary and Slovakia have maintained close ties with the Kremlin despite the invasion.",
      "The halt in Russian gas transit through Ukraine will force some countries to dip deeper into their reserves and seek to import more liquefied natural gas (LNG).",
      "But Hungary is set to be largely unaffected by the move, as it receives most of its Russian gas via the Black Sea pipeline, an alternative route that bypasses Ukraine by running via Turkey and up through the Balkans.",
      "Brussels has downplayed the impact the loss of Russian gas supply will have on the 27-member bloc.",
      "\"The Commission has been working for more than a year specifically on preparing for a scenario without Russian gas transiting via Ukraine,\" it told AFP on Tuesday.",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "russian gas",
      "via ukraine",
      "gas transit",
      "europe via",
      "gas supplied",
      "ukraine since",
      "natural gas",
      "russia gas",
      "transit europe",
      "ukraine stopped"
    ]
  },
  {
    "title": "Russia unveils anti-fraud measures for the digital ruble, including a two-day transaction freeze",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/russia-unveils-anti-fraud-measures-231656360.html",
    "publishedAt": "2024-12-29T23:16:56Z",
    "sentences": [
      "Oops, something went wrong Starting February 2025, Russian banks will acquire a new tool to combat suspected fraud involving the digital ruble, Russia’s new central bank digital currency (CBDC).",
      "Banks will have the capability to freeze digital ruble transactions for a maximum of 48 hours if they believe a fraud is taking place.",
      "The measure offers Russian banks enhanced protection to temporarily suspend transactions involving the CBDC.",
      "Customers will be notified about possible fraud, giving them 24 hours to confirm or decline the CBDC transaction.",
      "In the United States, CBDCs have attracted widespread criticism among crypto enthusiasts, who fear their potential to introduce financial surveillance and erode privacy.",
      "Earlier this year, U.S. president-elect Donald Trump tapped into this fear by pledging to \"never allow the creation of a central bank digital currency.” “Such a currency would give a federal government – our federal government – absolute control over your money,\" Trump said about the risks of the nascent technology.",
      "\"They could take your money, and you wouldn’t even know it was gone.\"",
      "This year, Texas senator Ted Cruz and several Republican senators introduced the CBDC Anti-Surveillance State Act, a bill to stop the federal government from launching a retail CBDC in America.",
      "“The Biden administration salivates at the thought of infringing on our freedom and intruding on the privacy of citizens to surveil their personal spending habits, which is why Congress must clarify that the Federal Reserve has no authority to implement a CBDC,” Cruz said.",
      "The legislation represents the third time Cruz has filed legislation to stop the federal government from establishing a CBDC in the United States.",
      "While the U.S. is still exploring the potential applications of a CBDC, there are no formal plans to introduce one.",
      "Globally, however, a survey indicates that nearly a third of central banks are pursuing CBDC projects.",
      "Sign in to access your portfolio"
    ],
    "topics": [
      "federal government",
      "russian banks",
      "digital ruble",
      "central bank",
      "bank digital",
      "digital currency",
      "united states",
      "stop federal",
      "oops something",
      "something went"
    ]
  },
  {
    "title": "Azerbaijan demands Russia admit it shot down passenger plane",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1266852-azerbaijan-demands-russia-admit-it-shot-down-passenger-plane",
    "publishedAt": "2024-12-29T19:00:00Z",
    "sentences": [
      "BAKU: Azerbaijani President Ilham Aliyev on Sunday demanded that Russia admit that it fired at an Azerbaijan Airlines passenger jet before it crashed, accusing Moscow of initially trying to cover up the cause of the fatal disaster.",
      "Aliyev accused in an interview to state media at Baku airport four days after the AZAL Embraer 190 plane crashed in Kazakhstan, killing 38 of the 67 people on board.",
      "Azerbaijani officials have suggested that a Russian air-defence system hit the aircraft as it tried to land in Grozny, the capital of the Russian Republic of Chechnya.",
      "On Sunday, the Kazakhstan transport ministry said that the aeroplane’s black box would be sent for analysis to Brazil, which manufactures the Embraer plane.",
      "Aliyev’s unusually forthright accusation of his country’s traditional ally came a day after he spoke by telephone to Russian President Vladimir Putin.",
      "A Kremlin statement about the phone call did not indicate that Putin had claimed responsibility for the crash.",
      "“The facts are that the Azerbaijani civilian plane was damaged from the outside over Russian territory, near the city of Grozny, and almost lost control,” Aliyev told state television.",
      "“We also know that electronic warfare systems put our plane out of control... At the same time, as a result of fire from the ground, the tail of the plane was also severely damaged,” he said.",
      "Aliyev said that while “our plane was hit by accident”, Baku was angry that Moscow had tried to hide the cause of the crash and demanded its ally admit responsibility.",
      "He said it was “regrettable and surprising” that Moscow “put forward theories” that, he said, “clearly showed the Russian side wanted to cover up the issue”.",
      "“For the first three days, we heard nothing from Russia except some absurd theories,” he said, adding that these included the plane hitting a flock of birds.",
      "He called the theory “completely removed” from reality, pointing out that the plane’s “fuselage is riddled with holes”.",
      "Russia has said that Grozny was being attacked by Ukrainian drones the day that the AZAL flight tried to land.",
      "Aliyev urged Moscow to publicly apologise to his country, saying Baku had made official “demands” to Russia two days ago.",
      "“First, the Russian side must apologise to Azerbaijan.",
      "“Second, it must acknowledge its guilt.",
      "“Third, those responsible must be punished, brought to criminal responsibility, and compensation must be paid to the Azerbaijani state, as well as to the injured passengers and crew members.",
      "“These are our conditions,” Aliyev said, in unusually strong language directed at Moscow.",
      "The Kremlin on Saturday said that during their phone conversation, Putin had apologised to Azerbaijan over the “tragic incident”.",
      "Putin said Russian air defence was operating in Grozny on December 25 when the plane tried to land, before diverting and crashing in western Kazakhstan.",
      "The Kremlin statement did not indicate that Putin had said Russia was at fault.",
      "Later on Saturday, the Russian leader called for a “transparent” probe into the crash.",
      "Russian news agencies reported that Putin and Aliyev discussed the crash again on Sunday.",
      "The United States this week said that it had “early indications” that Russia was responsible for the crash but did not provide details.",
      "Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
    ],
    "topics": [
      "tried land",
      "kremlin statement",
      "indicate putin",
      "aliyev said",
      "theories said",
      "russian side",
      "putin said",
      "baku azerbaijani",
      "azerbaijani president",
      "president ilham"
    ]
  },
  {
    "title": "‘2nd highest mercury recorded in Asia in 2023’",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1267109-2nd-highest-mercury-recorded-in-asia-in-2023",
    "publishedAt": "2024-12-29T19:00:00Z",
    "sentences": [
      "Islamabad: Dr Liudmila Kolomeets from World Meteorological Organisation (WMO), Russia, has said that 2023’s mean temperature was the second highest recorded in Asia.",
      "Dr Kolomeets was delivering keynote address at a webinar on ‘State of the Climate Change in Asia 2023’ organised here by Institute of Regional Studies (IRS), Dr Kolomeets discussed concerning trends in findings from WMO.",
      "Additionally, she noted anomalies in precipitation and snow coverage and the ongoing increase in glacial loss in the South Asian region.",
      "Dr Fahad Saeed, a South Asian regional climate scientist from Climate Analytics, highlighted Pakistan's pivotal geolocation, a convergence point for summer monsoons and winter western disturbances.",
      "This positioning makes the country especially susceptible to climate variations evident in events such as the 2022 floods, Glacial Lake Outburst Floods (GLOFs) and heatwaves, he said adding that there was a great need of integrating scientific insights into decision-making at national, subnational, and local levels.",
      "Jauhar Saleem, president, IRS, observed that the narrative of climate change reveals deep-seated inequality.",
      "Drawing from his experience representing Pakistan at forums like the United Nations Framework Convention on Climate Change (UNFCCC), he noted the stark disparity in climate change effects between developing and developed nations.",
      "He emphasised the slow progress seen in past Conferences of Parties (COPs) and called for enhanced collaboration to address humanity’s greatest existential threat.",
      "Talha Tufail Bhatti from IRS noted that this year’s COP financial targets disappointed developing nations.",
      "With at least 10 countries experiencing extreme temperatures over 50°C and economic losses reaching $202.7 billion in 2023, the pledges were insufficient.",
      "He said that there is a need for swift and ambitious action from the international community, based on the experts' insights.",
      "Edwardes College Peshawar seen in this image.",
      "— Facebook/Edwardes College Peshawar/FileRawalpindi:The elections for... A young boy collects recycling items from road sides in Islamabad to sell for earning daily wages, on June 11, 2022.... India's Prime Minister Narendra Modi attends a meeting with former US President Donald Trump and Japanese Prime...",
      "This image shows Pakistani and France flags.— APP/FileIslamabad:Chairman/CEO of Global Trade Expo Centre Pakistan,...",
      "The Millennium Universal College TMUC building.— herts.ac.uk/File Islamabad:The Millennium Universal College TMUC... Federal Minister for Climate Change and Environmental Coordination, Dr Musadik Malik in a meeting with the Ambassador..."
    ],
    "topics": [
      "climate change",
      "dr kolomeets",
      "south asian",
      "millennium universal",
      "universal college",
      "college tmuc",
      "islamabad dr",
      "dr liudmila",
      "liudmila kolomeets",
      "kolomeets world"
    ]
  },
  {
    "title": "Russia bans crypto mining in several regions until 2031",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/russia-bans-crypto-mining-several-200313048.html",
    "publishedAt": "2024-12-28T20:03:13Z",
    "sentences": [
      "Oops, something went wrong Russia has banned crypto mining in ten key regions of the country until 2031, citing its high energy consumption, according to Russian news sources.",
      "Dagestan, North Ossetia, and Chechnya are among the regions impacted by the new ban, which will start January 1, 2025 and stay in effect for the next six years.",
      "The ban will end on March 2031, and primarily disrupt mining pools and independent miners.",
      "In November, new crypto legislation went into effect in Russia requiring miners to register with the finance ministry.",
      "Earlier this year, regions like Dagestan were the site of rolling electricity blackouts, partly due to crypto mining, which consumes a significant amount of energy.",
      "This year alone, bitcoin mining used roughly 17% of the country's energy, according to one estimate.",
      "While Russia has moved to levy restrictions on the industry, it has spurred some miners to move underground.",
      "“The owners of illegal cryptocurrency mining installations are coming up with new methods of 'circumventing' the law - they install mining farms underground,\" Abdulmuslim Abdulmuslimov, Dagestan’s prime minister, told Reuters.",
      "In the past, Russia prohibited cryptocurrency as a payment method but still allowed it for cross-border payments.",
      "As the war in Ukraine escalates, Russia's alleged use of crypto to evade sanctions has gained renewed prominence, prompting the U.S. to increasingly target crypto transactions originating from Russia.",
      "This past July, Russia unveiled a new law greenlighting the use of crypto for international trade.",
      "The legislation allows the country's central bank to establish \"experimental\" infrastructure for crypto transactions.",
      "\"We are taking a historic decision in the financial sphere,\" said the head of the Russian parliament's finance committee Anatoly Aksakov about the move.",
      "Sign in to access your portfolio"
    ],
    "topics": [
      "crypto mining",
      "use crypto",
      "crypto transactions",
      "oops something",
      "something went",
      "went wrong",
      "wrong russia",
      "russia banned",
      "banned crypto",
      "mining ten"
    ]
  },
  {
    "title": "Russia to scrap unilateral missile moratorium: Lavrov",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1266828-russia-to-scrap-unilateral-missile-moratorium-lavrov",
    "publishedAt": "2024-12-28T19:00:00Z",
    "sentences": [
      "MOSCOW:Russia will scrap a moratorium on the deployment of intermediate and shorter range nuclear-capable missiles because the United States has deployed such weapons in various regions around the world, Russian Foreign Minister Sergei Lavrov said on Sunday.",
      "Russia’s move, long signalled, will kill off all that remains from one of the most significant arms control treaties of the Cold War, amid fears that the world’s two biggest nuclear powers could be entering a new arms race together with China.",
      "Russia and the United States, who both admit their relations are worse than at any time since the depths of the Cold War, have both expressed regret about the disintegration of the tangle of arms control treaties which sought to slow the arms race and reduce the risk of nuclear war.",
      "Asked by state news agency RIA if Russia could withdraw from the New START treaty before its expiry in February 2026, Lavrov said that there were currently “no conditions” for a strategic dialogue with Washington.",
      "“Today it is clear that, for example, our moratorium on the deployment of short- and intermediate-range missiles is no longer practically viable and will have to be abandoned,” Lavrov said.",
      "“The U.S. has arrogantly ignored the warnings of Russia and China and in practice has moved on to the deployment of weapons of this class in various regions of the world.” The Intermediate-range Nuclear Forces (INF) Treaty, signed by Mikhail Gorbachev and Ronald Reagan in 1987, marked the first time the superpowers had agreed to reduce their nuclear arsenals and eliminated a whole category of nuclear weapons.",
      "The United States under former President Donald Trump formally withdrew from the INF Treaty in 2019 after saying that Moscow was violating the accord, an accusation the Kremlin repeatedly denied and dismissed as a pretext.",
      "Russia then imposed a moratorium on its own development of missiles previously banned by the INF treaty - ground-based ballistic and cruise missiles with ranges of 500 km to 5,500 km (310 miles to 3,417 miles).",
      "Trump in 2018 said he wanted to terminate the INF Treaty because of what he said were years of Russian violations and his concerns about China’s intermediate-range missile arsenal.",
      "The United States publicly blamed Russia’s development of the 9M729 ground-launched cruise missile, known in NATO as the SSC-8, as the reason for it leaving the INF Treaty.",
      "In his moratorium proposal, Putin suggested Russia could agree not to deploy the missiles in its Baltic coast exclave of Kaliningrad.",
      "Since leaving the pact, the United States has tested missiles with a similar profile.",
      "Russia fired a new intermediate-range hypersonic ballistic missile known as “Oreshnik”, or Hazel Tree, at Ukraine on Nov. 21 in what Putin said was a direct response to strikes on Russia by Ukrainian forces with U.S. and British missiles.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "united states",
      "inf treaty",
      "lavrov said",
      "moratorium deployment",
      "various regions",
      "arms control",
      "control treaties",
      "cold war",
      "arms race",
      "russia could"
    ]
  },
  {
    "title": "Putin apologises to Azerbaijan over passenger plane crash",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1266536-putin-apologises-to-azerbaijan-over-passenger-plane-crash",
    "publishedAt": "2024-12-28T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia’s Vladimir Putin on Saturday apologised to Azerbaijan’s President Ilham Aliyev for a “tragic incident” which happened in Russian airspace involving an Azerbaijan Airlines passenger plane that crashed on Wednesday.",
      "Putin called Aliyev as speculation grew that Russian air defence may have accidentally shot down the plane, which crashed in western Kazakhstan, killing 38 people while 28 survived.",
      "Flight J2-8243 crashed in a ball of fire near the city of Aktau in Kazakhstan after diverting from southern Russia where Ukrainian drones were reported to be attacking several cities.",
      "The Russian leader did not claim responsibility for crash, while apologising to Aliyev that the incident took place in Russian airspace.",
      "“(President) Vladimir Putin apologised for the tragic incident that occurred in Russian airspace and once again expressed his deep and sincere condolences to the families of the victims and wished a speedy recovery to the injured,” the Kremlin said in a statement.",
      "“It was noted in the conversation that the Azerbaijani passenger aircraft, which was travelling according to its schedule, repeatedly tried to land at Grozny airport.",
      "At that time, Grozny, Mozdok and Vladikavkaz were being attacked by Ukrainian unmanned aerial vehicles, and Russian air defence systems repelled these attacks,” the Kremlin said.",
      "The Kremlin said the call took place at Putin’s request.",
      "Azerbaijan’s president had noted that the plane had been “subjected to external physical and technical interference in Russian airspace, resulting in a complete loss of control and redirection to the Kazakh city of Aktau,” according to Azerbaijan’s presidential office.",
      "The Embraer EMBR3.SA passenger jet had flown from Azerbaijan’s capital Baku to Grozny, in Russia’s southern Chechnya region, before veering off hundreds of miles across the Caspian Sea.",
      "Statements by Azerbaijani officials suggest Baku believes the plane was hit mid-air, while the US has said it had “early indications” Russian air defence may have been responsible for the crash.",
      "Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
    ],
    "topics": [
      "russian airspace",
      "russian air",
      "air defence",
      "kremlin said",
      "vladimir putin",
      "azerbaijan president",
      "tragic incident",
      "plane crashed",
      "defence may",
      "city aktau"
    ]
  },
  {
    "title": "Azerbaijan says Russia shot at plane before crash, demands it admit",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1266669-azerbaijan-says-russia-shot-at-plane-before-crash-demands-it-admit",
    "publishedAt": "2024-12-28T19:00:00Z",
    "sentences": [
      "Azerbaijani President Ilham Aliyev accused Russia on Sunday of firing at an Azerbaijan Airlines passenger jet before it crashed and of initially trying to cover up the cause of the fatal disaster, demanding that Moscow admit guilt.",
      "Aliyev made the accusation in an interview to state media at Baku airport four days after the AZAL plane crashed in Kazakhstan, killing 38 people of the 67 people on board.",
      "Azerbaijani officials have suggested the aircraft was hit by a Russian air-defence system as it tried to land in Grozny, capital of the Russian republic of Chechnya.",
      "Aliyev's unusually forthright accusation of his country's traditional ally came a day after he spoke by phone to Russian President Vladimir Putin.",
      "A Kremlin statement on the phone call gave no indication that Putin had claimed responsibility for the crash.",
      "\"The facts are that the Azerbaijani civilian plane was damaged from the outside over Russian territory, near the city of Grozny, and almost lost control,\" Aliyev told state television.",
      "\"We also know that electronic warfare systems put our plane out of control... At the same time, as a result of fire from the ground, the tail of the plane was also severely damaged,\" he said.",
      "Aliyev said that while \"of course, our plane was hit by accident\", Baku was angry that Moscow had apparently tried to hide the cause of the crash and demanded its ally admit what happened.",
      "He said it was \"regrettable and surprising\" that Moscow \"put forward theories\" that, he said, \"clearly showed he Russian side wanted to cover up the issue\".",
      "\"For the first three days, we heard nothing from Russia except some absurd theories,\" he said, adding that these included the plane hitting a flock of birds.",
      "He called the theory \"completely removed\" from reality, pointing out that the plane's \"fuselage is riddled with holes\".",
      "Russia has said Grozny was being attacked by Ukrainian drones the day the AZAL flight tried to land.",
      "Aliyev urged Moscow to issue a public apology to his country, saying Baku had made official \"demands\" to Russia two days ago.",
      "\"First, the Russian side must apologise to Azerbaijan.",
      "\"Second, it must acknowledge its guilt.",
      "\"Third, those responsible must be punished, brought to criminal responsibility, and compensation must be paid to the Azerbaijani state, as well as to the injured passengers and crew members.",
      "\"These are our conditions,\" Aliyev said, in unusually strong language towards Moscow.",
      "The Kremlin said on Saturday that during their phone conversation, Putin had apologised to Azerbaijan over the \"tragic incident\".",
      "Putin said Russian air defence was operating in Grozny on December 25 when the plane tried to land, before diverting and crashing in western Kazakhstan.",
      "The Kremlin statement gave no indication that Putin had said Russia was at fault.",
      "Later on Saturday, the Russian leader called for a \"transparent\" probe into the crash.",
      "Aliyev's office said on Saturday he had \"emphasised\" during the call that the plane had been subject to outside interference over Russia.",
      "Russian news agencies reported that Putin and Aliyev discussed the crash again on Sunday.",
      "The United States said this week it had \"early indications\" that Russia was responsible for the crash but did not provide details.",
      "The European Union called on Saturday for a \"swift\" and \"independent\" probe into the crash.",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "tried land",
      "kremlin statement",
      "gave indication",
      "indication putin",
      "aliyev said",
      "theories said",
      "russian side",
      "said saturday",
      "putin said",
      "probe crash"
    ]
  },
  {
    "title": "'Tragic incident': Putin apologises to Aliyev over Azerbaijan plane crash",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1266379-tragic-incident-putin-apologises-to-aliyev-over-azerbaijan-plane-crash",
    "publishedAt": "2024-12-27T19:00:00Z",
    "sentences": [
      "MOSCOW: Russian President Vladimir Putin apologised to his Azerbaijan's counterpart Ilham Aliyev over the \"tragic\" Azerbaijan Airlines passenger plane crash which occurred in Russia's airspace on Wednesday.",
      "Putin called Aliyev as speculation grew that Russian air defence may have accidentally shot down the plane, which crashed in western Kazakhstan, killing 38 people while 28 survived.",
      "Flight J2-8243 crashed in a ball of fire near the city of Aktau in Kazakhstan after diverting from southern Russia where Ukrainian drones were reported to be attacking several cities.",
      "The Russian leader did not claim responsibility for crash, while apologising to Aliyev that the incident took place in Russian airspace.",
      "\"(President) Vladimir Putin apologised for the tragic incident that occurred in Russian airspace and once again expressed his deep and sincere condolences to the families of the victims and wished a speedy recovery to the injured,\" the Kremlin said in a statement.",
      "\"It was noted in the conversation that the Azerbaijani passenger aircraft, which was travelling according to its schedule, repeatedly tried to land at Grozny airport.",
      "At that time, Grozny, Mozdok and Vladikavkaz were being attacked by Ukrainian unmanned aerial vehicles, and Russian air defense systems repelled these attacks,\" the Kremlin said.",
      "The Kremlin said the call took place at Putin's request.",
      "Azerbaijan's president had noted that the plane had been \"subjected to external physical and technical interference in Russian airspace, resulting in a complete loss of control and redirection to the Kazakh city of Aktau,\" according to Azerbaijan's presidential office.",
      "The Embraer EMBR3.SA passenger jet had flown from Azerbaijan's capital Baku to Grozny, in Russia's southern Chechnya region, before veering off hundreds of miles across the Caspian Sea.",
      "Statements by Azerbaijani officials suggest Baku believes the plane was hit mid-air, while the US has said it had \"early indications\" Russian air defence may have been responsible for the crash.",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "russian air",
      "russian airspace",
      "kremlin said",
      "president vladimir",
      "vladimir putin",
      "putin apologised",
      "air defence",
      "defence may",
      "city aktau",
      "took place"
    ]
  },
  {
    "title": "Early indications suggest Azerbaijan plane possibly downed by Russia: White House",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1266104-early-indications-suggest-azerbaijan-plane-possible-downed-by-russia-white-house",
    "publishedAt": "2024-12-26T19:00:00Z",
    "sentences": [
      "The United States has seen early indications suggesting that the Azerbaijan Airlines jet that crashed in Kazakhstan this week was possibly brought down by Russian air defense systems, the White House said on Friday, adding that Washington had offered assistance to the investigation into the crash.",
      "\"We [...] have seen some early indications that would certainly point to the possibility that this jet was brought down by Russian air defense systems,\" White House spokesperson John Kirby told reporters on a call.",
      "\"There's an ongoing investigation right now,\" involving Kazakhstan and Azerbaijan, Kirby said.",
      "\"We have offered our assistance to that investigation, should they need it.\"",
      "The jet crashed near the Kazakh city of Aktau on Wednesday, killing 38 of the 67 people on board, after attempting to land at its destination in the Russian city of Grozny and then diverting far off course across the Caspian Sea.",
      "Azerbaijan Airlines said it had suspended flights to 10 Russian airports and that preliminary results suggested the crash of Baku-Grozny flight J2-8243 was \"due to physical and technical external interference\".",
      "The head of Russia's civil aviation agency, Dmitry Yadrov, said in an earlier statement that \"the situation on this day and at these hours in the area of Grozny airport was very complex\".",
      "\"Ukrainian attack drones at this time were making terrorist attacks on civilian infrastructure in the cities of Grozny and Vladikavkaz,\" Yadrov said, referring to a nearby city.",
      "He said the Azeri pilot made \"two attempts to land the plane in Grozny that were unsuccessful\" in \"thick fog\".",
      "\"The pilot was offered other airports.",
      "He took the decision to go to Aktau airport,\" he added.",
      "The Kremlin earlier Friday declined to comment on the deadly crash.",
      "\"Until the conclusions of the investigation, we do not consider we have the right to make any comments and we will not do so,\" Kremlin spokesman Dmitry Peskov told reporters.",
      "Some aviation and military experts have pointed to signs of shrapnel damage on the plane wreckage as evidence it was hit by air defence systems.",
      "An Azerbaijan pro-government website, Caliber, and several other media have cited unnamed Azerbaijani officials as saying they believed a Russian missile fired from a Pantsir-S1 air defence system caused the crash.",
      "Ukrainian President Volodymyr Zelensky has called for a \"thorough investigation\" and also pointed to Russian involvement.",
      "\"Every loss of life deserves a thorough investigation to establish the truth.",
      "We can see how the clear visual evidence at the crash site points to Russia's responsibility for the tragedy,\" he said in a post on social media.",
      "A Russian survivor, Subkhonkul Rakhimov, told state broadcaster RT that an \"explosion\" appeared to happen outside the plane as it attempted to land in Grozny in fog, causing shrapnel to penetrate inside.",
      "\"I wouldn't say it was inside the plane because the skin of the fuselage near where I was sitting flew off,\" he said.",
      "\"I grabbed a life jacket and saw there was a hole in it — it was pierced by shrapnel.\"",
      "Azerbaijan's President Ilham Aliyev said on Friday that he had phoned his Kazakh counterpart Kassym-Jomart Tokayev, with both pledging that the \"causes of the crash would be fully examined\", according to a statement from Baku.",
      "Contacted by AFP, Azerbaijani government officials did not respond to questions about the possible causes of the crash.",
      "But Rasim Musabekov, an Azerbaijani lawmaker and member of the parliament's international relations committee, urged Russia to apologise for the incident.",
      "\"They have to accept this, punish those to blame, promise that such a thing will not happen again, express regrets and readiness to pay compensation,\" Musabekov told AFP.",
      "He suggested the plane was not allowed to land at Grozny or a nearby Russian airport — instead being \"sent far away\" across the Caspian Sea to Kazakhstan — in an attempt to \"cover up a crime.\"",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "seen early",
      "early indications",
      "azerbaijan airlines",
      "jet crashed",
      "brought russian",
      "russian air",
      "air defense",
      "defense systems",
      "systems white",
      "white house"
    ]
  },
  {
    "title": "Russia attacks Ukraine energy grid with missiles, drones",
    "source": "BOL News",
    "url": "https://www.bolnews.com/international/2024/12/russia-attacks-ukraine-energy-grid-with-missiles-drones/",
    "publishedAt": "2024-12-26T12:47:48Z",
    "sentences": [
      "26th Dec, 2024.",
      "05:47 pm Share Listen Font size Dark Mode Save Print Russia attacks Ukraine energy grid with missiles, drones Ukrainian President Volodymyr Zelensky condemned an “inhumane” Russian attack on Wednesday, as over 170 missiles and drones targeted the country’s power grid on Christmas Day, killing an energy worker.",
      "At 5:30 am (0330 GMT), air raid alarms sounded across Ukraine, followed by reports of Kalibr cruise missiles launched from the Black Sea, according to the air force.",
      "“Putin deliberately chose Christmas for this attack.",
      "What could be more inhumane?",
      "Over 70 missiles, including ballistic ones, and more than 100 attack drones targeted our energy system,” Zelensky stated.",
      "This marked the 13th major assault on Ukraine’s energy infrastructure this year, part of Russia’s ongoing winter campaign.",
      "Meanwhile, Russia reported five deaths in the border region of Kursk and North Ossetia, allegedly due to Ukrainian strikes and a falling drone.",
      "Ukraine claimed its air force intercepted 58 of the 79 missiles launched by Russia but was unable to down two North Korean-made KN-23 ballistic missiles used in the attack.",
      "British Prime Minister Keir Starmer condemned the strikes, praising Ukraine’s resilience and Zelensky’s leadership.",
      "“Even at Christmas, Putin’s bloody and brutal war machine shows no respite,” he remarked.",
      "Kyiv accused a Russian missile of passing through Moldovan and Romanian airspace, though Romania denied any airspace breach, and Moldova launched an investigation.",
      "“Unfortunately, there are some impacts.",
      "Currently, blackouts are affecting several regions,” Zelensky noted.",
      "Catch all the International News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "ukraine energy",
      "missiles drones",
      "drones targeted",
      "missiles launched",
      "air force",
      "bol news",
      "26th dec",
      "dec 2024",
      "2024 pm",
      "pm share"
    ]
  },
  {
    "title": "BMW admits to supplying cars to Russia despite sanctions",
    "source": "BOL News",
    "url": "https://www.bolnews.com/auto/2024/12/bmw-admits-to-supplying-cars-to-russia-despite-sanctions/",
    "publishedAt": "2024-12-24T06:54:46Z",
    "sentences": [
      "24th Dec, 2024.",
      "11:54 am Share Listen Font size Dark Mode Save Print BMW admits to supplying cars to Russia despite sanctions BMW has acknowledged that it supplied cars to Russia in violation of sanctions.",
      "An internal investigation confirmed that the vehicles were imported from Hanover.",
      "BMW stated that the employees responsible for bypassing the sanctions have been dismissed, and all deliveries to Russia have been halted.",
      "Business Insider reports that over 100 cars were delivered to Russian customers.",
      "The European Union has placed an embargo on car deliveries to Russia, and BMW reiterated its commitment to adhering to these sanctions.",
      "However, the company has not disclosed details on how the deliveries bypassed restrictions, the models involved, or the exact number of employees implicated.",
      "The German auto industry is grappling with significant challenges, including high labor and energy costs and declining sales in China, a key market.",
      "BMW shares have dropped by 21% in 2024.",
      "Despite the sanctions, BMW vehicles remain popular among Russian buyers.",
      "Long supply chains and seller risks have driven up prices, yet the demand persists.",
      "New imports of BMW and MINI models are officially banned, but Russian roads continue to see updated versions of X5, X6, X7 crossovers, as well as the latest 5-Series and 7-Series sedans.",
      "Interestingly, some BMW models are imported directly from China.",
      "For example, long-wheelbase versions of the new X1 crossover are widely available at Russian dealerships, highlighting alternative sourcing methods despite restrictions.",
      "BMW’s admission underscores the ongoing complexities surrounding sanctions enforcement and global trade in the auto industry.",
      "The Toyota Corolla remains a leading model for Indus Motor Company, securing... Catch all the Auto News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "cars russia",
      "despite sanctions",
      "sanctions bmw",
      "deliveries russia",
      "auto industry",
      "bol news",
      "24th dec",
      "dec 2024",
      "2024 share",
      "share listen"
    ]
  },
  {
    "title": "Russia paves way to remove Taliban from ‘terror’ list",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1262765-russia-paves-way-to-remove-taliban-from-terror-list",
    "publishedAt": "2024-12-16T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia´s parliament on Tuesday approved a bill that could pave the way for Moscow to lift its designation of the Taliban as a banned “terrorist” organisation.",
      "Moscow has courted relations with the Taliban since they seized power in Afghanistan after the United States´ chaotic withdrawal from in 2021.",
      "Officials have since been pushing to remove the Islamist group from Moscow´s official list of outlawed “terrorist” groups.",
      "The State Duma passed a bill outlining a mechanism for groups to be legally removed from the list -- putting the necessary legal framework in place for an expected future decision.",
      "The bill now passes to the upper-house Federation Council and then to President Vladimir Putin to sign into law.",
      "In a visit to Kabul last month, top Russian security officials told their Afghan counterparts that Moscow would soon remove the Taliban from the list of banned organisations.",
      "Under the proposed system, Russia´s Prosecutor General would file a request with a Russian court outlining that a group has “ceased” its activities “in support of terrorism”.",
      "A judge could then rule to remove the designation.",
      "The expected move would not amount to a formal recognition of the Taliban government and what it calls the “Islamic Emirate of Afghanistan” -- a step no country has yet taken.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "moscow parliament",
      "parliament tuesday",
      "tuesday approved",
      "approved bill",
      "bill could",
      "could pave",
      "pave way",
      "way moscow",
      "moscow lift",
      "lift designation"
    ]
  },
  {
    "title": "Moscow evacuates part of its diplomatic personnel in Syria",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1262021-moscow-evacuates-part-of-its-diplomatic-personnel-in-syria",
    "publishedAt": "2024-12-14T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia’s foreign ministry said it has evacuated some of its diplomatic staff from Syria Sunday, a week after the fall of Bashar al-Assad.",
      "“On December 15, the withdrawal of part of the personnel of the Russian (diplomatic) representation in Damascus was carried out by a special flight of the Russian Air Force from the Hmeimim airbase” in Syria, the ministry’s crisis situations department said on Telegram.",
      "The ministry said the flight arrived at an airport near Moscow, without specifying how many people were aboard.",
      "The flight also carried members from the diplomatic missions of Belarus, North Korea and Abkhazia, a Moscow-backed separatist region of Georgia, the department said.",
      "“The Russian embassy in Damascus continues to function”, said the press release published on Telegram.",
      "Following an 11-day offensive, a rebel coalition dominated by Islamist group Hayat Tahrir al-Sham (HTS) overthrew Al-Assad, who fled to Russia along with his family.",
      "The fate of Russia’s two military bases in Syria -- the Tartus naval base and the Hmeimim military airfield -- is now uncertain.",
      "The sites are key to Russia maintaining its influence in the Middle East, in the Mediterranean basin and as far as Africa.",
      "On Wednesday, a Kremlin spokesperson said Moscow was in contact with the new authorities in Syria regarding the bases’ future.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "ministry said",
      "department said",
      "north korea",
      "moscow russia",
      "russia foreign",
      "foreign ministry",
      "said evacuated",
      "evacuated diplomatic",
      "diplomatic staff",
      "staff syria"
    ]
  },
  {
    "title": "At least one killed as Russian tankers wrecked in Black Sea",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1261902-at-least-one-killed-as-russian-tankers-wrecked-in-black-sea",
    "publishedAt": "2024-12-14T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia mounted a rescue effort on Sunday after two oil tankers were wrecked in rough seas off Moscow-annexed Crimea and one broke apart, killing at least one sailor and causing an oil spill.",
      "The tankers, transporting thousands of tonnes of fuel oil, were both damaged in a storm in the Kerch Strait between Crimea and southern Russia's Krasnodar region, Russian news agencies reported.",
      "\"Today as a result of a storm in the Black Sea waters, two tankers, the Volgoneft-212 and the Volgoneft-239 were wrecked.",
      "On board the ships are crews of 15 and 14.",
      "As a result of the accident there was an oil spill,\" said federal shipping agency Rosmorrechflot.",
      "Reports on crew numbers varied with the emergency situations ministry putting them at 13 and 14.",
      "Dramatic videos posted online showed the stern of the Volgoneft-212 ship broken off and floating vertically in the water.",
      "Interfax reported that some of the crew members were in the water.",
      "The emergency situations ministry later said that 13 sailors had been evacuated from the first ship, but \"unfortunately one of them had died\".",
      "\"Two tug boats and two helicopters have been sent to the tankers,\" the federal shipping agency said, adding that \"measures are being taken to eliminate the oil spill\".",
      "The Kerch Strait is a key route for exports of Russian grain and is also used for exports of crude oil, fuel oil and liquefied natural gas.",
      "In September, Ukraine accused Russia at an international court of flouting sea law by trying to keep the Kerch Strait under its sole control, something Moscow dismisses at groundless.",
      "The Emergencies Ministry said it was still in contact with the other tanker and its crew after the ship ran aground 80 m from shore near the port of Taman at the south end of the Kerch Strait.",
      "The ministry later wrote on Telegram that efforts to evacuate the crew of the second ship, Volganeft 239, were suspended because of bad weather.",
      "The ministry said rescue teams were in contact with the ship, which had all facilities on board necessary to ensure the lives of the crew were not in danger.",
      "Official statements did not provide details on the extent of the spill or why one of the tankers sustained such serious damage.",
      "President Vladimir Putin ordered the government to set up a working group to deal with the rescue operation and mitigate the impact of the fuel spill, news agencies cited Kremlin spokesman Dmitry Peskov as saying, after Putin met with the ministers for emergencies and environment.",
      "Svetlana Radionova, head of Russia's natural resources watchdog Rosprirodnadzor, said specialists were assessing the damage at the site of the incident.",
      "— With additional input from Reuters As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "kerch strait",
      "oil spill",
      "tankers wrecked",
      "fuel oil",
      "news agencies",
      "federal shipping",
      "shipping agency",
      "emergency situations",
      "situations ministry",
      "ministry later"
    ]
  },
  {
    "title": "Ukraine replaces commander as Russia advances fast in east",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1261774-ukraine-replaces-commander-as-russia-advances-fast-in-east",
    "publishedAt": "2024-12-13T19:00:00Z",
    "sentences": [
      "KYIV: Ukraine’s military leadership has replaced the commander overseeing defences in the eastern Donetsk region where Russian forces are making swift advances, a military official said on Saturday.",
      "General Oleksandr Tarnavskiy, 54, was appointed to head the operational and tactical group Donetsk, replacing General Oleksandr Lutsenko, the official at the General Staff told Reuters.",
      "Lutsenko was criticized by Ukrainian military bloggers and some lawmakers for failing to stop Russian troops’ relentless push toward the strategic Ukrainian city of Pokrovsk.",
      "The battles around Pokrovsk, a key logistic hub for Ukrainian military and civilians in the eastern Donetsk region, come at a critical juncture of the war.",
      "Ukraine is on the back foot on the battlefield as Russian troops advance at their fastest pace since the early days of Moscow’s invasion in February 2022.",
      "Last month President Volodymyr Zelenskiy replaced several other generals, saying changes were needed.",
      "Kyiv is also trying to build ties with U.S. President-elect Donald Trump, whose promise to end the war swiftly has raised concerns in Ukraine that it could be largely on Moscow’s terms.",
      "Ukraine’s Khortytsiya military command said on Saturday that Russian troops had destroyed several Ukrainian positions in villages around Pokrovsk, improving their tactical positions after “exhausting battles” and forcing Kyiv forces to retreat.",
      "In its daily report, the Ukrainian military reported a total of 62 combat clashes near Pokrovsk in the last 24 hours.",
      "Ukrainian officials said that about 11,000 people still remain in Pokrovsk, which has been under constant shelling for months and where all critical infrastructure - electricity, water, and gas supplies were destroyed.",
      "Pokrovsk lies at the intersection of several important roads and rail lines and is just about 20 kilometres away from the administrative border of the Donetsk region.",
      "Moscow has been trying to reach that line since the start of the invasion, as its forces aim to seize all of Donetsk and Luhansk regions.",
      "Military analysts said that for Kyiv, losing Pokrovsk would also potentially mean having the war closer to central Ukraine and its better-protected rear.",
      "Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
    ],
    "topics": [
      "donetsk region",
      "ukrainian military",
      "russian troops",
      "eastern donetsk",
      "said saturday",
      "general oleksandr",
      "around pokrovsk",
      "kyiv ukraine",
      "ukraine military",
      "military leadership"
    ]
  },
  {
    "title": "Russia pulling back but not out of Syria",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1261740-russia-pulling-back-but-not-out-of-syria",
    "publishedAt": "2024-12-13T19:00:00Z",
    "sentences": [
      "TARTOUS, Syria: Russia is pulling back its military from the front lines in northern Syria and from posts in the Alawite Mountains but is not leaving its two main bases in the country after the fall of President Bashar al-Assad, four Syrian officials told Reuters.",
      "Satellite footage from Friday shows what appeared to be at least two Antonov AN-124s, among the world’s largest cargo planes, at the Hmeimim base with their nose cones open, apparently preparing to load up.",
      "At least one cargo plane flew out on Saturday for Libya, a Syrian security official stationed outside the facility said.",
      "Syrian military and security sources in contact with the Russians told Reuters that Moscow was pulling back its forces from the front lines and withdrawing some heavy equipment and senior Syrian officers.",
      "But the sources, who spoke on condition of anonymity due to the sensitivity of the situation, said Russia was not pulling out of its two main bases and currently had no intention of doing so.",
      "Some equipment is being shipped back to Moscow as are very senior officers from Assad’s military but the aim at this stage is to regroup and redeploy as dictated by developments on the ground, a senior Syrian army officer in touch with the Russian military told Reuters.",
      "A senior rebel official close to the new interim administration told Reuters the issue of the Russian military presence in Syria and past agreements between the Assad government and Moscow were not under discussion.",
      "“It is a matter for future talks and the Syrian people will have the final say,” said the official, adding that Moscow had set up communication channels.",
      "“Our forces are also now in close vicinity of the Russian bases in Latakia,” he added without elaborating.",
      "The Kremlin has said Russia is in discussions with the new rulers of Syria over the bases.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "told reuters",
      "russia pulling",
      "pulling back",
      "front lines",
      "two main",
      "main bases",
      "senior syrian",
      "said russia",
      "russian military",
      "tartous syria"
    ]
  },
  {
    "title": "European troops in Ukraine could guarantee future peace deal: Kyiv",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1261082-european-troops-in-ukraine-could-guarantee-future-peace-deal-kyiv",
    "publishedAt": "2024-12-11T19:00:00Z",
    "sentences": [
      "KYIV, Ukraine: The deployment of European troops in Ukraine could help guarantee a future deal aimed at securing peace in the nearly three-year war with Russia, a senior Kyiv official said on Thursday.",
      "Polish Prime Minister Donald Tusk and French President Emmanuel Macron discussed the idea of stationing foreign troops in Ukraine in case of a ceasefire during talks on Thursday, Tusk said, although he cautioned Warsaw was not currently planning such a move.",
      "The discussions come as US President-elect Donald Trump pushes for a quick ceasefire to end the fighting once he enters office next month.",
      "A senior Ukrainian official told AFP that Kyiv was open to “all ideas” that could help guarantee future peace, including “military contingents” being deployed in Ukraine.",
      "Russian President Vladimir “Putin always breaks the ceasefire, he has done so dozens of times, not only in Ukraine.",
      "That´s why we need guarantees, and the presence of military contingents can be one of them,” the source told AFP.",
      "“This conversation is now being conducted by the Europeans.",
      "Macron is obviously the leader of this idea,” the source added.",
      "Macron did not mention the possibility of foreign peacekeepers in his statement to journalists on his visit to Warsaw on Thursday.",
      "But he has previously floated the idea of Western troops being sent to Ukraine, saying in February boots on the ground could not be ruled out.",
      "Asked about the proposal on Monday, Ukrainian President Volodymyr Zelensky said: “Frankly, we can think and work on Emmanuel (Macron)´s position.” A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "troops ukraine",
      "could help",
      "help guarantee",
      "guarantee future",
      "emmanuel macron",
      "told afp",
      "military contingents",
      "kyiv ukraine",
      "ukraine deployment",
      "deployment european"
    ]
  },
  {
    "title": "Russia ‘close to’ deal with rebels to retain military bases in Syria",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1261088-russia-close-to-deal-with-rebels-to-retain-military-bases-in-syria",
    "publishedAt": "2024-12-11T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia has established direct contacts with the political committee of Syria’s Islamist rebel group, Hayat Tahrir al-Sham, the Interfax news agency quoted Russian Deputy Foreign Minister Mikhail Bogdanov as saying on Thursday.",
      "Interfax reported that Bogdanov, speaking to journalists, also said that Moscow aimed to maintain its military bases in Syria to continue “fighting international terrorism”.",
      "Bogdanov said contacts with HTS, the most powerful force in the country after the overthrow of President Bashar al-Assad, were “proceeding in constructive fashion”.",
      "Russia, he said, hoped the group would fulfil its pledges to “guard against all excesses”, maintain order and ensure the safety of diplomats and other foreigners.",
      "Bogdanov said Russia hoped to maintain its two bases in Syria - a naval base in Tartous and the Khmeimim Air Base near the port city of Latakia - to keep up efforts against international terrorism.",
      "“The bases are still there, where they were on Syrian territory.",
      "No other decisions have been made for the moment,” he was quoted as saying.",
      "“They were there at the Syrians’ request with the aim of fighting terrorists from the Islamic State.",
      "I am proceeding on the basis of the notion that everyone agrees that the fight against terrorism, and what remains of IS, is not over.” Maintaining that fight, he said, “requires collective efforts and in this connection, our presence and the Khmeimim base played an important role in the context of the overall fight against international terrorism.” Five Russian warships, including three frigates and at least one submarine, were photographed in Tartus port last week but had left by Monday.",
      "The warships were in a holding pattern 10 miles off the Syrian coast, out of range of rebel artillery and drone attacks, images released by US-based Maxar showed.",
      "MarineTraffic data also showed no ship had docked at or left Tartus since Monday.",
      "Moscow has not commented, but well-connected military bloggers and propagandists confirmed the Kremlin had withdrawn its warship from Tartus.",
      "Sources have also said that Moscow withdrew its warplanes from the Khmeimim Air Base, 75 miles north of Tartus, while it opened negotiations with HTS commanders.",
      "Anastasia Kashevarova, a pro-war Russian propagandist, told her 250,000 Telegram followers that rebel fighters had surrounded Russia’s bases in Syria.",
      "“Currently, negotiations on Syria are underway between Russia, Turkey, Iran and others,” she said.",
      "“The issue of Russian military bases in Syria is open.” Putin is desperate to retain control of its military bases in Syria, where Moscow intervened to prop up Assad during the civil war in 2015.",
      "The Tartus Naval Base has been the lynchpin for Russia’s operations in the Mediterranean Sea and across Africa.",
      "It is the only naval base in the region that the Kremlin independently controls and has been its main “replenishment and repair” centre.",
      "Analysts have said that the Kremlin had also maintained a “well-armed naval squadron” at Tartus.",
      "Built by the Soviet Union in 1971, Putin expanded Tartus in 2015 after his intervention in Syria to challenge the West in Africa, where he has since encouraged a series of coups by client rebel commanders and deployed mercenaries.",
      "The Khmeimim Air Base played an important role in defeating rebels in 2015.",
      "Russian forces launched carpet bombing missions from the base, killing thousands of civilians and destroying rebel positions.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "bases syria",
      "military bases",
      "naval base",
      "khmeimim air",
      "air base",
      "also said",
      "said moscow",
      "international terrorism",
      "bogdanov said",
      "base played"
    ]
  },
  {
    "title": "Pak-Russia IGC meeting discusses cooperation in energy sector",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260780-pak-russia-igc-meeting-discusses-cooperation-in-energy-sector",
    "publishedAt": "2024-12-11T19:00:00Z",
    "sentences": [
      "ISLAMABAD: The collaboration in gas infrastructure development, oil field services, oil and LNG trade was widely discussed during the Inter-Governmental Commission (IGC) meeting held in Moscow on December 2-4, 2024, though no MoU was signed on energy cooperation.",
      "However, Pakistan and Russia have agreed that the Pakistan Stream Gas Pipeline Project (PSGP) will be considered in terms of a comprehensive infrastructure program, which is economically viable for sustainable gas infrastructure development of Pakistan with ensuring affordable gas supplies.",
      "“The IGC meeting was informed that Pakistan has initiated a detailed study regarding the energy demand and supply along with the infrastructure requirements and, to this effect, the results of study will be shared with the Russian side on completion by third quarter of 2025.” “Both the countries agreed to continue negotiations on this matter within the related Joint Working Group,” reveals the protocol signed by Sardar Awais Ahmad Khan Leghari, Minister for Energy (Power Division) of Pakistan, and Sergei Tsivilev, Minister of Energy of the Russian Federation, after the 9th IGC meeting held in Moscow on December 4, 2024.",
      "Both sides also agreed to facilitate dialogue among the commercial banks of Russian Federation and Pakistan to explore the possibility to establish correspondent relationship through interbank consultations.",
      "Both noted the successful development of the process of oil supplies to Pakistan under IGC, implemented by the Russian-nominated company Operational Services Center JSC.",
      "The sides expressed their satisfactory opinion on the feasibility of maintaining the status of a nominated company in the supply of oil and petroleum products for Operational Services Center JSC and continued further deliberations on procurement of oil under this arrangement.",
      "The sides noted the interest of Gazprom Neft PJSC in cooperating with Pakistani oil and gas companies (OGDCL, PPL and MPCL) in the field of oilfield services, including those through an integrated service model.",
      "Both the countries agreed to discuss possible ways of cooperation by the second quarter of 2025.",
      "Autonomous Non-Commercial Organization Institute of Oil and Gas Technological Initiatives (INTI) showed interest in establishing a dialogue with oil and gas companies (such as OGDCL, HDIP, Sui companies) and relevant ministries and departments of Pakistan on the issue of presenting and recognizing INTI standards to facilitate access of Russian oil and gas equipment to the local market.",
      "The sides agreed to hold online meetings between the companies in the first quarter of 2025 with a view to potentially entering MoUs on further cooperation.",
      "The sides were informed about the interest of Gazprom PJSC to investigate opportunities of LNG supplies from Portovaya LNG plant (the existing LNG production complex near the Portovaya compressor station in the Leningrad Region) to Pakistan.",
      "The Russian side noted the interest of PJSC NOVATEK in developing cooperation with Pakistani partners in the gas sector and ready to discuss LNG supplies with them as well as participation in integrated gas projects in Pakistan.",
      "The sides expressed their interest in organizing long-term LNG supplies from the project of “Gas processing complex within Ust-Luga ethane-rich gas processing cluster” to Pakistan.",
      "The Pakistani side informed that a detailed study has been initiated regarding the assessment of energy demand and supply.",
      "Based on the outcome of the study, the Pakistani side will be in a better position to decide on the purchase of LNG.",
      "The Pakistani side will share the results of the study on completion by third quarter of 2025.",
      "The sides supported the negotiations between RusChemAlliance (project operator) and Pakistan LNG Limited (PLL) and signing of long-term agreement for LNG supplies from the Project to Pakistan, taking into consideration the results of the study.",
      "The Pakistani side presented the investment opportunities for oil and gas exploration in offshore Pakistan.",
      "The Russian side requested to share technical details in order to develop dialogue on this matter.",
      "The details of offshore opportunities were shared and a follow up meeting was held with Zarubezhneft JSC and Pakistani E&P companies, part of the delegation.",
      "Further engagement on offshore exploration and onshore mature fields was agreed between Zarubezhneft JSC and OGDCL, PPL and MPCL.",
      "The Russian side noted the interest of Rosgeo JSC in enhancing cooperation in the field of geology and diversification of the mineral resource base of the Islamic Republic of Pakistan.",
      "Russia showed interest in diversifying exports of coal and coal chemicals products through supplies to Pakistan and handed over to the Pakistani side a list of issues for detailed consideration of the issue.",
      "By the second quarter of 2025, the Pakistani side will send the Russian side answers to the requested information, including a list of potential Pakistani customers and (or) consumers of coal and coal chemistry products, in order to establish a direct dialogue with relevant Russian companies.",
      "Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
    ],
    "topics": [
      "pakistani side",
      "russian side",
      "oil gas",
      "lng supplies",
      "igc meeting",
      "meeting held",
      "results study",
      "noted interest",
      "gas infrastructure",
      "infrastructure development"
    ]
  },
  {
    "title": "A new compass for the Global South",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260637-a-new-compass-for-the-global-south",
    "publishedAt": "2024-12-11T19:00:00Z",
    "sentences": [
      "President Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support each other in taking the path to moderniaation” and announced the formation of a Global South Think Tanks Alliance to “promote people-to-people exchanges and experience-sharing”.",
      "Politicians and policymakers of the developing countries were quick to heed the call coming from the leader of a country that has accounted for close to three-quarters of global poverty reduction since 1980.",
      "In Nanjing in China’s Jiangsu province, during a historic conclave of political leaders and representatives of think tanks from over 100 countries, the Global South Think Tanks Alliance was officially launched on Thursday, November 14, 2024.",
      "This pool of resources from more than 200 universities and institutions from China and other developing counties will investigate, among others, the reasons behind the failures of Western theories of development and globalisation and conduct research to highlight how each developing country can forge its own unique path of modernisation, as demonstrated by the success of China.",
      "After World War I, the establishment of the Bretton Woods institutions and the UN system inaugurated the first-ever global security and economic order.",
      "However, the emergence of the USSR as an ideological rival prevented the US from exercising uncontested hegemony.",
      "All this changed when the curtain fell on the Soviet Union in December 1991.",
      "All international institutions were now under the political and ideological sway of the US and its European allies.",
      "For the next quarter century, the West purveyed its values, political institutions, economic models, security organisations, and cultural norms as the inexorable destiny of all mankind.",
      "No society could find stability, develop economically, or make social progress except within the framework of liberal democracy, market economy, and Western notions of freedom and human rights.",
      "Russia, other republics of the former Soviet Union, and nations of Eastern Europe were the first to experience the transformation of their societies in the ‘new world order’.",
      "These countries were cajoled and coerced by Washington into accepting the ‘shock therapy’ of disarmament, denuclearisation, democratisation, privatisation, and wholesale deregulation and liberalisation.",
      "The results were less than salubrious.",
      "Following the collapse of the Soviet Union, Russia, the biggest member state of the now-defunct Warsaw Pact countries, underwent an economic contraction worse than the one faced by the US during the Great Depression.",
      "It experienced a decade of political chaos, hyper-inflation, unemployment, breakdown of internal security, and disintegration of the moral fabric of society.",
      "The Russian population has been declining ever since.",
      "Countries in Africa, Latin America, and Asia were made to follow the same set of policies through soft and hard power tactics.",
      "After nearly three decades, the results outside Eastern Europe and the Commonwealth of Independent States are even less encouraging.",
      "Economically, countries in Latin America have either regressed or remain stagnant.",
      "Politically multi-party democracy has failed to flourish on the continent.",
      "During the same period, Africa’s share of the poor population of the world has risen from 56 per cent to over 67 per cent despite more than $2 trillion in development assistance according to some estimates.",
      "Sub-Saharan Africa is home to more failed states than any other part of the world.",
      "Only in East and Southeast Asia have countries succeeded in achieving regional peace, domestic stability, and economic progress.",
      "This has been made possible not by copying the Western template but by deviating from it in terms of ideology, institutional arrangements, and policy framework.",
      "China is the most notable example of this East Asian exceptionalism.",
      "Since the reform and opening up beginning in 1978, China has modernised and engaged with the outside world without succumbing to the Western model of development and global integration.",
      "China reestablished relations with the World Bank and the IMF in 1980 but has avoided falling into a debt trap or requiring financial bailouts.",
      "In the late 1980s, despite extreme national and international pressure, China wisely resisted calls for Western-style democracy.",
      "Ignoring the policy advice of multilateral institutions for en masse privatisation, China successfully incentivised and made its state-owned enterprises (SOE) profitable.",
      "Similarly, it protected its industrial base while successfully integrating into the global economy following accession to the World Trade Organization (WTO) in 2001.",
      "Most significantly, China rejected the West’s trickle-down economic theories and employed state machinery to divert resources towards less developed regions, sectors, and population groups.",
      "As a result, while other countries faltered, China succeeded in lifting nearly 800 million people out of poverty.",
      "China’s economic success has shattered the spell of Western ideological hegemony and opened new possibilities for developing countries to pursue policies that suit their social, political, and historic realities.",
      "These nations, a majority of whom are falling short in their goal to end extreme poverty by 2030, can draw encouragement from the example of China which has met the poverty reduction target of the UN’s 2030 Agenda for Sustainable Development ahead of schedule.",
      "China’s continuing modernisation drive since the election of Xi Jinping to the post of general secretary of the Communist Party of China (CPC) by the 18th National Congress in 2012 has defied the West’s ‘end of history’ thesis and proved wrong its predictions that economic growth would either turn China into a mirror image of Western society or the country would face social unrest and implode economically.",
      "The Western argument that multi-party adult franchise democracy and laissez-faire economic policies provide the sole pathway to prosperity no longer appears persuasive.",
      "The rise of China is not just characterised by strategic autonomy but also by humility, the principle of non-interference, and strategic restraint.",
      "While China has displayed leadership by initiating the Global South Think Tanks Dialogue and forming an alliance of research institutions from more than one hundred countries, it has no desire to export its political institutions and economic model.",
      "China only functions as a mirror.",
      "It is for the public intellectuals of the Global South to ponder why their societies are falling behind despite being the poster children of Western globalisation while China has succeeded in rejuvenating its civilisation by following a path forged by its people and history.",
      "The message of President Xi Jinping to the Global South, delivered at the G20 Summit in Rio de Janeiro on November 18, can serve as a source of inspiration: “if China can make it, other developing countries can make it too”.",
      "The writer is the chairperson of Crescent Foundation, Pakistan.",
      "Improving health and well-being of nurses and midwives must begin with protecting their basic rights But beyond euphoric headlines, reality unfolded quite differently and far more swiftly Whether we like it or not, we must accept that war is a reality; one can’t stop it from happening This does not augur well for country or people and must be remedied AI promises to inject much-needed agility, accuracy, and scalability into public administration As field marshal, he has also taken over command of other armed forces, including air force and navy"
    ],
    "topics": [
      "global south",
      "think tanks",
      "xi jinping",
      "south think",
      "developing countries",
      "soviet union",
      "president xi",
      "countries global",
      "tanks alliance",
      "poverty reduction"
    ]
  },
  {
    "title": "Russia could launch another hypersonic missile at Ukraine soon: US",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260737-russia-could-launch-another-hypersonic-missile-at-ukraine-soon-us",
    "publishedAt": "2024-12-10T19:00:00Z",
    "sentences": [
      "WASHINGTON: Russia could launch another hypersonic ballistic missile in Ukraine in the coming days, but Washington does not consider the Oreshnik weapon a game-changer in the war, a US official said on Wednesday.",
      "Russia first fired the Oreshnik missile at the Ukrainian city of Dnipro on Nov 21, in what President Vladimir Putin cast as a response to Ukraine’s first use of US ATACMs ballistic missiles and British Storm Shadows to strike Russian territory with Western permission.",
      "“We assess that the Oreshnik is not a game-changer on the battlefield, but rather just another attempt by Russia to terrorize Ukraine, which will fail,” the official said.",
      "There was no immediate response from Russia.",
      "Putin has previously said Russia may use the Oreshnik again, including to hit “decision-making centers” in Kyiv, if Ukraine keeps attacking Russia with long-range Western weapons.",
      "Putin has claimed that the Oreshnik, or hazel tree, is impossible to intercept and that it has destructive power comparable to that of a nuclear weapon, even when fitted with a conventional warhead.",
      "Some Western experts have said the novel feature of the Oreshnik was that it carried multiple warheads capable of simultaneously striking different targets - something usually associated with longer-range intercontinental ballistic missiles.",
      "But the US official downplayed the usefulness of the missiles, calling them “experimental” in nature and said that “Russia likely possesses only a handful” of them.",
      "The official also said the weapon has a smaller warhead than other missiles Russia has deployed in Ukraine.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "us official",
      "official said",
      "ballistic missiles",
      "said russia",
      "washington russia",
      "russia could",
      "could launch",
      "launch another",
      "another hypersonic",
      "hypersonic ballistic"
    ]
  },
  {
    "title": "Russia preparing for prisoner swap with Trump",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260734-russia-preparing-for-prisoner-swap-with-trump",
    "publishedAt": "2024-12-10T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia is preparing for a possible prisoner swap when President-elect Donald Trump returns to office to demonstrate a reset in relations with the United States.",
      "Sergei Ryabkov, Russia’s deputy foreign minister, said on Wednesday the move would represent a “healthy step forward” for the two countries’ diplomatic ties.",
      "Moscow would “definitely be prepared to consider” a prisoner swap on a similar scale to the exchange which took place on Aug 1, the largest since the Cold War, he told NBC News.",
      "Ryabkov said it would be a “multiphased or multistep approach on both sides”, while avoiding to detail exact timelines or prisoners to be exchanged.",
      "On Aug 1, Russia and Western governments conducted a large-scale exchange, mediated by Turkiye.",
      "During the trade, 26 prisoners from six countries, including Evan Gershkovich, the Wall Street Journal journalist, were swapped for a number of Russians, including Vadim Krasikov, a Russian hitman.",
      "Trump, who will take office in the White House on Jan 21, has generally favoured brokering east-west exchanges.",
      "During his first term in the Oval Office, he attempted to further negotiations on the return of Paul Whelan, a former US Marine once held in Russia.",
      "Whelan was eventually freed as part of the Aug 1 deal.",
      "But Trump was critical of one prisoner swap brokered between Washington and Moscow, in which Brittney Griner, an American basketball player being held by Russia, was traded for notorious Russian arms dealer Viktor Bout.",
      "The president-elect said the deal was “stupid” and “unpatriotic”, claiming it favoured Russian interests.",
      "There are still many Westerners lingering in Russian prisons, even after the latest exchange, who could be traded as part of a deal between Trump and Vladimir Putin, Russia’s president.",
      "Marc Fogel, a Pennsylvania native, was arrested entering Russia in 2021, before being sentenced to 14 years in prison for drug smuggling.",
      "The history teacher was allegedly carrying a small amount of cannabis.",
      "Ksenia Karelina, a Russian-American dual citizen, was detained in February, accused of treason over a $52 donation to a Ukrainian charity in the US.",
      "And in July, Michael Travis Leake, an American rock musician, was sentenced to 13 years in jail after being accused of organising a drug-trafficking ring.",
      "Russia is said to maintain a list of at least 70 of its citizens being held in US jails, convicted of crimes like espionage or sanctions evasion.",
      "Mash, a Telegram channel with links to Russia’s security services, reported that a swap could happen as early as February next year.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "prisoner swap",
      "aug 1",
      "held russia",
      "deal trump",
      "moscow russia",
      "russia preparing",
      "preparing possible",
      "possible prisoner",
      "swap donald",
      "donald trump"
    ]
  },
  {
    "title": "Russia takes step towards recognising Afghanistan’s Taliban government",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260387-russia-takes-step-towards-recognising-afghanistan-s-taliban-government",
    "publishedAt": "2024-12-09T19:00:00Z",
    "sentences": [
      "MOSCOW: Russia moved a step closer towards recognising the Taliban government of Afghanistan on Tuesday as parliament voted in favour of a law that would make it possible to remove the Taliban from Moscow’s list of banned terrorist organisations.",
      "Parliament’s lower house, the Duma, approved the bill in the first of three required readings, Interfax news agency said.",
      "No country currently recognises the Taliban government which seized power in August 2021 as US-led forces staged a chaotic withdrawal after 20 years of war.",
      "But Russia has been gradually building ties with the movement, which President Vladimir Putin said in July was now an ally in fighting terrorism.",
      "Moscow sees a major security threat from Islamist militant groups based in a string of countries from Afghanistan to the Middle East, where Russia lost a major ally this week with the toppling of Syrian President Bashar al-Assad.",
      "The Taliban says it is working to wipe out the presence of Islamic State in Afghanistan.",
      "Western diplomats say the movement’s path towards wider international recognition is stalled until it changes course on women’s rights.",
      "The Taliban has closed high schools and universities to girls and women and placed restrictions on their movement without a male guardian.",
      "It says it respects women’s rights in line with its strict interpretation of Islamic law.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "taliban government",
      "women rights",
      "moscow russia",
      "russia moved",
      "moved step",
      "step closer",
      "closer towards",
      "towards recognising",
      "recognising taliban",
      "government afghanistan"
    ]
  },
  {
    "title": "Syria enters critical chapter in history as post-Assad era begins",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1259760-syria-enters-critical-chapter-in-history-as-post-assad-era-begins",
    "publishedAt": "2024-12-08T19:00:00Z",
    "sentences": [
      "Syrians awakened on Monday to a mix of hope and uncertainty after rebels captured Damascus and President Bashar al-Assad fled to Russia, ending a 13-year civil war and over 50 years of the al-Assad family's brutal rule.",
      "The rapid advance of Hayat al-Tahir al-Shams (HTS), a former al-Qaeda affiliate, marked a key turning point in the region as Assad's departure weakened Iran and Russia's influence in the Arab world.",
      "Moscow gave asylum to Assad and his family, Russian media reported and Mikhail Ulyanov, Russia's ambassador to international organisations in Vienna, said on his Telegram channel on Sunday.",
      "International governments welcomed the end of the Assad's autocratic government, as they sought to take stock of a new-look Middle East.",
      "United States President Joe Biden said Syria is in a period of risk and uncertainty, and it is the first time in years that neither Russia, Iran, nor the Hezbollah organisation held an influential role there.",
      "HTS is still designated as a terrorist group by the US, Turkey, and the United Nations, although it has spent years trying to soften its image to reassure international governments and minority groups within Syria.",
      "Japan's chief cabinet secretary, Yoshimasa Hayashi, said on Monday Tokyo was paying close attention to developments in Syria.",
      "Assad's overthrow limits Iran's ability to spread weapons to its allies and could cost Russia its Mediterranean naval base.",
      "It could also allow millions of refugees scattered for more than a decade in camps across Turkey, Lebanon, and Jordan to finally return home.",
      "The rebels face a monumental task of rebuilding and running a country after a war that left hundreds of thousands dead, cities pounded to dust and an economy hollowed by global sanctions.",
      "Syria will need billions of dollars in aid.",
      "\"A new history, my brothers, is being written in the entire region after this great victory,\" said Ahmed al-Sharaa, better known as Abu Mohammed al-Golani, the head of HTS.",
      "Speaking to a huge crowd on Sunday at Damascus' Umayyad Mosque, a place of enormous religious significance, Golani said with hard work Syria would be \"a beacon for the Islamic nation.\"",
      "The Assad police state was known as one of the harshest in the Middle East with hundreds of thousands of political prisoners held in horrifying conditions.",
      "On Sunday, elated but often confused inmates poured out of jails.",
      "Reunited families wept in joy.",
      "Newly freed prisoners were filmed running through the Damascus streets holding up their hands to show how many years they had been in prison.",
      "The White Helmets rescue organisation said it had dispatched emergency teams to search for hidden underground cells still believed to hold detainees.",
      "With a curfew declared by the rebels, Damascus was calm overnight, with roads leading into the city mostly empty.",
      "One shopping centre had been looted on Sunday, and some people rampaged inside Assad's presidential place, leaving carrying furniture.",
      "The rebel coalition said it was working to complete the transfer of power to a transitional governing body with executive powers, referring to building \"a Syria together.\"",
      "Golani is a Sunni Muslim, which is the majority in Syria, but the country is home to a wide range of religious sects, including Christians and Assad's fellow Alawites, an offshoot of Shi'ite Islam.",
      "The pace of events stunned world capitals and raised concerns about more regional instability on top of the ongoing crises in the Middle East.",
      "The US Central Command said its forces conducted dozens of airstrikes targeting known Daesh camps and operatives in central Syria on Sunday.",
      "Secretary of Defense Lloyd Austin said on Sunday he spoke with Turkish Minister of National Defense Yasar Guler, emphasising the importance of protecting civilians and that the US is watching closely.",
      "During Syria's civil war, which erupted in 2011 as an uprising against Assad, his forces and their Russian allies bombed cities to rubble.",
      "The refugee crisis across the Middle East was one of the biggest of modern times and caused a political reckoning in Europe when a million people arrived in 2015.",
      "In recent years, Turkey had backed some rebels in a small redoubt in the northwest and along its border.",
      "The US, which has about 900 troops in Syria, backed a Kurdish-led alliance that fought Daesh fighters from 2014-2017.",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "middle east",
      "civil war",
      "international governments",
      "hundreds thousands",
      "syrians awakened",
      "awakened monday",
      "monday mix",
      "mix hope",
      "hope uncertainty",
      "uncertainty rebels"
    ]
  },
  {
    "title": "Russia, Iran ‘share responsibility’ for Assad crimes: Nato",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260049-russia-iran-share-responsibility-for-assad-crimes-nato",
    "publishedAt": "2024-12-08T19:00:00Z",
    "sentences": [
      "BRUSSELS: Nato chief Mark Rutte on Monday said Russia and Iran were complicit in the crimes of ousted Syrian president Bashar al-Assad, and his fall showed they were “unreliable partners”.",
      "“Russia and Iran were the main backers of the Assad regime, and they share the responsibility for the crimes committed against the Syrian people,” Rutte said.",
      "“They also proved to be unreliable partners, abandoning Assad when he ceased to be of use to them.” A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "russia iran",
      "unreliable partners",
      "brussels nato",
      "nato chief",
      "chief mark",
      "mark rutte",
      "rutte monday",
      "monday said",
      "said russia",
      "iran complicit"
    ]
  },
  {
    "title": "Nobel laureate warns Putin about danger of nuclear weapons",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260057-nobel-laureate-warns-putin-about-danger-of-nuclear-weapons",
    "publishedAt": "2024-12-08T19:00:00Z",
    "sentences": [
      "OSLO: This year´s Nobel Peace Prize laureate, Japan´s atomic bomb survivors´ group Nihon Hidankyo, on Monday urged Russia to stop issuing nuclear threats in a bid to prevail in its war in Ukraine.",
      "“President Putin, I don´t think he truly understands what nuclear weapons are for human beings,” said Terumi Tanaka, the 92-year-old co-chair of Nihon Hidankyo and a survivor of the 1945 atomic bombing of Nagasaki.",
      "“I don´t think he has even thought about this,” Tanaka told a press conference in Oslo a day before he was due to accept the 2024 Nobel Peace Prize, with two other co-chairs, at a formal ceremony in Oslo on behalf of Nihon Hidankyo.",
      "Putin began making nuclear threats shortly after Russia´s full-scale invasion of Ukraine in February 2022, and signed a decree in late November lowering the threshold for using atomic weapons.",
      "Russian Foreign Minister Sergei Lavrov reiterated on Thursday that Moscow was ready to use “any means” to defend itself.",
      "A satellite image shows the new North Korean warship at harbour before launch, in Chongjin, North Korea, May 18, 2025.... A view shows the courthouse of Vannes, where ex-surgeon Joel Le Scouarnec, accused of the aggravated rape and sexual... Members of the emergency services work at Hamburg’s main train station where several people were stabbed on May 23,... India's Border Security Force personnel patrol along the fencing of the India-Bangladesh international border.",
      "—... Representational image of chickens.",
      "— Unsplash/FilePARIS: Outbreaks of bird flu in mammals more than doubled across... Turkey's President Tayyip Erdogan speaks during a press briefing during NATO’s 75th anniversary summit in..."
    ],
    "topics": [
      "nihon hidankyo",
      "nobel peace",
      "peace prize",
      "nuclear threats",
      "oslo nobel",
      "prize laureate",
      "laureate atomic",
      "atomic bomb",
      "bomb group",
      "group nihon"
    ]
  },
  {
    "title": "India inducts Russia-built warship into its naval fleet",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1259909-india-inducts-russia-built-warship-into-its-naval-fleet",
    "publishedAt": "2024-12-08T19:00:00Z",
    "sentences": [
      "A Russian-manufactured guided missile frigate, INS Tushil, was commissioned into India’s naval fleet at a Russian shipyard on Monday, with the country’s defence ministry terming it a \"significant milestone\" in ties with a longstanding defence ally.",
      "Indian defence minister Rajnath Singh took part in the commissioning ceremony of the country's latest multi-role stealth guided missile frigate, INS Tushil, in the Baltic port of Kaliningrad.",
      "\"The ship is a proud testament to India's growing maritime strength and a significant milestone in long-standing bilateral relations with Russia,\" Singh posted on X. Tushil, or \"Shield\" in English, weighs 3,900 tonnes and carries \"an impressive blend of Russian and Indian cutting edge technologies\", the defence ministry in New Delhi said last week.",
      "It also said the ship would reach India in a \"near-combat ready condition\" since all Russian equipment on board had been already tested successfully.",
      "New Delhi has walked a diplomatic tightrope since the beginning of the Ukraine conflict in February 2022, pledging humanitarian support for Kyiv while avoiding explicit condemnation of Russia's offensive.",
      "In October at the BRICS summit in Kazan, Indian Prime Minister Narendra Modi reiterated his calls for a quick end to the fighting in a meeting with Russian President Vladimir Putin.",
      "Putin praised what he called Russia and India's \"privileged strategic partnership\", and vowed to build ties further.",
      "Modi visited Kyiv in August and Moscow in July in an effort to encourage talks, as India cast itself as a potential mediator in the conflict.",
      "As more people opt for self-generated electricity, challenges rise for power grids with dwindling customer base \"Let the future of publishing begin,\" says Melania after launching AI Audiobook NOAA forecasts 60% chance of above-normal season, with between 13 to 19 named storms with winds of 39 mph \"Harvard University’s Student and Exchange Visitor Programme certification is revoked,\" says statement \"We're waiting to get the registered numbers that were on the plane itself,\" says official CNN reports Israel is making preparation to strike Iranian nuclear sites"
    ],
    "topics": [
      "guided missile",
      "missile frigate",
      "frigate ins",
      "ins tushil",
      "defence ministry",
      "significant milestone",
      "new delhi",
      "tushil commissioned",
      "commissioned india",
      "india naval"
    ]
  },
  {
    "title": "Trump calls for immediate Ukraine ceasefire, Kyiv and Moscow cite conditions",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1259736-trump-calls-for-immediate-ukraine-ceasefire-kyiv-and-moscow-cite-conditions",
    "publishedAt": "2024-12-08T19:00:00Z",
    "sentences": [
      "PARIS: US President-elect Donald Trump called on Sunday for an immediate ceasefire and negotiations between Ukraine and Russia to end “the madness”, prompting Ukrainian President Volodymr Zelenskiy and the Kremlin to list their conditions.",
      "Trump made his comments just hours after meeting Zelenskiy in Paris for their first face-to-face talks since Trump won last month’s U.S. election.",
      "Trump has vowed to bring about a negotiated end to the conflict, but so far has not provided details.",
      "“Zelensky and Ukraine would like to make a deal and stop the madness,” Trump wrote on his social media platform Truth Social, adding that Kyiv had lost some 400,000 soldiers.",
      "“There should be an immediate ceasefire and negotiations should begin.” “I know Vladimir well.",
      "This is his time to act.",
      "China can help.",
      "The World is waiting!” Trump added, referring to Russian President Putin.",
      "Trump, in Paris for the reopening of Notre-Dame Cathedral, sat down with Zelenskiy on Saturday for about an hour, along with host President Emmanuel Macron.",
      "Trump and Zelenskiy shook hands and smiled, but it was unclear how the conversation had gone.",
      "Accounts of the talks from the French and Ukrainian sides said only that the discussions had been good and productive.",
      "Zelenskiy reacted to Trump’s message on Sunday saying peace was not just a piece of paper, but needed guarantees.",
      "“When we talk about effective peace with Russia, we must first and foremost talk about effective guarantees for peace.",
      "Ukrainians want peace more than anyone else,” he said on X.",
      "“It (the war) cannot simply end with a piece of paper and a few signatures.",
      "A ceasefire without guarantees can be reignited at any moment, as Putin has already done before.",
      "To ensure that Ukrainians no longer suffer losses, we must guarantee the reliability of peace and not turn a blind eye to occupation.” Yunus has promised polls will be held by June 2026 at latest in Muslim-majority nation of around 170 million people China has given guaranteed loan of $364 million, out of which $58.41 million guarantee has been given in April 2025 Former champions will now face Quetta Gladiators in Sunday’s final at the same venue Maryam Nawaz Sharif expressed deep grief over sad demise of renowned Punjabi poet Tajammul Kaleem WB Managing Director Anna Bjerde, Country Director Najy Benhassine and CM Syed Murad Shah accompanied her In separate meeting with PVMA, Khan assured ghee producers of government’s understanding and support"
    ],
    "topics": [
      "immediate ceasefire",
      "ceasefire negotiations",
      "piece paper",
      "talk effective",
      "paris us",
      "us donald",
      "donald trump",
      "trump called",
      "called sunday",
      "sunday immediate"
    ]
  }
]