[
  {
    "title": "Trump says Russia and Ukraine to start ceasefire talks ‘immediately’",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/united-states/after-putin-call-trump-says-russia-ukraine-talks-to-begin-immediately",
    "publishedAt": "2025-05-19T17:59:28Z",
    "sentences": [
      "WASHINGTON – US President Donald Trump spoke with President Vladimir Putin on May 19 and said Russia and Ukraine will immediately start negotiations towards a ceasefire, but the Kremlin said reaching an agreement would take time and Mr Trump indicated he was not ready to join Europe with fresh sanctions to pressure Moscow.",
      "In a social media post, Mr Trump said he relayed the plan to Ukrainian President Volodymyr Zelensky as well as the leaders of the European Union, France, Italy, Germany and Finland in a group call following his session with Mr Putin.",
      "“Russia and Ukraine will immediately start negotiations towards a ceasefire and, more importantly, an end to the war,” Mr Trump said, adding later at the White House that he thought “some progress is being made”.",
      "European leaders decided to increase pressure on Russia through sanctions after Mr Trump briefed them on his call with Mr Putin, German Chancellor Friedrich Merz said in a post on social media platform X late on May 19.",
      "Mr Trump did not appear ready to follow that move.",
      "When asked why he had not imposed fresh sanctions to push Moscow into a peace deal as he has threatened, Mr Trump told reporters: “Well because I think there’s a chance of getting something done, and if you do that, you can also make it much worse.",
      "But there could be a time where that’s going to happen.” Mr Trump said there were “some big egos involved”.",
      "Without progress, “I’m just going to back away”, he said, repeating a warning that he could abandon the process.",
      "“This is not my war.” After speaking to Mr Trump, Mr Putin said efforts to end the war were “generally on the right track” and that Moscow was ready to work with Ukraine on a potential peace deal.",
      "“We have agreed with the President of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” he told reporters near the Black Sea resort of Sochi.",
      "European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce.",
      "The Russian leader has resisted that, insisting that conditions be met first.",
      "Kremlin aide Yuri Ushakov said Mr Trump and Mr Putin did not discuss a timeline for a ceasefire but did discuss trading nine Russians for nine Americans in a prisoner swop.",
      "He said the US leader called prospects for ties between Moscow and Washington “impressive”.",
      "Russian state news agencies cited Kremlin spokesman Dmitry Peskov as saying that Moscow and Kyiv faced “complex contacts” to develop a unified text of a peace and ceasefire memorandum.",
      "“There are no deadlines and there cannot be any.",
      "It is clear that everyone wants to do this as quickly as possible, but, of course, the devil is in the details,” the RIA agency quoted him as saying.",
      "Former Swedish prime minister Carl Bildt said on X that the call with Mr Trump was “undoubtedly a win for Putin”.",
      "The Russian leader “deflected the call for an… immediate ceasefire and instead can continue military operations at the same time as he puts pressure on at the negotiating table”.",
      "After speaking with Mr Trump, Mr Zelensky said Kyiv and its partners might seek a high-level meeting among Ukraine, Russia, the US, European Union countries and Britain as part of a push to end the war.",
      "He said he hoped this could happen soon and be hosted by Turkey, the Vatican or Switzerland.",
      "It was not immediately clear if this would be part of the negotiations Mr Trump said would start immediately.",
      "Mr Trump said Pope Leo had expressed interest in hosting the negotiations at the Vatican.",
      "The Vatican did not immediately respond to a request for comment.",
      "One person familiar with Mr Trump’s call with the Ukrainian and European leaders said participants were “shocked” that the US leader did not want to push Mr Putin with sanctions.",
      "In a post on X, European Commission president Ursula von der Leyen said the conversation with Mr Trump was “good” and it was “important that the US stays engaged”.",
      "Ukraine and its supporters have accused Russia of failing to negotiate in good faith, doing the minimum needed to keep Mr Trump from applying new pressure on its economy.",
      "Prodded by Mr Trump, delegates from the warring countries met last week in Istanbul for the first time since 2022, in the early months of Russia’s invasion of Ukraine, but those talks failed to produce a truce.",
      "Prospects for progress dimmed after Mr Putin spurned Mr Zelensky’s proposal they meet face to face in Istanbul, and Mr Trump said there would be no movement unless he and Mr Putin met.",
      "Mr Putin, whose forces control a fifth of Ukraine and are advancing, has stood firm on his conditions for ending the war.",
      "He said the memorandum Russia and Ukraine would work on about a future peace accord would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.",
      "Mr Putin said: “The main thing for us is to eliminate the root causes of this crisis.",
      "“We just need to determine the most effective ways to move towards peace.” REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "mr putin",
      "trump said",
      "russia ukraine",
      "end war",
      "european leaders",
      "trump mr",
      "ukraine immediately",
      "immediately start",
      "start negotiations"
    ]
  },
  {
    "title": "S’pore-based TikToker gets 11½ years’ jail and caning for raping woman he met on Tinder",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/singapore/courts-crime/spore-based-tiktoker-gets-111-2-years-jail-and-caning-for-raping-woman-he-met-on-tinder",
    "publishedAt": "2025-05-19T09:11:55Z",
    "sentences": [
      "SINGAPORE - A TikToker and former scriptwriter-actor with local YouTube comedy channel Wah!Banana was sentenced to 11½ years’ jail and 12 strokes of the cane on May 19 for raping a woman he had met on the dating app Tinder.",
      "Lev Panfilov, a 29-year-old Singapore permanent resident originally from Russia, was earlier found guilty by the High Court of two counts of rape, one count of sexual assault by penetration, and one count of outrage of modesty.",
      "The assault took place on Jan 12, 2021, in Panfilov’s bedroom after he invited the woman back to the flat he shared with flatmates to work on her script.",
      "The woman, who was then 30 years old, had worked as an actress and model and was trying to branch out into comedy writing.",
      "Deputy Public Prosecutor Sheldon Lim sought 14 years’ jail and 16 strokes of the cane.",
      "In written submissions, the prosecution said Panfilov lacked remorse, as he had prolonged his trial unnecessarily by subjecting the woman to a marathon 13 days of cross-examination.",
      "The prosecution noted that Panfilov had tried to leave Singapore midway through the trial, without any permission being granted by the court.",
      "On Dec 9, 2023, he was stopped at the entrance to the departure hall of Changi Airport Terminal 1, as he was trying to use his new Russian passport to pass through to board his flight.",
      "As a result, Panfilov, who was on bail up to that point, was arrested and remanded in custody.",
      "He had applied for and obtained the new passport without the knowledge of the investigating officer.",
      "Lawyer Sameer Melber who, together with Mr Manoj Nandwani, now acts for Panfilov, asked for 10 years and five months’ jail and six strokes of the cane.",
      "Mr Sameer said the sequence of events shows there was no element of premeditation on the part of his client, and that the woman had ended up in Panfilov’s bed of her own volition.",
      "The lawyer said his client intends to get married later in 2025 and also pursue his education in prison.",
      "During the trial, which began in May 2023, the woman and Panfilov presented different accounts of the incident.",
      "The two had matched on Tinder and later moved their chat to WhatsApp before arranging to meet in person at a restaurant in Robertson Quay.",
      "She testified that his Tinder profile had stated he was either a writer or scriptwriter, and that she had hoped to get some advice on scriptwriting from him.",
      "At the restaurant, she opened her laptop and started working on her script with him.",
      "She said that after waiters came round to ask if they had any last orders, Panfilov suggested continuing working on the script at his place, and she agreed.",
      "The two went to the flat separately – Panfilov rode his motorcycle and the woman took a Grab car.",
      "At his flat, he ushered her into his bedroom.",
      "They sat on his bed as they talked about comedic characters and watched videos of various comedians.",
      "She said she sat on his bed because the room was otherwise rather cluttered.",
      "The woman said he suddenly leaned in and kissed her on her lips, but she told him “no” and gathered her things to leave.",
      "But he sexually assaulted her and raped her on his bed, she said.",
      "On Jan 16, 2021, still in pain from the assault, she saw a doctor, who advised her to make a police report.",
      "The same day, she went to a neighbourhood police centre and spoke to several police officers but left without lodging a report.",
      "Around midnight on Jan 18, 2021, she finally told her mother what had happened.",
      "Her mother took her to KK Women’s and Children’s Hospital, and a police report was lodged.",
      "Panfilov did not deny that he had sex with the woman but said the encounter was consensual.",
      "He said she had made the first advances – laughing at his jokes, tapping on his leg and stroking his thigh.",
      "After they had sex, he asked for her address and booked a car on the Gojek app for her to get home.",
      "He said he later messaged her, asking if she had reached home safely, and she replied that all was good.",
      "He said he subsequently did not reply to her because her interest in morbid jokes was not in line with his sense of humour.",
      "On March 21, Justice Pang Khang Chau found the woman to be an unusually convincing witness who gave a detailed and textured account that was internally and externally consistent.",
      "The judge accepted that she had explanations for the issues raised by the defence.",
      "On the other hand, Justice Pang found that Panfilov was not a credible witness and that his testimony did not help in casting reasonable doubts on the prosecution’s case.",
      "The judge said there were significant inconsistencies between what Panfilov said to police officers, what he said in his video-recorded interviews and what he said in court.",
      "Panfilov will be appealing against his conviction and sentence.",
      "Join ST's WhatsApp Channel and get the latest news and must-reads.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "strokes cane",
      "years jail",
      "one count",
      "working script",
      "sat bed",
      "woman said",
      "police report",
      "police officers",
      "justice pang",
      "singapore tiktoker"
    ]
  },
  {
    "title": "Zelensky says Ukraine will observe Easter truce, accuses Russia of breaches",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-says-russian-artillery-fire-goes-on-despite-ceasefire-proclamation",
    "publishedAt": "2025-04-19T18:55:48Z",
    "sentences": [
      "KYIV - Ukraine will abide by an Easter truce, President Volodymyr Zelensky said, hours after Vladimir Putin ordered Russian troops to pause all combat activity until 2100 GMT on April 20 (5am on April 21 in Singapore).",
      "The 30-hour truce would be the most significant pause in the fighting throughout the three-year conflict.",
      "But just hours after the order was meant to have come into effect, air-raid sirens sounded in the Ukrainian capital and Mr Zelensky accused Russia of having maintained its artillery fire and assaults on the frontline.",
      "Also on April 19, Russia and Ukraine held a large exchange of prisoners, with each side saying it had handed back more than 240 captured fighters.",
      "The order to halt all combat over the Easter weekend came after months of efforts by US President Donald Trump to get Moscow and Kyiv to agree a ceasefire.",
      "On Friday, Washington even threatened to withdraw from talks if no progress was made.",
      "Mr Putin announced the Easter truce in televised comments during a meeting with the Russian chief of the general staff Valery Gerasimov.",
      "Mr Zelensky responded by saying Ukraine would follow suit, and proposed extending the truce beyond April 20.",
      "But the Ukrainian leader also accused Russia of having already broken its promises.",
      "“If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly – mirroring Russia’s actions,” Mr Zelensky said on April 19, in a post on X.",
      "“Russian assault operations continue on several front-line sectors, and Russian artillery fire has not subsided,” he said.",
      "Ukraine’s Kherson governor reported several Russian drone attacks after Mr Putin’s order was supposed to have come into force at 6pm.",
      "Ukraine’s air force issued air-raid warnings across several regions in eastern Ukraine on April 19 evening, also while the ceasefire was supposed to be in effect.",
      "Ukraine’s air force said on social media there was a “ballistic missile threat” and official air-raid maps indicated alerts issued for the Kharkiv, Donetsk, Zaporizhzhia and Dnipropetrovsk regions.",
      "“Therefore, there is no trust in words coming from Moscow,” Mr Zelensky said.",
      "“We know all too well how Moscow manipulates, and we are prepared for anything.",
      "Ukraine’s Defence Forces will act rationally – responding in kind.",
      "Every Russian strike will be met with an appropriate response,” he added.",
      "Mr Putin had said the truce for the Easter holiday celebrated on April 20 was motivated by “humanitarian reasons”.",
      "While he expected Ukraine to comply, he said that Russian troops “must be ready to resist possible breaches of the truce and provocations by the enemy”.",
      "Mr Zelensky in a social media post wrote: “If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly – mirroring Russia’s actions.” He added: “If a complete ceasefire truly takes hold, Ukraine proposes extending it beyond the Easter day of April 20.” He proposed that “30 days could give peace a chance”, while pointing out that Mr Putin had earlier rejected a proposed 30-day full and unconditional ceasefire.",
      "Ukraine had accepted that offer.",
      "Mr Trump is pushing to end the three-year war, but on April 18 threatened to ditch his efforts to broker a ceasefire if he did not see meaningful progress soon.",
      "“The fighting is ongoing, and Russian attacks continue,” Ukraine’s military command, the Chief of Staff, reported April 19 evening.",
      "“In some areas on the frontline, Russian artillery continues to be heard, despite the promise of silence from the Russian leader.",
      "Russian drones are being used.",
      "It is quieter in some areas.” Soldiers in the eastern Ukrainian city of Kramatorsk close to the front line earlier greeted the truce announcement with scepticism.",
      "Mr Putin “might do it to give some hope or to show his humanity”, said Dmitry, a 40-year-old soldier.",
      "“But either way, of course, we don’t trust (Russia).” Mr Putin said the latest truce proposal would show “how sincere is the Kyiv’s regime’s readiness, its desire and ability to observe agreements and participate in a process of peace talks”.",
      "Russia launched its full-scale invasion of neighbouring Ukraine in February 2022.",
      "Previous attempts at holding ceasefires for Easter in April 2022 and Orthodox Christmas in January 2023 were not implemented after both sides failed to agree on them.",
      "“For millions of Ukrainians, Easter is one of the most important holidays.",
      "And millions of Ukrainians will go to church,” said Mr Zelensky in his evening address.",
      "“Over the years of this full-scale war, Russian attacks have destroyed or damaged more than 600 churches, prayer houses and places of worship.” In Kramatorsk, one soldier Vladislav, 22, said: “I feel like it’s going to start again after a while, and it’s going to go on and on.” On the streets of Moscow, Mr Yevgeny Pavlov, 58, said he did not think Russia should give Ukraine a breather.",
      "“There is no need to give them respite.",
      "If we press, it means we should press to the end,” he told AFP.",
      "Earlier on April 19, Ukraine and Russia said they had each returned 246 soldiers being held as prisoners of war in a swop mediated by the United Arab Emirates.",
      "Mr Zelensky said the total number of returned POWs now stood at 4,552.",
      "The UAE’s foreign ministry said 31 wounded Ukrainians and 15 wounded Russians were also exchanged.",
      "The UAE said it was committed to “finding a peaceful solution” to the conflict and “mitigating the humanitarian impacts”.",
      "Russia said it had retaken the penultimate village still under Ukrainian control in its Kursk frontier region.",
      "Kyiv had hoped to use its hold on the region as a bargaining chip in the talks.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr zelensky",
      "mr putin",
      "april 19",
      "zelensky said",
      "full unconditional",
      "easter truce",
      "russian troops",
      "april 20",
      "accused russia",
      "artillery fire"
    ]
  },
  {
    "title": "GOP Rep Slams Trump For Firing NSA Director: 'Russia And China Are Laughing At Us'",
    "source": "Yahoo Singapore News",
    "url": "https://sg.news.yahoo.com/gop-rep-slams-trump-firing-153940676.html",
    "publishedAt": "2025-04-05T15:39:40Z",
    "sentences": [
      "Rep. Don Bacon (R-Neb.)",
      "is less than pleased about President Donald Trump firing Gen. Timothy Haugh, who headed both the National Security Agency and U.S. Cyber Command until Thursday — when he was let go without a single reason divulged to voters.",
      "“The White House fired one of our best generals and the smartest on cyber operations, and with no explanation,” Bacon told Fox News senior congressional correspondent Chad Pergram on Friday.",
      "“Russia and China are laughing at us.” Chief Pentagon spokesperson Sean Parnell said in a statement Friday to CBS News that the “Defense Department thanks General Timothy Haugh for his decades of service” and that the DoD wishes “him and his family well” — providing no further detail about his exit.",
      "Several senior members of the National Security Council were also fired.",
      "Haugh and NSA deputy Wendy Noble were both ousted after Trump met with far-right activist Laura Loomer on Wednesday, The Washington Post reported.",
      "Loomer, who has frequently shared QAnon conspiracy theories and is one of Trump’s staunchest social media supporters, told the Post she had advocated for the firings.",
      "Loomer elaborated on the matter Friday on X, formerly Twitter, arguing that Haugh and Noble “have been disloyal to President Trump” and “that is why they have been fired.” She also slammed retired Gen. Mark Milley, who called Trump “a total fascist” in October.",
      "“As a Biden appointee, General Haugh had no place serving in the Trump admin given the fact that he was HAND PICKED by General Milley, who was accused of committing treason by President Trump,” she wrote.",
      "“Given the fact that the NSA is arguably the most powerful intel agency in the world, we cannot allow for a Biden nominee to hold that position,” she added.",
      "“Thus, Haugh was fired today, along with his Obama loving protege, Wendy Noble.",
      "This is called VETTING.” Loomer gave Trump a list of supposedly disloyal officials during their closed-door meeting Wednesday, and successfully called for them to be fired despite national security adviser Michael Waltz reportedly pushing back, The New York Times reported Thursday.",
      "The report was based on interviews with eight people with knowledge of the events.",
      "Bacon, who previously criticized Trump for berating Ukrainian President Volodymyr Zelenskyy during their televised meeting in February and called Trump’s stance on Russia “too conciliatory,” shared an additional statement on Haugh’s exit Friday on X.",
      "“General Tim Haugh is an outstanding leader and was doing a superb job at Cyber Command and National Security Agency,” he wrote.",
      "“He was fired with no public explanation.",
      "This action sets back our Cyber and Signals Intelligence operations.” As Stock Market Plunges Over Tariffs, Trump Takes In The Green At His Golf Course White House Official Sums Up Trump's Tariffs With Foul-Mouthed Analysis: Report Trump Posts Dark 5-Word Message From His Motorcade North Korea’s newest warship was severely damaged during a launch ceremony Wednesday, with leader Kim Jong Un, who witnessed the accident, saying it brought shame to the nation’s prestige and vowing to punish those found responsible, state media reported.",
      "\"I'm a strong Republican and in general a big fan of Trump but this is a sad day for America.\"",
      "It took the US president four months to come to the same conclusion as the rest of Ukraine's allies... A single-vote win could reshape taxes, gut clean energy, and spark bond market chaos--just before the 2024 election fight.",
      "Singaporean Harvard students need to leave uni as Trump bans its international student enrolment, bumper crop of new faces in PM Lawrence Wong's Cabinet, and more news and updates from Yahoo Singapore.",
      "President Donald Trump on Friday threatened a 50% tax on all imports from the European Union as well a 25% tariff on smartphones unless those products are made in America.",
      "The threats, delivered over social media, reflect Trump's ability to disrupt the global economy with a burst of typing, as well as the reality that his tariffs have yet to produce the trade deals he is seeking or the return of domestic manufacturing he has promised voters.",
      "The Republican president said he wants to charge higher import taxes on goods from the EU, a longstanding US ally, than from China, a geopolitical rival that had its tariffs cut to 30% this month so Washington and Beijing could hold negotiations.",
      "Singapore’s Deputy Prime Minister Gan Kim Yong said neutrality is not possible, highlighting the rising challenges for the city-state that has long sought to tread a diplomatic tightrope amid US-China trade tensions.",
      "MFA rejects social media diplomacy after US and Chinese embassies clash over the South China Sea while ICA reviews the PR status of convicted sex offenders Ian Fang and Lev Panfilov.",
      "Plus some of the biggest and fascinating news in Singapore and beyond.",
      "ISLAMABAD, NEW DELHI (Reuters) -Pakistan will not get water from rivers over which India has rights, Indian Prime Minister Narendra Modi said on Thursday, upping the rhetoric in a standoff over water access triggered by a deadly attack in Indian Kashmir.",
      "Pakistan's chief legal officer, in an interview with Reuters, responded that Islamabad remained willing to discuss water sharing between the neighbours but said India must stick to a decades-old treaty.",
      "Rahm Emanuel explained what will lead voters to start turning to Democrats as a check on the president's \"chaotic corruption.\"",
      "His Thursday night “gala” dinner is unprecedented in American history.",
      "Using public office for personal enrichment is the literal definition of corruption.",
      "Political analysts say the PKR election result reflects the shifting power dynamics within the reformist party, long shaped by Datuk Seri Anwar Ibrahim's tumultuous political journey.",
      "It has also reignited debate over political dynasties in a country where family ties often intersect with power.",
      "China has developed asymmetric weapons known as assassin's maces that could cripple America's infrastructure, and Congress must act to strengthen America's digital backbone to prepare for any road ahead.",
      "Russia is deploying a military strategy known as the “triple chokehold” to grind down Ukrainian troops, according to experts.",
      "A district judge ruled Thursday the federal government could not revoke the legal status of international students after a nationwide crackdown on foreign individuals at U.S. universities.",
      "The case involves two dozen students who were admitted to the U.S. on F-1 nonimmigrant visas who saw their status changed when the federal government took them… \"The NSC is the ultimate Deep State,\" one White House official told Axios.",
      "“When Trump finally figures out he’s trying to...” joked the late night comedian.",
      "The hosts of CNBC’s Squawk Box tore into President Donald Trump after he threatened new tariffs against Apple and Europe, sending the global stock market cratering.",
      "“You can see that it’s been a bad morning at the White House in terms of thinking these negotiations are getting somewhere,” observed co-host Becky Quick, jabbing Trump for his much-touted trade deals that have yet to materialize.",
      "Co-host Andrew Ross Sorkin was in agreement.",
      "“Well, that’s always been the big question.",
      "Everyone said w The four litigators, who have represented major tech companies and Democratic power players, announced Friday they are starting their own firm.",
      "\"If I had been a member of an administration where such unlawful orders had come from the White House, I would have resigned immediately,\" he said."
    ],
    "topics": [
      "white house",
      "national security",
      "president donald",
      "donald trump",
      "social media",
      "timothy haugh",
      "security agency",
      "cyber command",
      "wendy noble",
      "friday x"
    ]
  },
  {
    "title": "Ukraine accepts US proposal for 30-day ceasefire in war with Russia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraine-agrees-to-accept-immediate-30-day-ceasefire-us-ukraine-statement",
    "publishedAt": "2025-03-11T18:16:27Z",
    "sentences": [
      "JEDDAH, Saudi Arabia – The United States agreed on March 11 to resume military aid and intelligence sharing with Ukraine after talks where Kyiv said it would accept a US proposal for a 30-day ceasefire in its conflict with Russia, the countries said in a joint statement.",
      "US Secretary of State Marco Rubio said the US would now take the offer to Russia, and that the ball is in Moscow’s court.",
      "“The President wanted this war to end yesterday...",
      "So our hope is that the Russians will answer ‘yes’ as quickly as possible, so we can get to the second phase of this, which is real negotiations,” Mr Rubio told reporters, referring to US President Donald Trump, after more than eight hours of talks in Jeddah.",
      "The Kremlin launched a full-scale invasion of Ukraine three years ago, and Russia, which has been making advances, now holds around a fifth of Ukraine’s territory, including Crimea, which it claims to have annexed in 2014.",
      "Mr Rubio said Washington wanted a full agreement with both Russia and Ukraine “as soon as possible”.",
      "“Every day that goes by, this war continues, people die, people are bombed, people are hurt on both sides of this conflict,” he said.",
      "How Moscow would respond was far from certain.",
      "Russian President Vladimir Putin has said he is open to discussing a peace deal.",
      "But he has ruled out territorial concessions, and has said Ukraine must withdraw fully from four Ukrainian regions claimed and partly controlled by Russia.",
      "Ukrainian President Volodymyr Zelensky, who was in Saudi Arabia but did not participate in the talks, said the ceasefire was a “positive proposal” that covers the front line in the conflict, not just fighting by air and sea.",
      "In Saudi Arabia, the US and Ukraine also said they agreed to conclude as soon as possible a comprehensive agreement for developing Ukraine’s critical mineral resources, a deal that has been in the works for weeks and was thrown into limbo by an acrimonious White House meeting between the Republican US president and Mr Zelensky last week.",
      "A top aide to Mr Zelensky said options for security guarantees to Ukraine were discussed with US officials.",
      "The aide did not detail the options.",
      "Security guarantees have been one of Kyiv’s key aims, and some European countries have expressed willingness to explore sending peacekeepers.",
      "Mr Rubio said the plan will be delivered to the Russians through multiple channels.",
      "Mr Trump’s national security adviser, Mr Mike Waltz, told reporters that he would be talking to his Russian counterpart in the coming days.",
      "In the joint statement, Ukraine reiterated that European partners should be involved in the peace process.",
      "Nato Secretary-General Mark Rutte will be at the White House on March 13.",
      "Under Mr Trump, Kyiv’s one-time staunchest ally Washington has upended its policy on the war and piled pressure on Ukraine.",
      "Mr Waltz said the initial resumption of military assistance for Ukraine would entail equipment from US stockpiles.",
      "This was approved by former US president Joe Biden, using so-called Presidential Drawdown Authority, before he left office, and stopped by Mr Trump after the acrimonious White House meeting.",
      "As the diplomacy plays out, Ukraine’s battlefield positions have been under heavy pressure, particularly in Russia’s Kursk region where Moscow’s forces have launched a push to flush out Kyiv’s troops, which had been trying to hold a patch of land as a bargaining chip.",
      "Ukraine overnight launched its biggest drone attack on Moscow and the surrounding region yet, showing that Kyiv can also land major blows after a steady stream of Russian missile and drone attacks, one of which killed 14 people on March 8.",
      "The attack, in which 337 drones were downed over Russia, killed at least three employees of a meat warehouse and caused a short shutdown at Moscow’s four airports, Russian officials said.",
      "Ukraine said its drones struck an oil refinery near Moscow and a facility in Russia’s Oryol region, while Hungary said crude oil shipments via Russia’s Druzhba pipeline were suspended following the attack.",
      "US and Russian officials met in the Saudi capital in February in a rare encounter between the former Cold War foes.",
      "The discussions were focused largely on restoring ties after a near-total freeze on official contact under Mr Biden, Mr Trump’s Democratic predecessor.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "saudi arabia",
      "rubio said",
      "mr rubio",
      "us president",
      "white house",
      "joint statement",
      "told reporters",
      "soon possible",
      "said ukraine"
    ]
  },
  {
    "title": "US, South Korea drills to reflect North Korea-Russia threat",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/east-asia/us-south-korea-drills-to-reflect-north-korea-russia-threat",
    "publishedAt": "2025-03-06T03:25:00Z",
    "sentences": [
      "SEOUL – Upcoming joint drills by US and South Korean forces will factor in North Korea’s deepening military ties with Russia, according to a statement from Seoul, underscoring growing concerns about that alliance as tensions rise globally.",
      "The Exercise Freedom Shield 25 combined drills will run from March 10 to March 20, with joint field training that will involve various units, from land to cyberspace, said South Korea’s Defence Ministry in a statement.",
      "The drills will help reinforce confidence that the US-South Korea alliance remains firm despite a leadership crisis in Seoul after President Yoon Suk Yeol was impeached for his brief attempt to impose martial law in December 2024.",
      "The joint drills will be the first since US President Donald Trump returned to the White House in January, and they come at a time when North Korea has threatened to beef up its nuclear deterrence against what it labels provocations by Washington and Seoul.",
      "“By reflecting realistic threats, lessons learnt from recent armed conflicts, and evolving challenges, including the Democratic People’s Republic of Korea’s military strategy, tactics and capabilities, as well as its growing partnership with Russia, the ROK-US alliance will further strengthen its readiness, capability and combined defence posture,” the statement added, referring to the South’s official name, Republic of Korea.",
      "In recent months, North Korea has supplied artillery shells and sent troops to Russia to take part in the war in Ukraine, triggering condemnation from South Korea and the US.",
      "The statement from South Korea did not say how exactly the Pyongyang-Moscow ties will be incorporated into the drills with the US.",
      "South Korea relies on security guarantees from the US to deter North Korean aggression, providing sites that host about 28,500 American troops.",
      "Earlier in March, a nuclear-powered US aircraft carrier docked at a South Korean port, prompting the sister of North Korean leader Kim Jong Un to denounce the deployment of strategic assets in the region.",
      "In her statement on March 4, Ms Kim Yo Jong did not say whether she meant Pyongyang would conduct more nuclear or missile tests in response to what she characterised as US hostility.",
      "The US and South Korea say their exercises are intended to enhance combat readiness and capabilities, and are not aimed at toppling the regime in Pyongyang.",
      "North Korea’s last nuclear test took place in 2017, but it routinely conducts missile launches.",
      "During his first term, Mr Trump announced the suspension or scaling down of some major US-South Korea military drills, making the decision after his 2018 Singapore Summit with Mr Kim.",
      "The two met again in Vietnam in 2019 without reaching a deal to disarm North Korea of its nuclear arms.",
      "BLOOMBERG Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korea",
      "south korea",
      "us south",
      "joint drills",
      "drills us",
      "south korean",
      "republic korea",
      "korea military",
      "korea say",
      "north korean"
    ]
  },
  {
    "title": "After three years of war with Russia, Ukraine could be heading for an even more dangerous peace deal",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/three-years-on-after-russias-invasion-ukraine-faces-one-of-its-most-serious-challenges-to-date",
    "publishedAt": "2025-02-24T14:45:00Z",
    "sentences": [
      "LONDON – Ukraine marked the third anniversary of the Russian invasion on Feb 24 with a solemn ceremony in Kyiv, the capital, attended by 12 European heads of state and government, with many more joining by video link.",
      "“Three years of resistance.",
      "Three years of gratitude.",
      "Three years of absolute heroism of Ukrainians,” President Volodymyr Zelensky told his guests before thanking “all those who defend and support” Ukraine.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "three years",
      "london ukraine",
      "ukraine marked",
      "marked third",
      "third anniversary",
      "anniversary russian",
      "russian invasion",
      "invasion feb",
      "feb 24",
      "24 solemn"
    ]
  },
  {
    "title": "‘Aerial terror’: Russia launches largest drone attack in war on Ukraine, Kyiv says",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-launches-wars-largest-drone-attack-on-ukraine-kyiv-says",
    "publishedAt": "2025-02-23T11:42:55Z",
    "sentences": [
      "KYIV - Ukraine’s President Volodymyr Zelensky said on Feb 23 that Russia launched more than 200 drones in an overnight attack, the largest of the war, as he condemned Russia’s “aerial terror” and called for unity among Ukraine’s allies.",
      "“Every day, our people stand against aerial terror,” he wrote on X.",
      "“On the eve of the third anniversary of the full-scale war, Russia launched 267 attack drones against Ukraine – the largest attack since Iranian drones began striking Ukrainian cities and villages.” Ukraine's air force said in a statement that 138 of the drones were downed and another 119 disappeared from radars after being jammed by electronic warfare, adding that Russia also launched three ballistic missiles.",
      "Damage was reported in five regions of Ukraine.",
      "Moscow has launched near-nightly massed drone attacks at Ukraine for months, seeking to exhaust air defences.",
      "Mr Zelensky said that in total, nearly 1,150 attack drones, more than 1,400 guided aerial bombs and 35 missiles of various types, were launched by Russia at Ukraine in the past week.",
      "The president thanked those operating Ukraine’s air defences, and called on the country’s foreign allies to stand united to secure a “just and lasting peace”.",
      "\"This is achievable through the unity of all partners – we need the strength of all of Europe, the strength of America, the strength of everyone who seeks lasting peace.\"",
      "Kyiv and its European allies have been unnerved by new US President Donald Trump verbally attacking Mr Zelensky last week, as well as by a meeting between US and Russian delegations in Riyadh to which Ukraine was not invited.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "zelensky said",
      "russia launched",
      "aerial terror",
      "attack drones",
      "ukraine air",
      "air defences",
      "mr zelensky",
      "lasting peace",
      "kyiv ukraine",
      "ukraine president"
    ]
  },
  {
    "title": "Trump calls Ukraine’s Zelensky a ‘dictator’ as he hits back at ‘disinformation’ criticism",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/trump-brands-ukraines-zelensky-a-dictator",
    "publishedAt": "2025-02-19T17:01:46Z",
    "sentences": [
      "MIAMI – US President Donald Trump called Ukrainian leader Volodymyr Zelensky a “dictator” on Feb 19, widening a personal rift with major implications for efforts to end the conflict triggered by Russia’s invasion three years ago.",
      "The US had provided funding and arms to Ukraine, but in an abrupt policy shift since coming to power, Mr Trump has opened talks with Moscow.",
      "“A dictator without elections, Zelensky better move fast, or he is not going to have a country left,” Mr Trump wrote on his Truth Social platform of the Ukrainian leader, whose five-year term expired in 2024.",
      "Martial law introduced following Russia’s invasion of Ukraine in February 2022 bans a wartime election.",
      "The Constitution says the president serves until a newly elected one takes office.",
      "Mr Trump’s comments have spurred some, though not all of Ukraine’s opposition figures to speak out and rally around Mr Zelensky despite seeing him as a political opponent.",
      "Former prime minister Yulia Tymoshenko said Mr Zelensky was Ukraine’s legitimate leader until someone else was elected and that it was “impossible and immoral” to hold elections during the war, as the military would not be able to take part.",
      "She said on Facebook: “Only Ukrainians have the right to decide when and under what conditions they should change their government.",
      "Today, there are no such conditions!” On Feb 19, Mr Trump said his Treasury Secretary Scott Bessent was treated “rudely” during an official visit to Kyiv.",
      "He also accused Mr Zelensky of “sleeping” and failing to make a deal.",
      "Mr Bessent was dispatched to Kyiv on Feb 12 to discuss with Mr Zelensky granting Washington access to rare earth minerals in return for security support.",
      "“Scott Bessent actually went there and was treated rather rudely, because essentially, they told him ‘no’,” Mr Trump told reporters on Air Force One.",
      "“And Zelensky was sleeping and unavailable to meet him.” Mr Bessent “travelled many hours on the train, which is a dangerous trip, and we’re talking about the Secretary of the Treasury”, Mr Trump said.",
      "“He went there to get a document signed, and when he got there, he came back empty,” he added.",
      "“They wouldn’t sign the document.” Mr Bessent said Mr Zelensky assured him ahead of the Munich Security Conference that took place between Feb 14 and Feb 16 that Ukraine would sign a US$500 billion (S$668.6 billion) deal handing over rights to Ukrainian minerals but has not signed yet.",
      "On Feb 18, Mr Trump held a press conference in which he criticised Mr Zelensky, repeated several Kremlin narratives about the conflict and called for an end to the war.",
      "Mr Zelensky in turn accused Mr Trump of succumbing to Russian “disinformation” – including the US President blaming Kyiv for having “started” the war and echoing Kremlin questions over the Ukrainian leader’s legitimacy.",
      "“He refuses to have elections, is very low in Ukrainian polls, and the only thing he was good at was playing (former US president Joe) Biden ‘like a fiddle’,” Mr Trump said in his Truth Social post of Mr Zelensky.",
      "“In the meantime, we are successfully negotiating an end to the war with Russia, something all admit only ‘Trump’, and the Trump administration, can do,” he added.",
      "Mr Trump said he hoped for a ceasefire between Russia and Ukraine soon.",
      "Mr Zelensky was elected in 2019 for a five-year term but has remained leader under martial law imposed following the Russian invasion.",
      "His popularity has eroded, but the percentage of Ukrainians who trust him has never dipped below 50 per cent since the conflict started, according to the Kyiv International Institute of Sociology.",
      "Mr Trump’s invective drew shock from Europe, where German Chancellor Olaf Scholz said it was “wrong and dangerous” to call Mr Zelensky a dictator.",
      "Mr Trump has long held his party in lockstep, but moderate Republicans swiftly pushed back against his attack on Mr Zelensky.",
      "“(Russian President Vladimir) Putin started this war.",
      "Putin committed war crimes.",
      "Putin is the dictator who murdered his opponents.",
      "The EU nations have contributed more to Ukraine.",
      "Zelensky polls over 50 per cent.",
      "Ukraine wants to be part of the West, Putin hates the West,” Representative Don Bacon, from Nebraska, wrote on social media platform X on Feb 19.",
      "“I don’t accept George Orwell’s doublethink,” he added, referring to the author of the dystopian novel 1984.",
      "Under Mr Biden, the US lauded Mr Zelensky as a hero and hammered Moscow with sanctions as Ukraine battled against advancing Russian troops.",
      "New York Republican Mike Lawler said Mr Putin demanding an election in Ukraine was “both comical and self-serving”.",
      "He said on X: “Vladimir Putin is a vile dictator and thug, who has worked in a concerted effort with China and Iran to undermine and destabilise the United States, Europe, Israel and the free world.",
      "He is not our friend, nor our ally.” Senator Lindsey Graham, Mr Trump’s staunch ally, meanwhile, threaded the needle carefully, writing that he blames Mr Putin “above all others” for the war – but adding on X that he still saw the US President as Ukraine’s “best hope”.",
      "Former vice-president Mike Pence, who broke with Mr Trump after his supporters stormed the US Capitol in 2021 in a bid to overturn his 2020 election loss to Mr Biden, also issued a rare public rebuke.",
      "“Mr President, Ukraine did not ‘start’ this war.",
      "Russia launched an unprovoked and brutal invasion, claiming hundreds of thousands of lives,” he wrote on X. Moscow has been buoyed by US-Russia talks in Saudi Arabia on Feb 18 on ending the war in Ukraine and Mr Trump’s attacks on Mr Zelensky.",
      "The talks “made the first step to restore work in various areas of mutual interests”, Mr Putin told journalists while visiting a drone manufacturing plant in his native St Petersburg.",
      "Kyiv was not invited to the Riyadh talks, as Moscow and Washington moved to sideline both Ukraine and Europe.",
      "Mr Putin said the US allies “only have themselves to blame for what’s happening”, suggesting they were paying the price for opposing Mr Trump’s return to the White House.",
      "Tensions between Mr Zelensky and Mr Trump over the new US position on the war had been building for weeks, before bursting into the open.",
      "But Mr Zelensky sought to take a positive approach ahead of meeting Mr Trump’s special envoy for Ukraine, Mr Keith Kellogg, in Kyiv on Feb 20, saying that “it is very important for us that the meeting and our work with America in general be constructive”.",
      "After their meeting, Mr Zelensky’s office said their joint news conference was cancelled at the request of the US, the RBC-Ukraine outlet reported.",
      "Russia, which for years has railed against the US military presence in Europe, wants a reorganisation of the continent’s security framework as part of any deal to end the Ukraine fighting.",
      "Mr Putin on Feb 19 said Russia and the US needed to work with each other if talks were to be successful.",
      "“It is impossible to solve many issues, including the Ukrainian crisis, without increasing the level of trust between Russia and the United States,” he said.",
      "AFP, BLOOMBERG, REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "mr zelensky",
      "mr putin",
      "us president",
      "feb 19",
      "trump said",
      "ukrainian leader",
      "said mr",
      "mr bessent",
      "zelensky dictator"
    ]
  },
  {
    "title": "US seems more than happy to satisfy Russia’s aspirations at talks in Saudi Arabia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/middle-east/us-seems-more-than-happy-to-satisfy-russias-aspirations-at-talks-in-saudi-arabia",
    "publishedAt": "2025-02-19T09:10:00Z",
    "sentences": [
      "LONDON – Russia emerged as the clear winner from talks held between US and Russian officials in the Saudi capital of Riyadh on Feb 18.",
      "The first public diplomatic encounter between the two powers in three years was convened to end the war in Ukraine.",
      "But in Riyadh, the American delegation – composed of Secretary of State Marco Rubio, National Security Adviser Mike Waltz and Mr Steve Witkoff, the US President’s special envoy and golf buddy – dangled before the Russians the much broader prospect of productive cooperation in geopolitics and, above all, economic investments.",
      "Therefore, it was hardly surprising that the usually glum-looking Russian Foreign Minister Sergey Lavrov, who has led his country’s diplomacy for more than two decades, was beaming broadly at the end of the talks in Saudi Arabia.",
      "Mr Lavrov said that “the atmosphere was exceedingly positive” and referred to the US negotiators as “positive individuals”.",
      "US President Donald Trump agreed to negotiations over the war in Ukraine after a Feb 12 phone call with Russian President Vladimir Putin.",
      "This generated a storm of protests from European governments, who were not consulted before the launch of Mr Trump’s initiative and argued that no settlement of the Ukraine conflict was feasible without Ukrainians sitting at the negotiation table.",
      "American officials dismissed such concerns as premature and exaggerated.",
      "They said that the talks in Riyadh were preliminary, just feelers to determine the Russian position.",
      "But right from the start, Moscow was careful to present its renewed links with the US as more than just a discussion over Ukraine.",
      "“The main thing is to begin a real normalisation of relations between us and Washington,” said Mr Yuri Ushakov, a former Russian ambassador to the US and one of Mr Putin’s closest foreign policy aides, who also attended the talks in Riyadh.",
      "There are two reasons why the Russians are eager to cast their talks with the US in a broader perspective.",
      "The first is that the Russians have already obtained the main concessions on Ukraine they wanted from the US.",
      "Even before the Riyadh talks started, Mr Trump announced that he sought an immediate ceasefire in Ukraine almost regardless of the conditions, that Russia would be allowed to keep the estimated 20 per cent of Ukraine’s territory it currently occupies, and that Ukraine would not benefit from any future US security guarantees.",
      "Russia’s diplomats were initially expected to fight hard for such concessions.",
      "Instead, they received them on a plate, and the Russians now want more.",
      "The second explanation for Russia’s growing aspirations is that Mr Putin has long sought to recover his country’s status as a global power.",
      "Therefore, any agreement with the US that boosts Russia in this direction is welcome.",
      "In Riyadh, the US negotiators seemed more than happy to satisfy Russia’s aspirations.",
      "They agreed, for instance, that one of the two countries’ priorities is to remove the restrictions placed on each other’s diplomatic missions.",
      "These restrictions started in March 2018 when none other than Mr Trump was in the White House and when the US, together with its allies, expelled a large number of Russian diplomats in response to a botched attempt by Mr Putin’s agents to poison Russian defectors living in the English city of Salisbury.",
      "Since then, Russia and the US have imposed caps on embassies in each other’s capitals and have closed several consulates.",
      "In Riyadh, however, Russian and US negotiators agreed to “establish a consultation mechanism to address irritants” in their bilateral relationship “with the objective of taking steps necessary to normalise the operation of our respective diplomatic missions”, according to the official communique.",
      "More importantly, Mr Rubio stated that the two sides laid “the groundwork for future cooperation on matters of mutual geopolitical interest and historic economic and investment opportunities”.",
      "All of this is music to Moscow’s ears, so Russia responded almost immediately by tightening its demands on Ukraine.",
      "Soon after the talks in Riyadh concluded, Russia’s Foreign Ministry spokeswoman Maria Zakharova raised what appeared to be a new condition: Russia was demanding “not just a pledge” to deny Ukraine any future Western security guarantees, but a formal withdrawal of previous plans to admit Ukraine into the Nato military alliance.",
      "And Mr Lavrov upped the stakes even further by specifying that Russia will not accept the presence of any Western troops on Ukraine’s soil under any guise.",
      "“The deployment of troops from the same Nato countries, but under a different flag – European Union or their national flags – changes nothing.",
      "Of course, this is unacceptable for us,” Mr Lavrov said.",
      "Such preconditions amount to an apparent demand that Ukraine should be abandoned to Russia’s mercies.",
      "To make matters worse, Mr Trump subsequently appeared to accept Russia’s propaganda narrative about Ukraine.",
      "In a press conference soon after the Riyadh talks concluded, Mr Trump falsely claimed that Ukraine, rather than Russia, started the current war, which began in February 2022.",
      "“You should have never started it,” the US President said, pretending to address Ukrainian President Volodymyr Zelensky.",
      "Mr Trump also called for fresh elections in Ukraine, claiming – yet again, falsely – that Mr Zelensky’s domestic popularity is “down at 4 per cent approval rating”.",
      "This is a Russian claim that the US President also appears to share, notwithstanding the latest opinion polls inside Ukraine, which indicate that Mr Zelensky’s popularity stands at 50 per cent.",
      "European governments are alarmed by rumours that Mr Trump is even prepared to discuss a withdrawal of some American troops from Europe in return for a broader deal with Russia.",
      "US officials scrambled to reassure their European allies as the Riyadh talks ended.",
      "The allies “are consulted literally almost every day”, said Mr Waltz.",
      "And Mr Rubio phoned key European foreign ministers to brief them about the talks with Russia.",
      "However, Europeans are not reassured.",
      "French President Emmanuel Macron’s call for another summit of European leaders on Feb 19 – the second such gathering this week – indicates their alarm.",
      "“Russia will try to divide us.",
      "Let’s not walk into their traps.",
      "By working together with the US, we can achieve a just and lasting peace – on Ukraine’s terms,” urged Ms Kaja Kallas, the EU’s top diplomat.",
      "Few believe that Washington is listening to her appeal.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "us president",
      "mr lavrov",
      "us negotiators",
      "talks riyadh",
      "mr putin",
      "riyadh talks",
      "per cent",
      "war ukraine",
      "waltz mr"
    ]
  },
  {
    "title": "Major risks loom as Trump upends US’ Russia policy",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/united-states/major-risks-loom-as-trump-upends-us-russia-policy",
    "publishedAt": "2025-02-19T02:11:34Z",
    "sentences": [
      "WASHINGTON - When Russian President Vladimir Putin launched his invasion of Ukraine nearly three years ago, then US president Joe Biden took a firm stand in solidarity with Kyiv, forged a bulwark of European allies and set veteran advisers to the task of isolating Moscow economically and diplomatically.",
      "Washington’s approach changed dramatically with a Feb 18 initial meeting between US and Russian negotiators.",
      "The officials met just a month after Mr Donald Trump returned to the White House, with Ukraine and Nato partners sidelined by a relatively inexperienced team of Trump aides, and Mr Putin granted concessions even before the talks got under way.",
      "Mr Trump’s rush to impose an end to Russia’s war in Ukraine has stoked fears of a peace deal with Mr Putin that could undermine Kyiv and Europe’s security and alter the geopolitical landscape.",
      "“The really worrying fact is that Trump has taken Russia from pariah to prize partner in the time span of just a few days.",
      "That comes at a price,” said Mr Brett Bruen, a former foreign policy adviser in the Obama administration.",
      "The talks in Riyadh, the first time the US and Russia have met to discuss the deadliest conflict in Europe since World War II, yielded agreement to form negotiating teams for future meetings and work to restore the normal functioning of each other’s diplomatic missions, reflecting a thawing of long-frozen relations.",
      "Even before the talks, European politicians accused Mr Trump of handing free concessions to Moscow last week by ruling out Nato membership for Ukraine and saying it was an illusion for Kyiv to believe it could win back the 20 per cent of its territory now under Russian control.",
      "Some critics condemned Mr Trump for what they said amounted to appeasement.",
      "Ukraine’s exclusion from the meeting on Feb 18 marked a sharp departure from Mr Biden and Nato’s mantra of “nothing about Ukraine without Ukraine”.",
      "Kyiv has said it will not accept any deal imposed without its consent.",
      "And the absence of European representatives added to US allies’ anxieties about whether Mr Trump might be willing to give up too much for little from Mr Putin.",
      "That helped spur European governments to discuss the possibility of contributing peacekeepers to back any deal on Ukraine.",
      "Mr Trump told reporters on Feb 18 he would not object to such a deployment, though Russian Foreign Minister Sergei Lavrov said Moscow would not accept Nato troops there, signaling that Russia may resist any major compromise.",
      "There was no immediate sign that Russian officials had offered any concessions in the meeting.",
      "The encounter saw Mr Lavrov and Kremlin foreign policy aide Yuri Ushakov – two veterans who have spent a combined 34 years in their current roles – negotiate with three Trump aides in their first month on the job – Secretary of State Marco Rubio, national security adviser Mike Waltz and Trump envoy Steve Witkoff.",
      "“The American team has almost no experience in high-level international negotiation, no regional expertise on Ukraine and Russia, and no relevant foreign language knowledge,” Dr Timothy Snyder, a Yale University professor and Russia expert, wrote on X.",
      "“Not true of the Russians, to put it mildly.” Mr Bruen described it as “amateur hour” for Mr Trump’s national security apparatus.",
      "A Trump administration official said Washington could not help foster a lasting peace with the same lack of engagement that has allowed the death and destruction in Ukraine to continue.",
      "“President Trump has built a strong team that is already demonstrating his peace through strength agenda in action,” said Mr Brian Hughes, spokesman for the White House National Security Council.",
      "Mr Trump said he was more confident after the talks and he would probably meet with Mr Putin before the end of the month.",
      "He has praised Mr Putin in the past and commended him for a conciliatory attitude after their phone call last week.",
      "“Russia wants to do something,” Mr Trump told reporters in Palm Beach, Florida, on Feb 18.",
      "He brushed aside Ukraine’s concern about being left out of the meeting and said Kyiv should have entered talks much earlier.",
      "Mr Rubio said earlier that no one was being frozen out and any solution must be acceptable to all parties.",
      "But there was no immediate word on how Ukraine might be allowed to join.",
      "Ukrainian President Volodymyr Zelensky postponed a visit to Saudi Arabia planned for Feb 19 because of what sources familiar with the matter said was to avoid giving “legitimacy” to the US-Russia talks.",
      "He drew the Trump administration’s ire last weekend when he said a draft minerals deal with Washington did not contain the security provisions that Kyiv needed.",
      "Three sources said the US had proposed taking ownership of 50 per cent of Ukraine's critical minerals, apparently in compensation for vital US military aid, a demand some Trump critics have likened to extortion.",
      "Dr Emma Ashford, senior fellow at Stimson Centre think tank in Washington, said the Trump administration may have been justified in keeping the talks limited for now.",
      "“It’s certainly not ideal that Ukraine was not in the room, though I believe they’ll be at future such meetings,” she said.",
      "“But the administration is probably right that including a variety of European partners in the room might make for too many voices and make any progress more difficult.” Still, Democrat Jake Auchincloss, who is a co-chair of the House of Representatives’ Ukraine caucus, said Russia had won round one.",
      "“The Kremlin has been normalised in bilateral diplomacy that excludes Ukraine and Nato, and they gave up nothing to get that,” he told Reuters.",
      "Three Western intelligence officials told Reuters they have seen no new evidence that suggests Mr Putin’s goals have changed, saying he intends to hold all the territory his forces have taken with the long-term aim of expanding his reach inside Europe.",
      "“Putin will not stop at Ukraine,” Mr Darius Jauniskis, director of Lithuania’s State Security Department, told Reuters.",
      "“Is there a sincere desire to end the war?",
      "I don’t think so.” Mr Trump’s fellow Republican, Mr Roger Wicker, chairman of the Senate Armed Services Committee, agreed Mr Putin could not be trusted in Ukraine talks.",
      "“Putin is a war criminal,” Mr Wicker told CNN.",
      "When asked about Mr Trump’s comment that he believes Mr Putin wants peace, Mr Wicker added: “What we can trust the Russians to do, is to do anything to their advantage, to take temporary steps.” REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "mr putin",
      "feb 18",
      "national security",
      "trump administration",
      "told reuters",
      "white house",
      "ukraine nato",
      "trump aides",
      "even talks"
    ]
  },
  {
    "title": "Russia offers India its most advanced Su-57 stealth fighter jet",
    "source": "Yahoo Singapore News",
    "url": "https://sg.news.yahoo.com/russia-offers-india-most-advanced-155136599.html",
    "publishedAt": "2025-02-11T15:51:36Z",
    "sentences": [
      "By Shivam Patel and Abhijith Ganapavaram BENGALURU, India (Reuters) - Russia has offered to make its fifth-generation stealth fighter jet Sukhoi Su-57 in India for the Indian Air Force, a Russian and an Indian official said on Tuesday, as Moscow looks to boost defence ties with New Delhi.",
      "Russia has for decades been the main weapons supplier to India, the world's biggest arms importer, and its fighter jets are part of India's military fleet.",
      "But Moscow's ability in recent years to export has been hobbled by the war in Ukraine, making New Delhi look westward.",
      "A spokesperson for Russian state arms exporter Rosoboronexport told reporters the fighter jet could go into production as early as this year if the Indian government accepts its offer.",
      "India's defence ministry did not immediately respond to a request for comment.",
      "A Russian industry source and an Indian official said an informal offer had been made by Russia in talks with officials of the Indian government and state-owned planemaker Hindustan Aeronautics Ltd.",
      "The move comes as the Indian Air Force is keen to shore up its fighter squadrons, which have fallen to 31 from a target of 42, at a time when rival China is expanding its own air force.",
      "Making the aircraft in India, with a full transfer of technology, will ensure that production and maintenance will not be affected by Western sanctions on Russia, the Rosoboronexport spokesperson told reporters on the sidelines of the Aero India aerospace exhibition in the southern city of Bengaluru.",
      "He declined to share his name.",
      "He said the jet could be produced with enhancements to the Indian production line of the Sukhoi Su-30 aircraft, 260 of which are in the Indian Air Force's fleet.",
      "Both the Su-57 and rival Lockheed Martin's F-35 Lightning II, a fifth generation stealth fighter jet of the U.S., were on display at the Aero India exhibition.",
      "Prime Minister Narendra Modi's government has been stressing the need to make India a global manufacturing hub and boost domestic defence production in order to achieve self reliance.",
      "Despite being touted as a Russian fifth-generation fighter aircraft to rival its U.S. equivalent, the Su-57 was plagued by development delays and a crash in 2019.",
      "According to its manufacturer, serial production of the aircraft began in 2022.",
      "Last year, Russia flew the SU-57, to Zhuhai in China for its first air show abroad, in an apparent message to the West about China-Russia cooperation.",
      "(Reporting by Shivam Patel and Abhijith Ganapavaram in Bengaluru; Editing by Bernadette Baum) North Korea’s newest warship was severely damaged during a launch ceremony Wednesday, with leader Kim Jong Un, who witnessed the accident, saying it brought shame to the nation’s prestige and vowing to punish those found responsible, state media reported.",
      "UK and US among nations seeking to keep Middle East from all-out war in wake of Israeli airstrikes on military targets with Tehran saying it is ‘obligated’ to respond \"I'm a strong Republican and in general a big fan of Trump but this is a sad day for America.\"",
      "It took the US president four months to come to the same conclusion as the rest of Ukraine's allies... A single-vote win could reshape taxes, gut clean energy, and spark bond market chaos--just before the 2024 election fight.",
      "Singaporean Harvard students need to leave uni as Trump bans its international student enrolment, bumper crop of new faces in PM Lawrence Wong's Cabinet, and more news and updates from Yahoo Singapore.",
      "A Thai court on Thursday ordered exiled former Prime Minister Yingluck Shinawatra to pay more than 10 billion baht ($304 million) to compensate for losses incurred by a money-losing rice farming subsidy program that her administration had implemented more than a decade ago.",
      "The Supreme Administrative Court partially reversed a 2021 court ruling that cleared her.",
      "It found her guilty of severe negligence in relation to rice sales to other countries and said she failed to act on many government agencies’ warnings of possible corruption.",
      "Singapore’s Deputy Prime Minister Gan Kim Yong said neutrality is not possible, highlighting the rising challenges for the city-state that has long sought to tread a diplomatic tightrope amid US-China trade tensions.",
      "ISLAMABAD, NEW DELHI (Reuters) -Pakistan will not get water from rivers over which India has rights, Indian Prime Minister Narendra Modi said on Thursday, upping the rhetoric in a standoff over water access triggered by a deadly attack in Indian Kashmir.",
      "Pakistan's chief legal officer, in an interview with Reuters, responded that Islamabad remained willing to discuss water sharing between the neighbours but said India must stick to a decades-old treaty.",
      "Treasury Secretary Scott Bessent squirmed in his seat when he was pressed on President Donald Trump’s faltering trade deal negotiations on Fox News.",
      "In early April, Trump’s trade adviser Peter Navarro said the Trump administration was primed to strike 90 deals in 90 days with trade partners.",
      "Trump and his economic advisers had envisaged countries queuing up to hash out terms to soften the president’s so-called “Liberation Day” tariffs, after a 90-day pause was imposed on the super-charged levies China has developed asymmetric weapons known as assassin's maces that could cripple America's infrastructure, and Congress must act to strengthen America's digital backbone to prepare for any road ahead.",
      "Amid mounting trade friction between the European Union and China, President Emmanuel Macron made a call to Chinese President Xi Jinping, a move that highlights France’s push to ease trade with Beijing while reinforcing its diplomatic presence in the Indo-Pacific region.",
      "As he prepares to embark on a diplomatic tour of Southeast Asia, Macron held a strategic call with Xi, pressing for progress on a key trade dispute and backing closer cooperation on global flashpoints such as Ukraine and Gaza.Al Chinese Premier Li Qiang has congratulated Prime Minister Lawrence Wong on his second term in office.",
      "MFA rejects social media diplomacy after US and Chinese embassies clash over the South China Sea while ICA reviews the PR status of convicted sex offenders Ian Fang and Lev Panfilov.",
      "Plus some of the biggest and fascinating news in Singapore and beyond.",
      "Rahm Emanuel explained what will lead voters to start turning to Democrats as a check on the president's \"chaotic corruption.\"",
      "The defense secretary led a gathering that \"appeared to be a first for a Pentagon chief.\"",
      "A district judge ruled Thursday the federal government could not revoke the legal status of international students after a nationwide crackdown on foreign individuals at U.S. universities.",
      "The case involves two dozen students who were admitted to the U.S. on F-1 nonimmigrant visas who saw their status changed when the federal government took them… BEIJING (Reuters) -It is \"arrogant and ignorant\" to call Taiwan a country and its future can only be decided by China's 1.4 billion people, the Chinese foreign ministry said on Thursday in a rebuff to the democratically-governed island's foreign minister.",
      "China views Taiwan as its own territory and says the island is one of its provinces with no right to be called a state.",
      "Taiwan's Foreign Minister Lin Chia-lung said on Wednesday that China had no authority to decide whether Taiwan was a country because the island chooses its own government.",
      "Army engineers are set to use thick steel plates and perhaps other measures to protect DC's roads during the Army's upcoming 250th birthday parade.",
      "\"The NSC is the ultimate Deep State,\" one White House official told Axios."
    ],
    "topics": [
      "prime minister",
      "air force",
      "fighter jet",
      "indian air",
      "new delhi",
      "shivam patel",
      "patel abhijith",
      "abhijith ganapavaram",
      "ganapavaram bengaluru",
      "stealth fighter"
    ]
  },
  {
    "title": "‘We walked into hell’: Tricked into Russia’s Ukraine war, Indians who escaped live with trauma",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/we-walked-into-hell-tricked-into-russias-ukraine-war-indians-who-escaped-live-with-trauma",
    "publishedAt": "2025-02-08T21:00:00Z",
    "sentences": [
      "BENGALURU – The horrors of a war he did not choose and the deaths he saw up close have broken Mr Jain T.K, an Indian citizen who once believed that his fortune lay beyond his country’s shores.",
      "“I want to return home somehow.",
      "I am tired.",
      "It’s been too long,” the 27-year-old told The Straits Times in a video call on Jan 29, before shutting his eyes in pain as he lay half-paralysed on a hospital bed in Moscow.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "bengaluru horrors",
      "horrors war",
      "war choose",
      "choose deaths",
      "deaths saw",
      "saw close",
      "close broken",
      "broken mr",
      "mr jain",
      "jain indian"
    ]
  },
  {
    "title": "Russian military reports capture of new village in eastern Ukraine",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/russian-military-reports-capture-of-new-village-in-eastern-ukraine",
    "publishedAt": "2025-01-29T22:59:16Z",
    "sentences": [
      "MOSCOW - Russia’s defence ministry said on Jan 29 that its troops had taken control of the village of Novoielyzavetivka in Ukraine’s eastern Donetsk region, near the logistics centre of Pokrovsk, the latest target in their steady advance westward.",
      "Reuters could not independently confirm the battlefield report.",
      "The General Staff of Ukraine’s military made no mention of the village in a late evening report.",
      "It reported “intensive” Russian activity in the Pokrovsk sector, with Ukrainian forces repelling 39 attacks by Moscow’s forces and nine clashes continuing.",
      "The popular Ukrainian military blog DeepState, which records military positions on the basis of open source materials, showed Novoielyzavetivka to be under Russian occupation.",
      "Pokrovsk hosts the only colliery in Ukraine producing coking coal for the steel industry – closed down as Russian troops approach the city – and is seen as a main target for Moscow.",
      "Russian forces have focused on capturing all of Donbas, made up of Donetsk and Luhansk regions, after initially failing to move on the capital Kyiv in the early weeks of the February 2022 invasion of Ukraine.",
      "Their progress in recent months has been the fastest since the launch of the invasion.",
      "On Jan 27, Russia’s military reported the capture of the village of Dvorichna, near the city of Kupiansk in north-eastern Kharkiv, another area of intensified Russian activity.",
      "But the governor of Kharkiv region, Mr Oleh Syniehubov, denied that Russian forces had seized the village and said fighting was continuing.",
      "Moscow announced the capture of the town of Velyka Novosilka south of Pokrovsk last weekend.",
      "Ukraine’s military has yet to acknowledge that the town is entirely under Russian control.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "ukraine military",
      "russian activity",
      "russian forces",
      "moscow russia",
      "russia defence",
      "defence ministry",
      "ministry said",
      "said jan",
      "jan 29",
      "29 troops"
    ]
  },
  {
    "title": "Trump threatens Russia and other countries with sanctions, tariffs if Ukraine deal not reached",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/trump-threatens-russia-other-countries-with-sanctions-tariffs-if-ukraine-deal-not-reached",
    "publishedAt": "2025-01-22T17:46:35Z",
    "sentences": [
      "WASHINGTON - US President Donald Trump said on Jan 22 that he would add new tariffs to his sanctions threat against Russia if the country does not make a deal to end its war in Ukraine, and added that these also could be applied to “other participating countries”.",
      "In a post on Truth Social, Mr Trump modified comments he made on Jan 21 that he would likely impose sanctions against Russia if President Vladimir Putin refused to negotiate an end to the nearly three-year invasion.",
      "“If we don’t make a ‘deal’, and soon, I have no other choice but to put high levels of taxes, tariffs and sanctions on anything being sold by Russia to the United States, and various other participating countries,” Mr Trump said.",
      "His post did not identify the countries that he considered participants in the conflict, or how he defined participation.",
      "Former US president Joe Biden’s administration heaped heavy sanctions on thousands of entities in Russia’s banking, defence, manufacturing, energy, technology and other sectors since Moscow’s February 2022 full-scale invasion of Ukraine, which has killed tens of thousands of people and reduced cities to rubble.",
      "Russia’s deputy UN ambassador Dmitry Polyanskiy said Moscow will have to see what Mr Trump thinks a “deal” to end the war in Ukraine means.",
      "“It’s not merely the question of ending the war,” Mr Polyanskiy told Reuters.",
      "“It’s first and foremost the question of addressing root causes of the Ukrainian crisis.” In the run-up to his Nov 5 election victory, Mr Trump declared dozens of times that he would have a deal in place between Ukraine and Russia on his first day in office, if not before.",
      "But his aides have conceded that a deal to end the war could take months or longer.",
      "Earlier in January, the US Treasury hit Russia’s energy revenues with its hardest sanctions yet, targeting oil and gas producers Gazprom Neft and Surgutneftegas, as well as 183 vessels that are part of the so-called shadow fleet of tankers aimed at evading other Western trade curbs.",
      "Mr Trump has sought to use the threat of tariffs to achieve non-trade goals, including threatening Mexico, Canada and China with duties to push them to stop illegal migration and the flow of the deadly opioid fentanyl into the US.",
      "Those three countries are the US’ top trading partners, accounting for more than US$2.1 trillion (S$2.85 trillion) in annual two-way trade.",
      "But Russia is far down the list, with US imports from Russia falling to just US$2.9 billion through the first 11 months of 2024, from US$29.6 billion in 2021.",
      "The US imported US$13.5 billion worth of Russian petroleum products in 2014, but this has fallen to zero after Ukraine war-related sanctions.",
      "Some other top import categories a decade ago, including semi-finished steel and pig iron, have also fallen to zero.",
      "The US still imports significant amounts of Russian fertiliser used in agriculture – about US$1.4 billion worth in 2023 – as well as more than US$1 billion each worth of uranium for nuclear power use and palladium and rhodium used in automotive catalytic converters.",
      "Mr Tim Brightbill, a trade attorney at law firm Wiley Rein in Washington, said: “One way to hit Russia hard would be to sanction and stop the use of Russian wood in finished wood products coming from China, Vietnam and other countries.” As for other participants, the Biden administration had imposed sanctions against entities in North Korea and Iran for weapons supplies to Russia, and against Chinese entities that supply components and other goods to Russia’s war effort.",
      "Mr Trump said he was “going to do Russia, whose Economy is failing, and President Putin, a very big FAVOUR.",
      "Settle now, and STOP this ridiculous War!”.",
      "The negotiating positions of the two warring sides remain far apart, and some Ukrainians fear they could be forced to make massive concessions after three years of brutal combat.",
      "The conflict has developed into a war of attrition, largely fought along front lines in eastern Ukraine, with huge numbers of casualties on both sides.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr trump",
      "us billion",
      "trump said",
      "deal end",
      "end war",
      "billion worth",
      "us president",
      "tariffs sanctions",
      "make deal",
      "war ukraine"
    ]
  },
  {
    "title": "Putin vows to further develop ties with Xi just hours after Trump inauguration",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/putin-vows-to-further-develop-ties-with-xi-just-hours-after-trump-inauguration",
    "publishedAt": "2025-01-21T09:51:06Z",
    "sentences": [
      "MOSCOW - Russian President Vladimir Putin and Chinese President Xi Jinping discussed on Jan 21 how to build ties with Donald Trump, prospects for a peace deal to end the war in Ukraine and Moscow’s firm support for Beijing’s position on Taiwan.",
      "Mr Xi and Mr Putin, who spoke for an hour and 35 minutes by video call after Mr Trump was sworn in as US President, proposed a further deepening of the strategic partnership between their countries which worries the West.",
      "China and Russia declared a “no limits” partnership in February 2022 when Mr Putin visited Beijing, days before he sent tens of thousands of troops into Ukraine.",
      "Mr Putin has in recent months described China as an “ally”.",
      "Mr Putin, 72, speaking from his Novo-Ogarevo residency outside Moscow, and Mr Xi, 71, speaking from the Great Hall of the People in Beijing, called each other “dear friends”, and Mr Xi told Mr Putin about a call with Mr Trump on Jan 17 on TikTok, trade and Taiwan.",
      "Both leaders “have indicated a willingness to build relations with the United States on a mutually beneficial, mutually respectful basis, if the Trump team really shows interest in this,” Kremlin foreign policy aide Yuri Ushakov told reporters in Moscow.",
      "“It was also noted from our side that we are ready for dialogue with the new US administration on the Ukrainian conflict.” Mr Ushakov said Mr Putin wanted long-term peace in Ukraine, not a short-term ceasefire, but any deal must take into account Russia’s interests.",
      "No specific proposals for a call with Mr Trump have been received, he said.",
      "Mr Trump has said he will be tough on China and speak to Mr Putin about ending the war in Ukraine.",
      "In remarks to reporters after his inauguration, the US President said Mr Putin should make a deal to end the war because the conflict was destroying Russia.",
      "Russia and China have increasingly found common geopolitical cause.",
      "Mr Xi has called for talks to end the war in Ukraine and has accused the US of stoking the war with weapons supplies to Kyiv, which also says it is ready to seek a negotiated solution that respects its interests.",
      "Mr Trump told The Wall Street Journal in October that Mr Xi was “a good poker player” and that he got along “great” with Mr Putin, but that during his first term, he had warned Mr Putin that the US could strike Moscow if Russia went farther in Ukraine.",
      "Mr Putin and Mr Xi share a broad world view, which portrays the West as decadent and in decline as China challenges US supremacy in many areas.",
      "“We jointly advocate building a more just multi-polar world order, and we are working in the interests of ensuring indivisible security in the Eurasian space and in the world as a whole,” Mr Putin said.Mr Ushakov said the Putin-Xi video call had been planned before Mr Trump’s inauguration.",
      "The United States casts China as its biggest competitor and Russia as its biggest nation-state threat.",
      "Former US President Joe Biden has said the world’s democracies face a challenge from “autocracies” such as China and Russia.",
      "China is the largest consumer of Russian energy, and the biggest single oil export market for Russia, Mr Putin said, adding that they would push ahead with cooperation on cooperating on fast neutron reactors and reprocessing nuclear fuel.",
      "On Taiwan, Mr Ushakov said Russia had “confirmed its unwavering position of support for the one-China principle”.",
      "Mr Xi said in a New Year’s speech that no one could stop China’s “reunification” with Taiwan, a clear warning to what Beijing regards as pro-independence forces within and outside of the island of 23 million people.",
      "China regards democratically governed Taiwan as its own territory.",
      "Taiwan’s government rejects Beijing’s claims and says only its people can decide their future and Beijing ought to respect the choice of the Taiwanese people.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr putin",
      "mr xi",
      "mr trump",
      "end war",
      "war ukraine",
      "call mr",
      "us president",
      "ushakov said",
      "said mr",
      "deal end"
    ]
  },
  {
    "title": "Zelensky says he’s ready to exchange North Korean soldiers for Ukrainians held in Russia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/zelensky-says-hes-ready-to-exchange-north-korean-soldiers-for-ukrainians-held-in-russia",
    "publishedAt": "2025-01-12T19:08:03Z",
    "sentences": [
      "KYIV – Ukrainian President Volodymyr Zelensky said on Jan 12 that Kyiv is ready to hand over North Korean soldiers to their leader Kim Jong Un if he can facilitate their exchange for Ukrainians held captive in Russia.",
      "“In addition to the first captured soldiers from North Korea, there will undoubtedly be more.",
      "It’s only a matter of time before our troops manage to capture others,” Mr Zelensky said on the social media platform X. Mr Zelensky said on Jan 11 that Ukraine had captured two North Koreans in Russia’s Kursk region, the first time Ukraine has announced the capture of North Korean soldiers alive since their entry into the nearly three-year-old war in autumn 2023.",
      "Ukrainian and Western assessments say that about 11,000 troops from Russia’s ally North Korea have been deployed in the Kursk region to support Moscow’s forces.",
      "Russia has neither confirmed nor denied their presence.",
      "Mr Zelensky has said Russian and North Korean forces had suffered heavy losses.",
      "“Ukraine is ready to hand over Kim Jong Un’s soldiers to him if he can organise their exchange for our warriors who are being held captive in Russia,” Mr Zelensky said.",
      "He posted a short video showing the interrogation of two men who are presented as North Korean soldiers.",
      "One of them is lying on a bed with bandaged hands, while the other is sitting with a bandage on his jaw.",
      "One of the men said through an interpreter that he did not know he was fighting against Ukraine and had been told he was on a training exercise.",
      "He said he hid in a shelter during the offensive and was found a couple of days later.",
      "He said if he was ordered to return to North Korea, he would, but that he was ready to stay in Ukraine if given the chance.",
      "Reuters could not verify the video.",
      "“One of them (soldiers) expressed a desire to stay in Ukraine, the other to return to Korea,” Mr Zelensky said in a televised statement.",
      "Mr Zelensky said for North Korean soldiers who did not wish to return home, there may be other options available and “those who express a desire to bring peace closer by spreading the truth about this war in the Korean (language) will be given that opportunity”.",
      "He provided no specific details.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "zelensky said",
      "mr zelensky",
      "north korean",
      "korean soldiers",
      "north korea",
      "said jan",
      "ready hand",
      "kim jong",
      "jong un",
      "held captive"
    ]
  },
  {
    "title": "Russia claims new villages in eastern Ukraine",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-claims-new-villages-in-eastern-ukraine",
    "publishedAt": "2025-01-12T12:11:57Z",
    "sentences": [
      "MOSCOW - Russia on Jan 12 claimed the capture of two villages in eastern Ukraine where its forces have been steadily advancing for months.",
      "The Defence Ministry said the southern group of forces had captured the village of Yantarne in the eastern Donetsk region, around 10km south-west of Kurakhove, a key logistics hub that Moscow claimed to have seized last week.",
      "On Jan 11, Russia’s army said it had also taken new territory north-west of Kurakhove.",
      "The Defence Ministry said on Jan 12 that Russian troops had also captured the village of Kalynove in the north-eastern Kharkiv region.",
      "The village is on the western bank of the Oskil River, which for a long time formed the front line between the two armies in the region.",
      "But a Ukrainian official said on Jan 9 that Russian forces had managed to establish a bridgehead on the western bank after crossing the river.",
      "Russia’s army has spent months making attempts to cross the river, which also cuts through Kupiansk, a city recaptured by Ukraine in its 2022 counter-offensive.",
      "The Ukrainian Air Force, for its part, said it had shot down 60 Russian drones overnight from Jan 11 to 12.",
      "Falling drone fragments damaged houses in the Kharkiv, Sumy and Poltava regions, but no one was hurt.",
      "In the southern Kherson region, three people were injured by drones on Jan 12, the regional authorities said.",
      "In the Russian-controlled section of the Kherson region, a Ukrainian drone attacked a car, killing a 76-year-old woman outside her house, Russian-installed Governor Vladimir Saldo said on Telegram.",
      "In the Russian city of Engels on the Volga River, a fire caused by a Ukrainian drone strike on Jan 8 on an oil depot continued to burn out, Saratov Governor Roman Busargin said on Telegram.",
      "Firefighters are working “24 hours a day” to extinguish the fire, Mr Busargin said, and the “amount of smoke and the total area of the fire is decreasing”.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "jan 12",
      "defence ministry",
      "ministry said",
      "captured village",
      "jan 11",
      "russia army",
      "said jan",
      "western bank",
      "region ukrainian",
      "kherson region"
    ]
  },
  {
    "title": "North Korean soldiers believed they were sent to Russia for training, not war: South Korea",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/north-korean-soldiers-believed-they-were-sent-to-russia-for-training-not-war-south-korea",
    "publishedAt": "2025-01-12T09:10:00Z",
    "sentences": [
      "SEOUL – Two North Korean soldiers deployed in the Ukraine-Russia war claimed they believed they were participating in a military exercise, not a war, South Korea’s National Intelligence Service (NIS) reported on Jan 12.",
      "According to the NIS, the North Korean soldiers were captured by Ukrainian military forces in the Kursk region of western Russia on Jan 9 and are currently in the custody of the Ukrainian government.",
      "The NIS stated that one of the detainees testified that they arrived in Russia in November 2024 and underwent a week of military training under the Russian military authorities, before being sent to the battlefield.",
      "The detainee added that he had believed he would be participating in a military exercise and realised it was actually war only upon his arrival in Russia.",
      "According to the detainee, the North Korean troops deployed to support Russia suffered significant losses in combat.",
      "The two captured soldiers, identified as a rifleman and a sniper, aged 20 and 26 respectively, have been transported to Kyiv for further investigation and medical treatment.",
      "Despite sustaining injuries, including wounds to the jaw, a fractured leg and a bandaged right hand, their conditions are not life-threatening.",
      "As the prisoners do not speak Ukrainian, English or Russian, communication with them is “carried out through interpreters of Korean, in cooperation with South Korean NIS”, according to the Ukrainian intelligence service.",
      "The NIS stated in a text message to the press in Korea that it will continue to cooperate closely with the Ukrainian authorities, including sharing information regarding the North Korean detainees.",
      "Ukrainian President Volodymyr Zelensky also confirmed the soldiers’ capture in a statement shared on Jan 11 in English, Ukrainian and Korean on social platform X. Mr Zelensky, in particular, referred to the North Korean detainees as “prisoners of war” in the statement, suggesting that Ukraine may seek to leverage them in a potential prisoner exchange with Russia.",
      "The statement marks the first time the Ukrainian authorities have officially announced the capture and identification of North Korean soldiers deployed to support Russia in the war.",
      "Previously, Ukrainian media reported one North Korean soldier had been captured in the same Kursk region by Ukrainian military forces in December 2024.",
      "The soldier was later confirmed by the NIS to have died from severe injuries.",
      "According to local reports, North Korea has sent over 11,000 troops to support Moscow in its war against Ukraine since November 2024.",
      "The soldiers are reportedly stationed primarily in Kursk, a region recently recaptured by Ukraine, and have been actively engaged on the front lines.",
      "THE KOREA HERALD/ASIA NEWS NETWORK Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korean",
      "korean soldiers",
      "kursk region",
      "soldiers deployed",
      "participating military",
      "military exercise",
      "intelligence service",
      "service nis",
      "ukrainian military",
      "military forces"
    ]
  },
  {
    "title": "Ukraine has captured two North Korean soldiers in Russia’s Kursk: Zelensky",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraine-captures-two-north-korean-soldiers-in-kursk-zelensky-says",
    "publishedAt": "2025-01-11T14:27:43Z",
    "sentences": [
      "KYIV - Ukraine has captured two North Korean soldiers in Russia’s Kursk region, President Volodymyr Zelensky said on Jan 11, the first time Ukraine has announced the capture of North Korean soldiers alive since their entry into the war last autumn.",
      "North Korean regular troops entered the war on Russia’s side in October, according to Kyiv and its Western allies, who initially estimated their numbers at 10,000 or more.",
      "In a post on X, Mr Zelensky said that the soldiers had been brought to Kyiv and were communicating with the Security Service of Ukraine (SBU), the country’s domestic intelligence agency.",
      "“As with all prisoners of war, these two North Korean soldiers are receiving the necessary medical assistance,” Mr Zelensky said.",
      "He said that journalists would be given access to speak to them.",
      "Kyiv says that North Korean troops are fighting in the Kursk region, where Ukraine launched an incursion in August.",
      "Kyiv says it still controls several hundred square kilometres of territory there.",
      "Pyongyang has also been supplying Russia with vast quantities of artillery shells, according to Kyiv and its western allies.",
      "Russia has neither confirmed nor denied the presence of North Korean troops in Kursk, and there was no immediate reaction from Moscow or Pyongyang to the latest report.",
      "Ukraine had previously said it captured North Korean soldiers in combat, but that they had been badly wounded and died shortly afterwards.",
      "Mr Zelensky said in a later video address that the troops had been captured by Ukraine’s special forces working alongside paratroopers.",
      "The special forces posted a video filmed from a drone claiming to show part of the operation.",
      "It showed five men in ghillie suits in a forested area, although other details were hard to make out.",
      "A video posted by the SBU appeared to show the two captured men.",
      "One had his jaw bandaged, due to an apparent wound, while the other was drinking through a straw.",
      "A doctor interviewed for the SBU’s video, who was not named and had his face blurred, said one of the soldiers had a facial wound and would be treated by a dentist, while the other soldier had an open wound and a lower leg fracture.",
      "The SBU said the North Koreans had been transferred to Kyiv for questioning, and that because they could not speak Ukrainian, Russian or English, their questioning was being done in Korean with the help of South Korea’s NIS intelligence agency.",
      "The SBU said one of the soldiers had been captured with a Russian military document with the name of another person registered in Russia, while the other did not have any documents.",
      "The agency said the soldiers had been born in 2005 and 1999, and had been serving in the North Korean armed forces since 2021 and 2016 respectively.",
      "The SBU said the two prisoners were being held in conditions that were in accordance with international law, and that a criminal investigation was being conducted to see if the men broke Ukraine’s law against planning or conducting a war.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korean",
      "korean soldiers",
      "zelensky said",
      "mr zelensky",
      "sbu said",
      "two north",
      "kursk region",
      "according kyiv",
      "kyiv western",
      "western allies"
    ]
  },
  {
    "title": "US warns North Korea becoming better prepared for war, fighting against Ukraine",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/east-asia/us-warns-north-korea-becoming-better-prepared-for-war-fighting-against-ukraine",
    "publishedAt": "2025-01-08T22:21:53Z",
    "sentences": [
      "UNITED NATIONS - The US warned on Jan 8 that North Korea is benefiting from its troops fighting alongside Russia against Ukraine, gaining experience that makes Pyongyang “more capable of waging war against its neighbours”.",
      "Russia has forged closer diplomatic and military ties with North Korea since Moscow invaded Ukraine in February 2022.",
      "More than 12,000 North Korean troops are in Russia and in December began fighting against Ukrainian forces in Russia’s Kursk region, US Deputy Ambassador to the UN Dorothy Shea told the United Nations Security Council.",
      "“The DPRK is significantly benefiting from receiving Russian military equipment, technology and experience, rendering it more capable of waging war against its neighbours,” Ms Shea told the council, which met over what Pyongyang said was a test of a new intermediate-range hypersonic ballistic missile on Jan 6.",
      "“In turn, the DPRK will likely be eager to leverage these improvements to promote weapons sales and military training contracts globally,” she said, using the acronym for North Korea’s formal name – the Democratic People’s Republic of Korea.",
      "North Korea’s UN Ambassador Kim Song justified the Jan 6 missile test as part of a plan to enhance the country’s defence capabilities.",
      "He accused the US of double standards.",
      "“When the civilian death toll exceeded 45,000 in Gaza, the United States embellished Israel’s nefarious mass killing atrocity as the right to self-defence...",
      "Meanwhile, it takes issue with legitimate exercise of the right to self-defence of the DPRK,” Mr Kim told the Security Council.",
      "Russia’s UN Ambassador Vassily Nebenzia repeated Moscow’s longstanding accusation that the US, South Korea and Japan provoke North Korea with military exercises.",
      "He also rejected as “wholly unsubstantiated” a US allegation that Russia intends to share satellite and space technology with Pyongyang.",
      "\"Such statements are the latest example of baseless conjecture which is geared towards smearing bilateral cooperation between the Russian Federation and the friendly nation of the DPRK,\" said Mr Nebenzia, who also congratulated North Korean leader Kim Jong Un on his birthday on Jan 8.",
      "South Korea’s UN Ambassador Joonkook Hwang told the council that North Korea’s soldiers were “essentially slaves to Kim Jong Un, brainwashed to sacrifice their lives on faraway battlefields to raise money for his regime and secure advanced military technology from Russia”.",
      "North Korea has been under UN sanctions since 2006, and the measures have been steadily strengthened over the years with the aim of halting Pyongyang’s development of nuclear weapons and ballistic missiles.",
      "Russia has veto power on the 15-member body, so any further council action is unlikely.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korea",
      "korea un",
      "un ambassador",
      "united nations",
      "capable waging",
      "waging war",
      "war neighbours",
      "north korean",
      "shea told",
      "security council"
    ]
  },
  {
    "title": "Several wounded N. Korean soldiers died after being captured by Ukraine: Zelensky",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/several-wounded-north-korean-soldiers-died-after-being-captured-by-ukraine-says-zelensky",
    "publishedAt": "2024-12-27T20:48:24Z",
    "sentences": [
      "KYIV - Ukraine’s President Volodymyr Zelensky said on Dec 27 that “several” wounded North Korean soldiers had died after being captured by his country’s forces, as he accused Russia of throwing them into battle with “minimal protection”.",
      "Ukraine and its Western allies say North Korea has sent thousands of soldiers to support Russia’s army, in what is seen as a major escalation in the nearly three-year war following Moscow’s 2022 invasion.",
      "“Today, there were reports about several soldiers from North Korea.",
      "Our soldiers managed to take them prisoner.",
      "But they were very seriously wounded and could not be resuscitated,” Mr Zelensky said, in an evening address posted on social media.",
      "South Korea’s spy agency said earlier on Dec 27 that a North Korean soldier who was captured while fighting in Russia’s war against Ukraine had died of his wounds.",
      "Mr Zelensky did not specify how many North Koreans had died after being captured by Ukrainian troops.",
      "Mr Zelensky had earlier said that nearly 3,000 North Korean soldiers had been “killed or wounded” so far as they joined Russia’s forces in combat in its western Kursk border region, where Ukraine mounted a shock incursion in August.",
      "South Korea’s intelligence service had previously put the number of killed or wounded North Koreans at 1,000, saying the high casualty rate could be down to an unfamiliar battlefield environment and their lack of capability to counter drone attacks.",
      "The White House on Dec 27 confirmed the South Korean estimates, saying that Pyongyang’s troops were being sent to their deaths in futile attacks by generals who see them as “expendable”.",
      "“We also have reports of North Korean soldiers taking their own lives rather than surrendering to Ukrainian forces, likely out of fear of reprisal against their families in North Korea in the event that they’re captured,” National Security Council spokesman John Kirby told reporters.",
      "North Korea and Russia have strengthened their military ties since Moscow’s invasion of Ukraine in February 2022.",
      "A landmark defence agreement between Pyongyang and Moscow signed in June came into force in December, with Russian President Vladimir Putin hailing it as a “breakthrough document”.",
      "North Korean state media on Dec 27 said Mr Putin sent a New Year’s message to North Korean leader Kim Jong Un, saying: “The bilateral ties between our two countries have been elevated after our talks in June in Pyongyang.” South Korea’s military believes the North is seeking to modernise its conventional warfare capabilities through combat experience gained in the Russia-Ukraine war.",
      "Nato chief Mark Rutte had also said Moscow was providing support to Pyongyang’s missile and nuclear programmes in exchange for the troops.",
      "South Korea’s Joint Chiefs of Staff on Dec 23 said Pyongyang is reportedly “preparing for the rotation or additional deployment of soldiers” and supplying “240mm rocket launchers and 170mm self-propelled artillery” to the Russian army.",
      "Pyongyang’s involvement in Russia’s war against Ukraine had prompted warnings from Seoul.",
      "South Korea’s President Yoon Suk Yeol, who is currently suspended, had said in November that Seoul was “not ruling out the possibility of providing weapons” to Ukraine, a move which would mark a major shift in a longstanding policy barring the sale of weapons to countries in active conflict.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korean",
      "south korea",
      "dec 27",
      "north korea",
      "korean soldiers",
      "mr zelensky",
      "zelensky said",
      "wounded north",
      "died captured",
      "russia war"
    ]
  },
  {
    "title": "‘Ukraine’s adjusting to the idea that it has to cede some territory to Russia’",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/opinion/ukraines-adjusting-to-the-idea-that-it-has-to-cede-some-territory-to-russia",
    "publishedAt": "2024-12-11T21:00:00Z",
    "sentences": [
      "With US President-elect Donald Trump having usurped the foreign policy initiative from incumbent Joe Biden and privileging French President Emmanuel Macron with the diplomatic coup of arranging a meeting between himself and Ukrainian President Volodymyr Zelensky, the pieces on the European chessboard are set to move swiftly.",
      "It is interesting, under these circumstances, to hear the Nato and European perspective on the Ukraine peace deal that Trump has promised within a day of taking office, and what more is likely to come thereafter.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "us donald",
      "donald trump",
      "trump usurped",
      "usurped foreign",
      "foreign policy",
      "policy initiative",
      "initiative incumbent",
      "incumbent joe",
      "joe biden",
      "biden privileging"
    ]
  },
  {
    "title": "Bogged down in Ukraine, Russia pays a price in Syria",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/middle-east/bogged-down-in-ukraine-russia-pays-a-price-in-syria",
    "publishedAt": "2024-12-08T22:45:00Z",
    "sentences": [
      "BERLIN – Lines of Russian troops in desert khaki greeted President Vladimir Putin in Syria in 2017.",
      "Declaring that Moscow had accomplished its mission in Syria’s civil war, Mr Putin pledged that Russia was there to stay.",
      "“If the terrorists raise their heads again,” he said on the tarmac of a Russian airbase, “we will deal unprecedented strikes unlike anything they have seen”.",
      "But over the past two weeks, as rebels whom Russia called terrorists swept across Syria aiming to topple one of Moscow’s closest allies, President Bashar al-Assad, those “unprecedented” strikes were nowhere to be seen.",
      "Instead, with Mr Assad’s ouster on Dec 8, Mr Putin has suffered one of the biggest geopolitical setbacks of his quarter-century in power.",
      "He took that blow, analysts said, in large part because his military is bogged down in Ukraine.",
      "“Our involvement over there had a cost,” a Moscow-based analyst focusing on the Middle East, Mr Anton Mardasov, said, referring to Russia’s war in Ukraine.",
      "“The cost was Syria.” By Dec 8, Russia had been reduced from kingmaker to bystander.",
      "Its Foreign Ministry issued a statement of “extreme concern” about “the dramatic events” and announced that Mr Assad had left the country.",
      "Kremlin spokesman Dmitry Peskov told Russian news agencies that he had nothing to add.",
      "Mr Putin has said nothing about Syria in recent weeks.",
      "The extent of the fallout for Russia of Mr Assad’s removal is still to be determined.",
      "The key question, analysts said, is whether Russia manages to strike an agreement with Syria’s new government to hold on to its Tartus naval base and its Hmeimim airbase, where Mr Putin delivered that victory speech in 2017.",
      "Mr Mardasov said he was unsure whether Moscow would be able to strike such a deal, given that Russia used those bases for overwhelming air strikes against Syria’s opposition after the Kremlin intervened in Syria’s civil war in 2015.",
      "Losing the Syrian bases would thwart some of Mr Putin’s ambitions to re-establish Russia as a world power, since they are crucial to the Kremlin’s ability to flex its muscles in places as far away as West Africa.",
      "“Syria is their only real foothold in the Middle East and the Mediterranean,” said Dr Eugene Rumer, director of the Russia and Eurasia programme at the Carnegie Endowment for International Peace in Washington.",
      "The rebel victory, he said, has become “part of the price they are paying for the war in Ukraine”.",
      "The Kremlin is also likely to bear a broader cost to its image.",
      "In Mr Putin’s widening conflict with the West, he has been trying to position Russia as a decisive, reliable leader of a global coalition against what he calls American hegemony.",
      "“What good is Russia as a partner if it cannot save its oldest client in the Middle East from a ragtag band of militias?” Dr Rumer asked.",
      "“Besides the operational setback, it is also a diplomatic and reputational blow.” Just a few years ago, Syria stood out as the biggest symbol of Russia’s resurgence on the world stage.",
      "Its sweeping, bloody air strikes bombed opposition groups into submission and turned the fighting in Mr Assad’s favour, sending the message that Russia was prepared to use overwhelming force to stand by its allies and assert its own interests.",
      "The United States, by contrast, was increasingly seen in the region as an unreliable power that was disengaging from the Middle East.",
      "And after Mr Assad’s grip on authority seemed secure, Russia used its Syrian bases as a staging point to compete for influence with the West in African countries like Libya, Mali and the Central African Republic.",
      "But after Mr Putin invaded Ukraine in 2022, Syria plummeted on the Kremlin’s priority list.",
      "Russia’s bases in Syria became known as places where commanders who had failed in Ukraine were put out to pasture, and as a draw for soldiers hoping to avoid the trenches of Ukraine.",
      "The focus on Ukraine left Russia flat-footed when the new rebel offensive began in Syria.",
      "Russia launched strikes against the Syrian rebels, but with far less intensity than at the height of its intervention in the civil war.",
      "A US official said Washington believed that this was because many Russian aircraft had been pulled out of Syria for operations in Ukraine.",
      "Warplanes that Russia may have otherwise sent to reprise the brutal bombing campaigns were instead committed to Ukraine.",
      "Warships that Russia might have dispatched from the Black Sea were unable to transit into the Mediterranean because of a treaty that allows Turkey to close its straits to the navy of a nation at war.",
      "And a once-fearsome Russian mercenary force, the Wagner Group, had its Syrian operations dissolved in 2023 after its leader Yevgeny Prigozhin staged a failed mutiny against Russian military chiefs.",
      "“The priorities totally changed,” said Mr Denis Korotkov, a Russian journalist who was among the first to document the Wagner group.",
      "“There was no time for Syria.” Russia’s support of the Assad regime dated back to the Soviet Union’s backing of Mr Assad’s father, president Hafez Assad, in the 1970s.",
      "Now, Russia appears to be turning to diplomacy to try to salvage its footprint in Syria.",
      "Russian Foreign Minister Sergei Lavrov held talks with his Iranian and Turkish counterparts in Qatar on Dec 7, and Mr Putin has spoken by phone with the leaders of those two countries in recent days.",
      "In a sign that Moscow could seek accommodation with Syria’s new powers, Russian state television on Dec 8 appeared to soften the language it used to refer to the forces that toppled Mr Assad.",
      "On the night of Dec 7, state television broadcasts referred to them as “terrorists” or “militants” backed by foreign powers.",
      "By the morning of Dec 8, Russian state media had started calling them “armed opposition” or “armed groups”.",
      "Russia’s best hope, analysts say, may be to negotiate with Turkey – which backs some of the rebel groups – to help it maintain its Syrian bases.",
      "But it is far from clear that Turkey would have the power or influence to persuade the rebels to accept such a deal.",
      "NYTIMES Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr putin",
      "mr assad",
      "dec 8",
      "middle east",
      "civil war",
      "syrian bases",
      "syria civil",
      "unprecedented strikes",
      "analysts said",
      "east mr"
    ]
  },
  {
    "title": "‘Black hole’ Russian sub spotted in Philippine waters as Moscow reminds US: We’re everywhere",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/black-hole-russian-sub-spotted-in-philippine-waters-as-moscow-reminds-us-were-everywhere",
    "publishedAt": "2024-12-02T08:50:00Z",
    "sentences": [
      "One of Russia’s stealthiest submarines has been spotted cruising in waters claimed by the Philippines.",
      "This incident could be Russia signalling to the US that it is prepared to help China amid an escalating stand-off in the South China Sea, one analyst said.",
      "Philippine President Ferdinand Marcos Jr said in a news conference on Dec 2 that the submarine’s presence in his nation’s exclusive economic zone (EEZ) is very concerning.",
      "“Any intrusion into the West Philippine Sea, of our EEZ, of our baselines, is very worrisome,” he said.",
      "The Philippine Daily Inquirer reported on Dec 2 that the Russian Navy’s Ufa attack submarine was spotted after it surfaced 148km west of Mindoro province on Nov 28.",
      "The Philippine Navy said in a statement that it sent the guided missile frigate BRP Jose Rizal to track the submarine as it made its way – while remaining surfaced – outside Philippine waters.",
      "Philippine Navy spokesman Rear-Admiral Roy Vincent Trinidad said the frigate communicated with the Ufa to ascertain its identity and intention.",
      "“The Russian vessel stated it was awaiting improved weather conditions before proceeding to Vladivostok,” he said.",
      "The Russian state-run Tass news agency had reported that the submarine, together with rescue tug Alatau, were operating in the South China Sea after stopping at the RMN Kota Kinabalu Naval Base in Malaysia on Nov 23 for a port visit and to hold exercises.",
      "It was due to return to the Russian Pacific Fleet’s submarine base at the Kamchatka peninsula in Russia’s Far East, it said.",
      "Rear-Adm Trinidad said the incident was not alarming.",
      "“But we were surprised because this is a very unique submarine,” he told Agence France-Presse.",
      "The Ufa is one of six Project 636.3 attack submarines dubbed as “black holes” for their reputation as among the stealthiest in Russia’s submarine fleet.",
      "It is a Kilo-class submarine powered by a hybrid diesel and electric engine, upgraded to make it even more quiet when cruising underwater.",
      "It is armed with Kalibr cruise missiles that have been used in Russia’s war in Ukraine.",
      "The Ufa was commissioned in 2022 and initially used to patrol the Baltic Sea.",
      "Tass reported in October that the submarine was deployed from the Baltic to the Pacific to shore up Russia’s naval fleet in the Far East.",
      "That a submarine known for stealth will surface in contested waters may be Russia’s way of telling the US that it, too, is a player in waters far from its shores, and where its allies are locked in territorial disputes, an analyst said.",
      "“Maybe this is a signal from the Russians… They may have intentionally surfaced the sub to say, ‘We’re just here’,” Dr Eduardo Araral, an associate professor at the National University of Singapore, told The Straits Times.",
      "He said it could be the Russians telling the Americans, “if you threaten us, we can threaten you back”.",
      "Dr Araral, who has advised the Philippine government on public policies, said it is also not surprising that Russian submarines are now operating in the South China Sea, as Russia has been stepping up its participation in war drills with its Pacific allies.",
      "“Russia is a close friend of China.",
      "So if China invites them (for a military exercise), they will come and join,” he said.",
      "Russia and China held massive naval and air drills in September – dubbed Ocean-2024 – involving more than 400 warships, at least 120 aircraft and some 90,000 troops.",
      "Analysts say these drills were meant to push back against efforts by the US and its allies in the Indo-Pacific region to deepen and expand their security ties as a check to China’s aspirations.",
      "“Russia wants to demonstrate that they can engage in a full-scale war with Ukraine while deploying resources to the Indo-Pacific region, and China wants to show that they can deepen its relationship with Russia and cause problems in the region, primarily in the South China Sea but also around Japan,” Dr Stephen Nagy, a regional security expert at the International Christian University in Japan, told Voice Of America in September.",
      "The Philippines – a long-time US ally – has figured in increasingly confrontational skirmishes with China since Mr Marcos became President in 2022 and took a more muscular approach against Beijing than his predecessor did.",
      "China’s coast guard ships have been swarming and colliding with Philippine resupply ships, chasing or boarding them, and sinking fishing boats.",
      "In the latest incident, a Chinese military helicopter was seen on Nov 28 aggressively flying over a group of Philippine fishing boats off Iroquis reef in the Spratly archipelago in the South China Sea.",
      "The reef has become the latest flashpoint stirring up clashes between Manila and Beijing, as China’s seaborne militia have been spotted swarming around it in what security analysts suggest is a sign that China is preparing to build another island fortress on it.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "south china",
      "china sea",
      "analyst said",
      "said philippine",
      "dec 2",
      "philippine navy",
      "trinidad said",
      "operating south",
      "fleet submarine",
      "far east"
    ]
  },
  {
    "title": "Syrian rebels sweep into Aleppo, Russia conducts strikes in support of Assad",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/middle-east/russia-says-air-force-strikes-rebels-in-support-of-syrian-army-agencies-report",
    "publishedAt": "2024-11-30T19:59:41Z",
    "sentences": [
      "MOSCOW – The Syrian army said on Nov 30 that dozens of its soldiers had been killed in a major attack led by Islamist Hayat Tahrir al-Sham rebels who swept into the city of Aleppo, forcing the army to redeploy in the biggest challenge to President Bashar al-Assad in years.",
      "Russia’s Defence Ministry said its air force had carried out strikes on Syrian rebels in support of the country’s army, Russian news agencies reported.",
      "The strikes followed what was the boldest rebel assault for years in a civil war where front lines had largely been frozen since 2020.",
      "Hayat Tahrir al-Sham, or HTS, once known as the Nusra Front, is designated a terrorist group by the US, Russia, Turkey and other states.",
      "Mr Assad is a close Moscow ally.",
      "A spokesperson for the US State Department said earlier that the US was monitoring the situation.",
      "The war – which has killed hundreds of thousands of people and displaced many millions – has ground on since 2011 with no formal end, although most major fighting halted years ago after Iran and Russia helped Mr Assad’s government win control of most land and all major cities.",
      "Aleppo had been firmly held by the government since a 2016 victory there, one of the war’s major turning points, when Russian-backed Syrian forces besieged and laid waste to rebel-held eastern areas of what had been the country’s largest city.",
      "“I am a son of Aleppo and was displaced from it eight years ago, in 2016.",
      "Thank God, we just returned.",
      "It is an indescribable feeling,” said Mr Ali Jumaa, a rebel fighter, in TV footage filmed inside the city.",
      "Acknowledging the rebel advance, the Syrian army command said insurgents had entered much of Aleppo.",
      "After the army said it was preparing a counter-attack, air strikes targeted rebel gatherings and convoys in the city, the pro-Damascus newspaper al-Watan reported.",
      "One strike caused casualties in Aleppo’s Basel square, a resident told Reuters.",
      "The state-run Russian Centre for the Reconciliation of the Enemy Parties in Syria said missile and bomb strikes against the rebels had targeted “militant concentrations, command posts, depots and artillery positions” in Aleppo and Idlib provinces.",
      "It claimed about 300 rebel fighters had been killed in the attacks.",
      "Overnight, images from Aleppo showed a group of rebel fighters gathered in the city’s Saadallah al-Jabiri Square, with a billboard of Mr Assad looming behind them.",
      "Images filmed on Nov 30 showed people posing for photos on a toppled statue of Mr Bassel al-Assad, late brother of the president.",
      "Fighters zipped around the city in trucks and milled around in the streets.",
      "A man waved a Syrian opposition flag as he stood near Aleppo’s historic citadel.",
      "The Syrian military command said militants had attacked in large numbers and from multiple directions, prompting “our armed forces to carry out a redeployment operation aimed at strengthening the defence lines in order to absorb the attack, preserve the lives of civilians and soldiers”.",
      "The rebels also took control of Aleppo airport, according to a statement by their operations room and a security source.",
      "Two rebel sources also said the insurgents had captured the city of Maarat al-Numan in Idlib province, bringing all of that area under their control.",
      "The fighting revives the long-simmering Syrian conflict as the wider region is roiled by wars in Gaza and Lebanon, where a truce between Israel and the Iran-backed Lebanese group Hezbollah took effect on Nov 27.",
      "With Mr Assad backed by Russia and Iran, and Turkey supporting some of the rebels in the north-west where it maintains troops, the offensive has brought into focus the conflict’s knotted geopolitics.",
      "Fighting in the north-west had largely abated since Turkey and Russia reached a de-escalation agreement in 2020.",
      "Russian Foreign Minister Sergei Lavrov held a phone call with his Turkish counterpart Hakan Fidan discussing the situation in Syria, Russia’s Foreign Ministry said on Nov 30.",
      "“Both sides expressed serious concerns at the dangerous development of the situation,” the ministry said.",
      "They agreed it was necessary to coordinate joint actions to stabilise the situation in the country.",
      "Turkish security officials had said on Nov 28 that Ankara had prevented operations, which opposition groups wanted to organise, in order to avoid further tensions in the region.",
      "Iranian Foreign Minister Abbas Araghchi told Mr Lavrov in a phone call that the rebel attacks were part of an Israeli-US plan to destabilise the region, Iranian state media said.",
      "The Syrian Civil Defence – a rescue service operating in opposition-held parts of Syria – said in a post on social media platform X that Syrian government and Russian aircraft carried out air strikes on residential neighbourhoods in rebel-held Idlib, killing four civilians and wounding six others.",
      "Two Syrian military sources said Russia has promised Damascus extra military aid that would start arriving in the next 72 hours.",
      "The Kurdish People’s Protection Units (YPG), which spearhead the US-backed Syrian Democratic Forces that control much of north-eastern and eastern Syria and have long had a foothold in Aleppo, widened their control in the city as government troops left, a senior YPG source said.",
      "Mr Mustafa Abdul Jaber, a commander in the Jaish al-Izza rebel brigade, said the rebels’ speedy advance had been helped by a lack of Iran-backed manpower to support the government in the broader Aleppo province.",
      "Iran’s allies in the region have suffered a series of blows at the hands of Israel as the Gaza war has expanded through the Middle East.",
      "The opposition fighters have said the campaign was in response to stepped-up strikes in recent weeks against civilians by the Russian and Syrian air forces on areas of Idlib province, and to pre-empt any attacks by the Syrian army.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr assad",
      "syrian army",
      "said nov",
      "nov 30",
      "ministry said",
      "army said",
      "hayat tahrir",
      "years ago",
      "said mr",
      "command said"
    ]
  },
  {
    "title": "Why North Korea struck a good deal in helping Russia with its war in Ukraine",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/opinion/why-north-korea-struck-a-good-deal-in-helping-russia-with-its-war-in-ukraine",
    "publishedAt": "2024-11-26T21:00:00Z",
    "sentences": [
      "During the Cold War, the Soviet Union sent thousands of troops and military advisers abroad to fight in foreign wars.",
      "Today, Russia – the Soviet Union’s successor state – recruits tens of thousands of foreigners to fight in its war in Ukraine.",
      "Not a week passes by without someone spotting new foreign mercenaries fighting for Russia; the latest to join this dubious company are the Houthi rebels in Yemen, who have apparently been sighted on Ukraine’s battlefields.",
      "Yet none of these foreign recruits is ever likely to be as significant as the presence of the North Korean soldiers in the Ukraine war.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "soviet union",
      "cold war",
      "war soviet",
      "union sent",
      "sent thousands",
      "thousands troops",
      "troops military",
      "military advisers",
      "advisers abroad",
      "abroad fight"
    ]
  },
  {
    "title": "Russia advances in Ukraine at fastest monthly pace since start of war, analysts say",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-advances-in-ukraine-at-fast-pace-moving-into-kurakhove-analysts-say",
    "publishedAt": "2024-11-26T04:08:30Z",
    "sentences": [
      "KYIV – Russian forces are advancing in Ukraine at the fastest rate since the early days of the 2022 invasion, taking an area half the size of London over the past month, analysts and war bloggers say.",
      "The war is entering what some Russian and Western officials say could be its most dangerous phase after Moscow’s forces made some of their biggest territorial gains and the US allowed Kyiv to strike back with US missiles.",
      "“Russia has set new weekly and monthly records for the size of the occupied territory in Ukraine,” independent Russian newsgroup Agentstvo said in a report.",
      "The Russian army captured almost 235 sq km in Ukraine over the past week, a weekly record for 2024, it said.",
      "Russian forces had taken 600 sq km in November, it added, citing data from DeepState, a group with close links to the Ukrainian army that studies combat footage and provides front-line maps.",
      "Russia began advancing faster in eastern Ukraine in July, just as Ukrainian forces carved out a sliver of its western region of Kursk.",
      "Since then, the Russian advance has accelerated, according to open source maps.",
      "Russia currently controls 18 per cent of Ukraine, including all of Crimea, just over 80 per cent of Donbas, which comprises Luhansk and Donetsk, and more than 70 per cent of the Zaporizhzhia and Kherson regions, as well just under 3 per cent of the Kharkiv region, according to open source maps.",
      "Neither side publishes accurate data on their own losses, though Western intelligence estimates the casualties to number hundreds of thousands killed or injured, while swathes of eastern and southern Ukraine have turned into wastelands.",
      "President Vladimir Putin, who replaced his defence minister in May, has repeatedly said Russian forces are advancing much more effectively.",
      "The thrust of the advance has been in the Donetsk region, with Russian forces pushing towards the town of Pokrovsk and into the town of Kurakhove.",
      "Russia has increasingly encircled territory and pummelled Ukrainian forces with artillery and glide bombs, according to Russian analysts.",
      "The general staff of Ukraine’s armed forces said in its Nov 25 update that 45 battles of varying intensity were raging along the Kurakhove part of the front line that evening.",
      "If Russia can pierce the Ukrainian defences around Kurakhove, then they will be able to push westwards towards the city of Zaporizhzhia while securing their rear to allow a swing towards Pokrovsk, according to Russian war bloggers.",
      "The Institute for the Study of War report and pro-Russian military bloggers say Russian troops are in Kurakhove.",
      "DeepState said on the Telegram messaging app on Nov 25 that the Russian forces were near Kurakhove.",
      "“Russian forces’ advances in south-eastern Ukraine are largely the result of the discovery and tactical exploitation of vulnerabilities in Ukraine’s lines,” the Washington-based Institute for the Study of War said in a report.",
      "Ukrainian President Volodymyr Zelensky has repeatedly said that peace cannot be established until all Russian forces are expelled and all territory captured by Moscow, including Crimea, is returned.",
      "But outnumbered by Russian troops, the Ukrainian military is struggling to recruit soldiers and provide equipment to new units.",
      "Mr Zelensky has said that he believed Mr Putin’s main objectives were to occupy the entire Donbas, which consists of the Donetsk and Luhansk regions, and oust Ukrainian troops from the Kursk region, parts of which they have controlled since August.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "russian forces",
      "per cent",
      "forces advancing",
      "war bloggers",
      "bloggers say",
      "said report",
      "sq km",
      "said russian",
      "maps russia",
      "ukrainian forces"
    ]
  },
  {
    "title": "39 foreigners flee Myanmar scam centre: Thai police",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/39-foreigners-flee-myanmar-scam-centre-thai-police",
    "publishedAt": "2024-11-25T07:34:00Z",
    "sentences": [
      "BANGKOK – Thirty-nine foreigners have fled an online scam centre in Myanmar across the border to Thailand, where officials are working to identify potential trafficking victims, the police told AFP on Nov 25.",
      "Scam compounds have mushroomed in Myanmar’s borderlands and are staffed by foreigners who are often trafficked and forced to work, swindling their compatriots in an industry analysts say is worth billions.",
      "The group from Sri Lanka, Nepal, Malaysia and Russia crossed into Thailand’s Tak province, according to the police chief in the city of Mae Sot.",
      "They had fled from Myawaddy just across the border, Colonel Pittayakorn Petcharat told AFP.",
      "Myawaddy is controlled by a military-aligned militia and is a hotbed of drug production and online scam outfits, according to observers.",
      "Sri Lanka’s Embassy in Bangkok had asked the Thai authorities for help after it was informed that 32 of its citizens were trapped in Myanmar, said Col Pittayakorn.",
      "Five Nepalis, one Malaysian and one Russian were also in the group that escaped and arrived in Thailand.",
      "AFP has contacted the embassies of the four countries for comment.",
      "The group crossed into Thailand on Nov 24 night, said a member of the security forces in Mae Sot, who asked for anonymity to talk to the media.",
      "Immigration officials were working to identify potential victims of human trafficking, Col Pittayakorn said.",
      "Thai local media reported the group had responded to advertisements on social media promising well-paid work but were then subjected to gruelling conditions in a scam centre.",
      "Some of the Sri Lankan workers later successfully contacted the embassy.",
      "Myanmar’s northern border with China was previously a hotbed for online scam centres, often run by militias aligned with the ruling junta.",
      "But a sweeping offensive by an alliance of ethnic rebels in 2023 cleared many of the scam centres out.",
      "More than 40,000 people suspected of taking part in cyberscams in Myanmar were handed over to China in 2023, Beijing state media said in 2024.",
      "Local Myanmar media has reported that scam bosses who escaped the offensive have since set up shop farther south along the border with Thailand.",
      "In December 2023, Myanmar’s junta chief and Thai military officials agreed to “jointly eradicate online gambling and online scams near Myawaddy”, according to Myanmar state media.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "online scam",
      "scam centre",
      "across border",
      "border thailand",
      "officials working",
      "working identify",
      "identify potential",
      "told afp",
      "sri lanka",
      "crossed thailand"
    ]
  },
  {
    "title": "Russia escalating ‘at every turn’ in Ukraine, says White House",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-escalating-at-every-turn-in-ukraine-says-white-house",
    "publishedAt": "2024-11-21T21:17:16Z",
    "sentences": [
      "WASHINGTON - The White House said Nov 21 that Russia was to blame for escalating “at every turn” in Ukraine, including by bringing in North Korean troops to join its war effort.",
      "“The escalation at every turn is coming from Russia,” White House spokeswoman Karine Jean-Pierre told reporters, adding that the United States had warned Moscow against involving “another country in another part of the world.” She vowed that the outgoing administration of President Joe Biden would continue to “surge” assistance to Ukraine in his term’s remaining months.",
      "Russia fired a new medium-range ballistic missile at Ukraine on Nov 21 in what was seen as a response to Mr Biden’s decision to authorise Kyiv to fire US-made long-range missiles into Russia.",
      "Ms Jean-Pierre declined to comment on the change in stance on ATACMS missiles, which was first reported over the weekend.",
      "“They (Russia) are the ones escalating.",
      "We are going to continue to support Ukraine as they push back on that aggression,” she said.",
      "She added that the United States does not see “any reason” to modify its nuclear posture following President Vladimir Putin’s updates to Russia’s nuclear doctrine, while condemning what she termed “irresponsible” rhetoric from Moscow.",
      "“We have not seen any reason to adjust our own nuclear posture or doctrine in response to Russia’s statements,” Ms Jean-Pierre said.",
      "Western intelligence services and Ukraine believe at least 10,000 North Korean troops are being deployed by Russia, with some in the Kursk region, to reinforce Moscow’s forces.",
      "Ms Jean-Pierre called it evidence of “desperation” from Moscow.",
      "“They are now seeing high casualties, and so now what they’re doing is turning to DPRK to supply them soldiers,” she said.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "white house",
      "nov 21",
      "every turn",
      "north korean",
      "korean troops",
      "united states",
      "nuclear posture",
      "washington white",
      "house said",
      "said nov"
    ]
  },
  {
    "title": "Russia’s Putin hints at strikes on West in ‘global’ Ukraine war",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/putin-says-russia-fired-hypersonic-ballistic-missile-at-ukraine-in-warning-to-the-west",
    "publishedAt": "2024-11-21T17:47:47Z",
    "sentences": [
      "MOSCOW - Russian President Vladimir Putin said on Nov 21 that the conflict in Ukraine had characteristics of a “global” war and did not rule out strikes on Western countries.",
      "The Kremlin strongman spoke out after a day of frayed nerves, with Russia test-firing a new-generation intermediate-range missile at Ukraine – which Mr Putin hinted was capable of unleashing a nuclear payload.",
      "Ukraine’s President Volodymyr Zelensky branded the strike a major ramping up of the “scale and brutality” of the war by a “crazy neighbour”, while Kyiv’s main backer US said that Russia was to blame for escalating the conflict “at every turn”.",
      "Intermediate-range missiles typically have a reach of up to 5,500km – enough to make good on Mr Putin’s threat of striking the West.",
      "In a defiant address to the nation, Russia’s president railed at Ukraine’s allies granting permission for Kyiv to use Western-supplied weapons to strike targets on Russian territory, warning of retaliation.",
      "In recent days, Ukraine has fired US and UK-supplied missiles at Russian territory for the first time, escalating already sky-high tensions in the brutal nearly three-year-long conflict.",
      "“We consider ourselves entitled to use our weapons against the military facilities of those countries that allow their weapons to be used against our facilities,” Mr Putin said.",
      "He said the US-sent Army Tactical Missile System (ATACMS) and British Storm Shadow payloads were shot down by Moscow’s air defences, adding: “The goals that the enemy obviously set were not achieved”.",
      "Kremlin spokesman Dmitri Peskov did, however, say Moscow informed Washington of the missile’s launch half an hour before it was fired through an automatic nuclear de-escalation hotline, in remarks cited in state media.",
      "He earlier said Russia was doing everything to avoid an atomic conflict, having updated its nuclear doctrine this week.",
      "White House spokeswoman Karine Jean-Pierre told reporters that Washington saw no need to modify the US’ own nuclear posture in response.",
      "Nato spokesperson Farah Dakhlallah said Russia’s use of the missile would “neither change the course of the conflict nor deter” the US-led defence alliance from backing Kyiv.",
      "Ukraine had earlier accused Russia of firing an intercontinental ballistic missile (ICBM) for the first time in history, a claim later downplayed by Washington.",
      "Ukrainian’s air force said Moscow had launched the missile as part of a barrage towards Dnipro, where the local authorities said an infrastructure facility was hit, and two civilians were wounded.",
      "Mr Putin said that Russia had carried out “testing in combat conditions” of one of its newest missile systems named Oreshnik.",
      "Criticising the global response to the strike – “final proof that Russia definitely does not want peace” – Mr Zelensky warned that other countries could become targets for Mr Putin too.",
      "“It is necessary to urge Russia to a true peace, which is possible only through force,” the Ukrainian leader said in his evening address.",
      "“Otherwise, there will be relentless Russian strikes, threats and destabilisation, and not only against Ukraine.” The attack on Dnipro comes just days after several foreign embassies shuttered temporarily in the Ukrainian capital, citing the threat of a large-scale strike.",
      "“It is another example of reckless behaviour from Russia,” a spokesman for British Prime Minister Keir Starmer told reporters.",
      "The spokesman for UN Secretary-General Antonio Guterres, Mr Stephane Dujarric, said the new missile’s deployment was “another concerning and worrying development”, warning the war was “going in the wrong direction”.",
      "Yet a US official played down the threat, saying on condition of anonymity that Russia “likely possesses only a handful of these” experimental missiles.",
      "The head of the Dnipropetrovsk region where the city of Dnipro is located said the Russian aerial bombardment damaged a rehabilitation centre and several homes, as well as an industrial enterprise.",
      "“Two people were wounded – a 57-year-old man was treated on the scene and a 42-year-old woman was hospitalised,” said the official, Mr Sergiy Lysak.",
      "Russia and Ukraine have escalated their use of long-range missiles in recent days since Washington gave Kyiv permission to use its ATACMS against military targets inside Russia, a long-standing Ukrainian request.",
      "British media, meanwhile, reported on Nov 20 that Kyiv had launched UK-supplied Storm Shadow missiles at targets in Russia after being given the green light from London.",
      "With ranges of 300km and 250km respectively, both missile systems’ reach is far dwarfed by the experimental intermediate-range system fired by Russia.",
      "Russia’s envoy to London on Nov 21 said that meant Britain was “now directly involved” in the Ukraine war, with Mr Andrei Kelin telling Sky News “this firing cannot happen” without UK and Nato support.",
      "But the White House’s Ms Jean-Pierre countered that it was Russia who was behind the rising tensions, pointing to the reported deployment of thousands of North Korean troops to help Moscow fight off a Ukrainian offensive in Russia’s border Kursk region.",
      "“The escalation at every turn is coming from Russia,” she said, adding that the United States had warned Moscow against involving “another country in another part of the world” – referring to Pyongyang.",
      "The defence ministry in Moscow said on Nov 21 its air-defence systems had downed two Storm Shadows, without saying whether they had come down on Russian territory or in occupied Ukraine.",
      "The missile escalation is coming at a critical moment on the ground for Ukraine, as its defences buckle under Russian pressure across the sprawling front line.",
      "Russia claimed deeper advances in the war-battered Donetsk region, announcing on Nov 21 that its forces had captured another village close to Kurakhove, closing in on the town after months of steady advances.",
      "Moscow’s defence ministry said Russian forces had taken the small village of Dalne, 5km south of Kurakhove.",
      "Mr Lysak, the governor of the Dnipropetrovsk region, said that 26 people had been wounded in another strike on the town of Kryvyi Rih, where Mr Zelensky was born.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr putin",
      "nov 21",
      "said russia",
      "putin said",
      "russian territory",
      "said nov",
      "every turn",
      "use weapons",
      "recent days",
      "first time"
    ]
  },
  {
    "title": "Russia launches intercontinental ballistic missile in attack on Ukraine, Kyiv says",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-launches-intercontinental-ballistic-missile-in-attack-on-ukraine-kyiv-says",
    "publishedAt": "2024-11-21T08:02:28Z",
    "sentences": [
      "KYIV – Russia fired an intercontinental ballistic missile (ICBM) during an attack on the Ukrainian city of Dnipro on Nov 21, Kyiv’s air force said, in what would be the first use in war of a weapon designed to deliver long-distance nuclear strikes.",
      "The launch, if confirmed, highlights rapidly rising tensions in the 33-month-old Russia-Ukraine war after Kyiv fired US and British missiles at targets inside Russia this week despite warnings by Moscow that it would see such action as a major escalation.",
      "Security experts said it would be the first military use of an ICBM.",
      "The missiles are strategic weapons designed to deliver nuclear warheads and are an important part of Russia’s nuclear deterrent.",
      "“Today, there was a new Russian missile.",
      "All the characteristics – speed, altitude – are (of an) intercontinental ballistic (missile).",
      "An expert (investigation) is currently under way,” Ukrainian President Volodymyr Zelensky said in a video statement.",
      "The Ukrainian Air Force said the missile was fired from the Russian region of Astrakhan, more than 700km from Dnipro in central-eastern Ukraine.",
      "It did not specify what kind of warhead the missile had or what type of missile it was.",
      "There was no suggestion it was nuclear-armed.",
      "Asked about the air force’s statement, Kremlin spokesman Dmitry Peskov told reporters to contact Russian military for comment.",
      "During a weekly briefing, Russia’s Foreign Ministry spokeswoman Maria Zakharova received a phone call in which she was told by an unidentified man not to comment, video footage showed.",
      "Ukrainska Pravda, a Kyiv-based media outlet, cited anonymous sources saying the missile was an RS-26 Rubezh, a solid-fuelled ICBM with a range of 5,800km, according to the Arms Control Association.",
      "The RS-26 was first successfully tested in 2012, and is estimated to be 12m long and weigh 36 tonnes, according to the Centre for Strategic and International Studies (CSIS).",
      "It said the RS-26 can carry an 800kg nuclear warhead.",
      "The RS-26 is classified as an ICBM under a nuclear arms reduction treaty between the US and Russia, but it can be seen as an intermediate-range ballistic missile when used with heavier payloads at ranges below 5,500km, CSIS said.",
      "The Russian missile attack targeted enterprises and critical infrastructure in the central-eastern city of Dnipro, the air force said.",
      "Ukraine’s air force did not say what the ICBM targeted or whether it had caused any damage, but regional governor Serhiy Lysak said the missile attack damaged an industrial enterprise and set off fires in Dnipro.",
      "Two people were hurt.",
      "Russia also fired a Kinzhal hypersonic missile and seven Kh-101 cruise missiles, six of which were shot down, the Ukrainian Air Force said.",
      "The Nato military alliance did not immediately respond to a request for comment.",
      "The US European Command said it had nothing on the reported use of an ICBM and referred questions to the US Department of Defence.",
      "“If true, this will be totally unprecedented and the first actual military use of ICBM.",
      "Not that it makes a lot of sense given their price and precision,” Mr Andrey Baklitskiy, of the UN Institute for Disarmament Research, posted on X. German security expert Ulrich Kuehn posted: “It looks as if Russia has today used an intercontinental ballistic missile in a war for the first time in history, against the civilian target Dnipro.” Some military experts said the ICBM launch, if confirmed, could be seen as an act of deterrence by Moscow following Kyiv’s strikes into Russia with Western weapons this week.",
      "“An ICBM launch can certainly be seen as a threatening gesture, potentially in response to the lifting of restrictions on ATACMS and Storm Shadow.",
      "It’s a means of deterrence,” said a European military source.",
      "Russian war correspondents on Telegram and an official speaking on condition of anonymity said Kyiv fired British Storm Shadow cruise missiles into Russia’s Kursk region bordering Ukraine on Nov 20.",
      "Russia’s Defence Ministry, in its daily report of events over the previous 24 hours on Nov 21, said air defences had shot down two British Storm Shadow cruise missiles but did not say where.",
      "Britain had previously let Ukraine use Storm Shadows within Ukrainian territory.",
      "Ukraine also fired US ATACMS missiles into Russia on Nov 19 after US President Joe Biden gave the all-clear to use such missiles, two months before he leaves office and Donald Trump returns to the White House.",
      "Russian President Vladimir Putin on Nov 19 lowered the threshold for a nuclear strike in response to a broader range of conventional attacks.",
      "Trump has said he will end the war, without saying how, and criticised billions of dollars in aid for Ukraine under Mr Biden.",
      "The warring sides believe Trump is likely to push for peace talks – not known to have been held since the war’s earliest months – and are trying to attain strong positions before negotiations.",
      "Moscow has said the use of Western weapons to strike Russian territory far from the border would be a major escalation in the conflict.",
      "Kyiv says it needs the capability to defend itself by hitting Russian rear bases used to support Moscow’s February 2022 invasion.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "air force",
      "ballistic missile",
      "force said",
      "intercontinental ballistic",
      "use icbm",
      "cruise missiles",
      "storm shadow",
      "city dnipro",
      "nov 21",
      "said would"
    ]
  },
  {
    "title": "Ukraine reportedly fires UK Storm Shadow missiles into Russia for first time",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraine-fires-uk-storm-shadow-missiles-into-russia-media-says",
    "publishedAt": "2024-11-20T19:43:36Z",
    "sentences": [
      "LONDON - Ukraine has fired UK-supplied Storm Shadow missiles into Russia for the first time, British media reported on Nov 20, after being given the green light from London.",
      "Several missiles were launched against at least one Russian military target, the Financial Times said, citing an unidentified Western official.",
      "The Times said government sources had confirmed the use of the long-range missiles for the first time.",
      "The Guardian said Britain had given Ukraine permission to use the missiles in Russia in response to Moscow’s deployment of North Korean troops on the border.",
      "The strikes were also widely reported by Russian war correspondents on Telegram and confirmed by an official on condition of anonymity.",
      "A spokesperson for Ukraine’s General Staff said he had no information.",
      "Russian pro-Kremlin military bloggers wrote that around a dozen Storm Shadow missiles were fired on a target in the Kursk border region, which is partially held by Ukrainian forces.",
      "Ukrainian media posted aerial video footage from a drone showing a series of explosions at what appears to be a country estate, naming the location as Maryino, where the presidential administration has a sanatorium.",
      "Ukrainian media reported the strikes could have targeted an underground military command centre.",
      "Neither Moscow nor Kyiv have officially confirmed the missile attack or the use of Storm Shadows.",
      "A spokesperson for British Prime Minister Keir Starmer declined to comment.",
      "Britain had previously allowed Ukraine to use Storm Shadows, which have a range in excess of 250km, within Ukrainian territory.",
      "The reported attack came after Washington this week said it had cleared Ukraine to use its ATACMS against military targets inside Russia – a long-standing Ukrainian request.",
      "Russia said on Nov 19 that the missiles had been used to target a military facility in the Bryansk border region.",
      "The reported strikes came as Moscow looks to retaliate against Ukraine for firing US-supplied long-range missiles on Russian territory for the first time and with the Kremlin accusing outgoing US President Joe Biden of dragging out the war.",
      "Russia has ramped up deadly missile strikes in recent days, targeting residential areas and Ukraine’s energy grid.",
      "Air alerts blare out across the country daily.",
      "The United States said on Nov 20 morning that it was shutting its Kyiv office to the public after having received “specific information of a potential significant air attack”.",
      "Canada, Greece, Hungary, Italy and Spain – all Nato members – followed suit.",
      "The US embassy said on Nov 20 evening that it would reopen on Nov 21, after having “temporarily modified operations” due to a warning of a “potential imminent air attack”.",
      "The French embassy remained open but urged its citizens to be cautious.",
      "The Kremlin said it had no comment.",
      "Ukrainian officials criticised the rare move and called on its allies not to spread yet more fear among Ukrainian society.",
      "“We remind you that the threat of strikes by the aggressor state has unfortunately been a daily reality for Ukrainians for over 1,000 days,” Ukraine’s foreign ministry posted on social media.",
      "Air alert sirens sounded in Kyiv on Nov 20 and the authorities said falling debris from an intercepted drone attack in the morning caused minor damage.",
      "President Volodymyr Zelensky said in his evening address that the “panic messages that were reposted” on social media “only helps Russia”.",
      "Nerves are already frayed in Kyiv after almost three years of war, and Donald Trump’s victory in the US presidential election has injected fresh uncertainty.",
      "The Republican has repeatedly criticised US support for Ukraine and claimed he could broker a ceasefire within hours – comments that have triggered fears in Kyiv and Europe about Ukraine’s ability to withstand the Russian attacks without American support.",
      "Both Ukraine and Russia are jockeying for upper hand on the battlefield before Trump re-enters the White House in January.",
      "Trump, who has said he will end the war, without saying how, has criticised the billions of dollars in aid for Ukraine under the Biden administration.",
      "The warring sides believe he is likely to push for peace talks – not known to have been held since the war's earliest months – and are trying to attain strong positions before negotiations.",
      "Russia on Nov 20 accused Mr Biden of prolonging the war by stepping up weapons deliveries to Kyiv in his final weeks in office.",
      "“If you look at the trends of the outgoing US administration, they are fully committed to continuing the war in Ukraine and are doing everything they can to do so,” Kremlin spokesman Dmitry Peskov said.",
      "Mr Peskov was responding to the US saying it would soon provide Ukraine with anti-personnel land mines.",
      "This decision has prompted criticism from charities over the long-term risk to civilians, but Mr Zelensky said in his evening address that landmines were “very important... to stop Russian assaults”.",
      "US Defence Secretary Lloyd Austin said on Nov 20 that Russian forces “lead with dismounted forces” rather than tanks, and landmines “can help slow down that effort”.",
      "Western countries say the arrival of more than 10,000 North Korean troops to fight for Russia in recent weeks was an escalation that merited a response.",
      "The war is at a volatile juncture, with nearly a fifth of Ukrainian territory in Russian hands, North Korean troops deployed in Russia’s Kursk region and doubts over the future of Western aid under Trump, whose nominees for administration posts include sceptics of support for Kyiv.",
      "World leaders have taken note of the stepped-up American support for Kyiv.",
      "Turkey’s President Recep Tayyip Erdogan, a Nato ally of the US, said on Nov 20 that the decision to allow Kyiv to use the powerful long-range missiles was a “big mistake”.",
      "“This step by Biden will not only escalate the conflict, but will lead to a greater reaction from Russia,” Mr Erdogan, who sees himself as a possible mediator, told journalists.",
      "Moscow has struck a defiant tone, pledging retribution and continuing its advance on the front lines.",
      "Its forces claimed on Nov 20 to have captured the village of Illinka, close to the strategic hub of Kurakhove in the eastern Donetsk region.",
      "The Kremlin also rejected as “absurd” and “laughable” suggestions it was involved in the cutting of two telecommunications cables running under the Baltic Sea.",
      "European officials have said they suspect “sabotage” and “hybrid warfare” linked to Russia’s invasion of Ukraine.",
      "Despite increased speculation of possible talks to end the conflict, there is no sign of Mr Zelensky or Russian President Vladimir Putin being anywhere close to converging on a possible deal.",
      "AFP, REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "nov 20",
      "said nov",
      "first time",
      "north korean",
      "korean troops",
      "storm shadow",
      "shadow missiles",
      "missiles russia",
      "media reported",
      "russian military"
    ]
  },
  {
    "title": "China urges ‘calm’ after Putin decree on broader use of nuclear weapons",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/china-urges-calm-after-putin-decree-on-broader-use-of-nuclear-weapons",
    "publishedAt": "2024-11-20T09:25:00Z",
    "sentences": [
      "BEIJING - China on Nov 20 urged “calm” and “restraint” after Russian President Vladimir Putin issued a nuclear threat, and Ukraine fired longer-range US missiles at Russian territory for the first time.",
      "Moscow has reacted furiously to a decision by US President Joe Biden to change the country’s policy on Ukraine and allow Kyiv to use US-supplied long-range missiles to strike Russian territory.",
      "On Nov 19, Mr Putin signed a decree that enables Moscow to use nuclear weapons against non-nuclear states such as Ukraine if they are supported by nuclear powers.",
      "Following the decree, a senior official told AFP that a strike on Russia’s Bryansk region earlier on Nov 19 “was carried out by ATACMS missiles” – a reference to the US-supplied Army Tactical Missile System.",
      "On Nov 20, Beijing called for a cooling of tensions.",
      "When asked about the decree and the strikes inside Russia, Chinese Foreign Ministry spokesman Lin Jian said: “Under the current circumstances, all parties should remain calm and exercise restraint, working together through dialogue and consultation to ease tensions and reduce strategic risks.” He added: “China’s stance of encouraging all parties to de-escalate the situation and commit to a political resolution of the Ukraine crisis remains unchanged.” He also said: “China will continue to play a constructive role in this regard.” The White House, Britain and the European Union condemned Mr Putin’s nuclear decree as “irresponsible”.",
      "Speaking to journalists after the Group of 20 summit in Rio de Janeiro, French leader Emmanuel Macron said he had asked Chinese President Xi Jinping during a meeting at the G-20 to “use all his influence” with Mr Putin to try to achieve a de-escalation.",
      "Mr Macron said Russian ally China had “the capacity to negotiate with President Putin so that he halts his attacks” on Ukraine.",
      "China presents itself as a neutral party in the Ukraine war and says it is not sending lethal assistance to either side, unlike the US and other Western nations.",
      "But it remains a close political and economic ally of Russia, and Nato members have branded Beijing a “decisive enabler” of the war, which it has never condemned.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr putin",
      "nov 20",
      "russian territory",
      "nov 19",
      "macron said",
      "beijing china",
      "china nov",
      "20 urged",
      "urged calm",
      "calm restraint"
    ]
  },
  {
    "title": "Ukraine hits Russia with US ATACMS missiles for first time on war’s 1,000th day",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraine-hits-russia-with-us-atacms-missiles-for-first-time-on-wars-1000th-day",
    "publishedAt": "2024-11-19T21:56:35Z",
    "sentences": [
      "KYIV - Ukraine used US ATACMS missiles to strike Russian territory on Nov 19, taking advantage of newly granted permission from the outgoing administration of US President Joe Biden on the war’s 1,000th day.",
      "Russia said its forces shot down five of six missiles fired at a military facility in the Bryansk region.",
      "Debris of one hit the facility, starting a fire that was swiftly put out and caused no casualties or damage, it said.",
      "Ukraine said it struck a Russian arms depot about 110km inside Russia, an attack that caused secondary explosions.",
      "Ukraine’s military did not publicly specify the weapons used, but a Ukrainian government source and a US official confirmed it had used ATACMS.",
      "A US official said Russia intercepted two of eight missiles and that the strike was at an ammunition supply point.",
      "Mr Biden gave approval this week for Ukraine to use ATACMS, the longest-range missiles Washington has supplied, for such attacks inside Russia.",
      "Russian Foreign Minister Sergei Lavrov said the use of ATACMS was a clear signal the West wanted to escalate the conflict.",
      "Moscow has said such weapons cannot be used without direct US operational support and their use would make Washington a direct combatant in the war, prompting Russian retaliation.",
      "The attack took place as Ukraine marked 1,000 days of war, with a fifth of its territory in Russian hands and doubts about the future of Western support as President-elect Donald Trump heads back to the White House.",
      "At the United Nations in New York, Ukraine’s UN ambassador, Mr Sergiy Kyslytsya, read a statement from his country and 42 others and the European Union, rejecting Russia’s “attempted illegal annexation” of Ukrainian territory and demanding immediate withdrawal.",
      "“One thousand days is a tragic reminder of the need to remain resolute in ensuring... that international law prevails, not just in Ukraine, but wherever it is challenged,” he said.",
      "Military experts say using the US missiles can help Ukraine defend a pocket of captured Russian territory in the Kursk region as a bargaining chip, but was not likely to have a decisive impact on the 33-month-old war, in part as the move comes far too late.",
      "The missile’s range of up to 300km is much shorter than that of some Moscow has used to strike Ukraine, including its hypersonic Kinzhal weapon with a reported range of up to 2,000km.",
      "On Nov 19, Russian President Vladimir Putin signed a new nuclear doctrine that appeared intended as a warning to Washington.",
      "It lowers the threshold under which Russia might use atomic weapons to include responding to attacks that threaten its territorial integrity.",
      "Washington said the update to the nuclear doctrine was no surprise and rejected “more of the same irresponsible rhetoric from Russia”.",
      "Mr Zelensky said the step showed Mr Putin had no interest in peace: “Especially on this day... they presented (a) nuclear weapons strategy.",
      "Why?",
      "They didn’t present (a) peace strategy.",
      "Did you hear it?",
      "Putin wants war.” The Pentagon said the US State Department has approved another potential US$100 million (S$133 million) sale of military equipment and services to Ukraine, while Denmark said it was making a new donation of about US$138 million for development of Ukraine’s arms industry.",
      "Trump has criticised the scale of US aid to Kyiv and said he will end the war quickly, without saying how.",
      "Both sides appear to anticipate his return in two months will be accompanied by a push for peace talks, which are not known to have taken place since the war’s early months.",
      "The warring sides have been escalating to try to secure a stronger position at any negotiations.",
      "Mr Zelensky says Kyiv must do everything for the war to end diplomatically in 2025.",
      "“At this stage of the war, it is being decided who will prevail.",
      "Whether us over the enemy, or the enemy over us Ukrainians... and Europeans.",
      "And everyone in the world who wants to live freely and not be subject to a dictator,” he told parliament.",
      "Dozens of civilians and soldiers gathered for a moment’s silence at a candle-lit commemoration in the evening in Kyiv.",
      "Some sobbed.",
      "“My life has been turned upside down.",
      "There is no life for me.",
      "I only want victory and to return home.",
      "I am grateful to all the men defending our country,” said Yuliia, from the city of Mariupol, was captured by Russia in 2022.",
      "UN spokesman Stephane Dujarric cited data from the UN Human Rights Office that more than 12,000 civilians had been killed and nearly 27,000 injured in Ukraine over the past 1,000 days, with more than 2,400 child casualties.",
      "Over six million Ukrainians live as refugees abroad, and the population has fallen by a quarter since Mr Putin ordered the invasion that began Europe’s biggest conflict since World War II.",
      "Military losses are huge, although casualty figures remain secret.",
      "Public Western estimates based on intelligence reports say hundreds of thousands have been wounded or killed on each side.",
      "In the first year after the invasion, Ukrainian troops pushed Russian forces back from the outskirts of Kyiv and recaptured territory.",
      "Since then, relentless trench warfare has ground eastern Ukrainian cities to dust.",
      "In a move described in the West as an escalation, Russia has deployed 11,000 North Korean troops, some of whom Kyiv says have clashed with Ukrainian forces in Kursk.",
      "Mr Zelensky said Pyongyang could send 100,000 soldiers.",
      "Russia for its part continues to advance slowly in eastern Ukraine, and said it captured another settlement on Nov 19.",
      "With winter setting in, Moscow on Nov 17 renewed its aerial assault on Ukraine’s power system, launching the biggest barrage since August.",
      "There has been no public narrowing of negotiating positions.",
      "Kyiv demands a full Russian withdrawal from all occupied territory and Western security guarantees comparable to membership in Nato’s mutual defence treaty to prevent future Russian attacks.",
      "Moscow says Ukraine must drop all ambitions to join Nato and withdraw all troops from provinces Russia says it has annexed since its invasion.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "mr zelensky",
      "atacms missiles",
      "missiles strike",
      "russian territory",
      "nov 19",
      "ukraine said",
      "inside russia",
      "weapons used",
      "us official",
      "use atacms"
    ]
  },
  {
    "title": "US slams Russia’s ‘irresponsible rhetoric’ on nukes",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/united-states/us-wont-change-nuclear-posture-after-russia-lowers-threshold-white-house-says",
    "publishedAt": "2024-11-19T14:51:48Z",
    "sentences": [
      "WASHINGTON - The White House condemned Russia’s “irresponsible rhetoric” on Nov 19, after Vladimir Putin eased Moscow’s rules for nuclear strikes, but said it saw no need to change its own force posture.",
      "President Putin’s move came after Washington allowed Ukraine to fire long-range US-made missiles into Russian territory, with Moscow saying Kyiv had used the weapons for the first time on Nov 19.",
      "“This is more of the same irresponsible rhetoric from Russia, which we have seen for the past two years,” a spokesperson for the US National Security Council told AFP.",
      "The spokesperson said that “we were not surprised by Russia’s announcement that it would update its nuclear doctrine” and that Moscow had been “signalling its intent” to do so for several weeks.",
      "“Observing no changes to Russia’s nuclear posture, we have not seen any reason to adjust our own nuclear posture or doctrine in response to Russia’s statements today.” US officials have previously confirmed that outgoing President Joe Biden, who is attending a G-20 summit in Rio de Janeiro, gave the green light for ally Kyiv to use long-range missiles against Russia.",
      "While the White House has not done so on the record, it has hinted that the move is a response to Russia’s use of North Korean soldiers against Ukraine.",
      "The deployment of Pyongyang’s troops is a “significant escalation... and we warned that the United States would respond.",
      "I won’t get into the details of that response today,” the National Security Council spokesperson said.",
      "The US reaction came as Ukrainian President Volodymyr Zelensky accused G-20 leaders of failing to act after Mr Putin’s nuclear rule change.",
      "Ukraine is anxiously watching to see whether US President-elect Donald Trump will switch off American military aid and try to push through a peace deal that could force Kyiv to cede territory to Moscow.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "white house",
      "irresponsible rhetoric",
      "nov 19",
      "territory moscow",
      "national security",
      "security council",
      "spokesperson said",
      "nuclear posture",
      "response russia",
      "washington white"
    ]
  },
  {
    "title": "Russia says Ukraine fired first US-long range missiles",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/russia-says-ukraine-attacked-border-region-with-us-made-long-range-missiles",
    "publishedAt": "2024-11-19T08:36:46Z",
    "sentences": [
      "MOSCOW - Russia said on Nov 19 that Ukraine had fired US-supplied long-range missiles into its territory for the first time since Washington authorised such strikes as President Vladimir Putin issued a nuclear threat on the 1,000th day of the war.",
      "A senior Ukrainian official confirmed to AFP that its military had used Army Tactical Missile System (ATACMS) missiles to strike inside Russian territory.",
      "“The attack on the Bryansk region was carried out by ATACMS missiles,” the source told AFP, without adding details.",
      "Ukrainian President Volodymyr Zelensky separately declined to comment during a press conference in Kyiv.",
      "Russian Foreign Minister Sergei Lavrov, speaking at a Group of 20 press conference in Brazil, said the strike marked a “new phase of the Western war” against Moscow, and vowed to react “accordingly”.",
      "The grim 1,000th day anniversary opened with a Russian strike in the eastern Ukrainian region of Sumy that gutted a Soviet-era residential building and killed at least 12 people, including a child.",
      "Mr Zelensky published images of rescuers hauling bodies from the debris and called on Kyiv’s allies to “force” the Kremlin into peace.",
      "The Foreign Ministry released an anniversary statement calling on allies to ramp up military support to bring about a “sustainable” end to the war.",
      "“Ukraine will never submit to the occupiers, and the Russian military will be punished for violating international law,” the ministry said.",
      "“We need peace through strength, not appeasement,” it added, referring to growing calls for Kyiv to sit down at the negotiating table with Moscow to end the war.",
      "The Kremlin also vowed to defeat Ukraine.",
      "“The military operation against Kyiv continues... and will be completed,” Kremlin spokesman Dmitry Peskov told reporters, using Russia’s preferred language for its invasion.",
      "Washington this week said it had cleared Ukraine to use long-range ATACMS weapons against military targets inside Russia – a longstanding Ukrainian request.",
      "Russia’s military said: “At 3.25am (local time), the enemy struck a site in the Bryansk region with six ballistic missiles.",
      "According to confirmed data, US-made ATACMS tactical missiles were used.” Moscow has said the use of Western weapons against its internationally recognised territory would make the US a direct participant in the conflict and pledged an “appropriate and palpable response”.",
      "The strike confirmation came shortly after Mr Putin signed a decree on Nov 19 which enables Russia to use nuclear weapons against non-nuclear states such as Ukraine if they are supported by nuclear powers.",
      "The new nuclear doctrine allows Moscow to unleash a nuclear response in the event of a “massive” air attack, even if it is only with conventional weapons.",
      "Mr Peskov said this was “necessary to bring our principles in line with the current situation”.",
      "Russia has stepped up strikes on Ukraine in recent days as its troops advance in the east of the country.",
      "One overnight Russian attack hit a dormitory in the town of Glukhiv, which had a pre-war population of around 30,000 people and lies just 10km from the Kursk region in Russia, where Ukrainian troops captured territory in a major ground offensive in August.",
      "The drone attack killed 12 people, including a child, the emergency services said.",
      "In total, Kyiv said Russia had launched 87 drones over Ukraine during the night and that 51 were shot down.",
      "The strike on Sumy comes just days after another Russian aerial bombardment in the border region killed 12 people and wounded 84.",
      "A separate missile strike on Nov 18 on Odesa in southern Ukraine left 10 dead and 55 wounded.",
      "US President-elect Donald Trump has vowed to cut US assistance to Ukraine and bring about a swift end to the war, without detailing how he would do so.",
      "A group of European foreign ministers meeting in Warsaw on Nov 19 discussed stepping up aid to Ukraine if US support wanes.",
      "“I note with appreciation the readiness of the largest European Union countries to assume the burden of military and financial support for Ukraine in the context of a possible reduction in US involvement,” Polish Foreign Minister Radoslaw Sikorski said after the talks.",
      "Ukrainian forces have steadily lost ground in the Kursk region and have warned that Russia has amassed about 50,000 troops, including North Korean forces, to wrest back the region.",
      "The anniversary of Russia’s invasion – launched on Feb 24, 2022 – comes at a perilous time for Ukrainian forces across the front, particularly near the war-battered cities of Kupiansk and Pokrovsk.",
      "Nato chief Mark Rutte warned on Nov 19 that Mr Putin must not be allowed to prevail.",
      "“Why is this so crucial that Putin will not get his way?",
      "Because you will have an emboldened Russia on our border... and I’m absolutely convinced it will not stop there,” Mr Rutte said in Brussels.",
      "“It is then posing a direct threat to all of us in the West,” he said.",
      "The EU’s outgoing top diplomat Josep Borrell also pressed member states to align with Washington in allowing Kyiv to strike inside Russia using donated long-range missiles.",
      "“It is fully in accordance with international law,” he said.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "nov 19",
      "12 people",
      "end war",
      "atacms missiles",
      "strike inside",
      "bryansk region",
      "press conference",
      "foreign minister",
      "people including",
      "including child"
    ]
  },
  {
    "title": "Kremlin vows ‘response’ if Ukraine fires US missiles into Russia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/kremlin-vows-response-if-ukraine-fires-us-missiles-into-russia",
    "publishedAt": "2024-11-18T23:10:00Z",
    "sentences": [
      "ODESA, Ukraine - The Kremlin on Nov 18 accused US President Joe Biden of escalating the 1,000-day-old war in Ukraine, promising a “palpable” response to any use of US long-range missiles by Ukraine to strike targets inside Russia.",
      "Mr Biden, who in January hands over the White House to Donald Trump, a sceptic of US support for Ukraine, called at a Group of 20 (G-20) summit – attended by Russia’s foreign minister – for support for Ukraine’s sovereignty.",
      "The missile dispute raged as Moscow unleashed a second missile attack in two days on the Ukrainian Black Sea city of Odesa, killing 10 people and wounding 55, authorities said.",
      "Ukraine’s Foreign Minister Andriy Sybiga said the US decision to allow the use of Army Tactical Missile Systems (ATACMS) could be a “game changer”.",
      "Kyiv has long sought authorisation to use ATACMS against military targets inside Russia as its troops face some of the most intense pressure since Russia launched its offensive in February 2022.",
      "Russia’s aerial bombardments have levelled entire districts near the front line and decimated energy facilities across Ukraine.",
      "“The longer Ukraine can strike, the shorter the war will be,” Mr Sybiga told reporters ahead of a UN Security Council meeting to mark 1,000 days since Russia’s full invasion.",
      "“It could have very positive impact on the situation on the battlefield.” But Kremlin spokesman Dmitry Peskov said “it’s obvious that the outgoing administration in Washington intends... to continue fuelling the fire and provoke a further escalation of tensions”.",
      "Speaking at the G-20 summit in Brazil, Mr Biden said: “The United States strongly supports Ukraine’s sovereignty and territorial integrity.",
      "Everyone around this table in my view should as well.” A US official told AFP the major policy shift on the missiles was in response to Russia’s deployment of thousands of North Korean troops in its campaign.",
      "Mr Peskov said President Vladimir Putin had clearly expressed Moscow’s position in September when he declared that using the missiles would put Nato “at war” with Russia.",
      "Mr Putin said then that if Ukraine attacked Russia with long-range missiles, Moscow would “take the appropriate decisions” – a point the foreign ministry echoed on Nov 18.",
      "“Kyiv’s use of long-range missiles to attack our territory would represent the direct involvement of the United States and its satellites in hostilities against Russia,” the ministry said in a statement, vowing an “appropriate and palpable” response.",
      "Washington’s decision comes amid growing concerns over reports North Korea has deployed upwards of 10,000 troops to Russia to be sent into combat against Ukraine.",
      "US Principal Deputy National Security Adviser Jon Finer said Washington had been clear it would formulate a response to the Kremlin’s decision to deploy “a foreign country’s forces” in Russia.",
      "Russia, which has made rapid gains in Donetsk over recent weeks, claimed the capture of another village in the eastern region.",
      "The Donetsk regional governor said three people had been killed and two wounded in Russian attacks on the towns of Siversk and Kostyantynivka.",
      "President Volodymyr Zelensky said he visited two key frontline cities – Pokrovsk and Kupiansk.",
      "Pokrovsk is an important Ukrainian garrison city in the Donetsk region that Russian forces have been targeting, while Russian troops briefly entered Kupiansk last week and remain close to the outskirts.",
      "“This is a tense area,” Mr Zelensky said at Pokrovsk, thanking Ukrainian forces for ensuring that the wider Donbas territory was not “completely occupied by Russia”.",
      "Mr Biden’s decision to allow Ukraine to use US missiles to strike inside Russia could prompt European allies to also review their stance.",
      "Britain’s Prime Minister Keir Starmer refused to be drawn on the issue at the G-20.",
      "A senior Ukrainian presidency official expressed frustration over the time taken to get approval, however, saying the decision was “needed a year ago”.",
      "The international chemical weapons watchdog said meanwhile that it had found banned CS riot gas in shell and soil samples provided by Ukraine from the conflict zone.",
      "The presence of the gas violated a convention on the use of toxic weapons.",
      "Russia and Ukraine have accused each other of using chemical weapons, while Britain and the United States also charge Moscow with using banned toxic agents against Ukrainian troops.",
      "Ukrainian engineers meanwhile were still repairing damaged facilities from a Russian missile and drone barrage a day earlier.",
      "Prime Minister Denys Shmygal said around 220,000 consumers were without electricity in the Odesa and Dnipropetrovsk regions.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "inside russia",
      "russia mr",
      "mr biden",
      "united states",
      "nov 18",
      "palpable response",
      "use us",
      "us missiles",
      "ukraine strike",
      "targets inside"
    ]
  },
  {
    "title": "North Korea’s Kim urges improved military capabilities for war",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/east-asia/north-koreas-kim-urges-improved-military-capabilities-for-war",
    "publishedAt": "2024-11-17T22:51:17Z",
    "sentences": [
      "SEOUL - North Korean leader Kim Jong Un in a speech last week urged the country’s military to improve capabilities for fighting a war, said state media KCNA on Nov 18, after Pyongyang dispatched thousands of troops to Russia.",
      "Mr Kim delivered the speech to a conference of battalion commanders and political instructors held in Pyongyang on Nov 15, during which he called for building political and military strength and fighting efficiency to ensure that the armed forces can cope with a war.",
      "Threats from the United States and its allies including South Korea and their military confrontation with North Korea have brought tension to “the worst phase in history”, he said, calling the Korean peninsula “the world’s biggest hot spot”.",
      "“He ardently called upon all the participants to go all out for bringing about substantial and fundamental improvement in improving their capabilities for fighting an actual war,” KCNA said.",
      "The report came amid international criticism over rapidly developing military cooperation between North Korea and Russia.",
      "Washington, Seoul and Kyiv have said there are more than 10,000 North Korean soldiers in Russia to support its war against Ukraine, and some of them have engaged in combat in Kursk, near the Ukraine border.",
      "KCNA said a workshop was given for military officers at the weekend as part of the conference, which was aimed at strengthening the battalions, bolstering their fighting efficiency, and “rounding off war preparations as required by the prevailing situation and modern warfare”.",
      "In a separate dispatch, KCNA said a Russian delegation led by National Resources and Ecology Minister Alexander Kozlov arrived in Pyongyang on Nov 17 for trade and economy talks.",
      "Last week, Mr Kim guided a test of suicide drones and ordered their mass production, citing an intensifying competition for adopting such weapons around the world.",
      "US President Joe Biden, South Korean President Yoon Suk-yeol and Japanese Prime Minister Shigeru Ishiba condemned North Korea and Russia’s decision to “dangerously expand” the Ukraine war as they held a summit on the sidelines of the Asia-Pacific Economic Cooperation Summit in Peru.",
      "Mr Biden’s administration has allowed Ukraine to use US-made weapons to strike deep into Russia, sources told Reuters, marking a significant policy reversal and a response to Russia’s deployment of North Korean ground troops.",
      "Ukrainian President Volodymyr Zelensky has said that North Korean troops had suffered casualties in combat with his country’s forces, and the first battles between them “open a new page in instability”.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korean",
      "north korea",
      "kcna said",
      "last week",
      "capabilities fighting",
      "mr kim",
      "pyongyang nov",
      "fighting efficiency",
      "korea russia",
      "said north"
    ]
  },
  {
    "title": "Ukraine strikes on Russia with US missiles could lead to world war, Russian lawmakers say",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/ukraine-strikes-on-russia-with-us-missiles-could-lead-to-world-war-russian-lawmakers-say",
    "publishedAt": "2024-11-17T21:36:09Z",
    "sentences": [
      "MOSCOW - Washington’s decision to let Kyiv strike deep into Russia with long-range US missiles escalates the conflict in Ukraine and could lead to World War III, senior Russian lawmakers said on Nov 17.",
      "Two US officials and a source familiar with the decision revealed the significant reversal of Washington’s policy in the Ukraine-Russia conflict earlier on Nov 17.",
      "“The West has decided on such a level of escalation that it could end with the Ukrainian statehood in complete ruins by morning,” Mr Andrei Klishas, a senior member of the Federation Council, Russia’s upper chamber of parliament, said on the Telegram messaging app.",
      "Mr Vladimir Dzhabarov, first deputy head of the Russian Upper House’s international affairs committee, said that Moscow’s response will be immediate.",
      "“This is a very big step towards the start of World War III,” the Tass state news agency quoted Mr Dzhabarov as saying.",
      "Echoing his views, Russian lawmaker Maria Butina said on Nov 18: “These guys, Biden’s administration, is trying to escalate the situation to the maximum while they still have power and are still in office.” “I have a great hope that (Donald) Trump will overcome this decision if this has been made because they are seriously risking the start of World War III which is not in anybody’s interest.” President Vladimir Putin said on Sept 12 that Western approval for such a step would mean “the direct involvement of Nato countries, the United States and European countries in the war in Ukraine” because Nato military infrastructure and personnel would have to be involved in the targeting and firing of the missiles.",
      "In late October, Mr Putin said that Russia’s defence ministry was working on different ways to respond if the US and its Nato allies help Ukraine to strike deep into Russia with long-range Western missiles.",
      "“I guess there are some people in the United States who have nothing to lose for whatever reason or who are completely off the grid so much that they simply do not care,” said Ms Butina, who spent 15 months in US prison for acting as an unregistered Russian agent and is now a lawmaker for the ruling United Russia party.",
      "Mr Leonid Slutsky, chairman of the state Duma Lower House's foreign affairs committee, said that US authorisation of strikes by Kyiv on Russia with US ATACMS tactical missiles would lead to the toughest response, Russian news agencies reported.",
      "\"Strikes with US missiles deep into Russian regions will inevitably entail a serious escalation, which threatens to lead to much more serious consequences,\" Tass news agency quoted Mr Slutsky as saying.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "world war",
      "war iii",
      "strike deep",
      "deep russia",
      "russia us",
      "us missiles",
      "said nov",
      "affairs committee",
      "committee said",
      "start world"
    ]
  },
  {
    "title": "Biden allows Ukraine to use US arms to strike inside Russia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/united-states/biden-allows-ukraine-to-use-us-arms-to-strike-inside-russia",
    "publishedAt": "2024-11-17T18:11:11Z",
    "sentences": [
      "WASHINGTON - US President Joe Biden's administration has allowed Ukraine to use US-made weapons to strike deep into Russia, two US officials and a source familiar with the decision said on Nov 17, in a significant reversal of Washington's policy in the Ukraine-Russia conflict.",
      "Ukraine plans to conduct its first long-range attacks in the coming days, the sources said, without revealing details due to operational security concerns.",
      "The move comes two months before President-elect Donald Trump takes office on Jan 20 and follows months of pleas by Ukrainian President Volodymyr Zelensky to allow Ukraine's military to use US weapons to hit Russian military targets far from its border.",
      "The change comes largely in response to Russia's deployment of North Korean ground troops to supplement its own forces, a development that has caused alarm in Washington and Kyiv, a US official and a source familiar with the decision said.",
      "The White House and the State Department declined to comment.",
      "The Ukrainian Foreign Ministry and president's office did not immediately respond to requests for comment.",
      "Russia has warned that it would see a move to loosen the limits on Ukraine's use of US weapons as a major escalation.",
      "Mr Vladimir Dzhabarov, first deputy head of the Russian Upper House’s international affairs committee, said Washington’s decision to let Kyiv strike deep into Russia could lead to “World War III”.",
      "“The West has decided on such a level of escalation that it could end with the Ukrainian statehood in complete ruins by morning,” Mr Andrei Klishas, a senior member of the Federation Council, Russia’s Upper Chamber of Parliament, said on the Telegram messaging app.",
      "Ukraine's first deep strikes are likely to be carried out using ATACMS rockets, which have a range of up to 306km, according to the sources.",
      "While some US officials have expressed scepticism that allowing long-range strikes will change the war's overall trajectory, the decision could help Ukraine at a moment when Russian forces are making gains and possibly put Kyiv in a better negotiating position when and if ceasefire talks happen.",
      "It is not clear if Trump will reverse Mr Biden's decision when he takes office.",
      "Trump has long criticised the scale of US financial and military aid to Ukraine and has vowed to end the war quickly, without explaining how.",
      "A Trump spokesperson did not immediately respond to a request for comment.",
      "But one of Trump's closest foreign policy advisers, Mr Richard Grenell, criticised the decision.",
      "\"Escalating the wars before he leaves office,\" Mr Grenell said, in an X post responding to the news.",
      "Some congressional Republicans had urged Mr Biden to loosen the rules on how Ukraine can use US-provided weapons.",
      "Since Trump's Nov 5 victory, senior Biden administration officials have repeatedly said they would use the remaining time to ensure Ukraine can fight effectively next year or negotiate peace with Russia from a \"position of strength\".",
      "The US believes more than 10,000 North Korean soldiers have been sent to eastern Russia and that most of them have moved to the Kursk region and have begun to engage in combat operations.",
      "Russia is advancing at its fastest rate since 2022 despite taking heavy losses, and Ukraine said it had clashed with some of those North Korean troops deployed to Kursk.",
      "Stretched by personnel shortages, Ukrainian forces have lost some of the ground they captured in an August incursion into Kursk that Zelensky said could serve as a bargaining chip.",
      "\"Removing targeting restrictions will allow the Ukrainians to stop fighting with one hand tied behind their back,\" Mr Alex Plitsas, senior non-resident fellow at the Atlantic Council, said.",
      "\"However, like everything else, I believe history will say the decision came way too late.",
      "Just like the ATACMS, Himars, Bradley Fighting Vehicles, Abrams Tanks and F-16.",
      "They were all needed much sooner,\" he added.",
      "Despite Mr Zelensky's pleas, the White House had been reluctant to allow US-supplied weapons to be used to strike targets deep inside Russia for fear this could escalate the conflict.",
      "Republican US Representative Mike Turner, who chairs the House Intelligence Committee, said in a statement that Mr Biden’s decision was long overdue and that there were still too many restrictions on Ukraine.",
      "But he added: “This first step will put pressure on Vladimir Putin as President-elect Trump returns to the White House and works to end this war.” Kyiv's other allies have been supplying weapons but with restrictions on how and when they can be used inside Russia, out of concern such strikes could prompt retaliation that draws Nato countries into the war or provokes a nuclear conflict.",
      "Polish Foreign Minister Radoslaw Sikorski also called the move a response to North Korea's involvement.",
      "\"President Biden responded to the entry of North Korean troops into the war and the massive Russian missile strike in a language that V. Putin understands – by removing restrictions on Ukraine's use of Western missiles,\" Mr Sikorski said on X. REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "ukraine use",
      "north korean",
      "white house",
      "mr biden",
      "biden administration",
      "use weapons",
      "strike deep",
      "deep russia",
      "us officials",
      "source familiar"
    ]
  },
  {
    "title": "Ukraine’s Zelensky says wants to end war by ‘diplomatic means’ next year",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/zelensky-says-wants-to-end-war-by-diplomatic-means-next-year",
    "publishedAt": "2024-11-16T12:21:00Z",
    "sentences": [
      "KYIV, Ukraine - Ukrainian President Volodymyr Zelensky said on Nov 16 he would like to end the war with Russia next year through “diplomatic means”.",
      "He spoke a day after saying he expected the conflict to end sooner than it would otherwise have done, once Donald Trump takes office in the United States next year.",
      "“For our part, we must do everything we can to ensure that this war ends next year.",
      "We have to end it by diplomatic means,” Mr Zelensky said in an interview with Ukrainian radio.",
      "“And this, I think, is very important.” There have been no meaningful talks between Russia and Ukraine, but a Trump presidency raises questions about the future of the conflict, with the Republican repeatedly saying he would end the war swiftly.",
      "“We have to understand what the Russians want,” Mr Zelensky said.",
      "Referring to Ukraine, he said: “You are at war with a state that does not value its people, that has a lot of equipment, that does not care how many people die.” Russian President Vladimir Putin has said he will only accept talks with Ukraine if Kyiv surrenders Ukrainian territory that Moscow occupies.",
      "The Kremlin said he repeated that demand in a phone conversation with German Chancellor Olaf Scholz on Nov 15.",
      "Mr Zelensky has rejected Mr Putin’s conditions.",
      "Moscow has made steady advances in eastern Ukraine since this summer, inching closer to key hubs such as Pokrovsk and Kurakhove.",
      "Mr Zelensky said on Nov 16 that Russian forces were suffering heavy losses and that the adance had “slowed down” in some areas.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "zelensky said",
      "mr zelensky",
      "next year",
      "said nov",
      "nov 16",
      "end war",
      "diplomatic means",
      "kyiv ukraine",
      "ukraine ukrainian",
      "ukrainian president"
    ]
  },
  {
    "title": "Zelensky says Ukraine war will end ‘sooner’ with Trump in office",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/zelensky-says-ukraine-war-will-end-sooner-with-trump-in-office",
    "publishedAt": "2024-11-15T22:59:00Z",
    "sentences": [
      "KYIV - Ukrainian President Volodymyr Zelensky said on Nov 15 that Russia’s war against his country will “end sooner” than it otherwise would have done once Donald Trump becomes US president in 2025.",
      "“It is certain that the war will end sooner with the policies of the team that will now lead the White House.",
      "This is their approach, their promise to their citizens,” Mr Zelensky said in an interview with Ukrainian media outlet Suspilne.",
      "“The war will end, but we don’t know the exact date,” he added.",
      "Mr Zelensky said he had a “constructive exchange” with Trump during their telephone conversation after his victory in the US presidential election.",
      "“I didn’t hear anything that goes against our position,” he added.",
      "Throughout the election campaign, Trump criticised the tens of billions of dollars in aid provided for Ukraine since the start of the Russian invasion in February 2022, and he promised he would resolve the conflict “in 24 hours”, without ever explaining how.",
      "Speaking at his Mar-a-Lago resort in Palm Beach, Florida on Nov 15, Trump said “we’re going to work very hard on Russia and Ukraine.",
      "It’s got to stop”.",
      "Ukraine fears US support will flag just as its troops are struggling on the front, or that it will be forced to make territorial concessions to Russia.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "zelensky said",
      "nov 15",
      "end sooner",
      "war end",
      "mr zelensky",
      "kyiv ukrainian",
      "ukrainian president",
      "president volodymyr",
      "volodymyr zelensky",
      "said nov"
    ]
  },
  {
    "title": "North Korea’s Kim going for high-risk, high-return gamble by joining Ukraine war",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/east-asia/north-koreas-kim-going-for-high-risk-high-return-gamble-by-joining-ukraine-war",
    "publishedAt": "2024-11-14T12:15:00Z",
    "sentences": [
      "SEOUL – By throwing in his lot with Russian leader Vladimir Putin and joining the war in Ukraine, North Korean leader Kim Jong Un is taking on the biggest gamble of his leadership, say analysts.",
      "With North Korea’s economy facing immense difficulties, and growing civil unrest threatening his control of the regime, Mr Kim has calculated that joining the war would bring him more benefits than losses, said Dr Doo Jin-ho, who heads the global strategy division at the Korea Institute for Defence Analyses think-tank.",
      "Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "joining war",
      "seoul throwing",
      "throwing lot",
      "lot russian",
      "russian leader",
      "leader vladimir",
      "vladimir putin",
      "putin joining",
      "war ukraine",
      "ukraine north"
    ]
  },
  {
    "title": "North Korea ratifies mutual defence treaty with Russia",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/asia/east-asia/north-korea-ratifies-mutual-defence-treaty-with-russia",
    "publishedAt": "2024-11-11T22:14:10Z",
    "sentences": [
      "SEOUL – North Korea has ratified a landmark defence pact with Russia, state media reported on Nov 12, deepening security cooperation that has seen Pyongyang send thousands of troops to help Moscow fight against Ukraine.",
      "The agreement formalises months of tightening military bonds between two nations that were Communist allies throughout the Cold War.",
      "Seoul and ally the United States have accused the nuclear-armed North of sending thousands of soldiers to Russia, where they have been outfitted with Russian uniforms and are, according to reports, massed on the border near Kursk.",
      "The deal “was ratified as a decree” of North Korean leader Kim Jong Un, the Korean Central News Agency (KCNA) said on Nov 12.",
      "The notice comes after Russian lawmakers voted unanimously last week to ratify the deal, which President Vladimir Putin later signed.",
      "“The treaty will take effect from the day when both sides exchange the ratification instruments,” KCNA said.",
      "North Korea has become one of the most vocal and important backers of Russia’s full-scale offensive on Ukraine.",
      "Pyongyang has long been accused by Western nations of supplying Moscow with artillery shells and missiles for use in Ukraine, but that support has escalated in recent weeks with the reported arrival of thousands of North Korean troops prepared to engage in combat.",
      "Mr Putin and Mr Kim signed the strategic partnership treaty in June, during the Kremlin chief’s visit to Pyongyang.",
      "It obligates both states to provide military assistance “without delay” in the case of an attack on the other, and to cooperate internationally to oppose Western sanctions.",
      "Mr Putin hailed the deal in June as a “breakthrough document”.",
      "“With bilateral ratifications, Pyongyang and Moscow will claim legitimacy for North Korea’s military deployment to Russia, arguing that this action is justified by the ratified treaty between the two,” said Mr Hong Min, a senior analyst at the Korea Institute for National Unification.",
      "“While their treaty does not override UN resolutions prohibiting such cooperation, they will assert its legitimacy based on their agreement,” Mr Hong added.",
      "“This raises the prospect of additional, potentially larger deployments of North Korean manpower to Russia in the future.” North Korean Foreign Minister Choe Son Hui recently visited Moscow and said her country would “stand firmly by our Russian comrades until victory day”.",
      "She called Moscow’s offensive against Ukraine a “sacred struggle” and said Pyongyang believed in Mr Putin’s “wise leadership”.",
      "Citing intelligence reports, South Korea, Ukraine and the West say North Korea has deployed around 10,000 troops to Russia to fight against Ukraine.",
      "When asked publicly about the deployment in October, Mr Putin did not deny it, instead deflecting the question to criticise the West’s support of Ukraine.",
      "The West fears Russia is offering North Korea technological support that could advance Pyongyang’s nuclear weapons programme, in exchange for sending troops.",
      "The reclusive state recently fired a salvo of ballistic missiles, including a test of a new solid-fuel intercontinental ballistic missile.",
      "AFP Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korea",
      "north korean",
      "mr putin",
      "fight ukraine",
      "kcna said",
      "offensive ukraine",
      "mr hong",
      "ukraine west",
      "seoul north",
      "korea ratified"
    ]
  },
  {
    "title": "N. Korean troops clashed with Ukrainian forces in Russia’s Kursk, NYT reports",
    "source": "The Straits Times",
    "url": "https://www.straitstimes.com/world/europe/n-korean-troops-clashed-with-ukrainian-forces-in-russias-kursk-nyt-reports",
    "publishedAt": "2024-11-06T04:52:14Z",
    "sentences": [
      "NEW YORK - North Korean troops have engaged in clashes against Ukrainian forces fighting in the Russian Kursk region, The New York Times reported late on Nov 5, citing an unnamed senior US official and an unnamed senior Ukrainian official.",
      "The engagement was limited, the Ukrainian official told the newspaper, and likely meant to probe the Ukrainian lines for weaknesses.",
      "The Ukrainian official added that the North Korean troops fought together with Russia’s 810 Separate Naval Infantry Brigade.",
      "Reuters could not independently verify the New York Times report.",
      "The office of Ukraine’s President Volodymyr Zelensky, the Ukrainian Defence Ministry, the Russian Defence Ministry, the Pentagon and the US Department of State did not immediately respond to Reuters’ requests for comment.",
      "Ukrainian troops launched an incursion into Russia’s border Kursk region in August, taking a number of settlements under control in the first such deployment into the Russian territory since Moscow launched its full-scale invasion on Ukraine in February 2022.",
      "The Pentagon said on Nov 4 that there were at least 10,000 North Korean troops in Kursk but could not corroborate reports that they were engaged in combat.",
      "Ukrainian Defence Minister Rustem Umerov said in an interview with South Korean television, broadcast on Nov 5, that the first engagement had occurred with North Korean troops.",
      "The New York Times reported that it was unclear when the fighting took place.",
      "The US official told the newspaper that a significant number of North Korean troops were killed.",
      "Mr Zelensky said on Nov 5 in his nightly address that the first battles between the Ukrainian military and North Korean troops have opened “a new page in instability in the world”.",
      "REUTERS Join ST's Telegram channel and get the latest breaking news delivered to you.",
      "Terms and conditions apply Frequently asked questions"
    ],
    "topics": [
      "north korean",
      "korean troops",
      "new york",
      "york times",
      "nov 5",
      "ukrainian official",
      "kursk region",
      "times reported",
      "unnamed senior",
      "us official"
    ]
  }
]