[
  {
    "title": "Nigeria’s Brics partnership: economist outlines potential benefits",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/nigerias-brics-partnership-economist-outlines-potential-benefits-248943",
    "publishedAt": "2025-02-04T13:00:00Z",
    "sentences": [
      "Professor of Economics & Business, Allegheny College Stephen Onyeiwu does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "View all partners During its 16th annual summit in Kazan, Russia, Brics – a group of emerging economies determined to act as a counterweight to the west and to whittle down the influence of global institutions – invited Nigeria and eight other countries to join it as “partner” countries.",
      "Nigeria formally accepted the invitation in January 2025.",
      "That invitation has generated questions about how Nigeria stands to benefit, especially when US president Donald Trump is threatening to sanction members of the group if they replace the US dollar as reserve currency.",
      "It was established in 2006 and initially composed of Brazil, Russia, India, and China.",
      "South Africa joined in 2010 and the bloc added four new members (Egypt, Ethiopia, Iran and the United Arab Emirates) in 2023.",
      "In this interview, development economist Stephen Onyeiwu argues that Nigeria stands to gain from a Brics partnership, but would have to carefully balance its domestic interests with those of its western allies and Brics.",
      "The introduction of Brics partnership is an expansion mechanism designed to bring in more participants without giving them full membership.",
      "It is akin to “observer” status.",
      "Brics partners can participate in special sessions of summits and foreign ministers’ meetings, as well as other high-level events.",
      "Partners can also contribute to the organisation’s official documents and policy statements.",
      "But partners cannot host annual Brics summits or determine the venue.",
      "Neither can they select new members and partners.",
      "The main benefit would be access to finance offered by Brics’ New Development Bank.",
      "The New Development Bank was established as an alternative to western-dominated international financial institutions like the World Bank and International Monetary Fund.",
      "These institutions are sometimes used by the leading western countries to keep developing countries in line on global issues.",
      "Some developing countries are reluctant to criticise western countries for fear of losing access to funding by western-backed international financial institutions.",
      "Nigeria has been running a budget deficit of about 5% of GDP since 2019, and it needs funding to pay for the deficits.",
      "The New Development Bank could be an important source of funding for investment in Nigeria’s infrastructure, manufacturing, agriculture, and so on.",
      "New Development Bank loans are also available in member countries’ local currencies.",
      "They don’t have to earn foreign exchange to repay the loans.",
      "This fosters exchange rate stability and promotes economic growth.",
      "The New Development Bank raises funds in member countries’ local currencies, and lends them to member countries.",
      "Nigeria could use its Brics partnership to garner the group’s support in matters that affect Nigeria globally.",
      "For instance, there have been requests for African countries to be included as permanent members (without veto power) of the UN security council.",
      "South Africa and Nigeria have been touted as potential candidates.",
      "Should this issue be raised at the UN, Nigeria can count on the support of its Brics allies, which includes two permanent members (China and Russia) of the security council.",
      "Mutual understanding and cooperation with other Brics members and partners might spill over into economic, trade and investment agreements.",
      "Friendly countries are more likely to trade with each other and invest in each other’s economy.",
      "Nigeria should use it to attract foreign direct investment in strategic sectors of the economy, such as infrastructure, manufacturing, agriculture and technology.",
      "Some Brics members, like China, India, and the UAE, have investors that are seeking investment outlets abroad.",
      "Nigeria could use the bloc’s annual summits to showcase investment opportunities.",
      "The global economy is transitioning into “frontier industries and technologies”, such as big data, artificial intelligence, solar, drones, gene editing, 3D printing, blockchains, Internet of Things (IoT), 5G, robotics and nanotechnology.",
      "China, India and Brazil are already well advanced in these technologies.",
      "Nigeria should use its partnership with these countries to build capabilities in frontier industries and technologies.",
      "It could get favourable terms in the transfer of these technologies.",
      "Nigeria seeks to diversify its economy from reliance on the export of hydrocarbons.",
      "But Nigerian producers have had a hard time accessing global markets.",
      "The country should negotiate trade deals that provide access to Brics markets, especially agricultural and agro-processed products, arts and crafts.",
      "But Nigeria has to promote economic growth and structural transformation at home.",
      "If the Nigerian economy falters, it is unlikely the country will be invited to become a full member of Brics.",
      "Brics has so far not been able to significantly change the dynamics of the international political economy.",
      "Adding new members and partners, while symbolic, will not act as an effective counterweight to the influence of the G7 and G20 groups of nations.",
      "Most of the countries and partners in Brics are either allies of western countries or neutral on global issues.",
      "They are unlikely to support decisions or actions that are grossly inimical to western interests.",
      "Egypt and the UAE, for instance, receive military aid from the United States.",
      "Ethiopia and Nigeria are top recipients of foreign aid in Africa, much of it from western-backed financial institutions.",
      "The only outlier in the mix is Iran, whose membership was promoted by Russia.",
      "But Iran has no leverage to influence others in the bloc.",
      "On balance, therefore, Brics will not be a threat to western countries.",
      "Brics aspires to weaken the dominance of the US dollar for international transactions.",
      "Close to 90% of international trade transactions are conducted with the US dollar.",
      "Brics countries plan to reduce dollar dominance by encouraging member countries to settle their trade and financial transactions using their domestic currencies.",
      "For instance, South African businesses could purchase Chinese goods using the South African rand, while the Chinese could do the same for South African goods using the Chinese yuan.",
      "The more members you have in Brics swapping their currencies, the less important the US dollar will be.",
      "It is unlikely, however, that an increase in the number of Brics members and partners will weaken the dollar.",
      "Most will continue to have significant economic relationships with the west, including trade and foreign aid.",
      "They will also continue to conduct business with many non-Brics countries, which also have economic relationships with the west.",
      "They will need the US dollar to transact with many other countries.",
      "So increasing the number of Brics members and partners does not pose a threat to dollar dominance.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "us dollar",
      "members partners",
      "new development",
      "development bank",
      "western countries",
      "member countries",
      "brics members",
      "new members",
      "brics partnership",
      "financial institutions"
    ]
  },
  {
    "title": "Brics: growth of China-led bloc raises questions about a rapidly shifting world order",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/brics-growth-of-china-led-bloc-raises-questions-about-a-rapidly-shifting-world-order-248075",
    "publishedAt": "2025-01-28T13:00:00Z",
    "sentences": [
      "Teaching Fellow, School of International Studies, University of Nottingham Gabriel Huland does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Nottingham provides funding as a founding partner of The Conversation UK.",
      "View all partners Brics has emerged as a significant international force since 2009 when it was established at a summit in Russia.",
      "What began as a five-member group encompassing Brazil, Russia, India, China and South Africa, is now expanding with the integration of five new members and eight new partner countries.",
      "Even more countries may be joining in the next few years.",
      "This growth raises essential questions about whether Brics will challenge the leadership of traditional powers such as the US, UK and the European Union.",
      "But analysts are also questioning how united the bloc really is and whether a perceived lack of unity constitutes an obstacle to the bloc’s expansion.",
      "Brics is undoubtedly diverse.",
      "Iran and Saudi Arabia compete as regional powers in the Middle East, Egypt and Ethiopia have had different conflicts around the Nile’s governance, and the skirmishes between China and India are well known.",
      "Yet, the bloc’s strength may reside in its capacity to integrate this diverse array of countries that are not fully aligned.",
      "Building loose international organisations might be the key to navigating international politics in these times of increasing polarisation.",
      "The rise of Brics must be contextualised within the ongoing competition between the US and China.",
      "The rivalry between the world’s two largest economies is likely to intensify in the coming years, shaping the contemporary global order.",
      "China’s announcement of a record US$1 trillion (£804 billion) trade surplus for 2024 and its solid 5% economic growth have bolstered the narrative that its development model represents an alternative to the US-sponsored neoliberal policies that have dominated much of the world in the past four decades.",
      "Political leaders and economic elites worldwide are closely observing the US-China competition – and most countries strive to maintain an equidistant approach.",
      "Countries traditionally within the US sphere of influence, including Brazil and Peru, have been cautiously moving towards China, attracted by the economic opportunities the Asian giant offers.",
      "Others previously in China’s orbit, like Vietnam, are working to maintain or expand their ties with the US.",
      "China is unquestionably the driving force that holds Brics together.",
      "Without China, it wouldn’t have come into existence.",
      "All Brics countries share two key characteristics.",
      "They are global south countries that do not belong to the traditional group of hegemonic powers.",
      "And they have significant economic ties with China, especially through trade relations.",
      "The official Brics narrative emphasises multilateralism, cooperation and fair global development.",
      "But in fact the group serves primarily as an instrument for China to project its power and influence.",
      "China achieves this through a combination of rhetoric and by using the bloc as a special trade platform linked to the “Belt and Road Initiative” (BRI).",
      "Brics seeks to position itself as an alternative to US hegemony, promoting free trade and multilateralism.",
      "In times of political turbulence and the growth of illiberal forces, this narrative serves as a powerful legitimising tool for the group globally.",
      "But the group’s diversity also poses significant challenges to its rise as an alternative to the US-led global order.",
      "It is unlikely that Brics will evolve into a unified military alliance like Nato or a free trade area like Asean or the United States-Mexico-Canada Agreement (USMCA – formerly Nafta).",
      "The group’s diversity prevents it from acquiring these characteristics.",
      "Aware of this, China strategically uses Brics to increase its business opportunities and international influence.",
      "It maintains a fine balance between a loose bloc and a more solidified military or economic alliance.",
      "Contrary to the Cold War era, when the two superpowers, the US and the Soviet Union, had well-defined spheres of influence, the current world order appears to be shaped by loose, interconnected international blocs.",
      "China’s prominence within Brics is clear and unlikely to change.",
      "It accounts for two-thirds of both the group’s GDP and intra-Brics trade.",
      "The country is the primary trade partner for Brazil, Russia, India, South Africa, Egypt, Ethiopia, the UAE, Saudi Arabia and Iran.",
      "China also holds significant investments in these nations.",
      "Russia is the largest recipient of Chinese foreign direct investment within the Brics with an accumulated stock of more than USU$10 billion.",
      "Most Brics member states are also directly or indirectly involved in BRI.",
      "While the major BRI projects may not be located within Brics countries – they are primarily in central, south and southeast Asia – Egypt, Ethiopia, South Africa, Saudi Arabia and Iran also host BRI initiatives.",
      "Though not an official BRI member, Brazil has become a key partner due to its role as a central food supplier to China.",
      "These figures highlight that expanding Brics is one of China’s foreign policy priorities.",
      "The country uses the group to project both economic and ideological influence.",
      "Donald Trump’s plans to impose trade tariffs on several countries, including China, is likely to prompt China to intensify this policy.",
      "It is a distinct possibility that the recent episode with Colombia, where the US president reportedly threatened to impose tariffs if Colombia continued to push back against deportation flights, could encourage more countries to seek closer trading relationships with China.",
      "Some analysts correctly claim that Brics is divided between anti-western states and those that prefer to remain nonaligned.",
      "While the anti-western group, led by Russia, advocates for a confrontational stance towards the US, the nonaligned countries – including India and Brazil – favour a more nuanced approach.",
      "Analysts argue that the US should try to develop closer relations with non-aligned countries to influence internal Brics debates.",
      "But this overlooks the fact that China is not only the de-facto leader of Brics but also has an unequivocal strategy of favouring a nuanced approach towards the west, based on multilateralism and free trade.",
      "So, despite what Russia may want, it’s unlikely that Brics will assume a confrontational stance towards the west.",
      "China knows that a non-confrontational approach is the best way to attract more countries and solidify the Brics as a loose bloc that advocates for more democratic global governance.",
      "So far, this strategy appears to be working.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "saudi arabia",
      "egypt ethiopia",
      "free trade",
      "within brics",
      "university nottingham",
      "brazil russia",
      "russia india",
      "us china",
      "global order"
    ]
  },
  {
    "title": "Trump threatens BRICS nations with 100pc tariffs",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/north-america/trump-hails-productive-steak-playlist-dinner-with-trudeau-20241201-p5kuux",
    "publishedAt": "2024-11-30T22:04:30Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Washington | Donald Trump on Saturday (Sunday AEDT) demanded that the BRICS nations commit to not creating a new currency or back any other currency to replace the US dollar, threatening to impose 100 per cent tariffs on their imports if they do not comply.",
      "“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or they will face 100 per cent tariffs, and should expect to say goodbye to selling into the wonderful US economy,” Trump wrote on Truth Social.",
      "Bloomberg and Washington Post Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "Donald Trump picks fierce FBI critic Kash Patel as his nominee to lead it",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/politics/federal/russia-launches-air-strikes-as-syrian-rebels-sweep-into-aleppo-20241201-p5kuu0",
    "publishedAt": "2024-11-30T20:14:09Z",
    "sentences": [
      "Copy link Copied Copy link Copied That’s a wrap Trump picks FBI critic as his nominee to lead it Trump threatens 100pc tariffs on BRICs if they undermine the US dollar Elon Musk has an agenda: Albanese Irish PM under pressure after early election call backfires ‘Assad looking more vulnerable than ever’ as military bases fall to rebels Andrew Hobbs Copy link Copied Copy link Copied That’s the end of our live blog coverage for Sunday, December 1.",
      "Many thanks for following along.",
      "Here’s a recap of the main events: Elon Musk has an agenda: Albanese Prime Minister Anthony Albanese said Elon Musk is entitled to his opinion on the government’s social media ban for those under 16, but it is an opinion informed by his ownership of X.",
      "Hate speech disqualified former Israeli minister from getting a visa: Burke Comments from former Israeli justice minister Ayelet Shaked disqualified her from getting a visa to undertake a speaking tour in Australia, Home Affairs Minister Tony Burke said.",
      "Trump threatens 100pc tariffs on BRICs if they undermine the US dollar Donald Trump threatened 100 per cent tariffs against a bloc of nine nations if they act to undermine the US dollar.",
      "Trump picks FBI critic as his nominee to lead it Donald Trump on Saturday said he wanted former National Security official and firebrand loyalist Kash Patel to lead the FBI, signalling an intent to drive out the bureau’s current director, Christopher Wray.",
      "Trudeau returns from Mar-a-Lago with no assurance on tariffs Canadian Prime Minister Justin Trudeau returned home on Saturday after his meeting with Donald Trump without assurances the president-elect will back away from threatened tariffs on all products from the major American trading partner.",
      "Trump called the talks “productive” but signalled no retreat from a pledge that Canada says unfairly lumps it in with Mexico over the flow of drugs and migrants into the United States.",
      "Russia launches airstrikes as Syrian rebels sweep into Aleppo The Syrian army said on Saturday dozens of its soldiers had been killed in a major attack led by Islamist Hayat Tahrir al-Sham rebels who swept into the city of Aleppo, forcing the army to redeploy in the biggest challenge to President Bashar al-Assad in years.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "undermine us",
      "us dollar",
      "elon musk",
      "donald trump",
      "copied copy",
      "trump picks",
      "picks fbi",
      "fbi critic"
    ]
  },
  {
    "title": "Brics+ countries are determined to trade in their own currencies - but can it work?",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/brics-countries-are-determined-to-trade-in-their-own-currencies-but-can-it-work-243053",
    "publishedAt": "2024-11-24T13:00:00Z",
    "sentences": [
      "Associate Professor, China Studies Centre, University of Sydney Lauren Johnston does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Sydney provides funding as a member of The Conversation AU.",
      "View all partners Brics+ countries are exploring how they can foster greater use of local currencies in their trade, instead of relying on a handful of major currencies, primarily the US dollar and the euro.",
      "The forum for cooperation among nine leading emerging economies – Brazil, China, Egypt, Ethiopia, India, Iran, Russian Federation, South Africa, United Arab Emirates – emphasised this determination at their 16th summit in October 2024.",
      "Economist Lauren Johnston recently wrote a paper on this development.",
      "The Conversation Africa asked her for her insights.",
      "There are economic and political reasons to use local currencies.",
      "Using local currencies to trade among themselves will lower the transaction costs and reduce these countries’ dependence on foreign currencies.",
      "Over the past few centuries, the world’s economy has developed in a way that makes certain currencies more valuable and widely trusted for international trade.",
      "These include the US dollar, the euro, the Japanese yen and the British pound.",
      "These currencies hold value around the world because they come from countries with strong economies and a long history of trading globally.",
      "Read more: Foreign exchange: several African countries have a shortage of US dollars – why this happens and how to fix it When people or countries trade using these currencies and end up collecting or holding them, they consider it “safe” because the value of these currencies remains stable and they can be easily used or exchanged anywhere in the world.",
      "But for countries in the global south, like Ethiopia, whose currency (the birr) isn’t widely accepted outside its borders, trading is far more difficult.",
      "Yet these countries struggle to earn enough of the major currencies through exports to buy what they need on international markets and to repay their debts (which tend to be in those currencies).",
      "In turn, the necessity of trading in major currencies, or the inability to trade in them, can create challenges that slow down economic growth and development.",
      "Therefore, even some trade in local currencies between Brics+ members will support growth and development.",
      "Oil exporter Russia is a unique case.",
      "Though there are fewer foreign currency constraints overall, Russia faces extensive financial sanctions for its war of aggression against Ukraine.",
      "Using a variety of currencies in its foreign transactions may make it easier to get around these sanctions.",
      "Politically, the reasons for using other currencies primarily relates to freedom from sanctions.",
      "One of the tools for making sanctions work is an international payments systems known as Swift (Society for Worldwide Interbank Financial Telecommunication).",
      "Swift was founded in 1973 and is based in Belgium.",
      "It enables secure and standardised communication between financial institutions for international payments and transactions.",
      "And it’s almost the only way to do this.",
      "It was first used to impose financial sanctions on Iran in 2012, and has since been used to impose sanctions on Russia and North Korea.",
      "If a country is cut off from Swift, it faces disruptions in international trade and financial transactions, as banks struggle to process payments.",
      "This can lead to economic isolation and challenges in accessing global markets.",
      "The reality, and possibility, of exclusion from Swift’s payments system is one of the factors galvanising momentum towards a new payments system that also relies less on the currencies of the countries that govern Swift – like the euro, Japanese yen, British pound and US dollar.",
      "The Brics+ plan to use local currencies faces some hurdles.",
      "The central problem is the lack of demand for most currencies internationally.",
      "And it’s hard to supplant the international role of existing major currencies.",
      "If, for example, India accumulates Ethiopian birr, it can mainly only use them in trade with Ethiopia, and nowhere else.",
      "Or, if Russia allows India to buy oil in rupees, what will it do with those rupees?",
      "Since most countries seeking alternatives to dollar dependence tend to sell more than they buy from other countries, or are lower-income importers, they must consider what currencies to accumulate via trade.",
      "When it comes to payment systems, at least, alternatives are emerging.",
      "Brics+ is creating its own, Brics+ Clear.",
      "Some 160 countries have signed up to using the system.",
      "China also has its own, Cross-border Inter-bank Payment System, which broadly works the same way as Swift.",
      "There’s a risk, though, that these payment methods could merely fragment the system and make it even more costly and less efficient.",
      "Not all trade is done in major western currencies.",
      "For example, in southern Africa, within the Southern African Customs Union, the South African rand plays a relatively important role in cross-border trade and finance.",
      "Just as in south-east Asia the currencies of Singapore and Thailand compete to be the dominant currency in the sub-region.",
      "China – the world’s biggest exporter and producer of industrialised goods – is also signing bilateral currency swap agreements with countries.",
      "The goal is greater use of the renminbi in the world.",
      "As a means of circumventing sanctions, India and Russia recently trialled using the rupee to trade.",
      "Russia’s oil exports to and through India have risen strongly since the Ukraine war and some 90% of that bilateral trade takes place in the rupee and rouble.",
      "This leaves Russia with a challenge – what to do with all the rupees it has accumulated.",
      "These deposits are sitting in Indian banks and being invested in local shares and other assets.",
      "Another example of efforts to side-step major international currencies is China’s model of “barter trade”.",
      "The model works like this: China exports, for instance, agricultural machinery to an African country and receives payment in that country’s currency.",
      "China then uses that currency to buy goods from the same country, which are then imported back to China.",
      "After these goods are sold in China, the Chinese trader is paid in renminbi.",
      "Ghana is one country involved in this barter model.",
      "Challenges facing the model include the digitisation of payments and trade, and trust – high levels are needed to establish and maintain relationships between trading parties as individuals and as businesses.",
      "It also requires some level of centralisation and coordination, but lacks strong laws, regulations and industry standards.",
      "This means that different platforms and enterprises may not be compatible, which can add to transaction time and costs.",
      "Another example is when Chinese investors in Ethiopia make profits in birr.",
      "They use these birr to buy Ethiopian goods, like coffee, and export the goods to China.",
      "In China, when they sell these goods, they receive renminbi.",
      "So they transfer their profits from Ethiopia to China by increasing Ethiopia’s exports to China.",
      "Anecdotal reports suggest this is feasible at a small scale but has relatively high coordination costs.",
      "There could be other challenges.",
      "For example, if Chinese buyers pay Ethiopian coffee farmers in their local currency, instead of US dollars, it could lead to fewer dollars being available overall.",
      "Some international transactions still rely heavily on dollars.",
      "There is no simple, or easily scalable, solution to moving past the reliance on major international currencies or circumventing Swift.",
      "A fast, digital payment system is needed.",
      "This system would calculate and balance currency demand efficiently.",
      "It must also be reliable, replace parts of the current system, and not create extra costs for countries that aren’t using it yet.",
      "Although some Brics+ members, like Russia, may have more interest in fast-tracking change, this may be less in the interest of other Brics+ members.",
      "A move away from Swift, for instance, requires buy-in from local financial institutions, and those in African countries may not be under pressure to shift to a new lesser-known platform.",
      "Given these challenges, I argue that Brics+ should progress incrementally.",
      "What can happen soon, though, is to conduct some trade in local currency.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "local currencies",
      "major currencies",
      "use local",
      "us dollar",
      "university sydney",
      "lauren johnston",
      "greater use",
      "currencies trade",
      "currencies primarily",
      "dollar euro"
    ]
  },
  {
    "title": "O Brics+ poderia moldar uma nova ordem mundial, mas carece de valores comuns e de uma identidade unificada",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/o-brics-poderia-moldar-uma-nova-ordem-mundial-mas-carece-de-valores-comuns-e-de-uma-identidade-unificada-242447",
    "publishedAt": "2024-11-03T13:00:00Z",
    "sentences": [
      "Professor of International and Diplomacy Studies, Thabo Mbeki African School of Public and International Affairs, University of South Africa Anthoni van Nieuwkerk does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of South Africa provides funding as a partner of The Conversation AFRICA.",
      "View all partners As duas últimas cúpulas dos países do Brics levantaram questões sobre a identidade e o objetivo da coalizão.",
      "Isso começou a ficar evidente na cúpula organizada pela África do Sul em 2023 e, de forma mais aguda, na recente cúpula de 2024 em Kazan, na Rússia.",
      "Em ambos os eventos, a aliança se comprometeu a ampliar sua base de membros.",
      "Em 2023, os cinco primeiros membros do Brics (Brasil, Rússia, Índia, China e África do Sul) convidaram o Irã, o Egito, a Etiópia, a Arábia Saudita e os Emirados Árabes Unidos a se associarem.",
      "Todos, exceto a Arábia Saudita, já o fizeram.",
      "A cúpula de 2024 comprometeu-se a admitir mais 13 países, talvez como associados ou “países parceiros”.",
      "No papel, o Brics+, formado por nove membros, tem uma postura poderosa.",
      "Eles têm uma população combinada de cerca de 3,5 bilhões, ou 45% da população mundial.",
      "Juntas, suas economias valem mais de US$ 28,5 trilhões - cerca de 28% da economia global.",
      "Com o Irã, a Arábia Saudita e os Emirados Árabes Unidos como membros, o Brics+ produz cerca de 44% do petróleo bruto do mundo.",
      "Com base em minha pesquisa e na assessoria política aos tomadores de decisão da política externa africana, eu diria que há três interpretações possíveis do propósito do Brics+.",
      "Um clube de membros com interesses próprios - uma espécie de cooperativa do sul global.",
      "O que eu rotularia como uma organização de autoajuda.",
      "Um bloco reformador com um objetivo mais ambicioso de melhorar o funcionamento da atual ordem global.",
      "Um agente desestabilizador, preparando-se para substituir a ordem mundial liberal dominada pelo Ocidente.",
      "Analisando os compromissos assumidos na reunião na Rússia, eu diria que o Brics+ se vê mais como um reformador interessado em si mesmo.",
      "Ele representa o pensamento entre os líderes do sul global sobre a natureza da ordem global e as possibilidades de moldar uma nova ordem.",
      "Isso porque o mundo está se afastando da ordem ocidental financeiramente dominante, mas em declínio (em termos de influência moral), liderada pelos EUA.",
      "A mudança é para uma ordem multipolar na qual o leste desempenha um papel de liderança.",
      "Entretanto, a capacidade do Brics+ de explorar essas possibilidades é limitada por sua composição e inconsistências internas.",
      "Isso inclui uma identidade contestada, valores incongruentes e falta de recursos para converter compromissos políticos em planos acionáveis.",
      "A tendência de estreitar a cooperação e a coordenação comercial e financeira foi uma das principais conquistas da cúpula de Kazan.",
      "Outras conquistas dizem respeito à governança global e ao combate ao terrorismo.",
      "No que diz respeito ao comércio e às finanças, o comunicado final afirma que o seguinte foi acordado: adoção de moedas locais em transações comerciais e financeiras; a Declaração de Kazan observa os benefícios de instrumentos de pagamento transfronteiriços mais rápidos, de baixo custo, mais eficientes, transparentes, seguros e inclusivos.",
      "O princípio orientador seria o de barreiras comerciais mínimas e acesso não discriminatório.",
      "estabelecimento de um sistema de pagamento transfronteiriço.",
      "A declaração incentiva a criação de redes de correspondentes bancários dentro do Brics e permite liquidações em moedas locais, de acordo com a Iniciativa de Pagamentos Transfronteiriços do Brics.",
      "Tal sistema é voluntário e não vinculativo, devendo ser discutido posteriormente.",
      "Criação de funções aprimoradas para o Novo Banco de Desenvolvimento, como a promoção de infraestrutura e desenvolvimento sustentável.",
      "Proposta de uma Bolsa de Grãos do Brics para melhorar a segurança alimentar por meio do aumento do comércio de commodities agrícolas.",
      "Todos os nove países do Brics+ se comprometeram com os princípios da Carta da ONU, principalmente em resposta às sanções unilaterais do Ocidente, tais como paz e segurança, direitos humanos, Estado de Direito e desenvolvimento.",
      "A cúpula enfatizou que o diálogo e a diplomacia devem prevalecer sobre o conflito em lugares como Oriente Médio, Sudão, Haiti e Afeganistão.",
      "Apesar do tom positivo da declaração de Kazan, há sérias falhas estruturais e tensões inerentes à arquitetura e ao comportamento do Brics+.",
      "Isso pode limitar suas ambições de se tornar um agente de mudança significativo.",
      "Os membros não concordam nem mesmo com a definição do próprio Brics+.",
      "O presidente Cyril Ramaphosa, da África do Sul, por exemplo, o chama de plataforma.",
      "Outros o chamam de grupo (o presidente da Rússia, Vladimir Putin, e o primeiro-ministro da Índia, Narendra Modi) ou de família (segundo o porta-voz do Ministério das Relações Exteriores da China, Lin Jianan).",
      "O Brics+ é orientado pelo Estado, deixando a sociedade civil à margem.",
      "Ele lembra a União Africana, que fala sobre o envolvimento dos cidadãos na tomada de decisões, mas não o coloca em prática.",
      "Uma possibilidade é que ele evolua para uma organização intergovernamental com uma constituição que estabeleça suas agências, funções e propósitos.",
      "Entre os exemplos estão a Organização Mundial da Saúde, o Banco Africano de Desenvolvimento e a Assembleia Geral da ONU.",
      "No entanto, ela precisaria se unir em torno de valores compartilhados.",
      "Quais seriam esses valores?",
      "Os críticos apontam que o Brics+ é composto por democracias (África do Sul, Brasil e Índia), uma teocracia (Irã), monarquias (Emirados Árabes Unidos e Arábia Saudita) e ditaduras autoritárias (China e Rússia).",
      "Para a África do Sul, isso cria um problema interno.",
      "Na cúpula de Kazan, seu presidente declarou a Rússia como amiga e aliada.",
      "No entanto, seu parceiro de coalizão no governo de unidade nacional, a Aliança Democrática, declarou a Ucrânia como amiga e aliada.",
      "Também há diferenças marcantes em questões como a reforma das Nações Unidas.",
      "Na recente Cúpula do Futuro da ONU, por exemplo, houve consenso a favor da reforma do conselho de segurança da ONU.",
      "No entanto, resta saber se a China e a Rússia, como membros permanentes do conselho, concordarão com mais assentos com direito a veto.",
      "Read more: Análise: A crise da ONU e do sistema multilateral; Brasil não deve tomar partido na disputa entre EUA e China Quanto a conflitos violentos, crises humanitárias, corrupção e crime, há pouco na cúpula de Kazan que sugira um acordo em torno de ações.",
      "E quanto aos interesses compartilhados?",
      "Vários membros do Brics+ e os países parceiros mantêm laços comerciais estreitos com o Ocidente, que considera a Rússia e o Irã como inimigos e a China como uma ameaça global.",
      "Alguns, como a Índia e a África do Sul, usam noções de política externa, como ambiguidade estratégica ou não alinhamento ativo para mascarar a realidade do comércio com o leste, o oeste, o norte e o sul.",
      "A dura verdade das relações internacionais é que não existem amigos ou inimigos permanentes, apenas interesses permanentes.",
      "A aliança Brics+ provavelmente se unirá como uma cooperativa do sul global, com uma agenda inovadora de autoajuda, mas relutará em derrubar a ordem global atual, da qual deseja se beneficiar de forma mais equitativa.",
      "Pode ser necessário fazer concessões e compromissos para garantir a “unidade de propósito”.",
      "Não está claro se essa aliança flexível está próxima de conseguir isso.",
      "This article was originally published in English This article was originally published in English Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "áfrica sul",
      "cúpula de",
      "de kazan",
      "da onu",
      "arábia saudita",
      "na cúpula",
      "china e",
      "saudita e",
      "e os",
      "emirados árabes"
    ]
  },
  {
    "title": "Brics+ could shape a new world order, but it lacks shared values and a unified identity",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/brics-could-shape-a-new-world-order-but-it-lacks-shared-values-and-a-unified-identity-242308",
    "publishedAt": "2024-10-28T13:00:00Z",
    "sentences": [
      "Professor of International and Diplomacy Studies, Thabo Mbeki African School of Public and International Affairs, University of South Africa Anthoni van Nieuwkerk does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of South Africa provides funding as a partner of The Conversation AFRICA.",
      "View all partners The last two summits of Brics countries have raised questions about the coalition’s identity and purpose.",
      "This began to come into focus at the summit hosted by South Africa in 2023, and more acutely at the recent 2024 summit in Kazan, Russia.",
      "At both events the alliance undertook to expand its membership.",
      "In 2023, the first five Brics members – Brazil, Russia, India, China and South Africa – invited Iran, Egypt, Ethiopia, Saudi Arabia and the United Arab Emirates to join.",
      "All bar Saudi Arabia have now done so.",
      "The 2024 summit pledged to admit 13 more, perhaps as associates or “partner countries”.",
      "On paper, the nine-member Brics+ strikes a powerful pose.",
      "It has a combined population of about 3.5 billion, or 45% of the world’s people.",
      "Combined, its economies are worth more than US$28.5 trillion – about 28% of the global economy.",
      "With Iran, Saudi Arabia and the UAE as members, Brics+ produces about 44% of the world’s crude oil.",
      "Based on my research and policy advice to African foreign policy decision-makers, I would argue that there are three possible interpretations of the purpose of Brics+.",
      "A club of self-interested members – a kind of global south cooperative.",
      "What I’d label as a self-help organisation.",
      "A reforming bloc with a more ambitious goal of improving the workings of the current global order.",
      "A disrupter, preparing to replace the western-dominated liberal world order.",
      "Analysing the commitments that were made at the meeting in Russia, I would argue that Brics+ sees itself more as a self-interested reformer.",
      "It represents the thinking among global south leaders about the nature of global order, and the possibilities of shaping a new order.",
      "This, as the world moves away from the financially dominant, yet declining western order (in terms of moral influence) led by the US.",
      "The move is to a multipolar order in which the east plays a leading role.",
      "Read more: Russia's Brics summit shows determination for a new world order – but internal rifts will buy the west some time However, the ability of Brics+ to exploit such possibilities is constrained by its make-up and internal inconsistencies.",
      "These include a contested identity, incongruous values and lack of resources to convert political commitments into actionable plans.",
      "The trend towards closer trade and financial cooperation and coordination stands out as a major achievement of the Kazan summit.",
      "Other achievements pertain to global governance and counter-terrorism.",
      "When it comes to trade and finance, the final communiqué said the following had been agreed: adoption of local currencies in trade and financial transactions.",
      "The Kazan Declaration notes the benefits of faster, low cost, more efficient, transparent, safe and inclusive cross-border payment instruments.",
      "The guiding principle would be minimal trade barriers and non-discriminatory access.",
      "establishment of a cross-border payment system.",
      "The declaration encourages correspondent banking networks within Brics, and enabling settlements in local currencies in line with the Brics Cross-Border Payments Initiative.",
      "This is voluntary and nonbinding and is to be discussed further.",
      "creation of an enhanced roles for the New Development Bank, such as promoting infrastructure and sustainable development.",
      "a proposed Brics Grain Exchange, to improve food security through enhanced trade in agricultural commodities.",
      "All nine Brics+ countries committed themselves to the principles of the UN Charter – peace and security, human rights, the rule of law, and development – primarily as a response to the western unilateral sanctions.",
      "Read more: South Africa walks a tightrope of international alliances - it needs Russia, China and the west The summit emphasised that dialogue and diplomacy should prevail over conflict in, among other places, the Middle East, Sudan, Haiti and Afghanistan.",
      "Despite the positive tone of the Kazan declaration, there are serious structural fault lines and tensions inherent in the architecture and behaviour of Brics+.",
      "These might limit its ambitions to be a meaningful change agent.",
      "The members don’t even agree on the definition of Brics+.",
      "President Cyril Ramaphosa of South Africa calls it a platform.",
      "Others talk of a group (Russia’s President Vladimir Putin, India’s Prime Minister Narendra Modi) or a family (Chinese foreign ministry spokesperson Lin Jianan).",
      "So what could it be?",
      "Brics+ is state-driven – with civil society on the margins.",
      "It reminds one of the African Union, which pays lip service to citizens’ engagement in decision-making.",
      "One possibility is that it will evolve into an intergovernmental organisation with a constitution that sets up its agencies, functions and purposes.",
      "Examples include the World Health Organization, the African Development Bank and the UN general assembly.",
      "But it would need to cohere around shared values.",
      "What would they be?",
      "Critics point out that Brics+ consists of democracies (South Africa, Brazil, India), a theocracy (Iran), monarchies (UAE, Saudi Arabia) and authoritarian dictatorships (China, Russia).",
      "For South Africa this creates a domestic headache.",
      "At the Kazan summit, its president declared Russia a friend and ally.",
      "At home, its coalition partner in the government of national unity, the Democratic Alliance, declared Ukraine as a friend and ally.",
      "Read more: When two elephants fight: how the global south uses non-alignment to avoid great power rivalries There are also marked differences over issues such as the reform of the United Nations.",
      "For example, at the recent UN Summit of the Future the consensus was for reform of the UN security council.",
      "But will China and Russia, as permanent security council members, agree to more seats, with veto rights, on the council?",
      "As for violent conflict, humanitarian crises, corruption and crime, there is little from the Kazan summit that suggests agreement around action.",
      "What about shared interests?",
      "A number of Brics+ members and the partner countries maintain close trade ties with the west, which regards Russia and Iran as enemies and China as a global threat.",
      "Some, such as India and South Africa, use the foreign policy notions of strategic ambiguity or active non-alignment to mask the reality of trading with east, west, north and south.",
      "The harsh truth of international relations is there are no permanent friends or enemies, only permanent interests.",
      "The Brics+ alliance will most likely cohere as a global south co-operative, with an innovative self-help agenda, but be reluctant to overturn the current global order from which it desires to benefit more equitably.",
      "Trade-offs and compromises might be necessary to ensure “unity of purpose”.",
      "It’s not clear that this loose alliance is close to being able to achieve that.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "saudi arabia",
      "global south",
      "global order",
      "kazan summit",
      "university south",
      "2024 summit",
      "partner countries",
      "foreign policy",
      "would argue"
    ]
  },
  {
    "title": "Putin’s big push for new world order ends with a whimper",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/europe/putin-s-big-push-for-new-world-order-ends-with-a-whimper-20241025-p5klf8",
    "publishedAt": "2024-10-25T05:35:02Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Kazan | Russian President Vladimir Putin cut a confident figure as he took the stage on Thursday (Friday AEDT) to give a closing news conference with hundreds of members of the foreign press – a rare event since his invasion of Ukraine – to conclude a summit designed to show the world Russia is not a global pariah.",
      "The BRICS summit brought together Brazil, India, China and South Africa, several new members and a host of other nations that Putin says are keen to join.",
      "It was clearly pitched at pushing for an alternative world order – with Russia in a leading role – to counter one dominated by the wealthy Western nations.",
      "Washington Post Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "Russia’s Brics summit shows determination for a new world order - but internal rifts will buy the west some time",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/russias-brics-summit-shows-determination-for-a-new-world-order-but-internal-rifts-will-buy-the-west-some-time-241610",
    "publishedAt": "2024-10-24T13:00:00Z",
    "sentences": [
      "Professor of International Security, University of Birmingham Stefan Wolff is a past recipient of grant funding from the Natural Environment Research Council of the UK, the United States Institute of Peace, the Economic and Social Research Council of the UK, the British Academy, the NATO Science for Peace Programme, the EU Framework Programmes 6 and 7 and Horizon 2020, as well as the EU's Jean Monnet Programme.",
      "He is a Trustee and Honorary Treasurer of the Political Studies Association of the UK and a Senior Research Fellow at the Foreign Policy Centre in London.",
      "University of Birmingham provides funding as a founding partner of The Conversation UK.",
      "View all partners The recent Brics summit in the Russian city of Kazan was less notable for what happened at the meeting than for what happened before, on the margins, or not at all.",
      "Among the notable things that did not happen was another expansion of the organisation.",
      "Since the addition of Egypt, Ethiopia, Iran and the United Arab Emirates (UAE) at the 2023 Brics summit in Johannesburg, which almost doubled the number of member countries from the original five (Brazil, Russia, India, China and South Africa), further enlargement has stalled.",
      "Argentina, which was also invited in 2023, declined to join.",
      "Saudi Arabia, another 2023 invitee, has not acted on the offer to become a member either.",
      "Its de-facto ruler, crown prince Mohammad bin Salman, was among the notable absentees in Kazan.",
      "And Kazakhstan, Russia’s largest neighbour in Central Asia, decided not to join shortly before the summit.",
      "This drew Russia’s ire, resulting in a prompt ban on imports of a range of agricultural products from Kazakhstan in retaliation.",
      "While invitees have declined the opportunity to join Brics, a long list of applicants have not been offered membership.",
      "According to a statement by Russia’s president, Vladimir Putin, at a meeting of senior Brics security officials in September, 34 countries have expressed an interest in closer relations with Brics in some form.",
      "This appears to be a substantial increase in interest in Brics membership compared to a year ago, when South Africa’s foreign minister, Naledi Pandor, listed 23 applicants ahead of the 2023 summit.",
      "But the fact that, since then, only six invitations have been extended – and four accepted – indicates that formal enlargement of the organisation, at least for now, has been stymied by the inability of current members to forge consensus over the next round of expansion and the reluctance on the part of some invitees to be associated with the organisation.",
      "The summit declaration may offer little of substance.",
      "But there were a number of bilateral meetings before and in the margins of the gathering that are more indicative of the direction of Brics.",
      "Perhaps most importantly, India’s prime minister, Narendra Modi, and China’s president, Xi Jinping, held their first face-to-face discussion in five years.",
      "This is a remarkable change from just a few months ago, when tensions between New Delhi and Beijing were intense enough for Modi to cancel his participation in the summit of the Shanghai Cooperation Organisation in Astana, Kazakhstan.",
      "Yet, with a deal now reached over their countries’ longstanding border dispute, the two most populous and, in terms of GDP, economically most powerful members of Brics have an opportunity to rebuild their fraught relations.",
      "A warming of relations between China and India could generate more momentum for Brics to deliver on its ambitious agenda to develop, and ultimately implement, a vision for a new global order.",
      "Implicit in this would be a shift of leadership in Brics from China and Russia to China and India, and with it, potentially a change from an anti-western to a non-western agenda.",
      "This is, of course, something that exercises Putin.",
      "He acknowledged as much when he referred to the global south and global east in his remarks at the summit’s opening meeting.",
      "He also emphasised that it was important “to maintain balance and ensure that the effectiveness of Brics mechanisms is not diminished”.",
      "In his own bilateral meetings before and during the summit, Putin drove home the point that, despite western efforts, Russia was far from isolated on the world stage.",
      "One-to-one meetings with Xi, Modi, South Africa’s president, Cyril Ramaphosa, and the president of the UAE, Mohammed bin Zayed Al Nahyan, gave Putin the chance to push his own vision of Brics as a counterpoint to the US-led west.",
      "This may be a view shared in the global east – Russia, China and Iran, as well as non-Brics members North Korea, Cuba and Venezuela.",
      "But many in the global south – particularly India and Brazil – are unlikely to go all in with this agenda.",
      "They will focus on benefiting from their Brics membership as much as possible while maintaining close ties with the west.",
      "India is the most significant player in Brics when it comes to balancing between east and west.",
      "Nato member Turkey is the equivalent on the outside.",
      "The country’s president, Recep Tayyip Erdoğan, travelled to Kazan and did not shy away from an hour-long meeting with his “dear friend” Putin.",
      "The relationship between Moscow and Ankara is fractious and complex across a wide range of crises from the South Caucasus, to Syria, Libya and Sudan.",
      "Yet, on perhaps the most divisive issue of all, Russian aggression towards Ukraine, Turkey has consistently maintained opened channels of communication with Russia and remains the only Nato power able to do so.",
      "Read more: Turkey attempts to broker power between east and west as it bids to join Brics The fact that there has been relatively little public pressure from official sources in the west on Erdoğan to stop is probably a reflection that such communication channels are still valued in the west.",
      "This, and Nato’s continued cooperation with India, point to a hedging strategy by the west.",
      "India cooperates with the US, Australia and Japan – the so-called Quad group of nations – on security in the Indo-Pacific, and it has maintained political dialogue with Nato since 2019.",
      "Turkey and India may not see eye-to-eye with the west on all issues.",
      "But neither do they with the global east camp inside Brics, and especially not with Russia.",
      "If nothing else, this limits the ability of Brics to forge a coherent agenda, deepen integration and ultimately mount a credible challenge to the existing order.",
      "Relying on India and Turkey to do the west’s bidding in undermining Brics, however, is not a credible long-term strategy.",
      "Brics may have achieved little as an organisation, but the Kazan summit declaration indicates that its key players continue to harbour aspirations for more.",
      "However, as the flailing expansion drive of the organisation indicates, there is also an internal battle in Brics over its future direction.",
      "This, in turn, creates space and time for the west to exercise more positive and constructive influence in the ongoing process of reshaping the international order.",
      "The global east may be beyond redemption, but there is still a massive opportunity to reengage with the global south.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "global east",
      "south africa",
      "global south",
      "university birmingham",
      "research council",
      "council uk",
      "brics summit",
      "among notable",
      "join brics",
      "brics membership"
    ]
  },
  {
    "title": "Turkey attempts to broker power between east and west as it bids to join Brics",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/turkey-attempts-to-broker-power-between-east-and-west-as-it-bids-to-join-brics-238383",
    "publishedAt": "2024-10-20T13:00:00Z",
    "sentences": [
      "Professor of International Relations, Keele University Bulent Gökay does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "View all partners In a significant diplomatic manoeuvre that may have far-reaching implications for the international system of alliances, Turkey has submitted a formal request to join Brics, the group of emerging-market economies, signalling its intent to diversify its partnerships beyond the west.",
      "The Brics grouping, named after Brazil, Russia, India, China, and South Africa, comprises some of the world’s largest economies.",
      "Earlier this year, it welcomed four new members: Iran, the United Arab Emirates, Ethiopia and Egypt.",
      "Although Saudi Arabia has been invited to join, the official process is yet to take place.",
      "Often viewed as an alternative to western-led organisations such as the EU, G7 and Nato, Brics signifies a significant shift in global power dynamics.",
      "Ankara’s decision could be a strategy to strengthen relations with non-western powers as the global economy’s centre continues to shift away from the west, but is also about chasing more trade with Brics members.",
      "Announced ahead of the Brics summit starting on October 22, Turkey’s application has raised questions about the broader implications for its role within Nato.",
      "If accepted, Turkey would be the first Nato member of Brics.",
      "However, this is not to say that Turkey is entirely turning away from the west.",
      "Turkey’s institutional ties with the western world run deep.",
      "At most, this move signals Turkey’s president Recep Tayyip Erdoğan’s intention to increase the government’s flexibility in its foreign relations.",
      "Erdoğan said on September 1 that this move shows Ankara’s aims to cultivate ties with all sides simultaneously to “become a strong, prosperous, prestigious and effective country if it improves its relations with the east and the west simultaneously”.",
      "Turkey’s acceptance into the group could be discussed during the upcoming 16th Brics summit, in Kazan, Russia.",
      "Malaysia, Thailand and Azerbaijan are among other countries expecting to join.",
      "Turkey’s balancing act between east and west is not a recent phenomenon but a continuation of its policies since the end of the cold war, and is in line with its geographical position at the edge of Europe and Asia.",
      "This strategy has been central to Turkey’s intricate, at times conflicting, approach to international relations and remains pertinent in an increasingly complex world.",
      "The shift from a unipolar world – the idea that the world is dominated by one super power – to one with more global powers has led all governments to reassess their foreign policies, and Ankara is no different.",
      "Turkey’s longstanding commitment to Nato makes it highly unlikely that its willingness to join the Brics group signifies a move away from its western allies.",
      "Since 2016, Turkey has strengthened its economic, political, and military ties with Russia and China, and its recent application to the Brics group reflects this trend.",
      "According to some experts in Turkish foreign policy, while this development may raise concerns in western capitals, there is no pressing reason for the west to be alarmed about Turkey making concessions to Russia or acting independently of Nato.",
      "There are two incentives driving Turkey’s application.",
      "According to Sinan Ülgen, director of the Istanbul-based Centre for Economic and Foreign Policy Studies: “The first is Turkey’s aspiration to enhance its strategic autonomy in foreign policy which essentially involves improving ties with non-western powers like Russia and China in a way to balance the relationship with the west.",
      "The second is the accumulated frustrations over the relationship with the west.",
      "For example, the EU has not even been able to decide on the start of negotiations on the updating of the customs union, its trade deal with Turkey that dates back to 1996.” Read more: Bottled up in the Black Sea: Russia is having a dreadful naval war, hindering its great power ambitions Turkey has been keen on joining the Brics group since 2018.",
      "Putin, during a meeting with Turkish foreign minister Hakan Fidan in Moscow in June this year, welcomed Ankara’s interest and promised that Moscow “will support this desire to be together with the countries of this alliance [Brics], to be together, closer, to solve common problems”.",
      "Since the war in Ukraine, Russia has been making extra efforts to gain the support of more countries.",
      "Turkey holds a particular significance in this effort due to its strategic location, and its control of the Black Sea straits, an essential trade route for both Ukraine and Russia.",
      "The Black Sea has played an important part in the Ukraine war, and Turkey has been part of an alliance that has stymied Russia’s attempts to fully control the waters, and allowed Ukraine to continue to use the waters.",
      "The Montreux Convention regulates maritime traffic through the Turkish Straits.",
      "The convention distinguishes between Black Sea and non-Black Sea powers, acknowledging specific advantages for the former, which includes Ukraine and Russia.",
      "In March 2022, Erdoğan indicated that the convention allows Turkey to restrict the passage of naval vessels belonging to warring parties.",
      "Putin may be hoping that with Turkey on board as a Brics ally he may be able to persuade Ankara to give him more leeway.",
      "Currently Russia’s inability to control the Black Sea and cargo ships within it are seriously weakening its ability to constrain Ukraine’s economy.",
      "Turkey anticipates that Brics membership will enhance its geopolitical standing and expand its economic influence, especially in non-western markets.",
      "Most importantly, leveraging its geopolitical position to influence global affairs and pursuing a more balanced and diversified foreign policy.",
      "It is evident that Turkey aims to maintain its connections with the west while also desiring the flexibility to engage with other regions.",
      "It is highly improbable that this would lead to a significant overhaul of Turkey’s ties with western countries.",
      "It may, however, cause concern among fellow Nato members about how much they can rely on Turkey in the future.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "black sea",
      "brics group",
      "foreign policy",
      "ukraine russia",
      "international relations",
      "join brics",
      "year welcomed",
      "away west",
      "west also",
      "brics summit"
    ]
  },
  {
    "title": "East is East, West is West − and Turkey is looking to forge its own BRICS path between the two",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/east-is-east-west-is-west-and-turkey-is-looking-to-forge-its-own-brics-path-between-the-two-238498",
    "publishedAt": "2024-09-11T14:00:00Z",
    "sentences": [
      "Interim Director of the Frederick S. Pardee Center for the Study of the Longer-Range Future, Boston University Jorge Heine is a member of the Party for Democracy, a Chilean political party, and of the Foro Permanente de Politica Exterior, a Chilean think tank.",
      "Boston University provides funding as a founding partner of The Conversation US.",
      "View all partners Turkey tends to march to its own drum in international affairs.",
      "Take the United Nations vote on Dec. 14, 2022, when the body’s General Assembly approved a resolution in favor of a New International Economic Order.",
      "Some 123 member states – largely the countries of Africa, Asia and Latin America – voted in favor; only 50 cast a ballot against.",
      "Turkey was the only abstention – emblematic of the foreign policy of a country that strides the divide between Europe and Asia, East and West, North and South.",
      "Or consider the most recent expansion of the NATO military alliance: Turkey held back its support for the entry of Sweden for nearly two years, much to the chagrin of fellow members.",
      "It was nonetheless a remarkable moment when Turkey formally announced in September 2024 that it was applying to join the BRICS Plus group – the first time a NATO member country has requested membership in a club born in 2006 out of dissatisfaction with Western-dominated global governance mechanisms and that has since expanded from its original lineup of Brazil, Russia, India, China and South Africa.",
      "With NATO being the bulwark of the Western alliance, and BRICS seen as a key challenger to that established order, this is no minor matter – especially in a year in which BRICS is chaired by Russia, currently at war with Ukraine, and at a time when NATO members are scrambling to support Ukraine in whichever way they can.",
      "The move by Ankara, which the United States has by now decided to live with, suggests Turkey is increasingly wary about achieving its foreign policy goals primarily through the West’s institutions.",
      "Turkey’s interest in joining BRICS does not come out of the blue.",
      "As far back as 2018, after being invited to attend that year’s BRICS annual summit meeting, Turkey had been toying with the idea of doing so.",
      "Looking back, it was only a question of time for full membership to happen.",
      "Straddling the European and Asian continents, Turkey has long been attracted to the European Union, the world’s largest single market and a key Western institution, and has made repeated attempts to join the body during the 21-year rule of President Recep Tayyip Erdogan.",
      "Yet, the EU has been adamant that it is not ready to accept it as a full member.",
      "Trade agreements?",
      "Yes.",
      "Military cooperation through NATO?",
      "No problem.",
      "But full membership that grants voting rights in the European Commission, the European Council and the European Parliament?",
      "Nope, not yet.",
      "With a population of over 85 million, Turkey would be the largest country in the EU if it joined – surpassing Germany, with about 84 million – and would thus play a key role in its governance and leadership.",
      "Yet amid a surge of Arab and African migration to Europe – and a concomitant rise in anti-immigrant and anti-Muslim sentiment – European acceptance of a nonwhite, Muslim-majority nation in its midst seems less likely than ever.",
      "As has been apparent in the contrasting reactions to the war in Ukraine and to the one in Gaza, many Europeans have come to define the continent as “white and Christian.” They see Europe as under siege from the rest of what it considers to be an uncivilized world.",
      "This notion has been reinforced by the rise of the far right in recent European elections and is even reflected in some of the rhetoric coming out of senior policymakers in Brussels.",
      "The European Union’s high representative for foreign affairs and security policy, Josep Borrell, for example, said in a 2022 speech to young European diplomats: “Europe is a garden.",
      "We have built a garden, where everything works,” but “most of the rest of the world is a jungle, and the jungle could invade the garden.” It was a comment for which he later apologized.",
      "In addition to facing a cold shoulder from the EU, Turkey also seemingly feels hampered by the broader Western-dominated global order.",
      "The Erdogan government blames the West, and especially the U.S., for holding back the growth of its defense sector, and its industry in general, and for not allowing the country to take the place it deserves in world affairs as a rising middle power.",
      "For example, Turkey’s 2019 acquisition of the Russian S-400 missile defense system led to a prolonged spat with the U.S., which blocked Turkey from acquiring F-35 fighter jets as a result.",
      "And Washington only reluctantly gave the green light to Turkey’s purchase of 40 F-16 fighter jets earlier this year, a transaction that met significant opposition in the U.S. Senate.",
      "Beyond the differences with Western entities of various kinds, Turkey also has grievances about the existing global order.",
      "A particular pet peeve for Erdogan is the composition of the United Nations Security Council and its five veto-wielding permanent members – the U.S., the United Kingdom, France, China and Russia – something he feels does not reflect the geopolitical realities of the 21st century.",
      "To be sure, Turkey has concluded that it will stick with NATO and continue to do much of its foreign trade with Europe, where its main export markets are.",
      "But in the wake of what some refer to as the Asian century, Turkey sees the world as moving in a different direction.",
      "Joining BRICS would thus open new opportunities both on the economic and the diplomatic front.",
      "In fact, such a move would put Turkey in a key position as a diplomatic bridge between East and West, as well as between North and South, with a foot in each of these camps, while also bolstering its position in all.",
      "“Turkey can become a strong, prosperous, prestigious and effective country if it improves its relations with the East and the West simultaneously,” Erdogan said in early September.",
      "“Any method other than this will not benefit Turkey but will harm it.” BRICS has come a long way from the days of its founding in 2006, when many commentators in the Western media dismissed the organization as an entity that talked a good game but didn’t get much done.",
      "It now has its own bank, the New Development Bank, based in Shanghai, with an initial capital allocation of US$50 billion, and whose performance in its first decade of existence has been well evaluated by credit agencies and the press.",
      "BRICS also has a Contingent Reserve Arrangement to provide member states with protection against global liquidity pressures.",
      "From the original four members – Brazil, Russia, India and China – to which South Africa was added in 2010, the group now has nine members.",
      "Egypt, Ethiopia, Iran and the United Arab Emirates joined in 2024, while Saudi Arabia has mulled accepting the invitation it was extended at the BRICS summit held in Johannesburg in August 2023.",
      "Now dubbed “BRICS Plus,” the body represents 46% of the world’s population, 29% of the world’s GDP, 43% of oil production and 25% of global exports.",
      "The BRICS economies clearly complement Turkey’s.",
      "Half of Turkey’s natural gas imports come from Russia, and China’s Belt and Road Initiative aims to connect the world’s fastest-growing region, East Asia, with the world’s biggest single market, Europe, with Turkey positioned as a key distribution hub for the Middle East, Africa and Central Asia.",
      "Finally, and perhaps most importantly, the BRICS group would provide Turkey with a bigger diplomatic platform from which to air its demands and leverage its influence.",
      "This should not be surprising from a country that believes, as many others in the Global South, it has gotten a raw deal from the West and is keen to reform the existing order.",
      "Singaporean diplomat Kishore Mahbubani famously argued that the Asian century started on March 13, 2015 – the day a Conservative government in the U.K. applied to join the Beijing-based Asian Investment and Infrastructure Bank, defying the express wishes of Washington.",
      "Without putting too fine a point on it, one could well argue that a page has been turned in the transition toward a less Western world when the first NATO member, in this case Turkey, applied to join BRICS.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "east west",
      "boston university",
      "united nations",
      "member states",
      "foreign policy",
      "north south",
      "join brics",
      "brics plus",
      "time nato",
      "nato member"
    ]
  },
  {
    "title": "Ukraine peace summit seeks consensus on Russia rebuke",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/europe/zelensky-vows-to-forge-ahead-as-peace-summit-risks-falling-short-20240616-p5jm5k",
    "publishedAt": "2024-06-16T02:59:59Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Buergenstock, Switzerland | Western powers and countries from the rest of the world were scheduled on Sunday to use the second day of a major summit in Switzerland to pursue a consensus on condemning Russia’s invasion of Ukraine and underscoring concerns about the war’s human cost.",
      "A draft of the final summit declaration seen by Reuters refers to Russia’s invasion as a “war” – a label Moscow rejects – and calls for Ukraine’s control over the Zaporizhzhia nuclear plant and its Azov Sea ports to be restored.",
      "Bloomberg and Reuters Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "The fundamental reason China will struggle to dethrone the dollar",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/asia/the-fundamental-reason-china-will-struggle-to-dethrone-the-dollar-20230903-p5e1mn",
    "publishedAt": "2023-09-03T05:15:30Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login The recent BRICS summit is disappearing in the rearview mirror and with it, mercifully, some of the wildly unrealistic discussion of a new currency issued by the grouping’s five emerging market members – aimed at dethroning the dollar.",
      "Policymakers watching challenges to the greenback’s global dominance can return to the more realistic challenge from an existing currency, the Chinese renminbi.",
      "Financial Times Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "Brics: African countries face opportunities and risks in alienating China or the US - an expert weighs in",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/brics-african-countries-face-opportunities-and-risks-in-alienating-china-or-the-us-an-expert-weighs-in-212273",
    "publishedAt": "2023-08-28T14:00:00Z",
    "sentences": [
      "Director, African Centre for the Study of the United States, University of Pretoria Christopher Isike does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Pretoria provides funding as a partner of The Conversation AFRICA.",
      "View all partners The Brics+ grouping is emerging as a possible rival to US dominance of world affairs.",
      "The US and China lie at the heart of this debate.",
      "They are the two biggest trading partners of most African countries and both have strategic interests that they are determined to protect.",
      "The Conversation Africa’s politics editor, Thabo Leshilo, asked international relations expert Christopher Isike to explain.",
      "Altering diplomatic relations between African countries and the US on account of Brics would have its pros and cons for the continent.",
      "Some potential gains from alienating the US would include: Increased autonomy for African countries in their foreign policy decisions.",
      "They might be able to align more closely with their own interests and priorities without the perceived influence of a major global power.",
      "The potential of diversifying partnerships and alliances with other countries or regional blocs that Brics presents.",
      "This could lead to more economic, political and security relationships, reducing reliance on any single nation.",
      "Stronger regional cooperation and integration.",
      "This could unify efforts to address common challenges such as security, infrastructure development and economic growth.",
      "Such regional cooperation offers more fertile ground for the African Continental Free Trade Areato thrive.",
      "However, a strained relationship with the US could also come at a cost.",
      "Some of the losses would include: Reduced trade opportunities, foreign direct investment and economic aid, potentially leading to economic setbacks for the continent.",
      "Beneficiaries of the Africa Growth and Opportunity Act (Agoa), which provides preferential access to the US market, would be hit the hardest.",
      "The US has been accused of militarising the continent to advance its own interests.",
      "But it plays a significant role in supporting peacekeeping efforts and counterterrorism initiatives in various African regions.",
      "Alienation could therefore affect security and stability, leaving a void in terms of resources, expertise, and coordination in these critical areas.",
      "Alienating a major global player like the US could also lead to diplomatic isolation for many African countries on the international stage.",
      "This could weaken their influence in international organisations, negotiations and decision-making processes.",
      "On gains, African countries would be able to diversify their economic and political partnerships by reducing dependence on China.",
      "This could lead to increased engagement with other countries and regions, potentially resulting in a more balanced and varied international relations portfolio.",
      "African countries could also enhance their bargaining power in negotiations.",
      "This could lead to more favourable terms in trade deals, investment agreements and development projects.",
      "Other countries including the US, EU members and Australia might see an opportunity to fill the void.",
      "Some Africans see China’s influence as overly dominant, potentially leading to concerns about sovereignty and autonomy.",
      "Alienating China could be seen as a way to assert national interests and prevent over-reliance on a single foreign partner.",
      "That said, African countries can ill afford to alienate China.",
      "China is a major economic partner for many African countries, providing investments, trade opportunities and infrastructure projects.",
      "Alienating it could lead to economic setbacks, including reduced trade and foreign direct investment.",
      "Second, China is involved in various infrastructure development projects across Africa.",
      "These include roads, railways, ports and energy facilities.",
      "A strained relationship with China might hinder the completion of these projects or slow down future infrastructure development, potentially affecting economic growth and connectivity.",
      "Third, China is a significant player in international diplomacy and geopolitics.",
      "So, alienating it could lead to reduced influence in global forums where China has a presence.",
      "These include the United Nations and various other international organisations.",
      "This might limit African countries’ ability to advance their interests on the global stage.",
      "However, it must be noted these gains and losses from alienating either the US or China are speculative and would depend on a wide range of factors.",
      "For example, the relationship between African countries and both of these superpowers is multifaceted and complex.",
      "Any decision to alienate either of them should involve careful assessment of both the short-term and long-term consequences, and the evolving geopolitical landscape.",
      "The trick is for Africa to articulate its own interests and pursue them consistently.",
      "African countries have diverse foreign policy priorities and alliances.",
      "Their responses to international conflicts can vary widely.",
      "Some might choose to align with major powers like the US, China, the European Union or Russia.",
      "Others might opt for neutrality or noninterference in the conflicts of other regions.",
      "These strands have played out in the voting patterns on the three UN General Assembly votes to condemn Russia’s invasion of Ukraine.",
      "It would help African countries to have a common position on the Ukraine war.",
      "This should be based on its impact on food and energy security in the continent.",
      "They should act consistently in line with that common position.",
      "They could also have a common position on Brics instead of leaving it entirely to South Africa to define an African agenda for Brics.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "african countries",
      "could lead",
      "could also",
      "us china",
      "infrastructure development",
      "common position",
      "university pretoria",
      "christopher isike",
      "conversation africa",
      "international relations"
    ]
  },
  {
    "title": "Six new countries to join BRICS as group seeks to counter G7",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/markets/currencies/six-new-countries-to-join-brics-as-group-seeks-to-counter-g7-20230825-p5dzb6",
    "publishedAt": "2023-08-24T16:17:52Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login BRICS leaders invited top oil exporter Saudi Arabia and five other countries including Iran to join their bloc in a push to expand its global influence.",
      "Saudi Arabia, Argentina, Egypt, Ethiopia, Iran and United Arab Emirates will become full members on January 1, South African President Cyril Ramaphosa said in a joint press conference of the BRICS leaders on Thursday at their annual summit in Johannesburg.",
      "Bloomberg Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "How Russia is fighting for allies among the Brics countries using 'memory diplomacy'",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/how-russia-is-fighting-for-allies-among-the-brics-countries-using-memory-diplomacy-212130",
    "publishedAt": "2023-08-24T14:00:00Z",
    "sentences": [
      "Senior Economist, IMD World Competitiveness Center, International Institute for Management Development (IMD) Jose Caballero does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "View all partners Since the start of the Ukraine war, there have been numerous diplomatic visits by Russian officials to Africa and Latin America aiming at boosting Russia’s global influence.",
      "In 2023 Russian officials visited Angola, Burundi, Eritrea, Eswatini, Kenya, Mali, Mauritania, Mozambique, South Africa and Sudan.",
      "In the same year, Russian foreign minister Sergey Lavrov toured some areas of Latin America visiting Brazil, Venezuela, Nicaragua and Cuba.",
      "The objective was to deepen ties and increase the support for Russia’s war in Ukraine.",
      "As the Ukrainian war goes on, some observers have noted that Russia is trying to gather influential support for its position in the war.",
      "Its claims to be fighting against the west’s power and neo-colonialism appear to have won some supporters.",
      "Ukraine’s attempts to win allies in the same regions by arguing that it is fighting off an empire don’t appear to have resonated so well.",
      "Some observers argue that we are witnessing the “return of the global Russia” through economic and political influence, and through its use of digital disinformation techniques to distribute narratives.",
      "In the 2010s, the expansion of Russia’s influence in Africa was the result of economic “opportunism”, but during the Ukraine war, it has become more strategic.",
      "There is evidence that in some African countries the influence of Russia continues to intensify.",
      "South Africa, for instance, seems to be moving away from the west and steering towards China’s and Russia’s orbit.",
      "But this could partly be because a challenge to the current liberal order is likely to be beneficial for the global south, giving it more power to negotiate in the international arena and achieve some of its policy targets.",
      "This was hinted at the recent Brics conference meeting of senior leaders from Russia, China, Brazil, India and South Africa.",
      "The leaders of these expanding economies are therefore hesitant to fully condemn Russia for its actions in Ukraine.",
      "At the summit, Brazil’s president Lula da Silva said the Ukraine war “showed the limitations of the UN security council”, and pointed to the economic power of the Brics allies as a symbol of its global relevance.",
      "The recent decision to integrate six new countries (including Argentina, Iran and UAE) into the bloc will increase that relevance and could enable its members to influence the current world order.",
      "Two interrelated factors can help us understand Russia’s attractiveness to the global south, and reluctance to fully support Ukraine.",
      "First, Russia frames itself as an “anti-colonial” agent, particularly in Africa.",
      "Such a strategy is based on “memory diplomacy”, aimed at increasing its influence overseas by taking advantage of shared positive memories.",
      "Memory diplomacy, for instance, invokes Russia’s contribution to the victory against fascism during the second world war.",
      "In addition, it points out that Russia has never colonised an African country and that it did not participate in the slave trade.",
      "On the contrary, the argument goes, Russia, as the centre of the Soviet Union, supported different anti-colonial struggles in the region during the cold war, for example, in Angola and Mozambique.",
      "Another factor in understanding Russia’s appeal to the global south is the “legacy” of Moscow’s solidarity with various countries in the past.",
      "Read more: Africa is being courted by China, Russia and the US.",
      "Why the continent shouldn't pick sides In 1927, the Communist International, an international organisation supportive of world communism that was led by the Soviet Union, sponsored the League Against Imperialism.",
      "The league aimed to eliminate colonial rule in the world.",
      "It brought together leading anti-colonial activists from around the world and prominent people such as Albert Einstein and Mahatma Gandhi.",
      "Ultimately, the league became an inspiration for many of the leaders of the global south’s decolonisation struggles.",
      "In this sense, it has left a long-term legacy in the countries where Moscow’s support had an effect on their anti-colonial struggles.",
      "This is evident in the case of South Africa.",
      "Its position towards the war in Ukraine is arguably partly defined by a nostalgia relating to Moscow’s support for its struggle against apartheid combined with a distrust for the west’s policies.",
      "The criticism levelled at the west in the global south by leaders such as Brazil’s Lula is that it upholds democracy at home while being willing to violate democratic principles elsewhere if the advancement of its interests makes it advantageous.",
      "Ukraine has responded to Russia’s diplomatic actions by increasing its embassies in Africa and prioritising the global south as a foreign policy.",
      "But this “battle” front may be more difficult than it seems.",
      "Russia continues to advance narratives, usually via its expertise in the use of digital channels, that strengthen its geopolitical influence.",
      "In addition, for the global south, Russia is perceived as a counterbalance to the west – particularly the US.",
      "And importantly, what can Ukraine offer to the global south?",
      "Ukraine could gather further support from Brics countries by strengthening existing economic ties and pointing out shared problems caused by Russia.",
      "Building the proposed new grain hubs for storing crops, such as wheat and corn, is a good start.",
      "This is particularly important because of Russia’s decision to withdraw permission for Ukrainian ships carrying grain to leave Black Sea ports.",
      "This is likely to cause food shortages across Africa.",
      "The Kenyan government, for instance, denounced Russia’s decision as a “stab in the back” for African countries.",
      "Ukraine could also tap into the similarities of its national struggle and those of the global south’s anti-colonial experiences.",
      "Rather than focusing its narrative against Russia, it could begin to build shared “memories” with the global south by concentrating on the commonalities of victimhood.",
      "What is becoming increasingly clear is that any country that attempts to challenge the image of Russia as an anti-imperialist agent, is in for a long battle.",
      "Particularly, if those countries cannot effectively appeal to their own shared positive memories.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "global south",
      "south africa",
      "ukraine war",
      "russian officials",
      "latin america",
      "war ukraine",
      "use digital",
      "african countries",
      "russia continues",
      "china russia"
    ]
  },
  {
    "title": "Brics expansion: six more nations are set to join - what they’re buying into",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/brics-expansion-six-more-nations-are-set-to-join-what-theyre-buying-into-212200",
    "publishedAt": "2023-08-23T14:00:00Z",
    "sentences": [
      "Associate Professor (International Relations), University of Johannesburg Bhaso Ndzendze does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Johannesburg provides support as an endorsing partner of The Conversation AFRICA.",
      "View all partners One key outcome of the 15th Brics summit, hosted by South Africa, is the decision to invite six more countries to join the group with effect from January 2024.",
      "They are Argentina, Ethiopia, Iran, Saudi Arabia, Egypt and the United Arab Emirates.",
      "All six had applied for membership.",
      "The enlargement will grow the association’s membership to 11, and increase its envisaged role as a geopolitical alternative to global institutions dominated by the west.",
      "The five current member countries – Brazil, Russia, India, China and South Africa – have argued that their size, in economic and population terms, was not represented in the world’s institutions, particularly the World Bank and the International Monetary Fund (IMF).",
      "The Brics five represent about 42% of the world’s population and more than 23% of world GDP.",
      "The enlarged grouping will account for 46.5% of the world population.",
      "Using IMF GDP data, we can deduce that it will account for about 30% of global GDP.",
      "The disparate nature of the six new members is bound to spark debate about the real nature of Brics.",
      "In his welcoming remarks at the summit (22-24 August), the host, South African president Cyril Ramaphosa, stated: Brics stands for solidarity and for progress.",
      "Brics stands for inclusivity and a more just, equitable order.",
      "Brics stands for sustainable development.",
      "The group has been remarkably consistent on these values and aspirations.",
      "One of the first questions about Brics is often “what is it?”.",
      "This is telling.",
      "This question does not come up, for example, about the European Union or even the G20.",
      "Brics is not an organisation (it has no headquarters, secretariat or treaty).",
      "But it does have a formal institution that is jointly owned – the New Development Bank.",
      "Confusion about Brics’ precise nature is understandable.",
      "At various points it has referred to itself as a forum, a platform, a mechanism, a partnership, or a strategic partnership, to name a few.",
      "Others have called it an alliance or a bloc.",
      "It is neither.",
      "Read more: South Africa's role as host of the BRICS summit is fraught with dangers.",
      "A guide to who is in the group, and why it exists In international relations, both terms are strictly defined.",
      "The term “alliance” refers to a mutual defence pact and implies military cooperation.",
      "A “bloc” refers to ideological consistency (political bloc) or a free trade agreement (trade bloc).",
      "Brics has none of these characteristics.",
      "The members also disagree on some key issues.",
      "China and Russia are noncommittal (at best) on the aspirations of India, Brazil and South Africa to become members of the UN Security Council.",
      "Their declarations have over the years reiterated the same phrase: China and Russia understand and support the aspirations of India, Brazil and South Africa to play a greater role in the United Nations.",
      "This shows there is some serious disagreement within the group.",
      "As a political scientist interested in global politics, I have written about Brics and its potential for changing the status quo.",
      "With hindsight, I can assert that certain principles have informed it since its establishment and first summit in 2009.",
      "In my view, at a material level, the 15 years of summit declarations point to four fundamental values: mutual development multilateralism global governance reform solidarity.",
      "The association self-reportedly seeks secure sustainable development for itself and the global south, to safeguard and advance multilateralism, to institute reform for the goal of representative institutions, and to achieve solidarity among members.",
      "Economics comes first in the group; at its root, it is a collective of emerging economies eager to sustain and improve their economic trajectory.",
      "Their insistence on reform is, after all, based on their perceived disproportionate under-representation in global financial institutions.",
      "Read more: China’s Africa strategy is shifting from extraction to investment – driven from the industry-rich Hunan region The group’s first, and so far only, notable establishment is the New Development Bank, primarily to finance infrastructure development.",
      "There’s also a contingent reserve that members can draw from in emergencies.",
      "It is valued at US$100 billion.",
      "The second value refers to the group’s concern about the use of entities outside the UN to pursue global objectives.",
      "Most notable is the use of the North Atlantic Treaty Organisation (Nato) to invade Afghanistan in 2001 following the 9/11 attacks in the US, and the invasion of Iraq in 2003 by the US and the UK, circumventing the UN Security Council.",
      "Russian president Vladimir Putin expressed this concern in his speech to the 2007 Munich Conference on Security: The use of force can only be considered legitimate if the decision is sanctioned by the UN.",
      "And we do not need to substitute NATO or the EU for the UN.",
      "Thirdly, the Brics countries have long pushed for leaders of global institutions to be elected in a transparent and democratic way.",
      "For example, the president of the World Bank has always been an American, and the managing director of the IMF a European.",
      "The World Bank has 189 member states and the IMF 190.",
      "The idea of the New Development Bank was not to substitute the World Bank but to “supplement” existing international financial institutions.",
      "Brics still envisions a World Bank in which its members have voting rights proportional to their economic weight, and with staff drawn from across the world in a geographically balanced way.",
      "Finally, the members have articulated solidarity with one another in a number of declarations, beginning in 2010.",
      "It comes down to mutual assistance in times of humanitarian disasters, respecting one another’s sovereignty and territorial integrity.",
      "Read more: When two elephants fight: how the global south uses non-alignment to avoid great power rivalries In light of criticism and sanctions plans against China, for its alleged suppression of the Uyghur-Muslim population, and Russia, for invading Ukraine, solidarity has come to mean silence or nonalignment.",
      "Brics is a nebulous entity.",
      "This has proved beneficial for member countries hosting Brics summits.",
      "They get to set the agenda and use it for their ends – without upsetting the consensus.",
      "One common pattern has been the use of summits to set overarching themes that are favourable to the host country’s domestic policy and regional leadership or foreign policy stance.",
      "Read more: Africa is being courted by China, Russia and the US.",
      "Why the continent shouldn't pick sides Thus, for example, all Brics summits hosted by South Africa foregrounded Africa in their names: “Brics and Africa: Partnership for mutually accelerated growth, sustainable development and inclusive multilateralism” in 2023.",
      "Brazil and Russia have inserted issues that are important to their region, and often invited leaders of neighbouring countries to retreats.",
      "This shows how much clout they enjoy, as they get to funnel access to a now-renowned association that is simultaneously well established but also evades easy definition.",
      "With the addition of the six new members, such evasiveness is set to only continue.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "world bank",
      "brics stands",
      "sustainable development",
      "new development",
      "development bank",
      "china russia",
      "international relations",
      "university johannesburg",
      "brics summit"
    ]
  },
  {
    "title": "China urges bigger, stronger BRICS to rival G7",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/world/asia/china-urges-bigger-stronger-brics-to-rival-g7-20230821-p5dy23",
    "publishedAt": "2023-08-20T21:52:56Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Johannesburg | London | China will push the BRICS bloc of emerging markets to become a full-scale rival to the G7 this week, as leaders from across the developing world gather to debate the forum’s biggest expansion in more than a decade.",
      "South African President Cyril Ramaphosa has invited more than 60 heads of state and government to a summit in Johannesburg from Wednesday when several countries could be invited to join the bloc of Brazil, Russia, India, China and South Africa, said several officials familiar with talks.",
      "Financial Times Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "As BRICS cooperation accelerates, is it time for the US to develop a BRICS policy?",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/as-brics-cooperation-accelerates-is-it-time-for-the-us-to-develop-a-brics-policy-210021",
    "publishedAt": "2023-08-17T14:00:00Z",
    "sentences": [
      "Senior Fellow, The Fletcher School, Tufts University Adjunct Lecturer in the International Studies Program, Boston College Assistant Professor of Global Studies, Sacred Heart University Mihaela Papa previously received funding for BRICS research from Minerva Research Initiative federal grant.",
      "Frank O'Donnell previously received funding for BRICS research from Minerva Research Initiative federal grant.",
      "Zhen Han previously received funding for BRICS research from Minerva Research Initiative federal grant.",
      "Tufts University provides funding as a founding partner of The Conversation US.",
      "View all partners When leaders of the BRICS group of large emerging economies – Brazil, Russia, India, China and South Africa – meet in Johannesburg for two days beginning on Aug. 22, 2023, foreign policymakers in Washington will no doubt be listening carefully.",
      "The BRICS group has been challenging some key tenets of U.S. global leadership in recent years.",
      "On the diplomatic front, it has undermined the White House’s strategy on Ukraine by countering the Western use of sanctions on Russia.",
      "Economically, it has sought to chip away at U.S. dominance by weakening the dollar’s role as the world’s default currency.",
      "And now the group is looking at expanding, with 23 formal candidates.",
      "Such a move – especially if BRICS accepts Iran, Cuba or Venezuela – would likely strengthen the group’s anti-U.S. positioning.",
      "So what can Washington expect next, and how can it respond?",
      "Our research team at Tufts University has been working on a multiyear Rising Power Alliances project that has analyzed the evolution of BRICS and the group’s relationship with the U.S. What we have found is that the common portrayal of BRICS as a China-dominated group primarily pursuing anti-U.S. agendas is misplaced.",
      "Rather, the BRICS countries connect around common development interests and a quest for a multipolar world order in which no single power dominates.",
      "Yet BRICS consolidation has turned the group into a potent negotiation force that now challenges Washington’s geopolitical and economic goals.",
      "Ignoring BRICS as a major policy force – something the U.S. has been prone to do in the past – is no longer an option.",
      "At the dawn of BRIC cooperation in 2008 – before South Africa joined in 2010, adding an “S” – members were mindful that the group’s existence could lead to tensions with policymakers who viewed the U.S. as the world’s “indispensable nation.” As Brazil’s former Foreign Minister Celso Amorim observed at the time, “We should promote a more democratic world order by ensuring the fullest participation of developing countries in decision-making bodies.” He saw BRIC countries “as a bridge between industrialized and developing countries for sustainable development and a more balanced international economic policy.” While such realignments would certainly dilute U.S. power, BRIC explicitly refrained from anti-U.S. rhetoric.",
      "After the 2009 BRIC summit, the Chinese foreign ministry clarified that BRIC cooperation should not be “directed against a third party.” Indian Foreign Secretary Shivshankar Menon had already confirmed that there would be no America bashing at BRIC and directly rejected China’s and Russia’s efforts to weaken the dollar’s dominance.",
      "Rather, the new entity complemented existing efforts toward multipolarity – including China-Russia cooperation and the India, Brazil, South Africa trilateral dialogue.",
      "Not only was BRIC envisioned as a forum for ideas rather than ideologies, but it also planned to stay open and transparent.",
      "Today, BRICS is a formidable group – it accounts for 41% of the world’s population, 31.5% of global gross domestic product and 16% of global trade.",
      "As such, it has a lot of bargaining power if the countries act together – which they increasingly do.",
      "During the Ukraine war, Moscow’s BRICS partners have ensured Russia’s economic and diplomatic survival in the face of Western attempts to isolate Moscow.",
      "Brazil, India, China and South Africa engaged with Russia in 166 BRICS events in 2022.",
      "And some members became crucial export markets for Russia.",
      "The group’s political development – through which it has continually added new areas of cooperation and extra “bodies” – is impressive, considering the vast differences among its members.",
      "We designed a BRICS convergence index to measure how BRICS states converged around 47 specific policies between 2009 and 2021, ranging from economics and security to sustainable development.",
      "We found deepening convergence and cooperation across these issues and particularly around industrial development and finance.",
      "But BRICS convergence does not necessarily lead to greater tension with the United States.",
      "Our data finds limited divergence between the joint policies of BRICS and that of the U.S. on a wide range of issues.",
      "Our research also counters the argument that BRICS is China-driven.",
      "Indeed, China has been unable to advance some key policy proposals.",
      "For example, since the 2011 BRICS summit, China has sought to establish a BRICS free trade agreement but could not get support from other states.",
      "And despite various trade coordination mechanisms in BRICS, the overall trade among BRICS remains low – only 6% of the countries’ combined trade.",
      "However, tensions between the United States and BRICS exist, especially when BRICS turns “bloc-like” and when U.S. global interests are at stake.",
      "The turning point for this was 2015, when BRICS achieved major institutional growth under Russia’s presidency.",
      "This coincided with Moscow enhancing its pivot to China and BRICS following Western sanctions over Russia’s annexation of Crimea in 2014.",
      "Russia was eager to develop alternatives to Western-led institutional and market mechanisms it could no longer benefit from.",
      "That said, important champions of BRICS convergence are also close strategic partners to the U.S. For example, India has played a major role in strengthening the security dimension of BRICS cooperation, championing a counter-terrorism agenda that has drawn U.S. opposition due to its vague definition of terrorist actors.",
      "Further constraints on U.S. power may emerge from BRICS transitioning to using local currencies over the dollar and encouraging BRICS candidate countries to do the same.",
      "Meanwhile, China and Russia’s efforts to engage BRICS on outer space governance is another trend for policymakers in Washington to watch.",
      "So where does a more robust – and potentially larger – BRICS leave the U.S.?",
      "To date, U.S. policy has largely ignored BRICS as an entity.",
      "The U.S. foreign and defense policymaking apparatus is regionally oriented.",
      "In the past 20 years, it has pivoted from the Middle East to Asia and most recently to the Indo-Pacific region.",
      "When it comes to the BRICS nations, Washington has focused on developing bilateral relations with Brazil, India and South Africa, while managing tensions with China and isolating Russia.",
      "The challenge for the Biden administration is understanding how, as a group, BRICS’ operations and institutions affect U.S. global interests.",
      "Meanwhile, BRICS expansion raises new questions.",
      "When asked about U.S. partners such as Algeria and Egypt wanting to join BRICS, the Biden administration explained that it does not ask partners to choose between the United States and other countries.",
      "But the international demand for joining BRICS calls for a deeper reflection on how Washington pursues foreign policy.",
      "Designing a BRICS-focused foreign policy is an opportunity for the United States to innovate around addressing development needs.",
      "Rather than dividing countries into friendly democracies and others, a BRICS-focused policy can see the Biden administration lead on universal development issues and build development-focused, close relationships that encourage a better alignment between countries of the Global South and the United States.",
      "It could also allow the Biden administration to deepen cooperation with India, Brazil, South Africa and some of the new BRICS candidates.",
      "Areas of focus could include issues where the BRICS countries have struggled to coordinate their policy, such as AI development and governance, energy security and global restrictions on chemical and biological weapons.",
      "Developing a BRICS policy could help re-imagine U.S. foreign policy and ensure that the United States is well positioned in a multipolar world.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "united states",
      "brics group",
      "biden administration",
      "tufts university",
      "previously received",
      "received funding",
      "funding brics",
      "brics research",
      "research minerva"
    ]
  },
  {
    "title": "BRICS creator pans ‘ridiculous’ common currency",
    "source": "The Australian Financial Review",
    "url": "https://www.afr.com/markets/currencies/brics-creator-pans-ridiculous-common-currency-20230815-p5dwsv",
    "publishedAt": "2023-08-15T08:54:06Z",
    "sentences": [
      "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login London/Johannesburg | The former Goldman Sachs economist who coined the BRICS acronym has dismissed as “ridiculous” the notion that the group of emerging nations might develop its own currency, as Brazil, Russia, India, China and South Africa prepare to discuss whether to expand the bloc.",
      "Ahead of the group’s 15th summit next week, Jim O’Neill told the Financial Times the BRICS had “never achieved anything since they first started meeting”, eight years after he created the phrase in a 2001 research note he wrote as the bank’s chief economist.",
      "Financial Times Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.",
      "Already a subscriber?",
      "Login Follow the topics, people and companies that matter to you.",
      "Fetching latest articles"
    ],
    "topics": [
      "copy link",
      "link copied",
      "copied copy",
      "copied subscribe",
      "subscribe gift",
      "gift article",
      "article gift",
      "gift 5",
      "5 articles",
      "articles anyone"
    ]
  },
  {
    "title": "An expanded BRICS could reset world politics but picking new members isn’t straightforward",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/an-expanded-brics-could-reset-world-politics-but-picking-new-members-isnt-straightforward-210507",
    "publishedAt": "2023-08-05T14:00:00Z",
    "sentences": [
      "Associate Professor (International Relations), University of Johannesburg Acting Director: Institute for Pan-African Thought & Conversation, University of Johannesburg Siphamandla Zondi is affiliated with the University of Johannesburg.",
      "Bhaso Ndzendze does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "University of Johannesburg provides support as an endorsing partner of The Conversation AFRICA.",
      "View all partners Eager to escape perceived western domination, several countries – mostly in the global south – are looking to join the Brics bloc.",
      "The five-country bloc (Brazil, Russia, India, China and South Africa) is also looking to grow its global partnerships.",
      "What began in 2001 as an acronym for four of the fastest growing states, BRIC (Brazil, Russia, India and China), is projected to account for 45% of global GDP in purchasing power parity terms by 2030.",
      "It has evolved into a political formation as well.",
      "Crucial to this was these countries’ decision to form their own club in 2009, instead of joining an expanded G7 as envisioned by former Goldman Sachs CEO Jim O’Neill, who coined the term “Bric”.",
      "Internal cohesion on key issues has emerged and continues to be refined, despite challenges.",
      "South Africa joined the group after a Chinese-initiated invitation in 2010; a boost for then president Jacob Zuma’s administration, which was eager to pivot further to the east.",
      "The bloc also gained by having a key African player and regional leader.",
      "Ever since, the grouping has taken on a more pointedly political tone, particularly on the need to reform global institutions, in addition to its original economic raison d’etre.",
      "The possibility of its enlargement has dominated headlines in the run up to its 15th summit in Johannesburg on 22-24 August.",
      "Read more: When two elephants fight: how the global south uses non-alignment to avoid great power rivalries We are political scientists whose research interests include changes to the global order and emerging alternative centres of power.",
      "In our view, it won’t be easy to expand the bloc.",
      "That’s because the group is still focused on harmonising its vision, and the potential new members do not readily make the cut.",
      "Some may even bring destabilising dynamics for the current composition of the formation.",
      "This matters because it tells us that the envisioned change in the global order is likely to be much slower.",
      "Simply put, while some states are opposed to western hegemony, they do not yet agree among themselves on what the new alternative should be.",
      "BRICS’ overtly political character partially draws on a long history of non-alignment as far back as the Bandung Conference of 1955.",
      "It was attended mostly by recently decolonised states and independence movements intent on asserting themselves against Cold War superpowers – the Soviet Union and the United States.",
      "BRICS has come to be viewed as challenging the counter hegemony of the US and its allies, seen as meddling in the internal affairs of other states.",
      "Reuters estimates that more than 40 states are aspiring to join BRICS.",
      "South African diplomat Anil Sooklal says 13 had formally applied by May 2023.",
      "Many, though not all, of the aspiring joiners have this overtly political motivation of countering US hegemony.",
      "The other important incentive is access to funds from the BRICS’ New Development Bank.",
      "This is especially pronounced in the post-COVID climate in which many economies are yet to fully recover.",
      "Of course the two can overlap, as in the case of Iran.",
      "The notable applicants have included Saudi Arabia, Belarus, Ethiopia, Argentina, Algeria, Iran, Mexico, and Turkey.",
      "A strategically expanded BRICS would be seismic for the world order, principally in economic terms.",
      "Key among the club’s reported priorities is reduction of reliance on the US dollar (“de-dollarisation” of the global economy).",
      "One of the hurdles to this is the lack of buy-in by much of the world.",
      "Though some states may disagree with the dollar’s dominance, they still see it as the most reliable.",
      "Given the extent of globalisation, it’s unlikely that there will be attempts to chip away at the west’s access to strategic minerals and trade routes as happened during the Suez Crisis of 1956, at the height of the Cold War.",
      "Instead, the new joiners would likely use their new BRICS membership to better bargain with their western partners, having more options on hand.",
      "Read more: Ethiopia wants to join the BRICS group of nations: an expert unpacks the pros and cons Herein lies the challenge (and the paradox) with BRICS expansion.",
      "On one hand, the grouping is not yet offering anything concrete to justify such drastic measures as de-dollarisation.",
      "On the other, the current five members also need to be selective about who they admit.",
      "Among the considerations must surely be the track record of the applicants as well as their closeness to the west.",
      "The experience of having had a right-wing leader such as former Brazilian president Jair Bolsonaro in its midst must have been a lesson about the need to be circumspect when admitting new members.",
      "In this regard, aspirants such as Saudi Arabia and Mexico seem the least likely to make the cut in the short term.",
      "That’s despite the Saudis’ oil wealth and Mexico’s leftist-progressive leader Andres Manuel Lopez Obrador.",
      "Although they might be currently experiencing rocky relations with Washington, they have proven to be capable of rapprochement following previous disagreements with the US, with which they seem inextricably intertwined.",
      "Saudi Arabia has a long-term military relationship with the US, while Mexico is the US’s number-one trading partner.",
      "Of equal importance in the evaluation of potential new members is the relationship the aspirants have with the existing BRICS members.",
      "This is because another crucial lesson has been the tiff between two of its largest members, China and India, over their disputed border.",
      "As a result of the uneasy relationship between two of its members, the bloc has become alert to the importance of direct bilateral relations and dispute resolution among its constituent leaders.",
      "Among the applicants, Saudi Arabia, which has had a fractious relationship with Moscow in the past, seems to face an uphill climb.",
      "It also has difficult relations with Iran, another applicant, despite their recent rapprochement.",
      "Read more: South Africa's role as host of the BRICS summit is fraught with dangers.",
      "A guide to who is in the group, and why it exists The country which seems the most suitable to join BRICS for ideological reasons, and will expand the bloc’s footing in the Caribbean, is Cuba.",
      "It enjoys strong ties with the existing members.",
      "It also has solid “counter-hegemonic” credentials, having been the bête noire of the US for more than 60 years.",
      "Cuba is also a leader in the Latin American left and enjoys strong ties with many states in Central and South America (particularly with Guatemala, Honduras, Nicaragua and Venezuela).",
      "Membership would boost its influence.",
      "If an expanded BRICS is to be an agent for change on the world scene, it will need to be capable of action.",
      "Having rivals, or states that are at least ambivalent towards each other, seems anathema to that.",
      "Eager to proceed cautiously and expand strategically, the current BRICS states seems likely, at least in the short term, to pursue a BRICS-plus strategy.",
      "In other words, there may emerge different strata of membership, with full membership granted to states that meet the group’s criteria over time.",
      "It is thus not mere expansion, but the character of the expansion which will guide the five principals on whether they grow from that number.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "university johannesburg",
      "join brics",
      "saudi arabia",
      "south africa",
      "new members",
      "global south",
      "brazil russia",
      "russia india",
      "india china",
      "global order"
    ]
  },
  {
    "title": "Ethiopia wants to join the BRICS group of nations: an expert unpacks the pros and cons",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/ethiopia-wants-to-join-the-brics-group-of-nations-an-expert-unpacks-the-pros-and-cons-209141",
    "publishedAt": "2023-07-10T14:00:00Z",
    "sentences": [
      "Professor in Geography, Trinity College Dublin Padraig Carmody previously received funding from National Geographic and the University of Johannesburg to conduct research on related topics.",
      "Trinity College Dublin provides funding as a member of The Conversation UK.",
      "View all partners A few years ago, the BRICS grouping – Brazil, Russia, China, India and South Africa – had lost salience because three of its members were in severe economic difficulty.",
      "Brazil, Russia and South Africa are primarily natural resource exporters and were badly affected by the global commodity price bust of 2014.",
      "Russia’s invasion of Ukraine has now given BRICS a new geopolitical salience as the members and their respective allies respond to events.",
      "Read more: South Africa's role as host of the BRICS summit is fraught with dangers.",
      "A guide to who is in the group, and why it exists In the emerging world order there is also now increased demand to join BRICS, in part as a countervailing power to “the west”.",
      "Argentina, Saudi Arabia and lately, Ethiopia, have expressed strong interest in becoming members.",
      "I have researched the political economy of globalisation in Africa over the last 30 years.",
      "I have specifically examined the scramble for Africa by the US and China, South Africa’s involvement in BRICS, the nature of BRICS engagement with Africa and market and resource access by BRICS in southern Africa.",
      "It would be a major coup for Ethiopia if it were able to join the grouping as it would raise its global profile, allow it to interact and coordinate more closely with some of the major world powers and move the discourse beyond the recent civil war there, potentially enabling it to attract more investment.",
      "Ethiopia has cited its key role in founding the African Union and other institutions, along with its national interest as grounds for seeking BRICS membership.",
      "In my opinion, there are five key reasons why Ethiopia would want to join the grouping.",
      "Deteriorating relations with western powers: Ethiopia has historically depended on substantial western support through aid and security cooperation.",
      "But its relations with the west have soured as a result of the civil war, in which human rights violations were reported.",
      "Joining BRICS would make the country more geostrategically important, perhaps encouraging western powers to downplay human rights concerns, as they have in the past in the interests of “realpolitik”.",
      "Alternative growth frontier: Ethiopia remains one of Africa’s fastest growing economies, at over 5% a year.",
      "It has developed strong economic ties with China in recent decades.",
      "Similarly, Indian companies have been acquiring land in Ethiopia.",
      "China and India are now Africa’s two largest single trading partners (not counting the European Union as a single entity).",
      "Joining BRICS would signal openness and lead to greater cooperation through platforms like the business council and forum.",
      "It could also add impetus to the “resurgent Ethiopia” narrative, an image the authorities are keen to promote to attract investments.",
      "Negotiations over finance: The Ethiopian government is negotiating a financial package with the International Monetary Fund.",
      "Joining BRICS might give it greater leverage.",
      "Western powers, which largely control the IMF, might be more wary of alienating Ethiopia in BRICS and driving it further “into the arms” of China.",
      "The creation of a new BRICS currency, to challenge US dollar hegemony, is on the agenda and its existing Contingency Reserve Arrangement already partly competes with the IMF.",
      "Non-interference policy: BRICS powers rhetorically largely subscribe to non-interference in the sovereign affairs of other states, with the qualification that President Lula de Silva of Brazil talked about “non-indifference” to human rights when he was previously in power and Russia has violated the principle through invasions and election interference, amongst others.",
      "Ethiopia may be interested in the political cover that joining BRICS would provide.",
      "The Russian invasion of Ukraine has received political cover from China, and some would argue from South Africa.",
      "The Ethiopian government may be keen to avoid human rights governance conditions attached to new loans, aid or debt relief from the west.",
      "A prime minister seeking new friends: BRICS membership would help restore the tarnished image of Prime Minister Abiy Ahmed, who is a Nobel peace prize recipient.",
      "Ahmed was heavily criticised as a war-monger during the civil war in Ethiopia’s Tigray region.",
      "Joining the BRICS club would show that his government is still politically acceptable to some major world powers.",
      "There would of course be risks in Ethiopia joining the BRICS.",
      "Western powers might perceive it as drifting into the alternative geopolitical bloc or alignment, which could reduce aid and investment from them.",
      "But this could also have advantages for Ethiopia’s relations with the west by making the country more geo-strategically important.",
      "Based on past experience, Ethiopia would be an unlikely addition to the grouping.",
      "The last and only country to be admitted after the group’s founding was South Africa in 2010.",
      "Other countries have applied and have not been admitted.",
      "BRICS now operates in what is sometimes described as a BRICS-plus format with countries such as Egypt already members of its development bank and all African leaders invited to the up-coming BRICS’ summit in South Africa.",
      "Ethiopia’s economy, estimated at around US$126.78 billion in 2022, is less than half the size of South Africa’s US$405.87 billion.",
      "South Africa is by far the smallest economy in the BRICS.",
      "But in some ways Ethiopia might be seen as a more representative African country in BRICS than South Africa.",
      "Ethiopia hosts the African Union headquarters and United Nations Economic Commission for Africa.",
      "Its capital, Addis Ababa, is sometimes described as the continent’s diplomatic capital.",
      "The outcome of Ethiopia’s application will likely be known after the next summit in August.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "joining brics",
      "western powers",
      "human rights",
      "civil war",
      "brics would",
      "trinity college",
      "college dublin",
      "brazil russia",
      "china india"
    ]
  },
  {
    "title": "A BRICS currency is unlikely to dislodge dollar any time soon - but it signifies growing challenge to established economic order",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/a-brics-currency-is-unlikely-to-dislodge-dollar-any-time-soon-but-it-signifies-growing-challenge-to-established-economic-order-206565",
    "publishedAt": "2023-06-21T14:00:00Z",
    "sentences": [
      "Adjunct Assistant Professor of Sustainable Development and Global Governance, The Fletcher School, Tufts University Mihaela Papa previously received funding for BRICS research from Minerva Research Initiative federal grant.",
      "She is affiliated with the Carnegie Council for Ethics in International Affairs.",
      "Tufts University provides funding as a founding partner of The Conversation US.",
      "View all partners Could a new currency be set to challenge the dominance of the dollar?",
      "Perhaps, but that may not be the point.",
      "In August 2023, South Africa will host the leaders of Brazil, Russia, India, China and South Africa – a group of nations known by the acronym BRICS.",
      "Among the items on the agenda is the creation of a new joint BRICS currency.",
      "As a scholar who has studied the BRICS countries for over a decade, I can certainly see why talk of a BRICS currency is, well, gaining currency.",
      "The BRICS summit comes as countries across the world are confronting a changing geopolitical landscape that is challenging the traditional dominance of the West.",
      "And while the BRICS countries have been seeking to reduce their reliance on the dollar for over a decade, Western sanctions on Russia after its invasion of Ukraine have accelerated the process.",
      "Meanwhile, rising interest rates and the recent debt-ceiling crisis in the U.S. have raised concerns among other countries about their dollar-denominated debt and the demise of the dollar should the world’s leading economy ever default.",
      "That all said, a new BRICS currency faces major hurdles before becoming a reality.",
      "But what currency discussions do show is that the BRICS countries are seeking to discover and develop new ideas about how to shake up international affairs and effectively coordinate policies around these ideas.",
      "With 88% of international transactions conducted in U.S. dollars, and the dollar accounting for 58% of global foreign exchange reserves, the dollar’s global dominance is indisputable.",
      "Yet de-dollarization – or reducing an economy’s reliance on the U.S. dollar for international trade and finance – has been accelerating following the Russian invasion of Ukraine.",
      "The BRICS countries have been pursuing a wide range of initiatives to decrease their dependence on the dollar.",
      "Over the past year, Russia, China and Brazil have turned to greater use of non-dollar currencies in their cross-border transactions.",
      "Iraq, Saudi Arabia and the United Arab Emirates are actively exploring dollar alternatives.",
      "And central banks have sought to shift more of their currency reserves away from the dollar and into gold.",
      "All the BRICS nations have been critical of the dollar’s dominance for different reasons.",
      "Russian officials have been championing de-dollarization to ease the pain from sanctions.",
      "Because of sanctions, Russian banks have been unable to use SWIFT, the global messaging system that enables bank transactions.",
      "And the West froze Russia’s US$330 billion in reserves last year.",
      "Meanwhile, the 2022 election in Brazil reinstated Luiz Inácio Lula da Silva as president.",
      "Lula is a longtime proponent of BRICS who previously sought to reduce Brazil’s dependence on and vulnerability to the dollar.",
      "He has reenergized the group’s commitment to de-dollarization and spoken about creating a new Euro-like currency.",
      "The Chinese government has also clearly laid out its concerns with the dollar’s dominance, labeling it “the main source of instability and uncertainty in the world economy.” Beijing directly blamed the Fed’s interest rate hike for causing turmoil in the international financial market and substantial depreciation of other currencies.",
      "Together with other BRICS countries, China has also criticized the use of sanctions as a geopolitical weapon.",
      "The appeal of de-dollarization and a possible BRICS currency would be to mitigate such problems.",
      "Experts in the U.S. are deeply divided on its prospects.",
      "U.S. Treasury Secretary Janet Yellen believes the dollar will remain dominant as most countries have no alternative.",
      "Yet a former White House economist sees a way that a BRICS currency could end dollar dominance.",
      "Although talk of a BRICS currency has gained momentum, there is limited information on various models under consideration.",
      "The most ambitious path would be something akin to the Euro, the single-currency adopted by 11 member states of the European Union in 1999.",
      "But negotiating a single currency would be difficult given the economic power asymmetries and complex political dynamics within BRICS.",
      "And for a new currency to work, BRICS would need to agree to an exchange rate mechanism, have efficient payment systems and a well-regulated, stable and liquid financial market.",
      "To achieve a global currency status, BRICS would need a strong track record of joint currency management to convince others that the new currency is reliable.",
      "A BRICS version of the Euro is unlikely for now; none of the countries involved show any desire to discontinue its local currency.",
      "Rather, the goal appears to be to create an efficient integrated payment system for cross-border transactions as the first step and then introduce a new currency.",
      "Building blocks for this already exist.",
      "In 2010, the BRICS Interbank Cooperation Mechanism was launched to facilitate cross-border payments between BRICS banks in local currencies.",
      "BRICS nations have been developing “BRICS pay” – a payment system for transactions among the BRICS without having to convert local currency into dollars.",
      "And there has been talk of a BRICS cryptocurrency and of strategically aligning the development of Central Bank Digital Currencies to promote currency interoperability and economic integration.",
      "Since many countries expressed an interest in joining BRICS, the group is likely to scale its de-dollarization agenda.",
      "To be sure, some of the group’s most ambitious past initiatives to set up major BRICS projects to parallel non-Western infrastructures have failed.",
      "Big ideas like developing a BRICS credit rating agency and creating a BRICS undersea cable never materialized.",
      "And de-dollarization efforts have been struggling both at the multilateral and bilateral level.",
      "In 2014, when the BRICS countries launched the New Development Bank, its founding agreement outlined that its operations may provide financing in the local currency of the country in which the operation takes place.",
      "Yet, in 2023, the bank remains heavily dependent on the dollar for its survival.",
      "Local currency financing represents around 22% of the bank’s portfolio, although its new president hopes to increase that to 30% by 2026.",
      "Similar challenges exist in bilateral de-dollarization pursuits.",
      "Russia and India have sought to develop a mechanism for trading in local currencies, which would enable Indian importers to pay for Russia’s cheap oil and coal in rupees.",
      "However, talks were suspended after Moscow cooled on the idea of rupee accumulation.",
      "Despite the barriers to de-dollarization, the BRICS group’s determination to act should not be dismissed – the group has been known for defying expectations in the past.",
      "Despite many differences among the five countries, the bloc managed to develop joint policies and survive major crises such as the 2020-21 China-India border clashes and the war in Ukraine.",
      "BRICS has deepened its cooperation, invested in new financial institutions and has been continuously broadening the range of policy issues it addresses.",
      "It now has a huge network of interlinked mechanisms that connect governmental officials, businesses, academics, think tanks and other stakeholders across countries.",
      "Even if there is no movement on the joint currency front, there are multiple issues on which BRICS finance ministers as well as central bankers regularly coordinate – and the potential for developing new financial collaborations is particularly strong.",
      "No doubt, talk of a new BRICS currency in itself is an important indicator of the desire of many nations to diversify away from the dollar.",
      "But I believe focusing on the BRICS currency risks missing the forest for the trees.",
      "A new global economic order will not emerge out of a new BRICS currency or de-dollarization happening overnight.",
      "But it can potentially emerge out of BRICS’ commitment to coordinating their policies and innovating – something this currency initiative represents.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "brics currency",
      "brics countries",
      "new currency",
      "local currency",
      "talk brics",
      "new brics",
      "dollar dominance",
      "tufts university",
      "international affairs",
      "south africa"
    ]
  },
  {
    "title": "South Africa's role as host of the BRICS summit is fraught with dangers. A guide to who is in the group, and why it exists",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/south-africas-role-as-host-of-the-brics-summit-is-fraught-with-dangers-a-guide-to-who-is-in-the-group-and-why-it-exists-206898",
    "publishedAt": "2023-06-01T14:00:00Z",
    "sentences": [
      "Professor/Senior Research Fellow, Centre for Advancement of Scholarship, University of Pretoria Danny Bradlow receives funding from the Open Society Foundation for a project unconnected to this article.",
      "He is also a Compliance Officer in the Social and Environmental Compliance Unit (SECU) at the UN Development Programme.",
      "University of Pretoria provides funding as a partner of The Conversation AFRICA.",
      "View all partners South Africa will host the BRICS summit in August 2023.",
      "The event could offer the country an opportunity to exercise leadership in the BRICS’ efforts to reform the arrangements for global economic governance and in supporting sustainable and inclusive development in Africa and the Global South.",
      "However, the opportunity has morphed into an international challenge because Russia’s President Vladimir Putin, who has been indicted by the International Criminal Court, has indicated that he will attend.",
      "South Africa could face the wrath of its BRICS partners if it fulfils its international obligation and arrests him.",
      "On the other hand, if it does not arrest him, it could face sanctions from those countries that want to see Putin tried for war crimes.",
      "Hosting the 2023 BRICS summit is therefore fraught with dangers.",
      "The international environment is complicated, dynamic and unpredictable.",
      "South Africa can avoid embarrassment and capitalise on the opportunities presented by the summit only if it is able to skilfully manoeuvre in these choppy waters.",
      "Trying to understand South Africa’s dilemma raises a number of questions: Who are the BRICS?",
      "What has the grouping achieved?",
      "In 2001, the global investment bank Goldman Sachs stated that it expected Brazil, Russia, India and China to become leading actors in the global economy.",
      "It collectively named the four countries “BRICs”.",
      "These countries decided that Goldman Sachs had a point and that they could enhance their global influence if they cooperated.",
      "They first met at a ministerial level in 2006 and at a leaders’ summit in 2009.",
      "In 2010 they invited South Africa to join the group.",
      "The group became known as “BRICS”.",
      "A primary objective of the group is to reform global economic governance so that it is more responsive to the concerns and interests of the Global South.",
      "For example, the BRICS have called for a new global currency that can challenge the dominant role of the US dollar in the international monetary system.",
      "It has also pushed for a greater voice – and more votes – for developing countries in key international economic organisations like the IMF and the World Bank.",
      "The group has also sought, through groups like its business forum, to promote greater economic cooperation between the participating countries.",
      "The BRICS record of achievements is mixed.",
      "In 2016, the group established two new international economic entities.",
      "The first was the New Development Bank.",
      "They contend that it is a “new” multilateral development bank which offers its members an alternative to institutions like the World Bank.",
      "It claims that its governance is fairer than the World Bank because its five original members all have equal votes.",
      "At the World Bank, shares (and therefore votes) are unevenly distributed among member states.",
      "The development bank also strives to provide financing more quickly than the World Bank, and in a way that is more respectful of the laws in its member states.",
      "However, to date, the New Development Bank has been less transparent and accountable than other multilateral development banks.",
      "It has provided US$32.8 billion to 96 projects in the 5 BRICS countries and it has begun looking to expand the scope of its operations.",
      "Since 2021 it has approved membership for Bangladesh, Egypt, United Arab Emirates and Uruguay.",
      "It is expected to add new members in the coming years.",
      "The second new entity was the Contingent Reserve Arrangement.",
      "This established a series of swap arrangements between the BRICS central banks.",
      "These arrangements allow each central bank, when its country is facing a balance of payments crisis, to exchange its local currency for hard currencies, like the US dollar, with its counterparts in the BRICS.",
      "Pursuant to the terms of the arrangement, a central bank can only draw on a fraction of the available financing without also having to enter into a financing arrangement with the IMF.",
      "Thus, the conditions that are attached to the IMF’s finances also become applicable to the funds made available through the Contingent Reserve Arrangement.",
      "To date, no BRICS central bank has used the arrangement.",
      "According to their communiques, the BRICS leaders have agreed to create other entities, such as a vaccine centre and a new credit rating agency.",
      "However, they have not yet implemented these agreements.",
      "They have not been successful either in reforming the existing institutions and arrangements for global economic governance, such as the IMF.",
      "One reason for this failure is the strong opposition to reform from states, primarily those in Europe, which currently have dominant voices in the IMF and would lose them in the case of true reform.",
      "But another important reason is that the BRICS are not unified in their demands for reform.",
      "For example, while Brazil, India and South Africa support reforming the UN Security Council to include more permanent members and to eliminate the veto power of the existing permanent members, China and Russia, as sitting permanent members, don’t.",
      "Similarly, not all the other BRICS have supported South Africa’s call for a third African seat on the IMF’s board of directors.",
      "The global political and economic situation has changed dramatically since 2010.",
      "These changes have created both opportunities and challenges for the BRICS.",
      "One opportunity arises from the fact that approximately 19 countries in the Global South, including Argentina, Cuba, Iran and Saudi Arabia, have expressed an interest in joining the BRICS.",
      "It is expected that the BRICS will consider the issue of membership at their upcoming August 2023 summit.",
      "Another opportunity arises from the growing interest around the world in having an alternative currency to the US dollar as the basis for the international financial system.",
      "The BRICS have been vocal supporters of de-dollarisation.",
      "However, given the complex economic and political relations between the BRICS member states, there is considerable scepticism about the feasibility of the BRICS developing a new global currency in the near term.",
      "The primary challenges facing the BRICS arise from geopolitics.",
      "The war in Ukraine has created tensions within the BRICS.",
      "The participating states have been forced to balance their respect for such international law principles as self-determination, sovereignty and peaceful resolution of disputes with their friendly relations with Russia.",
      "In addition, the BRICS cannot escape the fallout from the growing economic and security tensions between China and the west, particularly the US.",
      "Both these issues complicate the efforts of the other BRICS to maintain their formal non-aligned position.",
      "They also exacerbate existing tensions within the BRICS.",
      "The most important example of this is the complex and tense relationship between India and China.",
      "In recent years, they have had military skirmishes in disputed border areas.",
      "In addition, India has imposed economic constraints on Chinese companies operating in India.",
      "The two countries have refused to renew the visas of journalists from each country so that now there are almost no journalists from Chinese publications in India and vice versa.",
      "South Africa faces another opportunity that is fraught with danger when it hosts the G20 in 2025.",
      "The G20, which brings together the 20 leading economic powers in the world, has called itself the “premier forum” for global economic governance.",
      "South Africa is currently the only permanent African member of the G20 and 2025 will be the first time the group is hosted by an African country.",
      "Planning for this G20 event must begin soon because in 2024 South Africa will join India, the current G20 host, and Brazil, the 2024 G20 host in the troika that manages the G20 process.",
      "If the country does not plan carefully and effectively for this G20 event, South Africa risks emerging with a diminished reputation and its credibility shredded.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "world bank",
      "global economic",
      "economic governance",
      "development bank",
      "global south",
      "us dollar",
      "member states",
      "central bank",
      "permanent members"
    ]
  },
  {
    "title": "South Africa walks a tightrope of international alliances - it needs Russia, China and the west",
    "source": "The Conversation UK",
    "url": "https://theconversation.com/south-africa-walks-a-tightrope-of-international-alliances-it-needs-russia-china-and-the-west-204052",
    "publishedAt": "2023-05-10T14:00:00Z",
    "sentences": [
      "Politics lecturer, Rhodes University Thapelo Tselapedi does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
      "Rhodes University provides funding as a partner of The Conversation AFRICA.",
      "View all partners Relations between the People’s Republic of China and Russia on one hand and the west, specifically the US, on the other have become increasingly tense in recent times.",
      "For the US, China and Russia represent authoritarian regimes.",
      "For China, the US is the source of global insecurity.",
      "With a few exceptions like France and the UK, the west sees the presence of Russia and China in the BRICS bloc (which also includes Brazil, India and South Africa) as contaminating the entire bloc as well as their relations with the individual BRICS member countries.",
      "This is especially so for the US.",
      "This view reflects the weakening global power of the US, especially its inability to isolate Russia in Europe and to contain the influence of China in Asia and the developing world.",
      "The growing tensions pose a political and economic challenge for South Africa.",
      "This is especially so for US-South Africa relations.",
      "Part of my doctoral thesis focused on BRICS and its efforts to democratise the post-Cold War international order, which, by US admission, has come to an end.",
      "This is an important admission because the US is aware that the unilateral power it used to interact with the rest of the world after the collapse of the Soviet Union in 1989 is now subject to competition by many forces, both economic and political.",
      "I argue that South Africa should not choose between its BRICS or EU and US partnerships.",
      "It should keep its relations with the west while remaining within BRICS because of its economic prospects.",
      "The west remains economically significant for South Africa, but the BRICS bloc is important for South Africa’s economic adaptability.",
      "BRICS is effectively a forum for cooperation among regional powers that seek to democratise the international political economy.",
      "The bloc has used the (G20) platform – the group of 19 industrialised countries plus the European Union – to establish cohesion on issues such as international financial stability, climate change mitigation and sustainable development.",
      "At its 2011 summit, the bloc called for an end to the long reign of the US dollar as the world’s reserve currency (de-dollarisation).",
      "The 2008 credit crisis had illustrated the inadequacy of the world monetary system, with the US dollar at the centre.",
      "But it was the Russia-Ukraine war, when US sanctions against Russia backfired, which quickened efforts at de-dollarisation.",
      "The emergence of BRICS not only strengthens south-south relations, it weakens the inequality that characterises north-south relations.",
      "Much of the global south is developing fast enough for it to not only demand a more equitable world order, but also to finance it.",
      "This brings us to international governance.",
      "Read more: South Africa and Russia: President Cyril Ramaphosa's foreign policy explained The BRICS bloc serves as a counterweight to some of the excesses of US unilateralism that’s been a feature of global governance since the end of the Soviet Union in 1989.",
      "For instance, although the 2001 NATO invasion of Afghanistan was illegal under international law and the 2003 invasion of Iraq was equally unlawful, neither the US nor NATO have been prosecuted.",
      "Thus, the US has for some time undermined global governance.",
      "The BRICS bloc’s efforts to democratise global governance will support international accountability.",
      "Democratising financial and governance institutions is important in addressing many of the issues that concern the developing world.",
      "The emergence of the BRICS bloc has overshadowed the G7+ meetings while centralising the G20 as an international platform for political and economic coordination.",
      "So South Africa’s exclusion from May 2023’s G7+ meeting in Japan doesn’t count for much.",
      "Pretoria’s biggest trading partners are the EU and the US.",
      "South Africa is the largest US and EU trading partner in Africa, with the US totalling R289 billion (about US$16 billion in 2021) and the EU totalling a trade of R699 billion (about US$ 38 billion in 2021.",
      "South Africa also benefits from the preferential access to US markets for some of its exports in terms of the African Growth and Opportunity Act (AGOA.",
      "But the country is politically tied to the emergent multipolar world led by China, and broadly BRICS.",
      "Read more: South Africa's foreign policy: new paper sets the scene, but falls short on specifics Even France and the UK have begun to understand the need to balance their own interests with China against their interests with their traditional ally, the US.",
      "So South Africa’s national interests demand that it carefully navigate western anxieties caused by its BRICS ties.",
      "It needs to show that its membership of the bloc doesn’t make it anti-west.",
      "Immediately after South Africa joined BRICS in 2010, China invested in several projects, including expanding Durban’s port.",
      "This is the largest and busiest shipping terminal in sub-Saharan Africa.",
      "Trade and investment links between South Africa and China have improved too.",
      "By the end of 2021, South Africa’s exports to China reached over US$33 billion and China’s investment into South Africa totalled over US$25 billion, creating over 400,000 local jobs since 2008.",
      "Investments from South Africa into BRICS countries have surged since it became a bloc member.",
      "BRICS total trade amounted to R666 billion (about US$36 billion] in 2021.",
      "And China is an important trading partner for South Africa standing at R479 billion (about US$26 billion), above the US.",
      "Trade between South Africa and BRICS has yet to reach the level of trade with the EU and the US, but the BRICS bloc gives the country an opportunity to diversity its investment portfolio and destination.",
      "China has 1.4 billion people and the US has just over 300 million, so market access to China is important to any emerging economy.",
      "BRICS countries are currently responsible for roughly 31.5% of the global GDP while the G7 have come down to roughly 30%.",
      "Of course, the problem of South Africa’s strained relations with the west is not South Africa’s.",
      "The problem is that the west, specifically the unilateral power that the US represents, approaches the global order as if it’s a process that flows from its benevolence.",
      "Read more: How values, interests and power must shape South Africa's foreign policy For its own interests, South Africa must carefully navigate western anxieties about BRICS, and demonstrate that there is a common future for both the west and others in a multipolar world.",
      "Write an article and join a growing community of more than 203,400 academics and researchers from 5,196 institutions.",
      "Register now"
    ],
    "topics": [
      "south africa",
      "brics bloc",
      "billion us",
      "eu us",
      "africa brics",
      "foreign policy",
      "global governance",
      "rhodes university",
      "china russia",
      "west specifically"
    ]
  }
]