[
  {
    "title": "Eighty-four delegations support final declaration of Ukraine summit",
    "source": "Swissinfo (EN)",
    "url": "https://www.swissinfo.ch/eng/foreign-affairs/eighty-four-delegations-support-final-declaration-of-ukraine-summit/80855446",
    "publishedAt": "2024-06-16T12:47:42Z",
    "sentences": [
      "Comparing the list of delegations at the conference with the list of countries supporting the final declaration shows that several states will not be signing the final declaration: Armenia, Bahrain, Brazil, India, Indonesia, Colombia, Libya, Mexico, Saudi Arabia, South Africa, Suriname, Thailand and the United Arab Emirates.",
      "Stay informed with the latest news from Switzerland.",
      "Sign up now to receive daily updates straight to your inbox!",
      "The lack of support from the Brics countries, which include Brazil, India, China and South Africa as well as Russia, is a significant factor.",
      "China and Russia did not travel to Switzerland.",
      "Brazil, India and South Africa were there, but did not come with any heads of state.",
      "The participating heads of state and government were unable to agree on a clear approach to involving Russia in a peace process at the Ukraine summit on the Bürgenstock.",
      "There was no consensus on the question of when exactly and how Russia should be involved in future, said Defence Minister Viola Amherd, who holds the rotating Swiss presidency this year, in a closing speech.",
      "How the Ukraine conference in Switzerland aims to find a path to peace “Further steps” are needed and Switzerland is ready to play its part, said Amherd.",
      "“The conference created momentum,” said Amherd.",
      "The summit declaration sends a strong signal that changes are needed and there are common ideas for a fair and lasting peace, the Swiss defence minister said.",
      "Amherd also mentioned the securing of nuclear facilities, Ukraine’s access to its harbours, the release of all prisoners of war and the return of children deported from Ukraine to their homeland.",
      "Adapted from German by DeepL/amva This news story has been written and carefully fact-checked by an external editorial team.",
      "At SWI swissinfo.ch we select the most relevant news for an international audience and use automatic translation tools such as DeepL to translate it into English.",
      "Providing you with automatically translated news gives us the time to write more in-depth articles.",
      "If you want to know more about how we work, have a look here, and if you have feedback on this news story please write to english@swissinfo.ch.",
      "What were the circumstances of your immigration to Switzerland?",
      "And what motivated your decision to stay or leave?",
      "In Switzerland more people are being referred to electrical therapies or psychedelic-assisted psychotherapy.",
      "Are there similar approaches where you live?",
      "Switzerland is steering towards a housing crisis.",
      "Are there solutions?",
      "This content was published on May 12, 2025 Switzerland's good offices between the US and China appear to have been positive for its own trade deal talks with the US.",
      "This content was published on May 12, 2025 The Zurich Cantonal Council has insisted that the Zurich Art Society and the Bührle Foundation clarify the provenance of all paintings.",
      "This content was published on May 12, 2025 Kosovo President Vjosa Osmani Sadriu is coming to Switzerland on a state visit at the invitation of the federal government.",
      "This content was published on May 12, 2025 The Basel cantonal police are investigating the alleged threatening behaviour of an anti-Israel demonstrator at the Eurovision parade.",
      "This content was published on May 12, 2025 The Swiss army is examining the acquisition of weapons systems and ammunition to defend the country's borders over longer distances.",
      "This content was published on May 12, 2025 A 14-year-old girl is suspected of killed a 15-year-old girl in northern Switzerland on Sunday afternoon.",
      "This content was published on May 12, 2025 US President Trump wants to make medicines cheaper in the US, which could mean huge losses for drugmakers, including those in Switzerland.",
      "This content was published on May 12, 2025 The Swiss glaciers are starting the summer season this year with a record-low snow pack in some places.",
      "This content was published on May 12, 2025 Clariant is facing a third complaint concerning breaches of competition law on the ethylene market.",
      "This content was published on May 12, 2025 The trial of a man who allegedly killed a 41-year-old man with three shots in the Maggia Valley in May 2023 begins on Monday.",
      "In compliance with the JTI standards More: SWI swissinfo.ch certified by the Journalism Trust Initiative You can find an overview of ongoing debates with our journalists here .",
      "Please join us!",
      "If you want to start a conversation about a topic raised in this article or want to report factual errors, email us at english@swissinfo.ch.",
      "SWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR SWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"
    ],
    "topics": [
      "content published",
      "published may",
      "may 12",
      "12 2025",
      "brazil india",
      "south africa",
      "said amherd",
      "final declaration",
      "heads state",
      "defence minister"
    ]
  }
]