[
  {
    "title": "Will Trump’s tariff threats protect the dollar’s dominance?",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2024/dec/24/will-trumps-tariff-threats-against-brics-nations-backfire",
    "publishedAt": "2024-12-24T11:59:38Z",
    "sentences": [
      "Brics nations’ plan to create rival to greenback is bound to fail even without president-elect’s measures In 2023, the leaders of Brazil and the other Brics countries at the time – China, India, Russia, and South Africa – discussed collaboration on a new shared currency.",
      "The Brazilian president, Luiz Inácio Lula da Silva, has been a vocal proponent of an alternative to the US dollar, the dominant global currency for the past 75 years, and the Russian president, Vladimir Putin, publicly promoted the idea during the Brics summit in October by brandishing a symbolic Brics banknote.",
      "The bloc’s new members – Egypt, Ethiopia, Iran, and the United Arab Emirates – would presumably also be included in the new joint currency.",
      "The proposed challenge to the dollar has already drawn the ire of the US president-elect, Donald Trump, who has threatened to impose punitive tariffs of 100% on countries that move away from the greenback.",
      "At the end of last month, Trump warned Brics countries against creating or supporting an alternative reserve currency.",
      "“We require a commitment from these countries that they will neither create a new Brics currency nor back any other currency to replace the mighty US dollar, or they will face 100% tariffs,” he declared on Truth Social, his social media platform.",
      "This ultimatum follows Trump’s threats to impose a 25% tariff on Mexico and Canada if they fail to curb fentanyl smuggling into the USs, a 60% tariff on Chinese goods, and a 10-20% tariff on other trade partners.",
      "Despite Trump’s bluster, these increasingly extreme threats will not result in one of his self-proclaimed successful “deals”.",
      "While Trump’s rhetoric suggests he views a Brics currency as a serious threat, such a project is likely to fail anyway, regardless of his actions or ultimatums.",
      "If the proposed currency is intended to exist alongside Brics countries’ national currencies, it will not gain traction.",
      "A successful international currency requires a home base.",
      "That is why English, not Esperanto, became the world’s lingua franca, and why the special drawing right (SDR) – the International Monetary Fund’s reserve asset, whose value is based on a basket of major currencies – has not been successful as an international currency.",
      "For a Brics unit to compete with the US dollar, then, member countries would need to form a fully fledged monetary union, relinquishing their national currencies and establishing a unified central bank to oversee the new money.",
      "But the Brics economies differ too much from each other for a monetary union to function effectively.",
      "Successful monetary unions are typically formed by small, interconnected economies that trade extensively with one another and share common goals, cultural ties, correlated business cycles and relatively integrated labour markets.",
      "When member economies are too dissimilar, one may enter a recession while another overheats.",
      "In a monetary union, member states must give up control over their money supply, interest rates, and the exchange rate, limiting their ability to respond to cyclical economic fluctuations.",
      "In the absence of alternative adjustment mechanisms such as increased labour mobility and a strong political commitment, these disparities can lead to significant discord and needless macroeconomic instability.",
      "Examples of successful monetary unions include the CFA franc zones, comprising West African and Central African states that use a common currency pegged to the euro, and the Eastern Caribbean Currency Union, which consists of English-speaking islands such as Anguilla, Antigua, and Barbuda.",
      "These unions work because their members are small neighbouring countries that share cultural and historical roots.",
      "The largest member of the CFA, for example, is Ivory Coast, whose GDP is smaller than that of Buffalo, New York.",
      "The notable exception, of course, is the eurozone.",
      "But although it consists of relatively large economies, its 20 members also share borders, maintain integrated economies, and are bound by a shared commitment to the vision of a peaceful, unified Europe.",
      "Even so, European countries such as the UK, Sweden, and Norway have chosen to remain outside the eurozone, and peripheral members such as Greece have struggled to adapt to the constraints of the euro’s monetary straitjacket.",
      "Some regional blocs have long discussed adopting a common currency but made little progress.",
      "In 2001, the six-member Gulf Cooperation Council (GCC) announced plans to establish a currency union by 2010, but the plan failed to materialise.",
      "If even the small, culturally aligned, and cyclically correlated GCC countries have been unwilling to relinquish their monetary sovereignty, the proposed Brics currency stands little chance.",
      "Many of the Brics+ countries are large.",
      "They span four continents.",
      "They speak different languages.",
      "And their borders have historically been sources of conflict rather than economic integration.",
      "China and India, for example, were locked in a protracted military standoff along their shared Himalayan border before reaching a fragile truce in October.",
      "There is also little correlation among the Brics economies’ business cycles.",
      "Rising world energy prices benefit oil-producing countries such as Russia, Brazil, Iran, and the UAE, while putting pressure on energy-importing countries such as China and India.",
      "This dynamic makes the Brics far less suited for a monetary union than the GCC countries.",
      "To be sure, a gradual global shift away from the dollar is already under way.",
      "This process, while slow, has gained momentum in recent years, driven partly by America’s increasingly frequent use of financial sanctions.",
      "But if the Trump administration were to retaliate against the Brics with 100% tariffs, the move could backfire, prompting central banks to turn to the yuan, smaller currencies, or even gold for their international reserves.",
      "Trump’s clumsy efforts to enforce the international use of the dollar are at odds with his other stated objectives, such as improving the US trade balance by devaluing the dollar against the yuan and the currencies of other countries that run bilateral surpluses with the US.",
      "Talking down the dollar aligns with other inflationary Trump promises, such as his threats to weaken the Federal Reserve’s independence and his proposed mass deportations.",
      "But an international reserve currency that is prone to inflation and depreciation is hardly attractive.",
      "Trump’s tariff threats won’t resolve that contradiction.",
      "Jeffrey Frankel is a professor of capital formation and growth at Harvard University.",
      "He served as a member of President Bill Clinton’s Council of Economic Advisers.",
      "© Project Syndicate"
    ],
    "topics": [
      "monetary union",
      "brics countries",
      "china india",
      "us dollar",
      "brics currency",
      "dollar already",
      "reserve currency",
      "100 tariffs",
      "national currencies",
      "successful international"
    ]
  },
  {
    "title": "Trump threat of 100% tariffs against Brics nations raises trade war fears",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2024/dec/01/trump-threat-100-per-cent-tariffs-brics-nations-dollar",
    "publishedAt": "2024-12-01T14:50:25Z",
    "sentences": [
      "President-elect threatens retaliation if emerging economies create new currency to rival US dollar Fears of a global trade war have risen after Donald Trump threatened to impose 100% tariffs on countries in the Brics group if they create a new currency to rival the US dollar.",
      "Writing on his social media platform, Truth Social, on Saturday, Trump declared that he would also act if they supported another currency to replace the dollar.",
      "“We require a commitment from these countries that they will neither create a new Brics currency nor back any other currency to replace the mighty US dollar or they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US economy,” Trump said.",
      "“They can go find another sucker.",
      "There is no chance that the Brics will replace the US dollar in international trade, and any country that tries should wave goodbye to America,” he added.",
      "The warning came less than a week after Trump declared he would impose tariffs on Canada, Mexico and China once he was inaugurated as president.",
      "The Brics group was originally made up of Brazil, Russia, India, China and South Africa and has been joined by Egypt, the United Arab Emirates, Ethiopia and Iran.",
      "Some Brics members have shown interest in de-dollarising the world economy.",
      "In October, Vladimir Putin called for an alternative international payments system that could prevent the US from using the dollar as a political weapon.",
      "Others, though, fear the consequences of severing relations with the US and other western countries by breaking away from the dollar, which underpins world finance.",
      "A 100% tariff at the US border, if implemented, would drive up sharply the cost of goods from Brics members, fuelling US inflation and destabilising global trade flows.",
      "Stephen Innes, a managing partner at SPI Asset Management, said Trump had laid down the gauntlet with a “blistering proposal” of a 100% tariff.",
      "Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion “Trump’s recent electoral triumph was heavily fortified by his promise to impose harsh tariffs on foreign imports to the US, advocating for an aggressive 60% tariff on Chinese goods,” he said.",
      "“This hardline approach on trade reflects Trump’s broader ‘America First’ economic policy, which aims to recalibrate global trade dynamics and reinforce US economic sovereignty.",
      "As the world watches, the potential for a global trade upheaval looms, setting the stage for a contentious start to Trump’s administration.”"
    ],
    "topics": [
      "us dollar",
      "global trade",
      "create new",
      "new currency",
      "currency rival",
      "rival us",
      "100 tariffs",
      "brics group",
      "trump declared",
      "declared would"
    ]
  },
  {
    "title": "Trump or Harris? Whoever wins will face a shift in power in the global economy",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2024/nov/03/trump-or-harris-whoever-wins-will-face-a-shift-in-power-in-the-global-economy",
    "publishedAt": "2024-11-03T11:36:27Z",
    "sentences": [
      "West’s dominance is being challenged, with Brics summit showing emerging markets are unwilling to bow to pressure It is November 1992 and the US is at the height of its power.",
      "Communism has been defeated.",
      "The Berlin Wall has been demolished.",
      "The Soviet Union has broken up and Russia is being used as the laboratory mouse for free-market shock treatment.",
      "Liberalisation of the Chinese economy offers the opportunity for US multinationals to outsource production.",
      "An era of American-dominated globalisation has dawned.",
      "Two liberal internationalists – George HW Bush and Bill Clinton – are battling for the presidency.",
      "In the end, Clinton defeats Bush, the sitting Republican president, because the protectionist Ross Perot takes more votes from the Republicans than he does from the Democrats.",
      "Much has changed in the 32 years since Clinton became the first baby boomer to enter the White House.",
      "As Americans prepare to go to the polls on Tuesday, they do so in the knowledge that their country is still the world’s largest economy and strongest military power.",
      "But its supremacy is no longer unchallenged and the unipolar new world order that Bush boasted of in 1991 at the end of the first Gulf War has collapsed.",
      "In the 1990s, there was talk of a state-free world where money, goods and people would move freely without hindrance.",
      "Controls on capital were removed.",
      "Independent central banks set interest rates.",
      "The World Trade Organization would break down trade barriers and police the global trading system.",
      "But things quickly started to go wrong and the neoliberal utopia never materialised.",
      "Free movement of capital coupled with only the scantiest of regulation led to a series of localised meltdowns that eventually went global in the banking crisis of 2008.",
      "China became a much bigger and powerful economy than the US had envisaged.",
      "The WTO proved incapable of negotiating new trade deals.",
      "Voters expressed anger at slow growth, deindustrialisation and mass migration.",
      "The Covid pandemic exposed the fragility of global supply chains.",
      "The nation state made a comeback, along with activist industrial policies and protectionism.",
      "Bush’s vision of the world marching in step to the US’s tune lasted no more than a decade.",
      "Last month’s Brics summit, hosted by Vladimir Putin, was a sign of the times.",
      "Originally a group of five countries – Brazil, Russia, India, China and South Africa – the meeting in Kazan welcomed four new members in Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "At least another couple of dozen countries – including Saudi Arabia, Turkey and Indonesia – showed up as observers and are interested in joining the club.",
      "Putin’s interest in an expanded Brics is easy to understand; it sends out a message that – despite sanctions imposed and tightened since its invasion of Ukraine two and a half years ago – Russia is not isolated.",
      "For now, Putin’s ambition of creating a Brics currency as a rival to the US dollar has no real chance of coming to anything.",
      "The dollar is stable and easily convertible: it is under no immediate threat.",
      "Nor are countries such as India, Brazil and South Africa willing to sever relations with the US and other western countries but instead want to keep a foot in both camps.",
      "However, Kazan was still important for three reasons.",
      "First, it demonstrated that sanctions have not led to the collapse of the Russian economy – and probably never will.",
      "China and India are willing customers for Putin’s oil, while the domestic Russian economy has also proved to be resilient.",
      "Hard though it might be for western governments to acknowledge, Russia can keep fighting for a long time, and is winning the war.",
      "The second thing Kazan has demonstrated is that the bigger emerging market economies are unwilling to bow to western pressure.",
      "That applies not only to Russia but also to China, which fears being locked out of western markets by tariffs and other trade restrictions.",
      "If Donald Trump wins on Tuesday, he has pledged to impose a 60% tariff on all Chinese imports into the US – a considerable blow given that in 2022 China ran a $400bn (£310bn) trade surplus with the US.",
      "Yet the Democrats have taken a tough line with China, too.",
      "Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion Kamala Harris would stick to the less draconian but still robust approach taken by Joe Biden during his presidency, which has included 100% tariffs on Chinese electric vehicles, investment bans and sanctions against technology companies.",
      "Despite attempts to rebalance its growth model towards domestic consumption, China remains an export-dependent economy.",
      "It needs to find markets for the goods being turned out by its factories, and while the Brics members are no substitute for the much richer countries of North America and Europe, they include the more important middle-income nations.",
      "The final reason Kazan was important was that it demonstrated the growing influence and impatience of the global south, which accounts for a majority of the world’s population and an ever-growing share of the global economy.",
      "The combined GDP of the G7 nations – the US, Japan, Germany, the UK, France, Italy and Canada – has fallen from 67% in 1994 to 44% in 2022, while China’s has quadrupled to 20% over the same period.",
      "The new world order was supposed to produce prosperity for all but failed to achieve that.",
      "According to the World Bank, progress in the fight against global poverty has stalled as a result of wars, rising debt, the pandemic and climate change.",
      "Rich countries are incapable or unwilling to respond to this polycrisis.",
      "The G7 and the west more generally act as if they are still as powerful as they were in 1944 when the World Bank and the International Monetary Fund were created by the Bretton Woods conference.",
      "But this is now a different global economy.",
      "No matter who wins the White House race, the west’s dominance is being challenged as it hasn’t been for the past 500 years."
    ],
    "topics": [
      "west dominance",
      "dominance challenged",
      "brics summit",
      "unwilling bow",
      "white house",
      "new world",
      "world order",
      "south africa",
      "russian economy",
      "2022 china"
    ]
  },
  {
    "title": "Ukraine war briefing: Navalny widow blasts UN chief Guterres for meeting ‘murderer’ Putin",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2024/oct/25/ukraine-war-briefing-navalny-widow-blasts-un-chief-guterres-for-meeting-murderer-putin",
    "publishedAt": "2024-10-24T23:41:54Z",
    "sentences": [
      "Secretary general calls for ‘just peace’ in Ukraine at Brics summit; Putin not denying North Korean troops brought into war.",
      "What we know on day 975 The Russian opposition figure Yulia Navalnaya has slammed the UN secretary general, António Guterres, for meeting Vladimir Putin.",
      "“It was the third year of the war, and the UN secretary general was shaking hands with a murderer,” Navalnaya said on X, posting a photo of Putin greeting Guterres.",
      "Navalnaya is the widow of Alexei Navalny, the Russian opposition figurehead who died as a Russian political prisoner in February.",
      "It was the third year of the war, and the UN Secretary-General was shaking hands with a murderer pic.twitter.com/BpjsThSKsw Guterres told the Russian president on Thursday that “the Russian invasion of Ukraine was in violation of the United Nations charter and international law” a readout from the UN chief’s spokesperson said after their meeting on the sidelines of the Brics summit in Kazan, Russia.",
      "Guterres called on Thursday for a “just peace” in Ukraine.",
      "Moscow was ready to consider any options to end the conflict in Ukraine but only proceeding from “reality on the ground”, and was “not ready for anything else”, Putin said on Thursday.",
      "He accused the west of using Ukraine to “create critical threats to Russia’s security”.",
      "Putin made no denial of North Korean troops being brought into the war as he spoke on Thursday about defence ties with Kim Jong-un’s regime, writes Patrick Wintour, the Guardian’s diplomatic editor.",
      "Asked by a reporter about satellite imagery showing North Korean troop movements, Putin said: “Images are a serious thing.",
      "If there are images, then they reflect something.” The US and South Korea have said North Korean troops have reached Ukraine, while Ukraine’s military intelligence service said on Thursday that the first of them had been deployed in Russia’s Kursk region which has been counter-invaded by the Ukrainians.",
      "Russian attacks on eastern Ukraine killed at least six people and wounded 10 on Thursday, regional authorities said.",
      "A thermobaric bomb hit the town of Kupiansk in the Kharkiv region, wounding 10 people, said the regional governor, Oleh Syniehubov.",
      "One woman died later in hospital.",
      "“The enemy struck near a shop and the town market,” Syniehubov said.",
      "Russian shelling later in the day killed three people around Pokrovsk in the eastern Donetsk region, said the governor, Vadym Filashkin, adding later that a Russian strike on a branch of the Nova Poshta delivery service killed two people in Oleksiyevo-Druzhkiva, near the frontline towns of Chasiv Yar and Kostyantynivka.",
      "Russian media and war bloggers reported on Thursday that Russian forces had advanced into the coal mining town of Selydove, about 20km (12 miles) south-east of Pokrovsk.",
      "Ukraine’s military general staff said that currently the most intense Russian assaults along the frontline were taking place on the Pokrovsk front, including near Selydove.",
      "The international criminal court reported Mongolia to its oversight organisation on Thursday for failing to arrest Vladimir Putin when he visited in September.",
      "The ICC has an arrest warrant out for Putin related to the Ukraine war, but instead of arresting the Russian ruler as required by its membership of the ICC, Mongolia rolled out the red carpet.",
      "“In view of the seriousness of Mongolia’s failure to cooperate with the court, the chamber deemed it necessary to refer the matter to the assembly of states parties,” the court said, referring to its oversight body that meets in December in The Hague.",
      "The organisation, made up of all 124 of the court’s member states, can “take any measure it deems appropriate”, according to the ICC.",
      "A father and son from Ukraine have been sentenced to 20 years’ jail each in Belarus after being convicted of preparing terrorist acts.",
      "Serhiy Kabarchuk and his son Pavlo were arrested in February for allegedly assembling a store of weapons and explosives.",
      "State television later ran footage in which the Kabarchuks said they were acting under the direction of Ukraine’s SBU security service.",
      "Many observers claim such televised confessions in the authoritarian country are made under duress.",
      "Ukraine said on Thursday it had detained six people including three army recruitment officials in Kyiv as part of a probe into “illegal evasion of mobilisation by persons liable for military service”.",
      "The State Bureau of Investigation (SBI) added: “More than $1.2 million and 45,000 euros in cash were discovered and seized.",
      "In addition, 11 luxury cars worth over $100,000 each were seized.” The SBI alleged a civilian acted as a liaison between the recruitment officials and people seeking to avoid being drafted.",
      "The price to be removed from the call-up list ranged from $2,000 to $15,000 and the scheme may have aided “thousands” to evade service.",
      "Ukraine’s president, Volodymyr Zelenskyy, this week ordered the scrapping of the central body that issues medical disability certificates, and Ukraine’s prosecutor general, Andriy Kostin, resigned after security services uncovered a large-scale scheme that provided draft exemptions for government officials.",
      "Russian lawmakers voted on Thursday for a budget that will see defence spending surge by almost 30% next year as the Kremlin diverts huge resources to its Ukraine offensive.",
      "Only one lawmaker in the lower house voted against.",
      "The bill will go through a second reading on 14 November."
    ],
    "topics": [
      "north korean",
      "secretary general",
      "korean troops",
      "said thursday",
      "peace ukraine",
      "brics summit",
      "troops brought",
      "brought war",
      "russian opposition",
      "un secretary"
    ]
  },
  {
    "title": "'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe",
    "source": "Sky News",
    "url": "https://news.sky.com/story/utter-rubbish-putin-dismisses-mi5-claims-russia-trying-to-create-mayhem-in-uk-and-europe-13240462",
    "publishedAt": "2024-10-24T20:49:00Z",
    "sentences": [
      "The Russian president closed this year's BRICS summit by addressing a variety of topics, including claims Russia is trying to create mayhem in the UK.",
      "By Claire Gilbody Dickerson, news reporter Thursday 24 October 2024 21:49, UK Please use Chrome browser for a more accessible video player Vladimir Putin has dismissed as \"utter rubbish\" claims by the UK's MI5 intelligence chief that Russia is aiming to cause chaos across Britain and Europe.",
      "Speaking on the closing day of the annual summit of the BRICS bloc of developing economies, the Russian president responded to MI5 chief Ken McCallum's claims that Russian military intelligence is \"on a sustained mission to generate mayhem on British and European streets\".",
      "Mr McCallum said his service had \"seen arson, sabotage and more\".",
      "Mr Putin, who has been hosting the three-day summit in the Russian city of Kazan, responded saying the situation \"on the streets of European cities\" was caused by the actions of European authorities.",
      "This year's BRICS summit was touted by the Kremlin as \"the largest foreign policy event ever held\" by Russia.",
      "Read more: 'Global South' interested in joining BRICSThe battle of the summits?",
      "The alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.",
      "Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.",
      "Keep up with all the latest news from the UK and around the world by following Sky News Despite US-led efforts by Western countries to isolate Russia in the aftermath of its full-scale invasion of Ukraine back in February 2022, 36 countries attended the summit.",
      "Mr Putin told the summit Russia was ready to consider options to end the conflict.",
      "\"We are prepared to consider any options for peace agreements based on the realities on the ground.",
      "And are not ready for anything else,\" he said.",
      "Be the first to get Breaking News Install the Sky News app for free He also addressed US claims that North Korea had sent troops to Russia, which he didn't deny.",
      "But he said it was up to Moscow how to operate within the framework of an article of Russia's partnership deal with North Korea, which deals with mutual defence.",
      "The US has said that it had seen evidence that North Korea has sent 3,000 troops to Russia for possible deployment in Ukraine, viewed by the West as a significant escalation.",
      "Asked by a reporter about satellite imagery showing North Korean troop movements, Mr Putin said: \"Images are a serious thing.",
      "If there are images, then they reflect something.\""
    ],
    "topics": [
      "brics summit",
      "mr putin",
      "north korea",
      "russian president",
      "year brics",
      "end conflict",
      "sky news",
      "consider options",
      "korea sent",
      "sent troops"
    ]
  },
  {
    "title": "Putin does not deny North Korea has sent soldiers to Russia",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2024/oct/24/putin-does-not-deny-north-korea-has-sent-soldiers-to-russia",
    "publishedAt": "2024-10-24T18:08:17Z",
    "sentences": [
      "Russian president sidesteps claims after US said it had seen evidence 3,000 troops had been sent Vladimir Putin has sidestepped claims that North Korea has sent soldiers to Russia, insisting that it was up to Moscow how to run its mutual defence clause with Pyongyang.",
      "Speaking at the close of the Brics summit in Kazan on Thursday, he accused the west of escalating the Ukraine war and said it was “living an illusion” if it thought it could inflict a strategic defeat on Russia.",
      "The US said it had seen evidence that North Korea had sent 3,000 troops to Russia for possible deployment in Ukraine, a move that could mark a fundamental challenge to Ukraine due to its manpower shortages.",
      "Asked by a reporter about satellite imagery apparently showing North Korean troop movements, Putin said: “Images are a serious thing.",
      "If there are images, then they reflect something.” He repeated his claims that the west had escalated the Ukraine crisis and said Nato officers and instructors were directly involved in the Ukraine war.",
      "“We know who is present there, from which European Nato countries, and how they carry out this work,” Putin said.",
      "The US and South Korea have said that North Korean troops have reached Ukraine and, although Putin may be being deliberately ambiguous to lower Ukraine morale, it is also striking he did not deny the allegations given a high-profile opportunity to do so.",
      "No fellow Brics leader raised the issue in public during the summit, which instead heard vague calls for restraint.",
      "On Thursday, Ukraine’s military intelligence service said that the first North Korean units trained in Russia had been deployed in the Kursk region, the Russian border area where Ukrainian forces staged a major incursion in August.",
      "“On October 23, 2024, their presence was recorded in the Kursk region,” the Ukrainian intelligence agency said in a statement.",
      "The UN secretary general, António Guterres, used his speech to call for a “just peace”.",
      "Guterres was in Russia for the first time since April 2022 and was due to hold private talks on Ukraine with Putin later in the day.",
      "Moscow is seeking to use the forum to build a united front of emerging economies that use alternatives to the dollar with which to trade.",
      "In a brief passage on Ukraine, the UN chief said: “We need peace in Ukraine, a just peace in line with the UN charter, international law and the [UN] general assembly resolution.” He said: “We must uphold the values of the UN charter, the rule of law and the principles of sovereignty, territorial integrity and political independence of all states.” He made no reference to the North Korean troops.",
      "It is the first time Guterres has met Putin since the international criminal court in March 2023 issued a warrant for the arrest of the Russian leader because of children in Ukraine being abducted and taken to Russia.",
      "The Ukrainian foreign ministry has criticised Guterres over the meeting, especially since he rejected an invitation to attend a Ukrainian-sponsored peace summit this summer.",
      "Guterres urged members of Brics not to see the organisation as an alternative to the UN, saying: “No single group and no single country can act alone or in isolation.",
      "It takes a community of nations, working as one global family, to address global challenges.” Putin stated that the emergence of a “more just world order” was being hampered by “forces accustomed to thinking and acting in the logic of domination over everything and everyone”.",
      "He said Kyiv’s foreign backers did not any longer even hide their goal of inflicting a strategic defeat on his country.",
      "Putin said: “Only those who don’t know the history of Russia can believe in this, because they don’t take into account the unity and the strength of spirit of Russians forged over the centuries.”"
    ],
    "topics": [
      "north korean",
      "putin said",
      "us said",
      "said seen",
      "seen evidence",
      "north korea",
      "korea sent",
      "ukraine war",
      "strategic defeat",
      "korean troops"
    ]
  },
  {
    "title": "Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit",
    "source": "Sky News",
    "url": "https://news.sky.com/story/ukraine-war-a-just-peace-needed-to-end-conflict-un-chief-tells-putin-at-new-global-order-brics-summit-13240297",
    "publishedAt": "2024-10-24T13:32:00Z",
    "sentences": [
      "Antonio Guterres's message at the summit of BRICS countries in Kazan comes after President Xi Jinping told leaders yesterday that China has a peace plan for Ukraine - along with Brazil.",
      "Thursday 24 October 2024 14:32, UK The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.",
      "Appearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"in line with the UN Charter, international law and UN General Assembly resolutions\".",
      "He said summit attendees: \"Across the board, we need peace.",
      "We need peace in Ukraine.\"",
      "It comes after President Xi Jinping claimed on Wednesday that China and fellow BRICS member Brazil have put forward a peace plan for the war in Ukraine.",
      "He told Mr Putin and other leaders at the three-day summit that they intend to rally further international support in the hope of bringing fighting there to an end.",
      "Mr Xi said: \"We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift de-escalation of the situation.\"",
      "The BRIC coalition formed in 2009, bringing together Brazil, Russia, India, and China.",
      "South Africa joined the following year, changing the name to BRICS.",
      "'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe It was largely disregarded at first - but it has since grown in both membership and influence with Russia's war in Ukraine and Iran's involvement in the wars in Gaza, Israel, and Lebanon dominating global geopolitics.",
      "Just weeks before Russia invaded Ukraine in February 2022, Mr Putin and Mr Xi signed a \"no limits\" partnership between their two countries.",
      "Beijing, however, has kept largely quiet on the Ukraine war and not tried to use its influence on Moscow to bring it to an end.",
      "This week's claims of a peace plan could result in new impetus for talks to resolve the conflict.",
      "India's Prime Minister Narendra Modi added that his country \"supports dialogue and diplomacy, not war\".",
      "Mr Guterres has not visited Russia in over two years and the decision sparked criticism from Ukrainian officials.",
      "Ukraine's foreign ministry wrote on X ahead of the summit that his trip to Kazan would \"only damage the UN's reputation\".",
      "\"This is a wrong choice that does not advance the cause of peace,\" it added, also rejecting the China-Brazil plan.",
      "Farhan Haq, deputy spokesman for Mr Guterres, responded by saying it is \"standard practice in attending meetings of organisations with large numbers of important member states, such as the G7 and the G20\" - pointing out that BRICS countries represent \"half the world's population\".",
      "Notably, President Tayyip Erdogan of Turkey, which is a NATO member and hoping to enter the European Union, was also there.",
      "Appearing alongside BRICS members on Thursday, Mr Guterres also called for peace in the conflicts in Gaza, Lebanon, and Sudan.",
      "On the Middle East, Mr Xi called for a comprehensive ceasefire in Gaza.",
      "Alternative payment system would counter sanctions In a joint declaration bringing the three days to a close, BRICS members voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions\".",
      "Mr Putin's priority for the meeting was discussions of an alternative global payment system that could be used between members - after Russia was cut off from SWIFT at the outbreak of its invasion, due to Western sanctions.",
      "As such, the attendees' statement talked of a \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access\".",
      "Mr Putin said it was important as all the BRICS members \"share similar aspirations and values and a vision of new democratic global order\".",
      "Such a system would allow member countries to bypass the US dollar, which is currently used for oil transactions and other major international trade.",
      "On the sidelines of the summit, Mr Putin also met Iranian President Masoud Pezeshkian.",
      "He reiterated the \"truly friendly\" ties between Russia and Iran that he hopes will be solidified with a \"comprehensive strategic partnership treaty\", which is due to be signed by the pair on Mr Pezeshkian's planned trip to Moscow.",
      "A date for that visit has not been decided, Kremlin foreign affairs adviser Yuri Ushakov said.",
      "Commenting on the Middle East crisis, Mr Pezeshkian added: \"The flames of war continue to rage in the Gaza Strip andcities of Lebanon, and international institutions, particularly the UN Security Council as a driver of international peace and security, lack the necessary effectiveness to extinguish the fire of this crisis.\"",
      "Mr Modi and President Cyril Ramaphosa have chosen to go to the BRICS summit rather than, as leaders of India and South Africa, attend the Commonwealth Heads of Government Meeting, which is also taking place at the same time and is being visited by UK prime minister Sir Keir Starmer, among others."
    ],
    "topics": [
      "mr putin",
      "peace plan",
      "mr xi",
      "mr guterres",
      "brics members",
      "antonio guterres",
      "brics countries",
      "comes president",
      "president xi",
      "xi jinping"
    ]
  },
  {
    "title": "Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit",
    "source": "Sky News",
    "url": "https://news.sky.com/story/ukraine-war-a-just-peace-needed-to-end-conflict-un-chief-tells-putin-13240297",
    "publishedAt": "2024-10-24T13:32:00Z",
    "sentences": [
      "Antonio Guterres's message at the summit of BRICS countries in Kazan comes after President Xi Jinping told leaders yesterday that China has a peace plan for Ukraine - along with Brazil.",
      "Thursday 24 October 2024 14:32, UK The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.",
      "Appearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"in line with the UN Charter, international law and UN General Assembly resolutions\".",
      "He said summit attendees: \"Across the board, we need peace.",
      "We need peace in Ukraine.\"",
      "It comes after President Xi Jinping claimed on Wednesday that China and fellow BRICS member Brazil have put forward a peace plan for the war in Ukraine.",
      "He told Mr Putin and other leaders at the three-day summit that they intend to rally further international support in the hope of bringing fighting there to an end.",
      "Mr Xi said: \"We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift de-escalation of the situation.\"",
      "The BRIC coalition formed in 2009, bringing together Brazil, Russia, India, and China.",
      "South Africa joined the following year, changing the name to BRICS.",
      "'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe It was largely disregarded at first - but it has since grown in both membership and influence with Russia's war in Ukraine and Iran's involvement in the wars in Gaza, Israel, and Lebanon dominating global geopolitics.",
      "Just weeks before Russia invaded Ukraine in February 2022, Mr Putin and Mr Xi signed a \"no limits\" partnership between their two countries.",
      "Beijing, however, has kept largely quiet on the Ukraine war and not tried to use its influence on Moscow to bring it to an end.",
      "This week's claims of a peace plan could result in new impetus for talks to resolve the conflict.",
      "India's Prime Minister Narendra Modi added that his country \"supports dialogue and diplomacy, not war\".",
      "Mr Guterres has not visited Russia in over two years and the decision sparked criticism from Ukrainian officials.",
      "Ukraine's foreign ministry wrote on X ahead of the summit that his trip to Kazan would \"only damage the UN's reputation\".",
      "\"This is a wrong choice that does not advance the cause of peace,\" it added, also rejecting the China-Brazil plan.",
      "Farhan Haq, deputy spokesman for Mr Guterres, responded by saying it is \"standard practice in attending meetings of organisations with large numbers of important member states, such as the G7 and the G20\" - pointing out that BRICS countries represent \"half the world's population\".",
      "Notably, President Tayyip Erdogan of Turkey, which is a NATO member and hoping to enter the European Union, was also there.",
      "Appearing alongside BRICS members on Thursday, Mr Guterres also called for peace in the conflicts in Gaza, Lebanon, and Sudan.",
      "On the Middle East, Mr Xi called for a comprehensive ceasefire in Gaza.",
      "Alternative payment system would counter sanctions In a joint declaration bringing the three days to a close, BRICS members voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions\".",
      "Mr Putin's priority for the meeting was discussions of an alternative global payment system that could be used between members - after Russia was cut off from SWIFT at the outbreak of its invasion, due to Western sanctions.",
      "As such, the attendees' statement talked of a \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access\".",
      "Mr Putin said it was important as all the BRICS members \"share similar aspirations and values and a vision of new democratic global order\".",
      "Such a system would allow member countries to bypass the US dollar, which is currently used for oil transactions and other major international trade.",
      "On the sidelines of the summit, Mr Putin also met Iranian President Masoud Pezeshkian.",
      "He reiterated the \"truly friendly\" ties between Russia and Iran that he hopes will be solidified with a \"comprehensive strategic partnership treaty\", which is due to be signed by the pair on Mr Pezeshkian's planned trip to Moscow.",
      "A date for that visit has not been decided, Kremlin foreign affairs adviser Yuri Ushakov said.",
      "Commenting on the Middle East crisis, Mr Pezeshkian added: \"The flames of war continue to rage in the Gaza Strip andcities of Lebanon, and international institutions, particularly the UN Security Council as a driver of international peace and security, lack the necessary effectiveness to extinguish the fire of this crisis.\"",
      "Mr Modi and President Cyril Ramaphosa have chosen to go to the BRICS summit rather than, as leaders of India and South Africa, attend the Commonwealth Heads of Government Meeting, which is also taking place at the same time and is being visited by UK prime minister Sir Keir Starmer, among others."
    ],
    "topics": [
      "mr putin",
      "peace plan",
      "mr xi",
      "mr guterres",
      "brics members",
      "antonio guterres",
      "brics countries",
      "comes president",
      "president xi",
      "xi jinping"
    ]
  },
  {
    "title": "Ukraine war briefing: Brics summit backfired on Putin with calls for peace, says Kyiv",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2024/oct/24/ukraine-war-briefing-brics-summit-backfired-on-putin-with-calls-for-peace-says-kyiv",
    "publishedAt": "2024-10-24T00:10:32Z",
    "sentences": [
      "Xi Jinping among world leaders in Russia advising against escalation; any North Korean troops ‘fair game’ on Ukraine battlefield, says US.",
      "What we know on day 974 The foreign ministry in Kyiv said on Wednesday that Moscow had failed to win support for its invasion of Ukraine at the Brics summit it is hosting, where Putin faced direct calls to end the conflict from some of his closest and most important partners.",
      "“The Brics summit, which Russia planned to use to split the world, has once again demonstrated that the world majority remains on the side of Ukraine in its quest to guarantee a comprehensive, just and sustainable peace,” the ministry said.",
      "The Chinese president, Xi Jinping, told the summit that there must be “no escalation of fighting” in Ukraine, saying: “We must adhere to the three principles of ‘no spillover from the battlefield, no escalation of fighting and no adding oil to the fire by relevant parties’, so as to ease the situation as soon as possible.” The Brazilian president, Luiz Inacio Lula da Silva, called for “avoiding escalation and initiating peace negotiations”.",
      "Without referring to any specific conflict, the Indian prime minister, Narendra Modi, also issued a call for peace: “We support dialogue and diplomacy, not war.” In private talks, Vladimir Putin welcomed offers by several of the Brics leaders to mediate in Ukraine, even as he told them his forces were advancing, said his spokesman, Dmitry Peskov, according to Russian state media.",
      "North Korean troops would be legitimate military targets – “fair game” – if they engaged in combat in Ukraine, White House spokesperson John Kirby said on Wednesday.",
      "The US has said for the first time that it has seen evidence of North Korean troops in Russia, and South Korean lawmakers have said about 3,000 soldiers have been sent to support the Kremlin’s war in Ukraine, with Kim Jong-un’s regime promising to provide a total of about 10,000 troops by December.",
      "Alexander Lukashenko – the Belarusian president, who has stayed in power by running a client state of Russia – said in interviews broadcast on Wednesday that Putin deploying any foreign forces in the Ukraine conflict would inevitably lead to an escalation, possibly involving Nato troops.",
      "Lukashenko claimed it was “rubbish” that North Korean troops were going to fight in Ukraine: “Knowing his character Putin would never try to persuade another country to involve its army in Russia’s special operation in Ukraine … [it] would be a step towards the escalation of the conflict if the armed forces of any country, even Belarus, were on the contact line.” That would prompt Ukraine’s allies to point to foreign involvement “so Nato troops would be deployed to Ukraine”.",
      "Ukrainian authorities have announced the mandatory evacuation of children and their families from Borova in the north-eastern region of Kharkiv, where Russian forces have been making advances.",
      "The governor of the Donetsk region earlier said all children had been removed from the frontline town of Myrnograd and just several dozen remained in the nearby transport hub of Pokrovsk - the main target of Russian advances.",
      "Authorities in the Zaporizhzhia region, which the Kremlin claimed to have annexed alongside Donetsk and two others, said two men aged 40 and 73 had been killed in a drone attack.",
      "The Biden administration is trying to provide Ukraine with US$10bn in military aid as part of its $20bn commitment under a $50bn loan coordinated with the G7 and EU, the White House National Security Council said on Wednesday.",
      "Joe Biden, the US president, said: “We will provide $20bn in loans to Ukraine that will be paid back by the interest earned from immobilised Russian sovereign assets.",
      "Make no mistake: Russia will not prevail in this conflict … tyrants will be responsible for the damages they cause”.",
      "The US plans to disperse $10bn by December as economic aid, but needs US lawmakers’ approval for a further $10bn, the White House national security council has said on Wednesday.",
      "Romania scrambled two F-16 fighter jets after detecting what were probably two drones breaching its national airspace, the Romanian defence ministry said late on Wednesday.",
      "It was the third such incident in less than a week.",
      "Two signals were picked up by radar less than one hour apart flying above the south-eastern counties of Constanta and Tulcea, the latter bordering Ukraine across the Danube River.",
      "The pilots did not see either drone before losing the signals, the ministry said."
    ],
    "topics": [
      "north korean",
      "korean troops",
      "said wednesday",
      "ministry said",
      "white house",
      "xi jinping",
      "fair game",
      "brics summit",
      "escalation fighting",
      "troops would"
    ]
  },
  {
    "title": "Putin calls for alternative international payment system at Brics summit",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2024/oct/23/putin-world-economy-bloc-brics-summit",
    "publishedAt": "2024-10-23T16:08:17Z",
    "sentences": [
      "Russian president’s goal to de-dollarize world economy alarms members that do not want bloc to turn against west Vladimir Putin has opened the expanded Brics summit by issuing a call for an alternative international payments system that could prevent the US using the dollar as a political weapon.",
      "But the summit communique indicated that little progress had been made on an alternative payment system.",
      "Speaking at the summit in the Russian city of Kazan, Putin said: “The dollar is being used as a weapon.",
      "We really see that this is so.",
      "I think that this is a big mistake by those who do this.” He said that nearly 95% of trade between Russia and China is now conducted in rubles and yuan.",
      "The move to de-dollarize the world economy unnerves some Brics members – notably Brazil and India – that do not want their rapidly expanding club to become solely pro-Chinese and anti-western.",
      "Russia is working on creating a settlement and payment infrastructure that would bypass the Swift payment system based in Belgium.",
      "The de-dollarization initiative is probably the most concrete proposal likely to emerge from the summit that has been remarkable for giving Putin his biggest international platform since the Russian invasion of Ukraine in February 2022.",
      "The summit has been attended by the nine Brics members including the Indian prime minister, Narendra Modi, the Chinese premier and the president of South Africa, Cyril Ramaphosa.",
      "The UN secretary general, António Guterres, also arrived late on Monday with criticism from Ukraine ringing in his ears for finding time to fly from New York to meet a Russian leader for whom an arrest warrant has been issued by the international criminal court.",
      "Ukraine complained that Guterres refused to attend the Ukraine peace conference in July.",
      "Guterres’s spokesperson insisted that he would not retreat from any of his longstanding positions on the illegality of the Russian invasion of Ukraine, and would make that clear in his public as well as private remarks.",
      "The spokesperson added special provisions applied to allow the UN secretary general to meet world leaders that are subject to arrest warrants.",
      "The final summit communique will contain a single reference to a joint Brazil-China peace plan for Ukraine, saving its strongest language for a condemnation of Israel in Gaza.",
      "The Ukrainian president, Volodymyr Zelenskyy, has already rejected the Brazilian alternative to Ukraine’s own peace plan saying its “half-hearted settlement plans, so-called sets of principles” would only give Moscow the political space to continue the war.",
      "Modi was probably the most direct of world leaders saying he wanted peace in Ukraine, while Xi discussed the war in a private session with Putin.",
      "Putin has said that Moscow will not hand back the four regions of eastern Ukraine that it says are now part of Russia.",
      "“The Brics summit, which Russia planned to use to split the world, has once again demonstrated that the world majority remains on the side of Ukraine in its quest to guarantee a comprehensive, just and sustainable peace,” the Ukrainian foreign ministry said in a statement.",
      "The future purpose and size of the Brics summit – now in its 16th year - also proved controversial, with Putin saying it would be wrong to ignore the unprecedented interest in global south countries wishing to join the organisation, and keeping the organisation effective.",
      "Brazil in alliance with India has been trying to prevent Brics, already expanded from five to nine members at last year’s Brics summit in South Africa, being reshaped simply into an anti-western alliance that acts as a cheerleader for Russia and China.",
      "Speaking by video link the Brazilian president, Luiz Inácio Lula da Silva, said: “Many insist on dividing the world into friends and enemies.",
      "But the most vulnerable are not interested in simplistic dichotomies; what they want is plenty of food, decent work and quality universally accessible public schools and hospitals.” Nations to be admitted were only agreed after Brazil successfully held out a veto against Venezuela.",
      "The new members, a diverse geographical and political group, are expected to be Cuba, Bolivia, Thailand, Vietnam, Malaysia, Indonesia, Belarus, Turkey, Nigeria, Uganda, Kazakhstan and Uzbekistan.",
      "The decision by Turkey, a member of Nato, to attend has raised eyebrows.",
      "Agathe Demarais, a sanctions specialist at the European Council of Foreign Relations, said: “At this stage it is hard to imagine a widespread development and adoption of Brics financial tools globally.",
      "The US dollar’s domination of the global currency landscape is entrenched, both for trade transactions and foreign exchange reserves; more than 80% of global trade transactions are invoiced in US dollars, which also accounts for nearly 60% of central banks reserves."
    ],
    "topics": [
      "brics summit",
      "world economy",
      "summit communique",
      "payment system",
      "putin said",
      "russia china",
      "brics members",
      "russian invasion",
      "invasion ukraine",
      "south africa"
    ]
  },
  {
    "title": "'Global South' interested in joining BRICS - as it's 'tone deaf' to anti-Russia rhetoric",
    "source": "Sky News",
    "url": "https://news.sky.com/story/global-south-interested-in-joining-brics-as-its-tone-deaf-to-anti-russia-rhetoric-13238956",
    "publishedAt": "2024-10-22T18:47:00Z",
    "sentences": [
      "The message from the Kremlin is loud and clear - the West's efforts to isolate Russia have not worked.",
      "Instead of losing friends, Moscow has made them.",
      "Moscow correspondent @IvorBennett Wednesday 23 October 2024 07:36, UK For Vladimir Putin, the optics could not be better.",
      "More than two and a half years into his war in Ukraine, he is shaking hands this week with not just one world leader, or two, but more than 20.",
      "China's Xi Jinping, India's Prime Minister Narendra Modi, the new Iranian President Masoud Pezeshkian…there's even Turkey's Recep Tayyip Erdogan, the leader of a NATO member state and EU candidate country.",
      "They have all come to the Russian city of Kazan for the BRICS summit of emerging economies.",
      "As you might expect, the Russian president was positively beaming as he sat down with various heads of state for a string of one-on-one meetings.",
      "The message from the Kremlin is loud and clear - the West's efforts to isolate Russia have not worked.",
      "Instead of losing friends, Moscow has made them.",
      "Read more from Sky News:Millions of Sudanese displaced by war now face a new fightMystery tar balls wash up on Sydney beaches forcing seven to close Six Bulgarians who ran Russian spy ring out of guesthouse on east of coast of England jailed Ukraine, Gaza and China: Why Trump's Middle East tour takes on new importance Zelenskyy offers to meet Putin in Turkey - as Trump urges Ukraine to hold talks with Russia \"It shows something about the weakness of the sanctions regime,\" Mark Galeotti, principal director of Mayak Intelligence, told Sky News.",
      "\"There was a lot of exaggerated sense as to how the West could put a stranglehold on Russia, and many countries are, frankly, not willing to play those games.",
      "\"It highlights the degree to which in this incredibly complex, multi-connected, modern world, it's very hard to actually isolate any country, especially one as large and as engaged in global commerce as Russia.\"",
      "The first BRIC summit was in 2009, involving Brazil, Russia, India and China.",
      "South Africa joined in 2010 to add the S on the end of the acronym.",
      "For much of the last decade and a half, the group has been dismissed by economists as an alphabet soup of countries - too spread out and fundamentally different from one another to form any meaningful alliance.",
      "But in the last few years, it has grown more significant and seemingly influential.",
      "'A powerful platform' The group has expanded its membership to include Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "Saudi Arabia has also been invited to join, and according to Russia, there are dozens of other countries that want to become part of the club.",
      "That's despite Russia's full-scale invasion of Ukraine, and the West's attempts to cast Mr Putin as a war criminal.",
      "\"A lot of countries in the Global South are really tone deaf to rhetoric about Russia breaking the rules,\" Alexander Gabuev, director of the Carnegie Russia Eurasia Center, told Sky News.",
      "News correspondent For China, the BRICS conference is another opportunity to show the West that when it comes to its multi-polar vision of the world it's not alone.",
      "Chinese President Xi Jinping and Russia's President Vladimir Putin are united in actively challenging the US-led international order.",
      "One of the key moments of this BRICS will be a handshake between these leaders.",
      "Behind it though the international temperature is high.",
      "The US has imposed sanctions on two China-based companies and their alleged Russian business partners, accusing them of supplying complete weapons systems to Russia for its war in Ukraine.",
      "Previously China was accused of sending dual-use items like machinery tools and semiconductors to Russia, but not complete weapons.",
      "The US Treasury Department said China and Russia had collaborated to produce Moscow's 'Garpiya series' of long-range unmanned aerial vehicles.",
      "There are two dozen countries with emerging economies also attending the BRICS summit who are not yet members.",
      "Clearly interest from countries in the \"global south\" is strong.",
      "But for many of them it's not about choosing the West or China.",
      "It’s about having options in an increasingly complicated and fragmented world.",
      "\"All the questions 'what about Iraq?'",
      "are not driven by Russian propaganda points but by genuine concern about the US abusing its role as the most powerful country.",
      "\"They realise that the current international order underwritten by the US doesn't really deliver for them and they don't know what the alternative is but BRICS is really a powerful platform where these issues can be discussed.\"",
      "Top of the agenda this week is an alternative platform for international payments, which Mr Putin hopes will end the dominance of the dollar and make the BRICS economies immune to Western sanctions.",
      "Be the first to get Breaking News Install the Sky News app for free Because despite all the talk of sanctions not having the desired effect, they have caused Russia problems.",
      "It's been cut off from international markets, and more recently, the country's had difficulties with cross-border trade, even with friendly countries like China, because it's linked to the dollar and there's a threat of secondary sanctions by the US.",
      "An entirely new system, not involving the dollar, would bypass those issues.",
      "But it's unlikely to come to fruition this week.",
      "For one, the idea is still in its infancy.",
      "What's more, not all the BRICS members, like India and Brazil, share Mr Putin's anti-Western sentiment.",
      "Keep up with all the latest news from the UK and around the world by following Sky News \"There is concern among these countries about how close you want to move towards Russia or an agenda that's seen as enabling this horrible war from Russia in Ukraine,\" Mr Gabuev said.",
      "Brazil and India are not alone.",
      "Saudi Arabia and Turkey also share strong ties with the West.",
      "Their presence in Kazan can be seen more as an attempt to play both sides, rather than overt support of Russia.",
      "But that does not seem to matter to the residents of Kazan.",
      "Most people we have spoken to here view the summit as the Kremlin intends.",
      "\"This is a wonderful event,\" Alexandra told us.",
      "\"I think that this will be a breakthrough and that the world has become multipolar.\"",
      "Alexei is another who is proud of his president.",
      "\"He is looking in all directions and it's bearing fruit,\" he said.",
      "\"If someone thinks we're isolated, it is probably only their problem.\"",
      "Not everyone shares that opinion, though.",
      "Favaris points to Russia's closer ties with North Korea: \"If you are friends with an outcast, then you have fallen lower than ever.\""
    ],
    "topics": [
      "sky news",
      "mr putin",
      "message kremlin",
      "kremlin loud",
      "loud clear",
      "clear west",
      "west efforts",
      "efforts isolate",
      "isolate russia",
      "russia worked"
    ]
  },
  {
    "title": "Putin plays host to 36 world leaders at Brics summit in Russia",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2024/oct/22/putin-brics-summit-russia-china-india-iran-kazan",
    "publishedAt": "2024-10-22T13:51:09Z",
    "sentences": [
      "West infuriated as UN secretary general accepts invitation to meeting of countries including China, India and Iran Vladimir Putin, ostracised by the west and labelled a possible war criminal by the international criminal court, has played host to 36 world leaders from nations including China, India and Iran as part of a summit of the Brics group designed to display Moscow as anything but isolated.",
      "One of the main aims of the summit will be to speed up ways to reduce the number of dollar transactions, and so mitigate the US ability to use the threat of sanctions to seek to impose its political will.",
      "The spokesperson for the UN secretary general confirmed António Guterres would attend the summit as he did last year.",
      "His decision infuriated many in the west, including the Ukrainian foreign ministry, since the international criminal court issued warrants for Putin’s arrest in March 2023 over the abduction of children.",
      "The UN said Guterres would repeat his view that the invasion of Ukraine is in breach of the UN charter.",
      "Moscow said the representatives from 36 countries were attending parts of the three-day meeting, making it the largest international gathering hosted by Putin since he ordered the full-scale invasion of Ukraine in February 2022.",
      "Russia is this year’s chair of the group.",
      "The Chinese president, Xi Jinping, greeted Putin in Kazan as his dear friend, praising the “profound” friendship between the two countries.",
      "He said: “The world is undergoing profound changes unseen in a century, and the international situation is chaotic and intertwined.” China-Russia ties have “injected strong impetus into the development, revitalisation and modernisation of the two countries,” the Chinese leader said.",
      "Putin said he wanted to strengthen ties with China to bring greater global stability.",
      "“We intend to further increase coordination in all multilateral platforms to ensure global security and a just world order,” he told Xi.",
      "The Indian prime minister, Narendra Modi, said he wanted the Ukraine conflict resolved quickly and peacefully.",
      "Modi visited Kyiv in August and Moscow in July in an effort to encourage talks, casting Delhi as a potential peacemaker, but there have been few developments since.",
      "Cyril Ramaphosa, the South African president, who has also sought to play the role of mediator in the conflict, praised Moscow as a “valued ally” and friend “who supported us from the very beginning in the fight against apartheid”.",
      "Putin, speaking on Tuesday with the president of the Brics New Development Bank, Dilma Rousseff, said the use of local currencies instead of the dollar or euro “helps to keep economic development free from politics as far as possible in the context of today’s world”.",
      "Russia claims the group now represents the global majority that can make up a substantial element of a coming new global order.",
      "The Brics group has already expanded from its five members – South Africa, Russia, China, Brazil and India – to a broader group including Egypt, the United Arab Emirates.",
      "Ethiopia and Iran.",
      "Argentina applied and then withdrew after its presidential elections.",
      "Egypt’s president, Abdelfattah al-Sisi, hailed Russian support for Egypt’s economic projects when he met Putin.",
      "Chief among them, Sisi said, was Egypt’s first nuclear power plant at El-Dabaa on the Mediterranean coast, built by Russia’s state atomic energy corporation Rosatom.",
      "New applicants, often known as hedging states, that are in various stages of seeking membership include Turkey and Saudi Arabia.",
      "Others due to attend the event, apart from the wavering Guterres, include the Palestinian president, Mahmoud Abbas, as well as leaders from Algeria, Azerbaijan, Belarus, Indonesia and Mexico.",
      "Masoud Pezeshkian, the Iranian president, said on the way to the summit in Kazan: “Brics can be a way out of American totalitarianism and create a path of multilateralism.",
      "Brics can be a solution to deal with the dominance of the dollar and deal with the economic sanctions of countries.” But with expansion of Brics membership comes the risk of a loss of clear ideological cohesion.",
      "Sign up to Global Dispatch Get a different world view with a roundup of the best news, features and pictures, curated by our global development team after newsletter promotion India and Brazil share some of the desire to be freed of the dollar’s dominance, but not to the same extent as China or Russia.",
      "Despite the anti-western language in summit communiques, Brazil’s president, Luiz Inácio Lula da Silva, for instance, has insisted that Brics is “not against anyone”.",
      "Brazil is advising against Venezuela being admitted to the group as part of an effort to prevent the alliance becoming purely anti-western.",
      "Venezuelan president Nicolas Maduro made a previously unannounced arrival.",
      "He was quoted by Russian news agencies as calling the group “the epicentre of the new multi-polar world”.",
      "Alex Gabuev, director of the Carnegie Russia Eurasia Centre in Berlin, said overall the Brics summit was already a gift to Putin.",
      "Writing in Foreign Affairs, he said the message of the gathering will be: “Not only is [Russia] far from being an international pariah but also is now a pivotal member of a dynamic group that will shape the future of the international order.",
      "That message is not mere rhetorical posturing, nor is it simply a testament to the Kremlin’s skilful diplomacy with non-western countries or to those countries’ self-interested, pragmatic engagement with Russia.” Putin was unable to risk attending the last Brics summit in Johannesburg because he did not want to embarrass his hosts, who would have been obliged to arrest him on the ICC warrant since South Africa is a signatory to the Rome Statute.",
      "The Russian president may be hoping more generally that world events are swinging in his direction, with the possible return of Donald Trump to the White House next month and the possibility of favourable result in the elections in Georgia this weekend.",
      "The future of the Ukraine conflict in the short term rests on Trump’s election, but even if he loses, war fatigue in Europe is leading all sides to conclude that Ukraine will at least have to open talks with Putin while Russian troops still occupy a large part of eastern Ukraine.",
      "A decision by Guterres to attend the summit would have international consequences.",
      "In 2014, Brazil, China, India and South Africa abstained from voting on a UN general assembly resolution in support of Ukraine’s territorial integrity after Russia’s annexation of Crimea.",
      "Their unity was diluted after Russia’s invasion of Ukraine in 2022, where India, China and South Africa abstained, and Brazil condemned Russia’s actions.",
      "But the Brics+ founding purpose is not security but a means to develop economic and tech platforms that are immune to US pressure and sanctions, in part by circumventing the dollar and pushing the internationalisation of the yuan.",
      "Despite Brics+ group having a larger combined GDP than either the G7 or the EU, its capital share and subsequent voting influence within institutions such as the International Bank for Reconstruction and Development (IBRD) remains significantly smaller, because each member country’s voting power is weighted on the basis of its financial contribution to the World Bank."
    ],
    "topics": [
      "south africa",
      "china india",
      "invasion ukraine",
      "un secretary",
      "secretary general",
      "including china",
      "india iran",
      "international criminal",
      "criminal court",
      "brics group"
    ]
  },
  {
    "title": "Brazil president Lula cancels Brics trip to Russia after ‘small brain haemorrhage’ from fall",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2024/oct/21/brazil-president-luiz-inacio-lula-da-silva-fall-russia-trip-brics",
    "publishedAt": "2024-10-21T00:40:01Z",
    "sentences": [
      "Doctors say president sustained ‘great’ trauma to head and slight brain bleed, with long-haul travel cancelled as a precaution but is otherwise fit for duty The Brazilian president, Luiz Inácio Lula da Silva, on Sunday cancelled his trip to Russia for the Brics summit after a fall at home caused a minor brain haemorrhage.",
      "In a statement, the presidential office said Lula, 78, would participate via videoconference after receiving medical advice to temporarily avoid long-haul flights.",
      "He was initially scheduled to depart at 5pm on Sunday.",
      "Lula’s doctor, Roberto Kalil, said in an interview with GloboNews TV channel that the president had a fall that caused “great” trauma to the back of his head, requiring stitches and resulting in a “small brain haemorrhage” in the temporal-frontal region.",
      "“It’s a condition that will require repeat tests throughout the week.",
      "Any brain haemorrhage, theoretically, can worsen in the following days, so observation is important,” Kalil said, adding that Lula was doing well and could engage in normal activities.",
      "According to a medical report issued earlier on Sunday by the Sirio Libanes hospital in Brasília, Lula suffered a laceration to the “occipital region” of the back of his head on Saturday.",
      "The report said Lula “was advised to avoid long-distance air travel but is otherwise able to carry out his regular duties”.",
      "The government announced that Mauro Vieira, the foreign minister, was designated to lead the Brazilian delegation to the Brics summit, departing on Sunday.",
      "Gleisi Hoffmann, a congresswoman and president of Lula’s Workers party, said she had spoken with the president and that “he is doing very well, just avoiding a long trip”."
    ],
    "topics": [
      "brain haemorrhage",
      "great trauma",
      "brics summit",
      "said lula",
      "kalil said",
      "back head",
      "doctors say",
      "say president",
      "president sustained",
      "sustained great"
    ]
  },
  {
    "title": "Milei says Argentina will not be joining Brics bloc in U-turn",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/dec/29/milei-argentina-brics-bloc",
    "publishedAt": "2023-12-29T19:23:59Z",
    "sentences": [
      "Far-right president says not ‘opportune’ for Argentina – which had been set to become a member on 1 January – to be part of alliance Argentina has formally announced that it will not join the Brics bloc of developing economies, the latest in a dramatic shift in foreign and economic policy by Argentina’s new far-right populist president, Javier Milei.",
      "In a letter addressed to the leaders of Brazil, Russia, India, China and South Africa – all members of the alliance – Milei said the moment was not “opportune” for Argentina to join as a full member.",
      "The letter was dated a week ago, 22 December, but released by the Argentinian government on Friday, the last working day of 2023.",
      "Argentina was among six countries invited in August to join the bloc – made up of Brazil, Russia, India, China and South Africa to make an 11-nation bloc – and had been set to become a member on 1 January 2024.",
      "The move comes as Argentina has been left reeling by deepening economic crisis.",
      "Milei’s predecessor, the former center-left president Alberto Fernández, endorsed joining the alliance as an opportunity to reach new markets.",
      "The Brics currently account for about 40% of the world’s population and more than a quarter of the world’s GDP.",
      "But economic turmoil left many in Argentina eager for change, ushering the chainsaw-wielding political outsider Milei into the presidency.",
      "Milei, who defines himself as an “anarcho-capitalist” – a current within liberalism that aspires to eliminate the state – has implemented a series of measures to deregulate the economy, which in recent decades has been marked by strong state interventionism.",
      "In foreign policy, he has proclaimed full alignment with the “free nations of the west” – especially the United States and Israel.",
      "Throughout the campaign for the presidency, Milei also disparaged countries ruled “by communism” and announced that he would not maintain diplomatic relations with them despite growing Chinese investment in South America.",
      "However, in the letter addressed to his counterpart Luiz Inácio Lula da Silva in neighboring Brazil and the rest of the leaders of full Brics members – Xi Jinping of China, Narendra Modi of India, Vladimir Putin of Russia and Cyril Ramaphosa of South Africa – Milei proposed to “intensify bilateral ties” and increase “trade and investment flows”.",
      "Milei also expressed his readiness to hold meetings with each of the five leaders."
    ],
    "topics": [
      "south africa",
      "opportune argentina",
      "set become",
      "become member",
      "member 1",
      "1 january",
      "letter addressed",
      "brazil russia",
      "russia india",
      "india china"
    ]
  },
  {
    "title": "US has wrecked chances of peace in Middle East, Putin tells Brics summit",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/nov/21/us-has-wrecked-chances-of-peace-in-middle-east-putin-tells-brics-summit",
    "publishedAt": "2023-11-21T18:24:03Z",
    "sentences": [
      "Russian president blames US for Gaza conflict as he attempts to woo global south US unilateralism has wrecked the chances of peace in the Middle East, Vladimir Putin, the Russian president, told a crisis Brics meeting on Gaza as he attempted to woo leaders of the global south.",
      "The virtual meeting of 11 nations, convened by South Africa’s president, Cyril Ramaphosa, came as Arab foreign ministers toured capitals to drum up support for a fresh UN security council resolution mandating Israel to introduce a full ceasefire and end what they say are breaches of international humanitarian law.",
      "The moves are the latest sign of a revolt brewing among global south nations about US double standards in refusing to do more to stop the Israeli bombardment of Gaza, which so far has claimed more than 13,000 civilian lives, according to the Palestinian health ministry.",
      "The UN security council last week made a call, not amounting to an instruction, for Israel to accept humanitarian pauses, but the Arab foreign ministers want a firmer resolution and are prepared to challenge the US not to use its veto to protect Israel.",
      "It was notable that the Arab foreign ministers, including those not allied to Iran, chose to travel first to China and Moscow to enlist their support.",
      "Putin told the Brics meeting that the US was undermining the chances of peace by trying to monopolise diplomacy in its own self-interest.",
      "He said that “the deaths of thousands of people, the mass displacement of civilians and the humanitarian catastrophe that has unfolded are deeply disturbing”.",
      "He added: “Due to the sabotage of UN efforts, more than one generation of Palestinians are being brought up with a sense of unfairness to their state while the Israeli people cannot fully guarantee their own security.” Putin accused the US of sidelining other members of the Middle East Quartet – a group seeking to navigate the Israeli-Palestinian peace process that also includes Russia, the UN, and the EU.",
      "Washington had attempted to “monopolise the role of the mediator” while blocking the efforts of other international actors, he said.",
      "“History has vividly demonstrated that attempts to single-handedly cut the Palestinian knot are not viable and counterproductive.” Other countries attending the meeting include Brazil, India, China, Iran, Saudi Arabia and the United Arab Emirates, reflecting how the expanded Brics group is now a strong rival to the western G7 group of leading industrialised nations.",
      "The Chinese president, Xi Jinping, added his voice to the call for a ceasefire in Gaza, telling the summit: “All parties in the conflicts should immediately cease fire and hostilities, stop all violence and attacks targeting civilians, and release civilian detainees to avoid more loss of lives and suffering.” Xi said: “The root cause of the Palestinian-Israeli situation is the fact that the right of the Palestinian people to statehood, their right to existence, and their right of return have long been ignored.” However, the eventual joint statement was relatively mild and called only for Israel to comply with international humanitarian law and accept “full, immediate, safe, unhindered and sustained humanitarian access”.",
      "It also warned Israel not to attempt to displace Palestinans from Gaza.",
      "The Biden administration has been repeatedly told, including by its own diplomats, that it risks losing the support of the global south nations.",
      "Many of them accuse the US of double standards in condemning Russian war crimes in Ukraine while remaining largely silent on Israel’s actions in Gaza.",
      "Opening the Brics meeting, Ramaphosa accused Israel of committing war crimes that were tantamount to genocide and collective punishment.",
      "“The collective punishment of Palestinian civilians through the unlawful use of force by Israel is a war crime,” Ramaphosa said.",
      "“The deliberate denial of medicine, fuel, food and water to the residents of Gaza is tantamount to genocide.” Iran’s president, Ebrahim Raisi, called on the security council to adopt a binding resolution in the UN general assembly to stop attacks on Gaza and to label Israel as a terrorist regime and its army as a terrorist organisation.",
      "He called for the US to be held to account and urged the world to recognise the right of Palestinians to self-defence, a phrase that would absolve Hamas for its October attacks on Israel.",
      "Mohammed bin Salman, the Saudi crown prince, criticised the killing of innocent civilians and the destruction of health facilities and places of worship.",
      "The Indian prime minister, Narenda Modi, did not attend.",
      "The Brics meeting comes before a virtual meeting on Wednesday of the wider G20 group of nations, convened by India, that will be attended by Putin.",
      "The delegation of Arab diplomats is being led by a group appointed by the Organisation of Islamic Cooperation, including the foreign ministers of Jordan, Egypt, Indonesia, Saudi Arabia, Palestine and the secretary general of the Arab League.",
      "They visited the Chinese foreign minister, Wang Yi, in Beijing on Monday, before travelling to Moscow to meet the Russian foreign minister, Sergei Lavrov.",
      "The delegation is expected also to visit France and the UK this week.",
      "The Egyptian foreign ministry said the diplomats had “drafted a new resolution to be submitted to the security council by the Arab and Islamic groups, to deal with existing obstacles and imbalances of humanitarian aid entry to Gaza”.",
      "Egypt’s foreign ministry said it remained convinced that the “continued bombing targeting displaced people in the south had a clear objective, and that was to force Gaza’s residents to leave the strip.",
      "Egypt has clearly declared its utter rejection of any attempt to enforce displacement of Palestinians.”"
    ],
    "topics": [
      "global south",
      "brics meeting",
      "foreign ministers",
      "security council",
      "arab foreign",
      "russian president",
      "chances peace",
      "middle east",
      "virtual meeting",
      "nations convened"
    ]
  },
  {
    "title": "Will the dollar keep its global dominance? The US needs to get its act together",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2023/sep/11/us-dollar-global-dominance-us-russia-china-brics",
    "publishedAt": "2023-09-11T13:10:43Z",
    "sentences": [
      "The American position depends not only on relations with Russia, China and the Brics countries, but on fixing its own economic and political problems Is the dollar poised to lose its dominance of global economic and financial transactions?",
      "Many commentators apparently think so.",
      "Russia obviously hopes they are right, given that it has been shut out of the US banking system and suspended from the Society for Worldwide Interbank Financial Telecommunication (Swift).",
      "China evidently wants to help the process along by encouraging countries to undertake transactions in yuan.",
      "And the Brazilian president, Luiz Inácio Lula da Silva, has called for the Brics countries (Brazil, Russia, India, China and South Africa) to create a common currency as an alternative to the dollar.",
      "Russia’s shift away from the dollar, which got under way after its illegal annexation of Crimea in 2014, was prompted by the fear – and then the fact – of US sanctions.",
      "More than a few commentators have since warned that other countries, witnessing US “weaponisation” of the dollar, will follow the Kremlin’s example.",
      "China’s yuan internationalisation campaign reflects not only tensions with the US but also a desire to project power internationally, with the drive for economic and financial self-sufficiency reflected in other aspects of Chinese policy as well.",
      "The dollar’s singular pre-eminence, in this view, is unlikely to survive a world dominated by two large economies at loggerheads, only one of which benefits from the dollar’s “exorbitant privilege”.",
      "Similarly, Lula’s common currency campaign reflects the view that the rising power and influence of the Brics can no longer be denied, and that they deserve a seat at the top monetary table, whether the US agrees or not.",
      "So, do these global geopolitical developments augur the end of dollar dominance?",
      "History – at least 20th-century history – suggests not.",
      "To be sure, this history confirms that international currency status can be lost.",
      "But whether that happens depends on the actions of the issuing country, not simply on geopolitical circumstances beyond its control.",
      "To a significant extent, the 20th-century history of global currency status is a history of the British pound sterling, the leading global currency of the preceding century.",
      "Britain emerged from the first world war economically and financially weakened.",
      "It had lost skilled manpower, sold off assets to finance the war effort and faced intense competition from other economies.",
      "Importantly, Britain had incurred a public debt on the order of 130% of GDP, which was six times prewar levels.",
      "That raised questions about whether the country would maintain the value of its obligations or, alternatively, inflate them away, as Germany, France and Italy eventually did.",
      "Yet even though the dollar had emerged as a competitor by the early 1920s, sterling’s international status was successfully maintained.",
      "A decision was taken by the then chancellor of the exchequer, Winston Churchill, with broad support from the political class, to focus on this objective.",
      "Prices were pushed back down toward prewar levels, permitting earlier exchange rates against gold and the dollar to be restored.",
      "Painful steps were considered, and in some cases taken, to limit public spending.",
      "These policies came at a cost to British competitiveness and hence to output and employment.",
      "But this sacrifice was accepted in the interest of reestablishing sterling’s role in the global economy – a goal that financial leaders regarded as being in their self-interest, and that imperialists saw as necessary for maintaining Britain’s geopolitical reach.",
      "As a result, the currency’s international role survived even the turbulent 1930s, when it remained the pivot of the sterling area, the British-led currency zone.",
      "The UK emerged from the second world war even more heavily indebted.",
      "In addition, it now had an overriding commitment to full employment, implying very different policies toward sterling.",
      "The currency was devalued in 1949 in an effort to reconcile demand stimulus and full employment with external balance.",
      "The disorderly liquidation of sterling balances by other central banks and governments was prevented with exchange controls and commercial threats.",
      "Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion Such measures were antithetical to international currency status.",
      "Contrary to the textbook view of ongoing competition between sterling and the dollar, scholars such as Maylis Avaro show that the shift away from sterling was already well under way in the aftermath of second world war.",
      "At this point, geopolitics intervened.",
      "When the UK participated in an invasion of Egypt in 1956 to seize control of the Suez Canal and sterling crashed, Dwight Eisenhower’s administration refused to help until Britain withdrew its forces.",
      "This diminished sterling’s global stature once and for all.",
      "But these geopolitical events only validated a decline and fall that was already a fait accompli.",
      "The fundamental lesson, then, is that the issuer of an incumbent international currency has it within its power to defend or neglect that status.",
      "Thus, whether the dollar retains its global role will depend not simply on US relations with Russia, China or the Brics.",
      "Rather, it will hinge on whether the US brings its soaring debts under control, avoids another unproductive debt-ceiling showdown, and gets its economic and political act together more generally.",
      "Barry Eichengreen is professor of economics at the University of California, Berkeley, and a former senior policy adviser at the IMF.",
      "© Project Syndicate"
    ],
    "topics": [
      "international currency",
      "currency status",
      "world war",
      "relations russia",
      "russia china",
      "china brics",
      "brics countries",
      "economic political",
      "economic financial",
      "common currency"
    ]
  },
  {
    "title": "Could Brics Plus reshape the world economy?",
    "source": "New Statesman",
    "url": "https://www.newstatesman.com/spotlight/economic-growth/economic-policy/2023/09/brics-plus-reshape-world-economy",
    "publishedAt": "2023-09-01T11:30:02Z",
    "sentences": [
      "In 2001, when Chinese economic output was worth around $1.3trn (less than the UK’s GDP), the Goldman Sachs economist Jim O’Neill wrote a briefing note: Building Better Economic Brics.",
      "In it, he predicted the growing importance of emerging markets in Brazil, Russia, India and China (South Africa was added in later).",
      "Today, Chinese economic output is worth around $18trn, or about five and a half times the size of UK GDP.",
      "Now, as China’s economy slows, India is outpacing it with phenomenal rates of growth (around 7.8 per cent in this year’s April-June quarter).",
      "In 2009, the Brics went from being a handy acronym to a formal organisation.",
      "Last week, they announced the admission of six new members: Iran, Saudi Arabia, Egypt, Ethiopia, Argentina and the United Arab Emirates.",
      "The move was heralded as “historic” by the Chinese premier Xi Jinping.",
      "Some even declared it the beginnings of a “Brics world order”.",
      "O’Neill, for one, is unconvinced.",
      "Speaking to Spotlight‘s Green Transition newsletter, the former Treasury minister said: “I don’t think [the Brics] have really achieved much in their first 14 years as a political entity.” Nor is he optimistic about the expanded set of members: “I don’t really see the purpose beyond symbolism.” In the organisation’s joint declaration, the Brics+ (as it is now called) promised “multilateral cooperation” to ensure “a just, affordable and sustainable transition to a low carbon and low-emission economy”.",
      "Eyebrows were raised at the inclusion of Saudi Arabia and UAE in the new members’ list.",
      "The Brics+ now encompasses 45 per cent of the world’s oil production.",
      "There are few concrete policy proposals between the members – this isn’t a free-trade agreement like Nafta, or a transnational common currency bloc like the eurozone, nor is it a military alliance like Nato.",
      "There’s no cross-governmental agreement on topics such as climate change, either.",
      "The choice of new members is odd too, O’Neill adds, because they don’t share common characteristics other than wanting to join.",
      "But even the original members are less than united on many issues.",
      "“India and China rarely agree about anything,” says O’Neill.",
      "More appropriate candidates like Indonesia are biding their time before being seen to join what some are billing as an anti-Western alliance (a reputation enhanced by the inclusion of Iran as a new member, as well as the reluctance of the Brics to toe the Western line on the Ukraine conflict).",
      "“[The expansion] suggests that China and Russia had a bigger say on the choice of countries than India or Brazil,” O’Neill tells me.",
      "“Because if you look at the six [that have joined], arguably, there’s only one of them that’s a democracy.” But the Brics expansion does have consequences, even if they are symbolic.",
      "The US is consciously attempting to “decouple” its economy from China’s.",
      "O’Neill points me towards figures suggesting that “decoupling” is reducing trade with China while upping trade with third countries, which themselves are trading more with China.",
      "This makes the trade adjustment less a “decouple” and more of an increasingly polygamous arrangement.",
      "Part of that process began with Trump’s protectionist tariffs, but much is centred around the big-ticket industrial strategy policies of the Biden administration, including the Inflation Reduction Act.",
      "There’s just one problem: China currently controls the supply chain for key green industries that the Inflation Reduction Act subsidises in the billions of dollars.",
      "Research by the Centre for Strategic and International Studies shows that Beijing controls 53 per cent of the raw materials, 89 per cent of the components and 70 per cent of the production and manufacturing capacity for solar.",
      "For wind energy, its share is 54 per cent, 56 per cent, and 23 per cent, respectively.",
      "Its control over the lithium-ion battery market (essential for electric vehicles), has been estimated as high as 80 per cent, and the country is now the world’s number one electric vehicle exporter.",
      "If the Brics expansion is partly about sometimes oil-rich nations placing their bets with the Chinese, even if initially only symbolically, then they could do worse than siding with the principal technological and financing leader for the green transition.",
      "The group will likely continue trading in fossil fuels for as long as it sees fit – but when it comes to intensifying trade wars and geopolitical standoffs, it is less likely to side with the US hegemon than ever before.",
      "This article was originally published on the Green Transition newsletter.",
      "To see previous newsletters and subscribe, click here.",
      "[See also: The age of hyper-globalisation is ending] Related"
    ],
    "topics": [
      "per cent",
      "new members",
      "green transition",
      "chinese economic",
      "economic output",
      "output worth",
      "worth around",
      "uk gdp",
      "india china",
      "saudi arabia"
    ]
  },
  {
    "title": "Brazil: the world will not be the same after BRICS expansion, says president",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230830-brazil-the-world-will-not-be-the-same-after-brics-expansion-says-president/",
    "publishedAt": "2023-08-30T12:39:00Z",
    "sentences": [
      "August 30, 2023 at 12:39 pm Brazilian President Inacio Lula da Silva makes a speech during the 15th BRICS Summit in Johannesburg, South Africa on August 24, 2023 [Handout – BRICS – Anadolu Agency] Brazilian President Luiz Inacio Lula da Silva has said that the world with its different blocs and powers “will not be the same after the expansion of the BRICS group” during the recent South African summit.",
      "President da Silva, otherwise known simply as Lula, made his comment in a weekly video presenting the most prominent local developments, Anadolu has reported.",
      "He pointed out that BRICS has become more powerful and important after taking new members on board.",
      "South African President Cyril Ramaphosa announced last Thursday that BRICS had approved six new member states, including Egypt, Saudi Arabia and the UAE, bringing the total number of members to eleven.",
      "The other new members are Argentina, Ethiopia and Iran.",
      "This, said Lula, is going to change the world, especially with regard to economic discussions.",
      "He suggested that the group could even launch a common currency to facilitate trade between members.",
      "Such a common currency would be possible because the group doesn’t need to continue trading in US dollars.",
      "This was a point noted by Russian President Vladimir Putin twice during the South African summit.",
      "“The objective, irreversible process of ‘de-dollarisation’ of our economic ties is gaining momentum,” he said.",
      "READ: Egypt hopes BRICS entry will lure foreign cash, but analysts counsel patience"
    ],
    "topics": [
      "da silva",
      "south african",
      "brazilian president",
      "inacio lula",
      "lula da",
      "african summit",
      "new members",
      "common currency",
      "august 30",
      "30 2023"
    ]
  },
  {
    "title": "When the torturer is the ‘saviour’, can BRICS and the Global South help us to escape Western hegemony?",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230829-when-the-torturer-is-the-saviour-can-brics-and-the-global-south-help-us-to-escape-western-hegemony/",
    "publishedAt": "2023-08-29T14:55:00Z",
    "sentences": [
      "August 29, 2023 at 2:55 pm Leaders of BRICS countries pose a family photo at Sandton Convention Centre during the 15th BRICS Summit in Johannesburg, South Africa on August 24, 2023.",
      "[Iranian Presidency/Anadolu Agency] At the zenith of the mass protests in Egypt on 25 January 2011, Twitter, Facebook and other social media platforms based in the West appeared to be the most essential tools for the Egyptian Revolution.",
      "Although some observers later contested the descriptions “Twitter Revolution” or “Social Media Revolution”, one cannot deny the centrality of these platforms in the discussion around the events which attempted to redefine Egypt’s power structures.",
      "It was thus hardly surprising that, on 26 January 2011, the Egyptian regime decided to block access to social media in a desperate attempt to prevent the spread of the protests.",
      "Twitter, Google and other platforms, reported France24, responded quickly by establishing a system that allowed users to continue posting 140-character tweets despite the Internet shutdown in Egypt.",
      "It seemed that US-based technology companies were keen to see the removal of Hosni Mubarak and his regime.",
      "Indeed, their action was quite elaborate and well-coordinated: “The solution proposed by the two Internet giants is called ‘speak-to-tweet’ and allows people to publish updates on the famous microblogging site by leaving a message on a voice mailbox.",
      "The service is free of charge, with Google offering users three international telephone numbers,” explained France24, which published the actual numbers in the US, Italy and Bahrain.",
      "The irony is inescapable.",
      "How could these supposedly “revolutionary social media platforms” be part of the same Western structure that is dedicated to attacking and censoring Washington’s enemies, while elevating America’s often corrupt allies?",
      "While some choose to overlook the obvious dichotomy, we cannot all be so gullible.",
      "This becomes yet more intriguing when we consider the war against Palestinian and pro-Palestine views on the very same social media platforms.",
      "While pro-Palestine activists are frequently banned, blocked and censored for rejecting Israel’s military occupation and apartheid in the occupied land, Israeli propaganda is allowed to flourish on social media, with little interference.",
      "This is not just a social media phenomenon.",
      "READ: Egypt hopes BRICS entry will lure foreign cash, but analysts counsel patience The fact is that social media companies’ attitude towards the upheaval in the Arab world was consistent with the general zeitgeist of the US; in fact, of Western societies, governments, mainstream media and even public opinion polls.",
      "While some — in fact, many — people may have been genuine in wanting to support a popular push for democracy in the Middle East, governments and their media allies knew that by appearing to be on the “right side of history” they would get the geopolitical spaces to influence the agendas and, ultimately, outcomes of the Arab revolutions.",
      "Libya paid the heaviest price of that self-serving Western crusade.",
      "However, when the revolutions largely failed to create the major paradigm shift that the Arab masses coveted, Western governments were the first to reincorporate the post-revolt Arab regimes back into the embrace of the so-called international community.",
      "For Washington and its Western allies, the entire exercise had little to do with democracy, human rights and representation, and everything to do with new opportunities, geopolitics and regional relevance.",
      "By supporting the revolts, the West wanted to ensure that the resulting political discourse in the Middle East was simply not anti-Western.",
      "And, sadly, they partly succeeded, at least in creating a separation between corrupt regimes and the colonial powers that had sustained their corruption.",
      "Although some laboured to articulate a discourse that connected those who carried out the oppression — Mubarak, for example — and those who made the oppression possible in the first place — his Western allies — these attempts received little traction when compared with the mainstream Western-driven discourse.",
      "Indeed, the anti-colonial discourse was not allowed to taint what the West wanted to paint as purely “pro-democracy” rhetoric with no political or historical context beyond the simplified version of “the Arab Spring”.",
      "This is precisely why the New York Times, Twitter and the White House — and numerous other Western parties — ultimately parroted the same political line and accentuated the same language, while suppressing all other possible interpretations.",
      "BRICS: Global aims or a new scramble for Africa?",
      "Since then, the political discourse in the Middle East has been rife with contradictions.",
      "For example, some of those who rejected the US war and genocide in Iraq in 2003 later joined the chorus of interventionists in Syria in the post-2011 uprising-turned-civil war.",
      "Moreover, not a day passes without the US and other Western governments being called on by an Arab human rights group or civil rights organisation to put pressure on this or that regime to release political prisoners, or to ask them to withhold aid, and so on.",
      "Bizarrely, Washington became the guarantor of war and peace, chaos and stability in the Middle East.",
      "The unrepentant violator of our human rights is, at least for some of us, our human rights champion.",
      "This is more than a simple case of unfortunate contradictions.",
      "It was done by design.",
      "Sadly, Arab revolts were largely suppressed.",
      "The old regimes reinvented themselves and are now back in business.",
      "Yet again, they have the direct support of, and funding from, Western governments.",
      "Is a different path possible?",
      "Or are we simply trapped forever in this conundrum?",
      "We reflected on all of this during the BRICS conference in Johannesburg on 22-24 August.",
      "Without downplaying the internal contradictions among the main countries that established the BRICS group — Brazil, Russia, India, China and, later, South Africa — or the newcomers — Iran, Saudi Arabia, Egypt, Argentina, the UAE and Ethiopia — one cannot help but ponder a world without US-Western domination.",
      "For the first time since the collapse of the Soviet Union and the dismantling of the Warsaw Pact, there seems to be a real global political momentum of actual worth that does not emanate from the West and its regional lackeys and representatives.",
      "Without a viable alternative for change, we have been trapped in these seemingly inescapable contradictions for decades, criticising Western colonialism, neo-colonialism and imperialism, while appealing to the moral values of the West.",
      "We continue to call for the respect of international law, although we are fully aware about why and how “international laws” were designed and are interpreted and enforced.",
      "In short, we want the West to leave us alone, while beseeching the West to come to our rescue.",
      "We suffer the consequences of Western wars, and yet flee to the West as desperate refugees.",
      "We have experienced this dichotomy numerous times in Iraq, Syria, Afghanistan and every part of the Middle East; in fact, across the Global South.",
      "In truth, the contradiction is hardly Western, it is entirely ours.",
      "The “West” has rarely attempted to present itself as anything but a political mass that is motivated solely by economic, geopolitical and strategic interests.",
      "Its use of human rights, democracy and so on is but a continuation of an old colonial legacy that has served it for hundreds of years.",
      "The target audience for such double-speak has never truly been the colonised masses, but the colonial entities themselves.",
      "What’s more, there is actually no historical basis or evidence for claims that the West has changed, is changing or is capable of change.",
      "The case of Palestine remains the most powerful example of Western hypocrisy and our own gullibility.",
      "Without the West, Israel would have never been established.",
      "And without Western support and protection, Israel would not still exist as a military power and apartheid regime.",
      "Over a hundred years after the British promised Palestine to the Zionists; after 75 years of Israeli conquest and violence; and after more than fifty years of Israeli military occupation of East Jerusalem, the West Bank and Gaza, the West remains Israel’s greatest supporter and benefactor.",
      "These very recent headlines should illustrate our point: This is all taking place as Israel has become a full-blown apartheid regime, and when Israeli war crimes in the West Bank are at their worst, at least since 2005, and there are no signs of things improving for the Palestinians in any way whatsoever.",
      "Israel is now ruled by a government coalition whose ministers openly deny the very existence of the Palestinians, and are calling repeatedly for genocide and religious war against them.",
      "Meanwhile, the West is still financing, protecting and defending the racist, apartheid entity against the mere possibility of legal accountability.",
      "And mainstream Western media and most social media platforms continue to censor Palestinian voices, as if the Palestinian quest for justice is unworthy and, in fact, offensive to Western sensibilities.",
      "In the final analysis, neither BRICS alone, nor any other economic or political body, will save us from our own contradictions.",
      "The new political formations in the Global South, however, should serve as a starting point for confronting our dichotomy, at least through the realisation that a whole world full of potential allies and new ideas extends beyond the confines of Washington and Brussels.",
      "The scramble for the Global South: Foreign domination or self-sufficiency?",
      "In the Global South, we must explore these new margins and possibilities, and move forward towards real, substantive and sustainable change.",
      "Imploring the West to help us cannot be our strategy, because history has taught us, time and again, that our torturers cannot also be our saviours.",
      "The views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Monitor."
    ],
    "topics": [
      "social media",
      "middle east",
      "human rights",
      "media platforms",
      "global south",
      "western governments",
      "south africa",
      "january 2011",
      "military occupation",
      "western allies"
    ]
  },
  {
    "title": "The Guardian view on Brics: demand for membership is a symptom of global disorder",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/commentisfree/2023/aug/28/the-guardian-view-on-brics-demand-for-membership-is-a-symptom-of-global-disorder",
    "publishedAt": "2023-08-28T18:09:37Z",
    "sentences": [
      "As the world grows more fractured, developing countries are looking for new coalitions to stay out of a possible cold war The last decade of annual summits held by Brazil, Russia, India, China and South Africa (Brics) has rarely merited much attention beyond their own capitals.",
      "But last week’s conference in Johannesburg, South Africa, is likely to be remembered as a turning point in modern history – with six large nations joining the current five members.",
      "A few dozen more states wish to sign up.",
      "But the club’s popularity is not a sign that an anti-western bloc is coalescing.",
      "“Brics-11” contains two US allies: Saudi Arabia and the United Arab Emirates.",
      "Rather, demand for Brics membership looks more like an expression of concern at the way in which global disorder is growing.",
      "As the world grows more fractured, developing countries are stressing self-reliance and looking for new coalitions to keep their options open.",
      "What unites the Brics-11 nations is their view of geopolitics.",
      "Since Russia’s invasion of Ukraine, the transatlantic alliance has consolidated, and Moscow and Beijing have drawn closer.",
      "Brics members see the world moving towards a cold war-type mentality between a US-led coalition of democracies and a rival grouping of autocracies.",
      "This is not something that the leaders in many middle-order countries desire.",
      "Few would welcome a situation that constrains their political and economic freedom of action, as happened during the decades of Soviet-American rivalry.",
      "Developing countries prize the bargaining power to gain better trade, technology and weapons deals.",
      "No doubt countries such as Argentina and Iran see Brics membership as a way to access Chinese investment.",
      "The club’s original members had two things in common: they were large economies with high potential growth rates.",
      "The addition of South Africa in 2010 did suggest that the club was interested in recasting the power structures of the international system.",
      "But the US alone had the same nominal GDP as the Brics countries in 2022.",
      "Perhaps Brics’ most tangible achievement has been the New Development Bank – an institution that has approved almost $33bn of loans mainly for infrastructure projects since 2015.",
      "Given that Brics operates on consensus, its 26-page Johannesburg declaration is a triumph of drafting rather than diplomacy.",
      "Where Brics members agree, for example on Syria and Libya, they make a collective pronouncement, and where they have diverging positions – such as on Ukraine – they do not.",
      "Getting agreement on a common currency across such a diverse grouping would dwarf the kind of problems encountered so far, rendering such an idea a pipe dream.",
      "The next big international jamboree is the annual meeting of the G20, the group that contains most of the world’s largest economies, and will be held in India in September.",
      "Just as with the Brics meeting, Russia’s Vladimir Putin will not attend the G20 summit, although he did address Brics leaders by video link.",
      "Last year, Indonesia chaired the G20 and argued successfully that global food security was within the summit’s remit, opening the door to condemnation of Russian belligerence.",
      "Mr Putin has been described as “the apostle of payback”.",
      "By sticking to its guns, Indonesia probably waved goodbye to Brics membership this year.",
      "China and Russia are still attempting to block censure by the G20 of the Ukraine invasion.",
      "An old order is disappearing and a new one is struggling to be born.",
      "It is gut-wrenching that this process will mean Mr Putin will be able to dominate the next Brics summit – as he will be its host."
    ],
    "topics": [
      "developing countries",
      "south africa",
      "brics membership",
      "world grows",
      "grows fractured",
      "fractured developing",
      "looking new",
      "new coalitions",
      "brics members",
      "mr putin"
    ]
  },
  {
    "title": "In a multipolar world the dollar’s dominance won’t last forever",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2023/aug/27/multipolar-world-dollars-dominance-wont-last-forever-brics",
    "publishedAt": "2023-08-27T09:39:42Z",
    "sentences": [
      "While we shouldn’t read too much into the Brics expansion, the geopolitical landscape is shifting Two big international gatherings took place last week.",
      "The one that was held in the Rocky Mountain resort of Jackson Hole was a demonstration of the grip the US has on the global economy.",
      "The one that was held in Johannesburg was evidence of the challenge posed to America from the leading emerging market countries.",
      "Let’s start with Jackson Hole, where Jerome Powell took centre stage.",
      "What the head of America’s central bank had to say about interest rates clearly mattered for the US, where the economy has so far emerged relatively unscathed from the severest tightening of policy in four decades.",
      "The message was that the battle against inflation was not over and further increases in interest rates were possible.",
      "But, by virtue of the dollar’s position as the world’s principal reserve currency, what Powell and his colleagues at the Federal Reserve do in the coming months affects life well beyond America’s shores.",
      "Commodities such as oil are priced in dollars.",
      "Countries that borrow in dollars can see their repayments soar if the US currency rises in value.",
      "Countries that run current-account surpluses use the proceeds to buy US Treasury bonds, enabling the US to run massive trade and budget deficits.",
      "There is nothing new in this.",
      "It is the way the international financial system has operated since the second world war.",
      "Unsurprisingly, Washington wants the status quo to continue because it allows the US to fund its twin deficits without needing to take the tough deflationary action that would be demanded of less privileged countries.",
      "Equally unsurprisingly, the US’s financial hegemony is not universally popular.",
      "One of the motivations for the creation of the euro was that a European single currency would be a rival reserve currency to the dollar.",
      "Last week’s gathering in Johannesburg of the Brics – Brazil, Russia, India, China and South Africa – was another attempt to mount a challenge to the US-dominated international order.",
      "There are a number of reasons for this.",
      "Looked at from the perspective of a developing country, the way the global economy is run looks like a stitch-up.",
      "The US and its western allies have controlled the International Monetary Fund and the World Bank since they were founded in 1944, to the extent that every IMF managing director has been a European and every World Bank president an American.",
      "By virtue of their permanent seats on the UN security council, the US, Britain and France can veto any initiatives they don’t like.",
      "Between them, the US and the EU can prevent the leading developing nations exerting any real influence at the World Trade Organization.",
      "What’s more, it is clear that this is not the unipolar world that policymakers in the US envisaged after the break-up of the Soviet Union.",
      "China has emerged as a genuine rival, and has been successfully expanding its sphere of influence.",
      "One illustration of this is a global map produced by the consultancy Capital Economics that divides the world into countries that are strongly aligned or lean towards either the US or China.",
      "Outside the rich, developed nations of North America, Europe, Japan and Australasia, there are few countries strongly aligned with the US, and the only emerging economies of note leaning towards Washington are India and Vietnam.",
      "By contrast, most of Africa is seen as aligned or leaning towards China, as is most of Asia and a significant chunk of South America.",
      "Is this that much of a shock?",
      "Not really.",
      "The Brics have their own bank, which, in contrast to the strict conditions demanded by the IMF and the World Bank, offers loans on a no-strings attached basis.",
      "The selfish behaviour of the G7 countries – the US, the UK, Germany, France, Italy, Japan and Canada – when they hoarded vaccines during the Covid-19 crisis was not exactly conducive to winning friends in the emerging world.",
      "The shift in the geopolitical landscape was demonstrated by the countries invited to join the Brics club at last week’s summit: three were oil producers (Saudi Arabia, Iran and the UAE); two were from Africa (Egypt and Ethiopia) and one (Argentina) was from South America.",
      "It would be unwise to read too much into the Brics expansion.",
      "There are tensions between China and India, and between Saudi Arabia and Iran, while South Africa is eager to maintain good relations with the west.",
      "Like the G7, the Brics summits are essentially talkfests, where little of substance is decided.",
      "Having 11 members rather than five increases the chances of disagreement.",
      "Talk of a common Brics currency is for the birds.",
      "Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion What’s more, it will take years – perhaps decades – for the Brics to create a financial infrastructure similar to that which supports the dollar.",
      "Crucially, investors would need to be as willing to hold bonds denominated in a non-dollar currency as they are to hold US Treasury bonds.",
      "The dollar’s dominance is not under immediate threat.",
      "But that might not always been the case.",
      "Saudi Arabia’s decision to join the Brics also poses a threat to the dollar’s dominance.",
      "The oil-rich kingdom has traditionally been a reliable US ally in the Middle East but relations between Washington and Riyadh have recently cooled markedly.",
      "The expectation is that the Saudis will increasingly accept payment for oil from other Brics members in their own currencies.",
      "The US Treasury secretary, Janet Yellen, has expressed concerns about the long-term consequences of using financial sanctions as a tool of American foreign policy, saying there was a risk “over time it could undermine the hegemony of the dollar”.",
      "Yellen is right to be worried.",
      "A single, all-powerful reserve currency sits oddly with a multipolar world.",
      "It won’t happen overnight but a challenge to the dollar is coming."
    ],
    "topics": [
      "last week",
      "reserve currency",
      "us treasury",
      "world bank",
      "saudi arabia",
      "read much",
      "much brics",
      "brics expansion",
      "geopolitical landscape",
      "one held"
    ]
  },
  {
    "title": "Egypt hopes BRICS entry will lure foreign cash, but analysts counsel patience",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230825-egypt-hopes-brics-entry-will-lure-foreign-cash-but-analysts-counsel-patience/",
    "publishedAt": "2023-08-25T18:09:00Z",
    "sentences": [
      "August 25, 2023 at 6:09 pm (L-R) Russian President Vladimir Putin, Chinese President Xi Jinping, Egypt’s President Abdel-Fattah el-Sisi wave hands during the group photo session, a head of the Dialogue of Emerging Market and Developing Countries, on the sideline of the BRICS Summit [KENZABURO FUKUHARA/AFP via Getty Images] Egypt hopes its imminent inclusion in the BRICS bloc of developing nations will help ease its shortage of foreign currency and attract new investment, but analysts say it may take time before any benefits appear, Reuters reports.",
      "The bloc, which includes Brazil, Russia, India, China and South Africa, on Thursday invited Egypt and five other countries to join, and Egypt immediately welcomed the offer.",
      "“I appreciate Egypt being invited to join BRICS and look forward to coordinating with the group to achieve its goals in supporting economic cooperation,” President Abdel-Fattah Al-Sisi said soon after being invited.",
      "Egypt, over the past few years, has been mired in an economic crisis aggravated by the coronavirus pandemic and Russia’s invasion of Ukraine.",
      "Its currency has fallen by half in 18 months, annual inflation surged to a record 36.5 per cent in July, and a borrowing spree over the last eight years has made external debt repayments increasingly onerous.",
      "The dollar crunch has forced it to defer payments for wheat imports.",
      "READ: Egypt President Sisi looks forward to ‘raising the voice of countries in the South’ “The group’s aim of reducing dollar transactions will lower the foreign currency pressure in Egypt,” the cabinet said in s statement on Thursday.",
      "Membership in the bloc’s New Development Bank (NDB), established by its members in 2015, will provide concessional funding for development, it added.",
      "Egypt’s Supply Minister said in April it was discussing with China, India and Russia using their currencies for commodities, but no deal had been reached.",
      "Monica Malik of ADCB said BRICS membership may eventually help Egypt attract more investment.",
      "“It’s positive for Egypt to be included.",
      "Whilst in the near term the impact is expected to be limited, it could help strengthen its relationships with key EM (emerging market) economies.” Charles Robertson, head of macro strategy at FIM Partners, said gaining access to cheap NDB funding would help Egypt and it made sense to keep close to China, a potential source of huge foreign direct investment (FDI) in Egyptian manufacturing.",
      "“Egypt has two deep needs – FDI and a cheaper debt burden – and BRICS membership can help with both,” Robertson said.",
      "The BRICS group on Thursday also invited Saudi Arabia, Iran, Ethiopia, Argentina and the United Arab Emirates to join.",
      "“Whether it is Saudi and UAE injecting capital, or Egypt drawing on that capital, this Bank is a welcome addition to the global financial architecture,” Robertson added.",
      "James Swanston of Capital Economics said the BRICS expansion was unlikely to have major economic effects in the near term, but that “the possible shift in geopolitical alignment could have longer-run implications for trade and economic growth”.",
      "READ: BRICS invites 6 new members including UAE, Iran, Saudi Arabia"
    ],
    "topics": [
      "said brics",
      "egypt president",
      "emerging market",
      "foreign currency",
      "invited egypt",
      "brics membership",
      "help egypt",
      "near term",
      "saudi arabia",
      "august 25"
    ]
  },
  {
    "title": "BRICS welcomes new members in push to reshuffle world order",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230824-brics-welcomes-new-members-in-push-to-reshuffle-world-order/",
    "publishedAt": "2023-08-24T17:48:00Z",
    "sentences": [
      "August 24, 2023 at 5:48 pm Russian President Vladimir Putin (R) attends the 15th BRICS summit via video conference in Johannesburg, South Africa on August 22, 2023 [Murat Özgür Güvendik – Anadolu Agency] The BRICS bloc of developing nations agreed, on Thursday, to admit Saudi Arabia, Iran, Ethiopia, Egypt, Argentina and the United Arab Emirates in a move aimed at accelerating its push to reshuffle a world order it sees as outdated.",
      "The group’s leaders left the door open to future enlargement, potentially paving the way for the admission of dozens more countries, motivated by a desire to level a global playing field they consider rigged against them.",
      "The expansion adds economic heft to BRICS, whose current members are China, the world’s second largest economy, as well as Brazil, Russia, India and South Africa.",
      "It could also amplify its declared ambition to become a champion of the Global South.",
      "But long-standing tensions could linger between members who want to forge the grouping into a counter-weight to the West – notably China and Russia – and those that continue to nurture close ties to the United States and Europe.",
      "“This membership expansion is historic,” Chinese President Xi Jinping, the bloc’s most stalwart proponent of enlargement, said.",
      "“It shows the determination of BRICS countries for unity and cooperation with the broader developing countries.” READ: Brazil president supports accession of Saudi Arabia, UAE to BRICS Originally an acronym coined by Goldman Sachs chief economist, Jim O’Neill, in 2001, the bloc was founded as an informal four-nation club in 2009 and added South Africa a year later in its only previous expansion.",
      "The six new candidates will formally become members on 1 January, 2024, South African President, Cyril Ramaphosa, said when he named the countries during a three-day leaders’ summit he is hosting in Johannesburg.",
      "The entry of oil powers, Saudi Arabia and UAE, highlights their drift away from the United States’ orbit and ambition to become global heavyweights in their own right.",
      "“BRICS has embarked on a new chapter in its effort to build a world that is fair, a world that is just, a world that is also inclusive and prosperous,” Ramaphosa said.",
      "“We have consensus on the first phase of this expansion process and other phases will follow.” The countries invited to join reflect individual BRICS members’ desires to bring allies into the club.",
      "Brazilian President, Luiz Inacio Lula da Silva, had vocally lobbied for neighbour Argentina’s inclusion, while Egypt has close commercial ties with Russia and India.",
      "Russia and Iran have found common cause in their shared struggle against US-led sanctions and diplomatic isolation, with their economic ties deepening in the wake of Moscow’s invasion of Ukraine.",
      "“BRICS is not competing with anyone,” Russia’s Vladimir Putin, who is attending the summit remotely due to an international warrant for alleged war crimes, said on Thursday.",
      "“But it’s also obvious that this process of the emerging of a new world order still has fierce opponents.” Iran’s President, Ebrahim Raisi, celebrated his country’s invitation to join BRICS with a swipe at Washington.",
      "“The expansion of BRICS shows that the unilateral approach is on the way to decay,” Iran’s Arabic-language television network, Al Alam, quoted him as saying.",
      "Beijing is close to Ethiopia and the country’s inclusion also speaks to South Africa’s desire to amplify Africa’s voice in global affairs.",
      "READ: Iran calls BRICS membership ‘strategic victory’ amid tensions with US In a reflection of the bloc’s growing influence, United Nations Secretary-General, Antonio Guterres, attended Thursday’s expansion announcement and echoed BRICS’ long-standing calls for reforms of the UN Security Council, the International Monetary Fund and World Bank.",
      "“For multilateral institutions to remain truly universal, they must reform to reflect today’s power and economic realities,” he said.",
      "Though home to about 40 per cent of the world’s population and a quarter of global gross domestic product, internal divisions have long hobbled BRICS ambitions of becoming a major player on the world stage.",
      "BRICS countries have economies that are vastly different in scale and governments with often divergent foreign policy goals, a complicating factor for the bloc’s consensus decision-making model.",
      "The debate over enlargement has topped the summit in South Africa.",
      "And, while all BRICS members publicly expressed support for growing the bloc, there were divisions among the leaders over how much and how quickly.",
      "Last minute deliberations over entry criteria and which countries to invite to join extended late into Wednesday evening.",
      "READ: BRICS: Global aims or a new scramble for Africa?",
      "Bloc heavyweight China has long called for an expansion of BRICS as it seeks to challenge Western dominance, a strategy that is shared by Russia.",
      "Other BRICS members support fostering the creation of a multi-polar global order.",
      "But Brazil and India have both also been forging closer ties with the West.",
      "Brazil’s Lula on Tuesday rejected the idea the bloc should seek to rival the United States and Group of Seven wealthy economies.",
      "The views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Monitor."
    ],
    "topics": [
      "south africa",
      "saudi arabia",
      "united states",
      "brics members",
      "vladimir putin",
      "world order",
      "russia india",
      "ambition become",
      "brics countries",
      "arabia uae"
    ]
  },
  {
    "title": "UAE President hails BRICS membership",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230824-uae-president-hails-brics-membership/",
    "publishedAt": "2023-08-24T13:19:00Z",
    "sentences": [
      "August 24, 2023 at 1:19 pm South African President Cyril Ramaphosa (2nd L), President of Brazil, Luiz Inacio Lula da Silva (L), Indian Prime Minister Narendra Modi (C) attend the 15th BRICS summit in Johannesburg, South Africa on August 22, 2023.",
      "[ BRICS / Handout – Anadolu Agency ] United Arab Emirates (UAE) President, Sheikh Mohammed bin Zayed, on Thursday, welcomed the Gulf Kingdom’s inclusion in BRICS, a bloc of emerging economies, Anadolu Agency reports.",
      "“We respect the vision of the BRICS leadership and appreciate the inclusion of the UAE as a member to this important group,” he said in a tweet.",
      "The decision came on Wednesday at the end of the BRICS summit in Johannesburg, South Africa.",
      "“We look forward to a continued commitment of cooperation for the prosperity, dignity and benefit of all nations and people around the world,” he added.",
      "Established in 2006, BRICS comprise China, Brazil, Russia, India and South Africa.",
      "The bloc has agreed to expand by inviting six new countries, including Argentina, Egypt, Iran, Ethiopia, Saudi Arabia and the UAE.",
      "These six countries will become full members of the bloc by January 2024.",
      "READ: BRICS invites 6 new members including UAE, Iran, Saudi Arabia"
    ],
    "topics": [
      "south africa",
      "brics summit",
      "summit johannesburg",
      "johannesburg south",
      "anadolu agency",
      "saudi arabia",
      "august 24",
      "24 2023",
      "2023 pm",
      "pm south"
    ]
  },
  {
    "title": "BRICS invites 6 new members including UAE, Iran, Saudi Arabia",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230824-brics-invites-6-new-members-including-uae-iran-saudi-arabia/",
    "publishedAt": "2023-08-24T12:02:00Z",
    "sentences": [
      "August 24, 2023 at 12:02 pm Saudi Arabia’s Foreign Minister Faisal bin Farhan Al Saud attends a meeting during the 2023 BRICS Summit at the Sandton Convention Centre in Johannesburg on August 24, 2023 [MARCO LONGARI/POOL/AFP via Getty Images] The BRICS alliance invited six countries to join, including the UAE, Saudi Arabia, Iran, Ethiopia, Argentina and Egypt.",
      "BRICS is currently made up of five countries – Brazil, Russia, India, China and South Africa.",
      "The new members would be brought in on 1 January 2024.",
      "The South African President and chair of BRICS, Cyril Ramaphosa, made the announcement on X this morning saying: “We have reached agreement on the guiding principles, standards, criteria and procedures of the #BRICS expansion process.” BRICS is a diverse group of nations.",
      "It is an equal partnership of countries that have differing views but a shared vision for a better world.",
      "As the five #BRICS members, we have reached agreement on the guiding principles, standards, criteria and procedures of the #BRICS… — Cyril Ramaphosa 🇿🇦 (@CyrilRamaphosa) August 24, 2023 This announcement followed the 15th BRICS summit in which new members were a critical focus.",
      "BRICS membership has been sought by over 40 countries including the six invited for membership and others like Cuba and Indonesia.",
      "President Xi Jinping of China said at a press meeting that the new members would “bring new vigour to the BRICS cooperation mechanism, further strengthening a force for world peace and development.” President Mohammed Bin Zayed of the UAE commented on X, saying: “We respect the vision of the BRICS leadership and appreciate the inclusion of the UAE as a member to this important group.” We respect the vision of the BRICS leadership and appreciate the inclusion of the UAE as a member to this important group.",
      "We look forward to a continued commitment of cooperation for the prosperity, dignity and benefit of all nations and people around the world.",
      "— محمد بن زايد (@MohamedBinZayed) August 24, 2023 OPINION: Can BRICS challenge the Western order?"
    ],
    "topics": [
      "august 24",
      "24 2023",
      "new members",
      "saudi arabia",
      "brics summit",
      "members would",
      "cyril ramaphosa",
      "reached agreement",
      "agreement guiding",
      "guiding principles"
    ]
  },
  {
    "title": "Brics to admit six new countries to bloc including Iran and Saudi Arabia",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2023/aug/24/five-brics-nations-announce-admission-of-six-new-countries-to-bloc",
    "publishedAt": "2023-08-24T09:48:09Z",
    "sentences": [
      "Major expansion as economic bloc that includes Russia and China attempts to provide counterweight to the US and western allies The Brics group of big emerging economies has announced the admission of six new members, in an attempt to reshape the global world order and provide a counterweight to the US and its allies.",
      "From the beginning of next year, Iran, Saudi Arabia, Egypt, Argentina, the UAE and Ethiopia will join the current five members – Brazil, Russia, India, China and South Africa – it was announced at a summit in Johannesburg on Thursday.",
      "China’s president, Xi Jinping, described the expansion as “historic”.",
      "He had been the leading proponent of the admission of new members, presenting an enlarged Brics as a way for the global south to have a stronger voice in world affairs.",
      "It is unclear, however, how the expansion would significantly enhance the group’s clout on the global stage.",
      "That would depend on how far it will be able to act in unison, analysts said, and the group of new members has made it even more disparate, a mix of powerful autocracies with middle-income and developing democracies.",
      "“It’s not entirely clear what the newest Brics members will have to gain from their membership in the bloc,” Margaret Myers, the director of the Asia and Latin America programme at the Inter-American Dialogue.",
      "“For the moment, at least, this move is more symbolic than anything – it’s an indication of wide-ranging global south support for a recalibration of the global order.” Vladimir Putin did not attend the three-day summit in person, as he faces an arrest warrant for war crimes in Ukraine issued by the international criminal court, but the Brics enlargement represents a symbolic boost for him, as he fights a US-led effort to isolate his regime to force a withdrawal and an end to the war.",
      "The decision to admit Iran, also looking for a way to sidestep sanctions, represented a win for Putin and Xi, helping give the group a more anti-western, non-democratic tinge.",
      "They prevailed over the more cautious approach of the other members, who prefer to portray the group as non-aligned.",
      "For Argentina, facing dire economic problems, membership represents a potential lifeline to escape from the deepening crisis.",
      "Its president, Alberto Fernández, said it represented a “new scenario” for the country.",
      "“We open up our possibilities of joining new markets, of consolidating existing markets, of raising investment coming in, of creating jobs and raising imports,” Fernandez said.",
      "Ethiopia became the only low-income country in the group.",
      "Its prime minister, Abiy Ahmed, described it as “a great moment” for his country.",
      "Nearly two dozen countries had formally applied to join the group, but there had to be consensus among its existing five members for candidate countries to be admitted.",
      "South Africa’s president, Cyril Ramaphosa, said the members had agreed on “the guiding principles, standards, criteria and procedures of the Brics expansion process”.",
      "Those criteria were not explained, however.",
      "Indonesia, for example, with a population of 274 million and a powerful force in Asia, applied to join but was not admitted.",
      "“For China and Russia, this is a win.",
      "They have been pushing for this for five plus years now,” said Ryan Berg, the head of the Americas programme at the Centre for Strategic and International Studies.",
      "“For China, it allows them to continue to build what they hope is a Beijing-centric order.",
      "For Russia, who is hosting it next year, it sees this as a tremendous opportunity in its current moment of significant isolation.” “If you’re Brazil, or if you’re India, you’re less enthusiastic about expansion, even though they’re rhetorically committed to it, because it dilutes the power of your membership in an organisation that includes global power like China,” Berg said.",
      "There is not likely to be an immediate economic benefit from membership for members, who already have extensive bilateral ties with China.",
      "The group’s New Development Bank is still relatively small.",
      "But Myers said that although the move is largely symbolic that does not mean it is unimportant.",
      "“This is significant, and shouldn’t be dismissed by G7 and other global north actors,” she argued.",
      "“With these new members – especially the major oil producing ones – on board, the Brics configuration represents a much more significant share of the global economy and global population.”"
    ],
    "topics": [
      "new members",
      "provide counterweight",
      "counterweight us",
      "next year",
      "five members",
      "south africa",
      "global south",
      "group new",
      "applied join",
      "major expansion"
    ]
  },
  {
    "title": "BRICS agrees on group expansion mechanisms",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230824-brics-agrees-on-group-expansion-mechanisms/",
    "publishedAt": "2023-08-24T09:20:00Z",
    "sentences": [
      "August 24, 2023 at 9:20 am A general view of the 15th BRICS summit in Johannesburg, South Africa on August 22, 2023 [BRICS/Handout – Anadolu Agency] The BRICS group of nations has adopted a document that sets out guidelines and principles for the group’s expansion, South Africa’s Foreign Minister Naledi Pandor said yesterday according to Reuters.",
      "Establishing a framework and criteria for admitting new members has been at the top of the agenda at this week’s BRICS summit in Johannesburg.",
      "While all BRICS members – Brazil, Russia, India, China and South Africa – have publicly expressed support for growing the bloc, they have been divided over how many countries to admit and how quickly.",
      "More than 40 nations have expressed an interest in joining BRICS.",
      "“We have agreed on the matter of expansion.",
      "We have a document that we have adopted that sets out the guidelines and principles, processes for considering countries that wish to become members of the BRICS,” Pandor said.",
      "Agreement to expand BRICS paves the way for dozens of countries interested in joining the bloc, which pledged to give the “Global South” more clout in world affairs.",
      "READ: What is BRICS and who are its members?",
      "Bloc heavyweight China has long called for an expansion of BRICS as a means of fostering a multipolar world order to challenge Western dominance.",
      "“The world … has entered a new period of turbulence and transformation,” China’s President Xi Jinping said yesterday.",
      "“We, the BRICS countries, should always bear in mind our founding purpose of strengthening ourselves through unity.” BRICS, in its current composition, represents 40 per cent of the world’s population and a quarter of the global GDP.",
      "An infographic titled “15th BRICS Summit” is created in Ankara, Turkiye on August 21, 2023 [Elmurod Usubaliev/Anadolu Agency] READ: South Africa says 22 countries ‘officially requested’ to join BRICS group"
    ],
    "topics": [
      "south africa",
      "brics summit",
      "15th brics",
      "summit johannesburg",
      "brics group",
      "sets guidelines",
      "guidelines principles",
      "pandor said",
      "said yesterday",
      "brics members"
    ]
  },
  {
    "title": "Putin defends invasion of Ukraine in Brics summit address",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/aug/23/putin-defend-russian-invasion-ukraine-brics-summit-south-africa",
    "publishedAt": "2023-08-23T14:37:35Z",
    "sentences": [
      "Russian president seeks to rally leaders meeting in South Africa to Moscow’s side by blaming west Vladimir Putin has defended Russia’s invasion of Ukraine and sought to rally leaders of the Brics nations meeting in South Africa to the Kremlin’s side.",
      "In a prerecorded video message aired on Tuesday to the leaders of Brazil, India, China and South Africa, Putin repeated his earlier unfounded claims that the west was responsible for the war in Ukraine.",
      "“Our actions in Ukraine are dictated by only one thing – to end the war that was unleashed by the west and its satellites against the people who live in the Donbas,” Putin said, referring to the eastern part of Ukraine where Russian proxies have been fighting the Ukrainian army since 2014.",
      "“I want to note that it was the desire to maintain their hegemony in the world, the desire of some countries to maintain this hegemony that led to the severe crisis in Ukraine,” he added.",
      "Putin was the only leader of the five-nation Brics summit not to attend in person and spoke instead by video because he faces an arrest warrant for war crimes issued by the international criminal court (ICC).",
      "In the run-up to the summit, South Africa, which was party to the treaty that created the ICC and would have been obliged to arrest Putin if he had travelled there, had asked the Russian leader to stay away.",
      "The Russian president also accused the west of sabotaging the Black Sea grain deal that his country exited last month.",
      "The grain deal proved key for stabilising global food price, a topic of serious concern to many developing countries, including those in the bloc.",
      "The South African president, Cyril Ramaphosa, who earlier in the summer presented Putin with an African peace plan to end the war in Ukraine, said in response to the Russian president’s speech that Brics members would continue to support efforts to bring the conflict to an end.",
      "Ramaphosa also called for the resumption of the grain deal.",
      "The Brics countries represent about 40% of the world’s population and a quarter of global GDP, but the group is considering expansion.",
      "Leaders from more than 40 countries, largely from Africa and elsewhere in the global south, flew in for the three-day summit in Johannesburg alongside Brazil’s Luiz Inácio Lula da Silva, China’s Xi Jinping and Narendra Modi of India.",
      "According to the South African organisers, many of those countries have expressed interest in joining – though there had been divisions among the Brics leaders over how many and how quickly.",
      "South Africa’s foreign minister, Naledi Pandor, on Wednesday said an agreement had been made on expansion and a more detailed announcement would follow before the end of the summit.",
      "“We have agreed on the matter of expansion,” she told Ubuntu Radio, a station run by South Africa’s foreign ministry.",
      "“We have a document that we’ve adopted which sets out guidelines and principles, processes for considering countries that wish to become members of Brics ... That’s very positive.” Sign up to First Edition Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters after newsletter promotion However, analysts have questioned Putin’s assertion that the Brics bloc will soon grow to represent the “global majority”.",
      "“Even if other countries are ultimately welcomed to the new group, it remains unlikely that this will be a genuine challenge to the international order,” said Maximilian Hess, a fellow at the Foreign Policy Research Institute thinktank and a political risks consultant based in London.",
      "“That is because none of the Brics countries except for Russia seek a direct confrontation with America and its allies.",
      "Given the perilous state many Brics economies currently find themselves in, antagonising Washington risks adding fuel to the fire,” Hess added.",
      "In a clear sign the bloc’s members are wary of the fallout from Russia’s war in Ukraine, its flagship New Development Bank (NDB) has suspended all operations in Moscow out of fear of having sanctions imposed by the west.",
      "The Brics nations set up the NDB in 2015 as a counterweight to US-dominated financial institutions such as the World Bank."
    ],
    "topics": [
      "south africa",
      "russian president",
      "war ukraine",
      "grain deal",
      "rally leaders",
      "meeting south",
      "brics nations",
      "end war",
      "maintain hegemony",
      "south african"
    ]
  },
  {
    "title": "Can BRICS challenge the Western order?",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230823-can-brics-challenge-the-western-order/",
    "publishedAt": "2023-08-23T14:32:00Z",
    "sentences": [
      "August 23, 2023 at 2:32 pm Delegates walk past the logos of the BRICS summit during the 2023 BRICS Summit in Johannesburg on August 23, 2023 [GIANLUIGI GUERCIA/POOL/AFP via Getty Images] An enduring quote from Shakespeare’s Hamlet encapsulates a conflictual tension between reality and uncertainty: “We know what we are, but know not what we may be.” These words gain even more currency in today’s discussions surrounding the organisation of Brazil, Russia, India, China and South Africa (BRICS) and the Western-led international order.",
      "The summit takes place from 22-24 August, with one empty chair due to the international arrest warrant against the leader of one of the members, Vladimir Putin.",
      "Before every BRICS summit, a recurring view gets traction: the potential of this group to offer an alternative to the dominating Western-led global order.",
      "Delving into historical gross domestic product (GDP) data, often juxtaposed with the comparison of member countries with the Group of Seven (G7) or Organisation for Economic Co-Operation and Development (OECD), those who bet on the BRICS’ future fuel even more speculation about the upcoming rise of these developing economies.",
      "At one juncture, rumours of a common currency were circulating, although it was underscored that such deliberations would not take centre stage at the forthcoming summit.",
      "The threshold is low, indicating the focus is on localised transactions.",
      "READ: South Africa strives to work with all countries The rise of the BRICS media narrative is rooted in the never-ending anti-Western sentiments of some political figures within BRICS.",
      "Nevertheless, despite the antagonistic rhetoric, a long queue of hopeful candidates still aspires to get portions of the financial pie.",
      "Uruguay, the United Arab Emirates (UAE), Egypt and Bangladesh already participate in the New Development Bank (NDC), seeking commercial opportunities from this inter-governmental organisation.",
      "But can BRICS genuinely challenge the established Western-led rules, as disputed?",
      "A succinct yet resolution response beckons: very unlikely.",
      "Woven with a tapestry of divergent interests, the BRICS grouping is a curious ensemble within the Western-dominated global economic paradigm.",
      "Its raison d’être ostensibly extends beyond economic cooperation, to encompass the cultivation of a nuanced anti-American consciousness.",
      "Yet, herein lies a paradox: discordant aspirations simmer beneath the surface of this collective organisation, eroding every semblance of commonality.",
      "One might posit that diversity is not problematic, per se but, in the international arena, the need for a more abrasive glue is a necessary condition for the success of such alliances.",
      "In essence, BRICS is akin to a patchwork of nations more united in their disparities than their commonalities.",
      "Delving into various potential scenarios, a conspicuous truth emerges.",
      "Take, for example, the aspiration harboured by numerous emerging economies to share in the BRICS fold; even on this matter, the notion of a cohesive front seems elusive.",
      "China and Russia unfurl the banner of anti-American sentiment, envisaging expansion as a conduit to foster a counter-balancing coalition worldwide.",
      "READ: BRICS expansion hopefuls seek to rebalance world order Paradoxically, the ambivalent position of India within this union conveys a different narrative.",
      "Prime Minister, Narendra Modi’s India cannot afford the luxury of unequivocal anti-Americanism.",
      "For Modi, the US is more than just pecuniary gains; it intertwines with intricate geopolitical engagements.",
      "It is pertinent to remember that India shares a convoluted history of territorial disputes with its commercial partner, China.",
      "Thus, while the maxim extolling the virtues of diversity echoes in diplomatic corridors, the unvarnished truth is this: when contemplating the unrelenting complexities of the international stage, such platitudes find themselves relegated to the periphery.",
      "While appearing to strive for an inside-out capture of the existing system, there is a need for these actors to possess enough awareness to calculate the associated risks.",
      "Establishing an international order is not just about material capabilities; a profound ideational foundation must also exist.",
      "Despite its many flaws, the Western-led system is based on shared values, including a liberal package encompassing the rule of law, democracy, liberties and individual rights.",
      "If an alternative is sought, it has to extend beyond merely focusing on commerce and paying some lip service to the causes of the Global South.",
      "Similarly, another question is: who among the BRICS qualifies for the role of leader in the future?",
      "In such a situation, one would assume that China would not easily relinquish this privilege to India, or naively think of sharing such a position.",
      "Likewise, India would not nurture the idea of ​​being sidelined.",
      "Let us entertain the idea that China gains leadership; what ideational alternative could it lay for a global order?",
      "Concepts derived from Confucianism or Chinese President Xi Jinping’s frequent notions of harmonious society, or socialism with Chinese characteristics?",
      "While nothing is wrong with these principles, they are not necessarily shared by the rest of the world.",
      "FACTBOX: What is BRICS and who are its members?",
      "Hence, despite recurrent commitments to the UN Charter, for China to have pre-eminence within the system, it has to have more power of attraction in terms of ideology.",
      "Considering present conditions, this endeavour is still a distant possibility.",
      "The Western-led international system is facing discontent, sharp inequalities and structural imbalances due to a lack of fair representation in international bodies, like the United Nations Security Council.",
      "However, the solution can be sought by reforming the system and not necessarily dismantling it, replacing the hitherto established order with a new one with even more discrepancies and complications than opportunities.",
      "Lastly, BRICS is a product of the existing system and acts within its porous contours.",
      "To different degrees, all members benefit from the structure and capabilities of the system and have no genuine interest in, or willingness to challenge it, at least for the foreseeable future.",
      "They know reality well and have neither the will nor the capability to overpower it.",
      "The views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Monitor."
    ],
    "topics": [
      "brics summit",
      "august 23",
      "23 2023",
      "south africa",
      "international order",
      "global order",
      "existing system",
      "2023 pm",
      "pm delegates",
      "delegates walk"
    ]
  },
  {
    "title": "Xi Jinping unexpectedly pulls out of BRICS summit speech in 'extraordinary' move",
    "source": "Sky News",
    "url": "https://news.sky.com/story/xi-jinping-unexpectedly-pulls-out-of-brics-summit-speech-in-extraordinary-move-12945564",
    "publishedAt": "2023-08-23T08:42:00Z",
    "sentences": [
      "The Chinese leader has flown out to South Africa for the summit but asked his commerce minister to read out his remarks.",
      "Wednesday 23 August 2023 09:59, UK Chinese President Xi Jinping unexpectedly pulled out of delivering a speech at the BRICS summit in South Africa - leading to speculation he might be unwell.",
      "The Chinese leader was in Johannesburg for the business forum but asked his commerce minister Wang Wentao to deliver the remarks instead.",
      "The unusual move has sparked speculation that something was \"amiss\" but it is unlikely the Chinese government will provide an explanation.",
      "The president's speech brought an air of confrontation to the summit in Johannesburg.",
      "In a thinly-veiled swipe at the United States, Mr Wang said \"some country, obsessed with maintaining its hegemony, has gone out of its way to cripple the emerging markets and developing countries\".",
      "\"Whoever is developing fast becomes its target of containment.",
      "Whoever is catching up, becomes its target of obstructions.\"",
      "The remarks are another development in the growing friction between the US and China - with Mr Xi having earlier blamed the West for the difficulties faced by his country's economy.",
      "Mr Xi had met with South African president Cyril Ramaphosa on Tuesday before he pulled out of delivering his speech.",
      "American-Israeli hostage Edan Alexander released by Hamas Ukraine war latest: Ukraine's allies threaten Putin with ceasefire ultimatum Trump set for truly consequential week for his presidency and his ability to effect change Bill Bishop, author of Sinocism, a popular newsletter about Chinese affairs, highlighted how there had already been a long period this month with Mr Xi not making any public appearances.",
      "Mr Bishop said this seemed \"a bit strange\".",
      "He added: \"This last-minute decision to skip the business forum looks even stranger.",
      "So in the absence of any useful information from the PRC [People's Republic of China] system rumours will fly.\"",
      "Read more world newsAt least 17 dead in India bridge collapseMoscow threatens to annex Georgia breakaway regions The China Global South Project, a podcast exploring the country's involvement in Africa, wrote: \"To say [Xi's absence] is extraordinary is an understatement as Chinese leaders never miss highly choreographed events like this.\"",
      "Bonnie Glaser, managing director of the Indo-Pacific Programme at the German Marshall Fund, wondered if his absence meant something was \"amiss\".",
      "James Palmer, deputy editor of Foreign Policy magazine, wrote: \"The odds are very heavily that Xi Jinping just skipped that speech because he's sick.\"",
      "The BRICS group of countries is made up of Brazil, Russia, India, China and South Africa.",
      "Mr Xi was scheduled to join Brazilian President Luiz Inacio Lula da Silva, Indian Prime Minister Narendra Modi and Mr Ramaphosa for dinner at a luxury estate in suburban Johannesburg on Tuesday.",
      "Please use Chrome browser for a more accessible video player Russian President Vladimir Putin has not attended the summit as he currently faces an arrest warrant for war crimes which was issued by the International Criminal Court.",
      "Mr Putin planned to take part in the dinner virtually, officials said.",
      "The Russian president gave a 17-minute prerecorded speech, criticising the impact of sanctions and indirectly accused the West by criticising the \"trampling of all rules of free trade and economic life which we thought to be immovable before\".",
      "The leaders were expected to discuss the top agenda point for the three-day summit - a possible expansion of the BRICS group of nations.",
      "The group aims to be a counterweight to Western economic and geopolitical dominance.",
      "The five BRICS countries are home to 40% of the world's population and responsible for more than 30% of global economic output, and more than 20 nations have applied to join, according to South African officials, including Saudi Arabia, Iran and the United Arab Emirates."
    ],
    "topics": [
      "mr xi",
      "south africa",
      "chinese leader",
      "asked commerce",
      "commerce minister",
      "xi jinping",
      "pulled delivering",
      "delivering speech",
      "business forum",
      "something amiss"
    ]
  },
  {
    "title": "Rumours swirl after Xi Jinping fails to give key Brics speech",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/aug/23/xi-jinping-brics-china-fails-to-give-key-speech",
    "publishedAt": "2023-08-23T05:17:05Z",
    "sentences": [
      "Xi was due to address high profile forum in South Africa, but instead his speech was read out by his commerce minister China’s leader, Xi Jinping, unexpectedly skipped a scheduled speech at a key multilateral business forum in South Africa on Tuesday.",
      "Xi arrived in Johannesburg for the Brics summit on Monday evening on what is only his second international trip this year, after visiting Moscow in March.",
      "He was met on the airport tarmac by South African president Cyril Ramaphosa.",
      "According to the summit schedule, Xi was expected to attend the forum and deliver remarks alongside other leaders on Tuesday.",
      "But instead his speech was read out by his commerce minister, Wang Wentao.",
      "Xi later attended the summit dinner, but no reason was given for missing the speech.",
      "It appeared to be a last-minute decision, as state media articles and social media posts from China’s foreign ministry spokesperson were published as though he had delivered it himself.",
      "Some China watchers speculated whether something was “amiss” or if Xi was temporarily ill, but an explanation is unlikely to be given.",
      "Bill Bishop, author of Sinocism, a popular newsletter about Chinese affairs, noted there had already been a long period this month without any public appearances by Xi, which seemed “a bit strange”.",
      "“This last-minute decision to skip the business forum looks even stranger.",
      "So in the absence of any useful information from the PRC [People’s Republic of China] system rumours will fly,” he said.",
      "The China Global South Project noted this was the second unexplained absence by a Chinese official after former foreign minister Qin Gang – who has not been seen in public for months – also missed last month’s foreign ministers Brics meeting.",
      "“To say [Xi’s absence] is extraordinary is an understatement as Chinese leaders never miss highly choreographed events like this,” it said.",
      "The speech, delivered by Wang, made thinly veiled attacks on the US, describing an unnamed country as “obsessed with maintaining hegemony, [and] has gone out of its way to cripple the emerging markets and developing countries”.",
      "“Whoever develops first becomes their target of containment.",
      "Whoever is catching up becomes its target of obstruction,” Wang said on behalf of Xi.",
      "The Brics countries – Brazil, Russia, India, China and South Africa – represent about 40% of the world’s population and a quarter of global GDP.",
      "Leaders of all member nations except Vladimir Putin attended in person as he currently faces an arrest warrant for war crimes issued by the international criminal court.",
      "The summit was attended by representatives of dozens of other countries, as the main members consider expanding its membership.",
      "Some members like China are seeking to build up Brics as a counterweight to western blocs like the G7 or G20, although there is division within the group.",
      "On Tuesday Brazil’s president, Luiz Inácio Lula da Silva, said it wasn’t the group’s aim to compete with western institutions.",
      "India’s leadership, which has an often fractious relationship with China, is also hesitant over empowering Beijing through Brics."
    ],
    "topics": [
      "south africa",
      "forum south",
      "instead speech",
      "speech read",
      "read commerce",
      "commerce minister",
      "business forum",
      "becomes target",
      "xi due",
      "due address"
    ]
  },
  {
    "title": "Russia-Ukraine war at a glance: what we know on day 546 of the invasion",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/aug/23/russia-ukraine-war-at-a-glance-what-we-know-on-day-546-of-the-invasion",
    "publishedAt": "2023-08-22T23:07:25Z",
    "sentences": [
      "Ukrainians believed to have retaken south-eastern village of Robotyne; Putin tells Brics countries Russia could take Ukraine’s place as grain supplier Ukraine said its troops had entered the strategically important south-eastern village of Robotyne, a potentially significant advance in its counteroffensive against Russia.",
      "Hanna Maliar, Ukraine’s deputy defence minister, said Ukrainian soldiers were organising the evacuation of civilians, but were still coming under fire from Russian forces.",
      "A prominent Russian journalist said on Tuesday that Gen Sergei Surovikin, former commander of Moscow’s war effort in Ukraine, had been dismissed as head of Russia’s aerospace forces.",
      "There was no official confirmation of the report by Alexei Venediktov, the well-connected former head of the now defunct Ekho Moskvy radio station, but it was cited by some other Russian news outlets on social media, Reuters reported.",
      "Three people were killed and two were injured as a result of Russian shelling of several villages in Ukraine’s Donetsk region, the prosecutor general’s office said.",
      "According to the prosecutors, all three people, two women and a man, were killed in the village of Torske on Tuesday evening.",
      "The prosecutors provided no further detail of the attack.",
      "Russia said on Tuesday that it destroyed two Ukrainian military boats in the Black Sea.",
      "Moscow’s defence ministry said one of its Sukhoi Su-30sm jets destroyed a Ukrainian “reconnaissance boat” near Russian gas production facilities.",
      "It later said it also destroyed a US-made speedboat carrying Ukrainian troops east of Snake Island, without providing further detail.",
      "The claims were not verified.",
      "A group of Ukrainian “saboteurs” tried to breach Russia’s border in the Bryansk region, the regional governor, Alexander Bogomaz, said on Tuesday, Reuters reported.",
      "The claim was not verified.",
      "The Russian president, Vladimir Putin, said Russia would remain a “responsible supplier” of food and grain to African countries and could take Ukraine’s place as an international supplier of grain, in recorded remarks to a summit of the Brics countries in South Africa.",
      "He also said said the use of US dollars in trade between Brics nations was decreasing, as the countries moved towards national currencies and away from dollars in an “irreversible process of de-dollarisation”.",
      "The international court of justice will hear Russia’s objections to its jurisdiction in a genocide case brought by Ukraine in hearings starting in September, the body said on Tuesday.",
      "Ukraine filed a case with the ICJ shortly after Russia’s invasion began on 24 February 2022, which accused Moscow of falsely applying genocide law to justify the attack, Reuters reported.",
      "Denmark has begun training eight Ukrainian pilots in flying F-16 fighter jets as part of its commitment to donate aircraft, the Danish armed forces said on Tuesday.",
      "Denmark and the Netherlands pledged on Sunday to donate F-16s to Ukraine.",
      "The leaders of 11 Balkan and eastern European countries signed a joint declaration backing Ukraine’s territorial integrity at a summit in Athens on Monday.",
      "In the presence of Volodymyr Zelenskiy, they expressed their “unwavering support for Ukraine’s independence, sovereignty and territorial integrity within its internationally recognised borders” in the face of Russia’s aggression.",
      "Poland’s president has said Russia is in the process of shifting some short-range nuclear weapons to neighbouring Belarus.",
      "Andrzej Duda said the move would shift the security architecture of the region and the entire Nato military alliance, Associated Press reported.",
      "Mykhailo Podolyak, a senior adviser to Ukraine’s president, Volodymyr Zelenskiy, has said the commitment made by some European countries to donate F-16 fighter jets to Ukraine will help to minimise Ukrainian losses and de-escalate the conflict.",
      "A drone appears to have destroyed a supersonic Russian bomber on an airfield hundreds of kilometres from Ukraine, British military intelligence has said, the latest in a string of successful assaults on prestige infrastructure and military hardware.",
      "These attacks, far beyond the frontlines, are powerful propaganda for Ukraine, though Kyiv rarely claims them directly."
    ],
    "topics": [
      "said tuesday",
      "reuters reported",
      "village robotyne",
      "brics countries",
      "could take",
      "take ukraine",
      "ukraine place",
      "three people",
      "said russia",
      "fighter jets"
    ]
  },
  {
    "title": "Ukraine war - latest: Russia scrambles jets against drones off Crimea; Putin hits out at West in major speech",
    "source": "Sky News",
    "url": "https://news.sky.com/story/ukraine-war-latest-russia-scrambles-jets-against-drones-off-crimea-putin-hits-out-at-west-in-major-speech-12541713",
    "publishedAt": "2023-08-22T20:44:00Z",
    "sentences": [
      "Russia has launched new attacks against Ukraine despite Western allies calling for a 30-day ceasefire starting today.",
      "Germany says the 'clock is ticking' and if a truce is not in place by the end of Monday, then more sanctions will be prepared.",
      "Follow the latest here.",
      "Monday 12 May 2025 15:48, UK Thank you for reading.",
      "The main events today have been: Poland has said it will close the Russian consulate in Krakow after finding evidence that Moscow was responsible for a huge fire that almost completely destroyed a shopping centre in Warsaw last year.",
      "Russia has accused Poland of \"Russophobia\" and denied any involvement in the blaze.",
      "Yesterday Donald Tusk, Poland's prime minister, said his country knew \"for sure\" that Russian secret services were behind the fire.",
      "\"Due to evidence that the Russian special services committed a reprehensible act of sabotage against the shopping centre on Marywilska Street, I have decided to withdraw my consent to the operation of the consulate of the Russian Federation in Krakow,\" Polish foreign minister Radoslaw Sikorski wrote on X.",
      "He told reporters at a meeting of foreign ministers in London that Poland would take further action if attacks continued.",
      "Kremlin spokesman Dmitry Peskov said: \"Many different accusations against Russia are voiced in Poland.",
      "\"This is part of an absolutely Russophobic and unfriendly position towards our country.\"",
      "He claimed such accusations were \"always absolutely groundless\".",
      "As we have been reporting, UK Foreign Secretary David Lammy has been hosting the foreign ministers of France, Germany, Italy, Poland and Spain in London today, along with the EU's foreign affairs chief.",
      "In a joint statement, they welcomed the prospect of peace talks between Russia and Ukraine this week, but also said Moscow has \"not shown any serious intent to make progress\".",
      "It must \"do so without delay\", they added.",
      "They are calling for an \"immediate, full, unconditional 30-day ceasefire to create space for talks on a just, comprehensive and lasting peace\".",
      "The ministers said they had agreed to help Ukraine strengthen its armed forces, \"restock munitions and equipment, and further enhance industrial capacity\".",
      "They also said they would explore the \"creation of a coalition of air, land and maritime reassurance forces\" that could \"support the regeneration of Ukraine's armed forces\".",
      "Regarding sanctions, they said they would pursue \"ambitious measures\" to \"reduce Russia's ability to wage war by limiting Kremlin revenues, disrupting the shadow fleet, tightening the oil price cap, and reducing our remaining imports of Russian energy\".",
      "They added: \"We will keep Russian sovereign assets in our jurisdictions immobilised until Russia ceases its aggression and pays for the damage caused.\"",
      "Russia is serious about peace in Ukraine, Kremlin spokesman Dmitry Peskov has said.",
      "But he also reprimanded European countries for the \"language of ultimatums\" on further sanctions.",
      "\"We are committed to a serious search for ways of a long-term peaceful settlement,\" he told reporters.",
      "Vladimir Putin has suggested talks in Istanbul on Thursday.",
      "Peskov said many leaders had welcomed the Russian leader's plan.",
      "\"This approach, aimed precisely at finding a real diplomatic solution to the Ukrainian crisis, eliminating the root causes of the conflict and establishing lasting peace, has met with understanding and support from the leaders of many countries,\" he said, citing Donald Trump and Tayyip Erdogan, the president of Turkey.",
      "Before reporters could ask any more questions, Peskov said: \"That's all.",
      "I've said everything I could about this story.\"",
      "Germany has said European countries will start preparing new sanctions against Russia unless the Kremlin commits to a 30-day ceasefire by the end of today.",
      "Peskov commented: \"The language of ultimatums is unacceptable for Russia, it is not suitable.",
      "\"You can't use such language with Russia.\"",
      "Putin and Zelenskyy have not met since December 2019.",
      "Zelekskyy has said he will be in Turkey on Thursday and has challenged Putin to meet him face-to-face.",
      "Hungary has cancelled a meeting with Ukraine on minority rights after a row over alleged spying last week.",
      "Hungarian foreign ministry state secretary Levente Magyar said the meeting, to be held in Ukraine, could not go ahead on \"such an important and sensitive matter\".",
      "But Hungary remains open to dialogue, he added.",
      "On Friday Ukraine's spy agency, the SBU, said it had detained two suspected agents who, it claimed, were being run by Hungarian military intelligence.",
      "In retaliation, Hungarian foreign minister Peter Szijjarto said his country had expelled two people he said were working as spies at Ukraine's embassy in Budapest.",
      "Iran is getting ready for a visit by Vladimir Putin, a government spokesperson has said.",
      "\"Putin's trip to Tehran is currently being worked out, preparations are underway,\" Fatemeh Mohajerani said, according to Russia state news agency RIA.",
      "The Kremlin did not comment.",
      "Iran has been supplying Moscow with Shahed drones to use in Russian attacks against Ukraine.",
      "Putin held talks with supreme leader Ayatollah Ali Khamenei in Iran in 2022.",
      "That was the Russian president's first trip outside Russia since he began the invasion of Ukraine.",
      "Russia is \"completely ignoring the offer of a full and durable ceasefire\" starting today, Ukraine's foreign minister has said.",
      "Andrii Sybiha said Russian troops are continuing to attack \"Ukrainian positions all along the frontline\".",
      "He added: \"Moscow squanders another opportunity to put an end to the killings.",
      "\"This once again demonstrates that Russia's only goal is to prolong the war.\"",
      "Over the weekend, European countries including the UK proposed a 30-day ceasefire.",
      "Sybiha, who joined a meeting of foreign ministers convened by UK Foreign Secretary David Lammy remotely, said those taking part had discussed \"strong steps that can be taken\".",
      "Those included \"sanctions against Russia's banking, central bank, and energy sectors\".",
      "They were combined with \"new defence assistance packages for Ukraine\".",
      "Putin must \"understand the consequences of rejecting peace efforts and continuing the war\", Sybiha said.",
      "Russian troops have captured the village of Kotliarivka in the eastern Ukrainian region of Donetsk, the Russian defence ministry has said.",
      "It made the claim on the Telegram messaging app.",
      "Sky News cannot independently verify that assertion.",
      "\"Russia clearly wants war,\" the EU's foreign affairs chief has said.",
      "Kaja Kallas, who is in London for discussions on Ukrainian and European security, said there must be a truce because there \"cannot be talks under fire\".",
      "She added: \"We want to see that Russia also wants peace.",
      "\"It takes two to want peace, it takes only one to want war, and we see that Russia clearly wants war.\"",
      "David Lammy, the UK foreign secretary who is hosting talks at Lancaster House, said Vladimir Putin must \"get serious\" about engaging in peace talks.",
      "But if it's not a \"moment of seriousness from Putin\", Europe's leaders are \"prepared\", he added.",
      "Lammy also praised Volodymyr Zelenskyy for his \"willingness to engage in talks\".",
      "The Ukrainian president has said he will be in Turkey on Thursday to meet Vladimir Putin in person after Moscow suggested new discussions.",
      "It is unclear whether Putin will join him.",
      "European nations will prepare more sanctions against Russia if Moscow does not adhere to a ceasefire in Ukraine by the end of Monday, a German government spokesperson has said.",
      "They said: \"The clock is ticking.",
      "\"We still have 12 hours until the end of the day, and if the ceasefire is not in place by then, the European side will (set in motion) preparations for sanctions.\"",
      "Over the weekend, a number of European countries demanded that a 30-day ceasefire begin today.",
      "Russia responded by suggesting talks in Turkey on Thursday.",
      "It also reportedly launched more than 100 drones against Ukrainian targets overnight.",
      "Russian troops have also conducted dozens of assaults on the eastern front line in Ukraine today, according to spokesman Viktor Trehubov.",
      "Earlier, Germany's foreign minister, Johann Wadephul, said Vladimir Putin needed to consider a ceasefire before entering any new peace negotiations in Turkey (8.23am post)."
    ],
    "topics": [
      "vladimir putin",
      "foreign minister",
      "peskov said",
      "european countries",
      "foreign ministers",
      "uk foreign",
      "foreign secretary",
      "david lammy",
      "sanctions russia",
      "turkey thursday"
    ]
  },
  {
    "title": "Vladimir Putin attends BRICS summit virtually to avoid war crimes arrest",
    "source": "Sky News",
    "url": "https://news.sky.com/story/vladimir-putin-attends-brics-summit-virtually-to-avoid-war-crimes-arrest-12945353",
    "publishedAt": "2023-08-22T20:16:00Z",
    "sentences": [
      "The Russian president gave a 17-minute prerecorded speech as the bloc opened its first in-person meeting since before the COVID-19 pandemic in South Africa.",
      "Mr Putin is wanted by the International Criminal Court over the abduction of children from Ukraine.",
      "News reporter @samuelosborne93 Tuesday 22 August 2023 21:16, UK Please use Chrome browser for a more accessible video player Vladimir Putin has addressed a summit of the BRICS group of emerging economies virtually to avoid an International Criminal Court (ICC) warrant for his arrest for war crimes.",
      "The Russian president gave a 17-minute prerecorded speech as the bloc, named after its member states Brazil, Russia, India, China and South Africa, opened its first in-person meeting since before the COVID-19 pandemic in South Africa.",
      "Mr Putin is wanted by the ICC over the abduction of children from Ukraine.",
      "Ukraine war - latest: Putin hits out at West in major speech The Russian leader criticised the impact of sanctions and indirectly accused the West by criticising the \"trampling of all rules of free trade and economic life which we thought to be immovable before\".",
      "He said these have caused an \"exacerbation of serious problems\", in particular affecting the cereals industry.",
      "It is worth noting Russia's invasion of Ukraine and its decision to pull out of the Black Sea grain deal have had a significant impact on the grains industry.",
      "Mr Putin also gave an update on his offer of free grain for African countries, saying talks are almost finished and Russia remains and will be a reliable food supplier to Africa.",
      "Russian foreign minister Sergey Lavrov is representing Moscow in Johannesburg, but Kremlin spokesman Dmitry Peskov stressed Mr Putin would fully engage with the summit while participating remotely.",
      "Local officials said the Russian president would \"virtually\" attend a welcome dinner hosted by South Africa on Tuesday.",
      "The agenda also lists him giving a speech via video link on Wednesday.",
      "Read more:Wagner Group chief shares first video address since aborted coupRussian space agency boss blames decades of inactivity for moon crash Xi Jinping also absent from summit Chinese President Xi Jinping was also absent from the beginning of the summit, though he was in South Africa and held a bilateral morning meeting with President Cyril Ramaphosa.",
      "No reason was given for his absence, with Chinese Commerce Minister Wang Wentao reading his speech.",
      "Mr Xi, who has gradually resumed foreign travel after lifting his country's strict COVID-19 restrictions, joined Mr Ramaphosa to watch a ceremonial parade by soldiers at the Union Buildings, the official seat of the South African government.",
      "He made brief comments, saying China was ready for more cooperation with Africa's most advanced economy \"to take our comprehensive strategic partnerships to new heights\".",
      "Be the first to get Breaking News Install the Sky News app for free BRICS officials insist bloc is not taking anti-West position BRICS officials have argued against suggestions the bloc is shifting towards an anti-West position under the influence of China and Russia, saying instead it is looking out for the interests of the Global South.",
      "But the BRICS stance is at odds with its Western allies on a number of issues, including Russia's invasion of Ukraine.",
      "The European Union has called on Mr Xi, Mr Ramaphosa, Brazilian President Luiz Inacio Lula da Silva and Indian Prime Minister Narendra Modi to use the three-day summit to condemn Russia and Mr Putin for the war in Ukraine - something that is unlikely to happen.",
      "Instead BRICS has been a forum for Russia to express its anti-Western rhetoric, with Mr Lavrov using BRICS foreign minister meeting in June to lambast the West for its \"hegemony\" and use of \"financial blackmail\" to serve its \"selfish interests\".",
      "A small protest against Russia's invasion of Ukraine was held at a public park more than 3km (1.8 miles) from the summit on Tuesday."
    ],
    "topics": [
      "south africa",
      "mr putin",
      "russian president",
      "russia invasion",
      "invasion ukraine",
      "president gave",
      "gave prerecorded",
      "prerecorded speech",
      "speech bloc",
      "opened first"
    ]
  },
  {
    "title": "Putin says Brics should become trading bloc representing ‘global majority’",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2023/aug/22/putin-brics-summit-south-africa-trade",
    "publishedAt": "2023-08-22T18:41:00Z",
    "sentences": [
      "Russian president addresses group at South Africa summit, blaming western sanctions for causing volatility in global markets Vladimir Putin has told a summit of the Brics group of countries in South Africa that it should become a trading bloc representing the “global majority”.",
      "However, differences among the group – comprising Brazil, Russia, India, China and South Africa – have become apparent at the summit over accepting new members, and whether to turn Brics into a geopolitical counterweight to the west.",
      "Brazil’s president, Luiz Inácio Lula da Silva, insisted on Tuesday that it was not the group’s aim to compete with western institutions.",
      "“We do not want to be a counterpoint to the G7, G20 or the United States,” he said on Tuesday.",
      "“We just want to organise ourselves.” The White House, too, played down the likelihood of Brics turning into a powerful and cohesive bloc.",
      "“This is a very diverse collection of countries … with differences of view on critical issues,” the national security adviser, Jake Sullivan, said at a briefing.",
      "In his recorded remarks to the meeting, Putin blamed the volatility in global markets for food and other commodities on western sanctions, and said that Brics would be a force for fairness in international relations.",
      "“We cooperate on the principles of equality, mutual support and respect for each other’s interests,” he said.",
      "“This is the essence of the future-oriented strategic course of our association, a course that meets the aspirations of the main part of the world community, the so-called global majority.” The Brics countries represent about 40% of the world’s population and a quarter of global GDP, but the group is considering expansion.",
      "Leaders from more than 40 countries, largely from Africa and elsewhere in the global south, flew in for the three-day summit in Johannesburg alongside Lula, China’s Xi Jinping and India’s Narendra Modi.",
      "According to the South African organisers, many of those countries have expressed interest in joining.",
      "Among the disparate group of countries attending as observers and candidate members are Iran, Argentina, Saudi Arabia, Kazakhstan, Vietnam, Indonesia, Ethiopia and Venezuela.",
      "There is debate among members about how far expansion should go, India being the most cautious, and what criteria should be used in deciding membership.",
      "Brazil supports the admission of Argentina into Brics, but has warned that rapid expansion could dilute the group’s influence.",
      "Xi did not attend the first day of the summit, for reasons that were not explained.",
      "His remarks were delivered on his behalf by the Chinese commerce minister, Wang Wentao.",
      "In his speech, Xi insisted that the expansion of Brics was not aimed at “asking countries to take sides, or creating bloc confrontation, rather to expand the architect of peace and development”.",
      "There is expected to be common ground in the discussion of alternatives to trading in dollars, and possible creation of parallel financial institutions to the World Bank and the International Monetary Fund.",
      "However, the South African hosts have said there will be no proposals for a Brics common currency as an alternative to the dollar or euro.",
      "Russia’s invasion of Ukraine is expected to be a significantly divisive issue.",
      "Putin did not attend in person and spoke instead by video, because he faces an arrest warrant for war crimes issued by the international criminal court.",
      "The summit’s host, the South African president, Cyril Ramaphosa, has said he would use the meeting to push for the revival of the Black Sea Grain Initiative, which had facilitated the export of Ukrainian cereals to the rest of the world, and which Russia ended last month.",
      "Speaking on Sunday, Ramaphosa said he would also press for the return of Ukrainian children who had been taken to Russia from occupied Ukrainian territory since the start of the full-scale invasion in February 2022.",
      "Another substantial barrier to closer integration of the group is unresolved tension between China and India over their mutual border, which has escalated into brawls between their soldiers in recent years."
    ],
    "topics": [
      "south africa",
      "south african",
      "western sanctions",
      "volatility global",
      "global markets",
      "group countries",
      "africa become",
      "ramaphosa said",
      "said would",
      "russian president"
    ]
  },
  {
    "title": "Ukraine war - latest: Putin hits out at West in major speech; video shows moment drone downed over Moscow region",
    "source": "Sky News",
    "url": "https://news.sky.com/story/ukraine-war-latest-putin-hits-out-at-west-in-major-speech-video-shows-moment-drone-downed-over-moscow-region-12541713",
    "publishedAt": "2023-08-22T17:08:00Z",
    "sentences": [
      "Russia has launched new attacks against Ukraine despite Western allies calling for a 30-day ceasefire starting today.",
      "Germany says the 'clock is ticking' and if a truce is not in place by the end of Monday, then more sanctions will be prepared.",
      "Follow the latest here.",
      "Monday 12 May 2025 15:48, UK Thank you for reading.",
      "The main events today have been: Poland has said it will close the Russian consulate in Krakow after finding evidence that Moscow was responsible for a huge fire that almost completely destroyed a shopping centre in Warsaw last year.",
      "Russia has accused Poland of \"Russophobia\" and denied any involvement in the blaze.",
      "Yesterday Donald Tusk, Poland's prime minister, said his country knew \"for sure\" that Russian secret services were behind the fire.",
      "\"Due to evidence that the Russian special services committed a reprehensible act of sabotage against the shopping centre on Marywilska Street, I have decided to withdraw my consent to the operation of the consulate of the Russian Federation in Krakow,\" Polish foreign minister Radoslaw Sikorski wrote on X.",
      "He told reporters at a meeting of foreign ministers in London that Poland would take further action if attacks continued.",
      "Kremlin spokesman Dmitry Peskov said: \"Many different accusations against Russia are voiced in Poland.",
      "\"This is part of an absolutely Russophobic and unfriendly position towards our country.\"",
      "He claimed such accusations were \"always absolutely groundless\".",
      "As we have been reporting, UK Foreign Secretary David Lammy has been hosting the foreign ministers of France, Germany, Italy, Poland and Spain in London today, along with the EU's foreign affairs chief.",
      "In a joint statement, they welcomed the prospect of peace talks between Russia and Ukraine this week, but also said Moscow has \"not shown any serious intent to make progress\".",
      "It must \"do so without delay\", they added.",
      "They are calling for an \"immediate, full, unconditional 30-day ceasefire to create space for talks on a just, comprehensive and lasting peace\".",
      "The ministers said they had agreed to help Ukraine strengthen its armed forces, \"restock munitions and equipment, and further enhance industrial capacity\".",
      "They also said they would explore the \"creation of a coalition of air, land and maritime reassurance forces\" that could \"support the regeneration of Ukraine's armed forces\".",
      "Regarding sanctions, they said they would pursue \"ambitious measures\" to \"reduce Russia's ability to wage war by limiting Kremlin revenues, disrupting the shadow fleet, tightening the oil price cap, and reducing our remaining imports of Russian energy\".",
      "They added: \"We will keep Russian sovereign assets in our jurisdictions immobilised until Russia ceases its aggression and pays for the damage caused.\"",
      "Russia is serious about peace in Ukraine, Kremlin spokesman Dmitry Peskov has said.",
      "But he also reprimanded European countries for the \"language of ultimatums\" on further sanctions.",
      "\"We are committed to a serious search for ways of a long-term peaceful settlement,\" he told reporters.",
      "Vladimir Putin has suggested talks in Istanbul on Thursday.",
      "Peskov said many leaders had welcomed the Russian leader's plan.",
      "\"This approach, aimed precisely at finding a real diplomatic solution to the Ukrainian crisis, eliminating the root causes of the conflict and establishing lasting peace, has met with understanding and support from the leaders of many countries,\" he said, citing Donald Trump and Tayyip Erdogan, the president of Turkey.",
      "Before reporters could ask any more questions, Peskov said: \"That's all.",
      "I've said everything I could about this story.\"",
      "Germany has said European countries will start preparing new sanctions against Russia unless the Kremlin commits to a 30-day ceasefire by the end of today.",
      "Peskov commented: \"The language of ultimatums is unacceptable for Russia, it is not suitable.",
      "\"You can't use such language with Russia.\"",
      "Putin and Zelenskyy have not met since December 2019.",
      "Zelekskyy has said he will be in Turkey on Thursday and has challenged Putin to meet him face-to-face.",
      "Hungary has cancelled a meeting with Ukraine on minority rights after a row over alleged spying last week.",
      "Hungarian foreign ministry state secretary Levente Magyar said the meeting, to be held in Ukraine, could not go ahead on \"such an important and sensitive matter\".",
      "But Hungary remains open to dialogue, he added.",
      "On Friday Ukraine's spy agency, the SBU, said it had detained two suspected agents who, it claimed, were being run by Hungarian military intelligence.",
      "In retaliation, Hungarian foreign minister Peter Szijjarto said his country had expelled two people he said were working as spies at Ukraine's embassy in Budapest.",
      "Iran is getting ready for a visit by Vladimir Putin, a government spokesperson has said.",
      "\"Putin's trip to Tehran is currently being worked out, preparations are underway,\" Fatemeh Mohajerani said, according to Russia state news agency RIA.",
      "The Kremlin did not comment.",
      "Iran has been supplying Moscow with Shahed drones to use in Russian attacks against Ukraine.",
      "Putin held talks with supreme leader Ayatollah Ali Khamenei in Iran in 2022.",
      "That was the Russian president's first trip outside Russia since he began the invasion of Ukraine.",
      "Russia is \"completely ignoring the offer of a full and durable ceasefire\" starting today, Ukraine's foreign minister has said.",
      "Andrii Sybiha said Russian troops are continuing to attack \"Ukrainian positions all along the frontline\".",
      "He added: \"Moscow squanders another opportunity to put an end to the killings.",
      "\"This once again demonstrates that Russia's only goal is to prolong the war.\"",
      "Over the weekend, European countries including the UK proposed a 30-day ceasefire.",
      "Sybiha, who joined a meeting of foreign ministers convened by UK Foreign Secretary David Lammy remotely, said those taking part had discussed \"strong steps that can be taken\".",
      "Those included \"sanctions against Russia's banking, central bank, and energy sectors\".",
      "They were combined with \"new defence assistance packages for Ukraine\".",
      "Putin must \"understand the consequences of rejecting peace efforts and continuing the war\", Sybiha said.",
      "Russian troops have captured the village of Kotliarivka in the eastern Ukrainian region of Donetsk, the Russian defence ministry has said.",
      "It made the claim on the Telegram messaging app.",
      "Sky News cannot independently verify that assertion.",
      "\"Russia clearly wants war,\" the EU's foreign affairs chief has said.",
      "Kaja Kallas, who is in London for discussions on Ukrainian and European security, said there must be a truce because there \"cannot be talks under fire\".",
      "She added: \"We want to see that Russia also wants peace.",
      "\"It takes two to want peace, it takes only one to want war, and we see that Russia clearly wants war.\"",
      "David Lammy, the UK foreign secretary who is hosting talks at Lancaster House, said Vladimir Putin must \"get serious\" about engaging in peace talks.",
      "But if it's not a \"moment of seriousness from Putin\", Europe's leaders are \"prepared\", he added.",
      "Lammy also praised Volodymyr Zelenskyy for his \"willingness to engage in talks\".",
      "The Ukrainian president has said he will be in Turkey on Thursday to meet Vladimir Putin in person after Moscow suggested new discussions.",
      "It is unclear whether Putin will join him.",
      "European nations will prepare more sanctions against Russia if Moscow does not adhere to a ceasefire in Ukraine by the end of Monday, a German government spokesperson has said.",
      "They said: \"The clock is ticking.",
      "\"We still have 12 hours until the end of the day, and if the ceasefire is not in place by then, the European side will (set in motion) preparations for sanctions.\"",
      "Over the weekend, a number of European countries demanded that a 30-day ceasefire begin today.",
      "Russia responded by suggesting talks in Turkey on Thursday.",
      "It also reportedly launched more than 100 drones against Ukrainian targets overnight.",
      "Russian troops have also conducted dozens of assaults on the eastern front line in Ukraine today, according to spokesman Viktor Trehubov.",
      "Earlier, Germany's foreign minister, Johann Wadephul, said Vladimir Putin needed to consider a ceasefire before entering any new peace negotiations in Turkey (8.23am post)."
    ],
    "topics": [
      "vladimir putin",
      "foreign minister",
      "peskov said",
      "european countries",
      "foreign ministers",
      "uk foreign",
      "foreign secretary",
      "david lammy",
      "sanctions russia",
      "turkey thursday"
    ]
  },
  {
    "title": "Ukraine war - latest: Putin giving major speech; video shows moment drone downed over Moscow region",
    "source": "Sky News",
    "url": "https://news.sky.com/story/ukraine-war-latest-putin-giving-major-speech-video-shows-moment-drone-downed-over-moscow-region-12541713",
    "publishedAt": "2023-08-22T16:31:00Z",
    "sentences": [
      "Russia has launched new attacks against Ukraine despite Western allies calling for a 30-day ceasefire starting today.",
      "Germany says the 'clock is ticking' and if a truce is not in place by the end of Monday, then more sanctions will be prepared.",
      "Follow the latest here.",
      "Monday 12 May 2025 15:48, UK Thank you for reading.",
      "The main events today have been: Poland has said it will close the Russian consulate in Krakow after finding evidence that Moscow was responsible for a huge fire that almost completely destroyed a shopping centre in Warsaw last year.",
      "Russia has accused Poland of \"Russophobia\" and denied any involvement in the blaze.",
      "Yesterday Donald Tusk, Poland's prime minister, said his country knew \"for sure\" that Russian secret services were behind the fire.",
      "\"Due to evidence that the Russian special services committed a reprehensible act of sabotage against the shopping centre on Marywilska Street, I have decided to withdraw my consent to the operation of the consulate of the Russian Federation in Krakow,\" Polish foreign minister Radoslaw Sikorski wrote on X.",
      "He told reporters at a meeting of foreign ministers in London that Poland would take further action if attacks continued.",
      "Kremlin spokesman Dmitry Peskov said: \"Many different accusations against Russia are voiced in Poland.",
      "\"This is part of an absolutely Russophobic and unfriendly position towards our country.\"",
      "He claimed such accusations were \"always absolutely groundless\".",
      "As we have been reporting, UK Foreign Secretary David Lammy has been hosting the foreign ministers of France, Germany, Italy, Poland and Spain in London today, along with the EU's foreign affairs chief.",
      "In a joint statement, they welcomed the prospect of peace talks between Russia and Ukraine this week, but also said Moscow has \"not shown any serious intent to make progress\".",
      "It must \"do so without delay\", they added.",
      "They are calling for an \"immediate, full, unconditional 30-day ceasefire to create space for talks on a just, comprehensive and lasting peace\".",
      "The ministers said they had agreed to help Ukraine strengthen its armed forces, \"restock munitions and equipment, and further enhance industrial capacity\".",
      "They also said they would explore the \"creation of a coalition of air, land and maritime reassurance forces\" that could \"support the regeneration of Ukraine's armed forces\".",
      "Regarding sanctions, they said they would pursue \"ambitious measures\" to \"reduce Russia's ability to wage war by limiting Kremlin revenues, disrupting the shadow fleet, tightening the oil price cap, and reducing our remaining imports of Russian energy\".",
      "They added: \"We will keep Russian sovereign assets in our jurisdictions immobilised until Russia ceases its aggression and pays for the damage caused.\"",
      "Russia is serious about peace in Ukraine, Kremlin spokesman Dmitry Peskov has said.",
      "But he also reprimanded European countries for the \"language of ultimatums\" on further sanctions.",
      "\"We are committed to a serious search for ways of a long-term peaceful settlement,\" he told reporters.",
      "Vladimir Putin has suggested talks in Istanbul on Thursday.",
      "Peskov said many leaders had welcomed the Russian leader's plan.",
      "\"This approach, aimed precisely at finding a real diplomatic solution to the Ukrainian crisis, eliminating the root causes of the conflict and establishing lasting peace, has met with understanding and support from the leaders of many countries,\" he said, citing Donald Trump and Tayyip Erdogan, the president of Turkey.",
      "Before reporters could ask any more questions, Peskov said: \"That's all.",
      "I've said everything I could about this story.\"",
      "Germany has said European countries will start preparing new sanctions against Russia unless the Kremlin commits to a 30-day ceasefire by the end of today.",
      "Peskov commented: \"The language of ultimatums is unacceptable for Russia, it is not suitable.",
      "\"You can't use such language with Russia.\"",
      "Putin and Zelenskyy have not met since December 2019.",
      "Zelekskyy has said he will be in Turkey on Thursday and has challenged Putin to meet him face-to-face.",
      "Hungary has cancelled a meeting with Ukraine on minority rights after a row over alleged spying last week.",
      "Hungarian foreign ministry state secretary Levente Magyar said the meeting, to be held in Ukraine, could not go ahead on \"such an important and sensitive matter\".",
      "But Hungary remains open to dialogue, he added.",
      "On Friday Ukraine's spy agency, the SBU, said it had detained two suspected agents who, it claimed, were being run by Hungarian military intelligence.",
      "In retaliation, Hungarian foreign minister Peter Szijjarto said his country had expelled two people he said were working as spies at Ukraine's embassy in Budapest.",
      "Iran is getting ready for a visit by Vladimir Putin, a government spokesperson has said.",
      "\"Putin's trip to Tehran is currently being worked out, preparations are underway,\" Fatemeh Mohajerani said, according to Russia state news agency RIA.",
      "The Kremlin did not comment.",
      "Iran has been supplying Moscow with Shahed drones to use in Russian attacks against Ukraine.",
      "Putin held talks with supreme leader Ayatollah Ali Khamenei in Iran in 2022.",
      "That was the Russian president's first trip outside Russia since he began the invasion of Ukraine.",
      "Russia is \"completely ignoring the offer of a full and durable ceasefire\" starting today, Ukraine's foreign minister has said.",
      "Andrii Sybiha said Russian troops are continuing to attack \"Ukrainian positions all along the frontline\".",
      "He added: \"Moscow squanders another opportunity to put an end to the killings.",
      "\"This once again demonstrates that Russia's only goal is to prolong the war.\"",
      "Over the weekend, European countries including the UK proposed a 30-day ceasefire.",
      "Sybiha, who joined a meeting of foreign ministers convened by UK Foreign Secretary David Lammy remotely, said those taking part had discussed \"strong steps that can be taken\".",
      "Those included \"sanctions against Russia's banking, central bank, and energy sectors\".",
      "They were combined with \"new defence assistance packages for Ukraine\".",
      "Putin must \"understand the consequences of rejecting peace efforts and continuing the war\", Sybiha said.",
      "Russian troops have captured the village of Kotliarivka in the eastern Ukrainian region of Donetsk, the Russian defence ministry has said.",
      "It made the claim on the Telegram messaging app.",
      "Sky News cannot independently verify that assertion.",
      "\"Russia clearly wants war,\" the EU's foreign affairs chief has said.",
      "Kaja Kallas, who is in London for discussions on Ukrainian and European security, said there must be a truce because there \"cannot be talks under fire\".",
      "She added: \"We want to see that Russia also wants peace.",
      "\"It takes two to want peace, it takes only one to want war, and we see that Russia clearly wants war.\"",
      "David Lammy, the UK foreign secretary who is hosting talks at Lancaster House, said Vladimir Putin must \"get serious\" about engaging in peace talks.",
      "But if it's not a \"moment of seriousness from Putin\", Europe's leaders are \"prepared\", he added.",
      "Lammy also praised Volodymyr Zelenskyy for his \"willingness to engage in talks\".",
      "The Ukrainian president has said he will be in Turkey on Thursday to meet Vladimir Putin in person after Moscow suggested new discussions.",
      "It is unclear whether Putin will join him.",
      "European nations will prepare more sanctions against Russia if Moscow does not adhere to a ceasefire in Ukraine by the end of Monday, a German government spokesperson has said.",
      "They said: \"The clock is ticking.",
      "\"We still have 12 hours until the end of the day, and if the ceasefire is not in place by then, the European side will (set in motion) preparations for sanctions.\"",
      "Over the weekend, a number of European countries demanded that a 30-day ceasefire begin today.",
      "Russia responded by suggesting talks in Turkey on Thursday.",
      "It also reportedly launched more than 100 drones against Ukrainian targets overnight.",
      "Russian troops have also conducted dozens of assaults on the eastern front line in Ukraine today, according to spokesman Viktor Trehubov.",
      "Earlier, Germany's foreign minister, Johann Wadephul, said Vladimir Putin needed to consider a ceasefire before entering any new peace negotiations in Turkey (8.23am post)."
    ],
    "topics": [
      "vladimir putin",
      "foreign minister",
      "peskov said",
      "european countries",
      "foreign ministers",
      "uk foreign",
      "foreign secretary",
      "david lammy",
      "sanctions russia",
      "turkey thursday"
    ]
  },
  {
    "title": "Brics group looks to expand at summit despite divisions among key members",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/aug/21/brics-looks-to-expand-bloc-south-africa-summit-divisions-key-members-india",
    "publishedAt": "2023-08-21T18:01:53Z",
    "sentences": [
      "Experts say India concerned about expansion and any overt anti-west turn as leaders fly into South Africa Leaders from developing countries representing almost half the world’s population including China and Russia are meeting in South Africa for a key summit aimed at reinforcing their alliance as a counterweight to the west.",
      "The Brics grouping summit in Johannesburg is being hosted by the South African president, Cyril Ramaphosa, and brings together the prime minister of India, Narendra Modi, as well the presidents of China, Xi Jinping, and Brazil, Luiz Inácio Lula da Silva.",
      "Dozens of leaders of other countries in Africa, Asia and the Middle East are also attending, many hoping to be invited to join the bloc.",
      "The two-day summit opens on Tuesday morning.",
      "Russia is being represented by its foreign minister, Sergei Lavrov, after Vladimir Putin decided not travel to Johannesburg to avoid forcing South Africa to choose between fulfilling conflicting obligations as hosts of the summit and as a member of the international criminal court.",
      "The ICC has issued an arrest warrant for the Russian president for alleged war crimes in Ukraine that would have theoretically compelled South Africa to detain him.",
      "Putin will now only attend virtually.",
      "The summit may see the Brics group, whose economies account for a quarter of global gross domestic product, take a clearly anti-western turn.",
      "This raises the prospect of a new and re-energised economic and political actor against the US and its allies in world affairs.",
      "On Sunday, Ramaphosa sought to reassure concerned observers and domestic opponents that South Africa would “not be drawn into a contest between global powers” and wanted to avoid a world that was “increasingly polarised into competing camps”.",
      "“Our decision not to align with any one of the global powers does not mean that we are neutral on matters of principle or national interest,” he told viewers in a televised national address.",
      "One issue at the summit will be moves to undermine the dominance of the US dollar in international trade transactions, which would be helpful to Russia as its economy struggles with sanctions imposed after its full-scale invasion of Ukraine last year.",
      "China is looking to build a broader coalition of developing countries to extend Beijing’s influence and reinforce its efforts to compete with the US on the global stage.",
      "“The traditional global governing system has become dysfunctional, deficient and missing in action,” the Chinese ambassador to South Africa, Chen Xiaodong, said at a briefing in Pretoria last week, adding that the Brics grouping was “increasingly becoming a staunch force in defending international justice”.",
      "But both China’s expansion plans and the more explicitly political stance that Beijing has outlined has riled India, the most populous country in the group.",
      "Prof Harsh Pant, an international relations expert at the Observer Research Foundation, a thinktank in Delhi, said: “India is looking to ensure that this platform doesn’t just drift off into [being] an openly anti-western platform, and there is a danger of that with both Russia and China having a certain agenda.",
      "“India and least of all Modi have no interest in shaping India’s foreign policy in an anti-western direction.",
      "Brics was conceived as a geoeconomic platform but is drifting into a geopolitical role and India is not likely to be comfortable with that.” Officials in South Africa say more than 40 countries have expressed interest in joining Brics.",
      "Twenty three are thought to have asked formally to be admitted.",
      "Anil Sooklal, South Africa’s ambassador at large for Asia and the Brics, said one of the reasons countries were lining up to join the group was a “very polarised world” that had been further polarised by the Ukraine war, and that countries were being forced to take sides.",
      "“Countries in the [global] south don’t want to be told who to support, how to behave and how to conduct their sovereign affairs.",
      "They are strong enough now to assert their respective positions,” said Sooklal.",
      "Among potential new members are Iran and Venezuela, both hit by sanctions and diplomatically isolated.",
      "Ramón Lobo, Venezuela’s former finance minister and central bank president, told Reuters: “Other integration frameworks that exist globally have been blinded by the hegemonic vision put forward by the US government.” Russia also sees the summit as an opportunity to reinforce its alliances in the developing world, particularly in Africa.",
      "Putin hosted African leaders in St Petersburg for a second Russia-Africa summit last month.",
      "African candidates for membership such as Ethiopia and Nigeria are attracted by the bloc’s commitment to UN reforms that would give Africa a more powerful global voice.",
      "Others believe an expanded Brics may be able to drive through changes to the World Trade Organization, the International Monetary Fund and the World Bank.",
      "With India’s opposition to any new members of Brics without very strict safeguards and its concerns that Beijing will pack the group with anti-western allies, there is very unlikely to be consensus, say experts, meaning immediate expansion is improbable.",
      "“I don’t think we’ll see any explicit messages on this issue, just some anodyne statement,” said Pant.",
      "Many analysts are also sceptical of hopes that even an enlarged Brics grouping could have much impact.",
      "Since its foundation in 2009, the bloc’s ambitions to exert significant global political and economic influence has been undermined by the differences between the values, interests and political systems of its members.",
      "Steven Gruzd of the South African Institute of International Affairs, a thinktank, said: “They may have too high expectations of what Brics membership will actually bring in practice.”"
    ],
    "topics": [
      "south africa",
      "brics grouping",
      "developing countries",
      "south african",
      "global powers",
      "new members",
      "experts say",
      "say india",
      "india concerned",
      "concerned expansion"
    ]
  },
  {
    "title": "Morocco not to attend BRICS summit in Johannesburg",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230819-morocco-not-to-attend-brics-summit-in-johannesburg/",
    "publishedAt": "2023-08-19T16:48:00Z",
    "sentences": [
      "August 19, 2023 at 4:48 pm Flag of Morocco [Kristin Harvey/Flickr] Morocco has refrained from submitting an application to join BRICS and will be absent from the upcoming summit in Johannesburg, as confirmed by the state news agency MAP on Saturday, Anadolu reports.",
      "Citing an undisclosed source within the Foreign Ministry, the agency conveyed that there had never been any intention of positively responding to the invitation or participating in the meeting at any level.",
      "The source emphasized that the summit was organized unilaterally by the South African government, stating, “South Africa has consistently exhibited primary antagonism towards the Kingdom and has consistently adopted adverse and entrenched stances concerning the Moroccan Sahara issue.” The source further remarked, “Pretoria has therefore persistently undertaken actions that are detrimental to Morocco’s paramount interests, both on a national level and within the African Union.” Critiquing South African diplomacy for its perceived impromptu and unpredictable approach to event organization, the source indicated that South Africa extended invitations to a substantial number of countries without valid justification and without consulting fellow BRICS members.",
      "The source suggested that Pretoria intends to “hijack” the summit for ulterior motives, describing it as a means to serve a concealed agenda.",
      "While Morocco maintains bilateral relations with the other BRICS member countries and remains committed to multilateralism, it has not officially pursued membership.",
      "This stance was affirmed by the ministry source.",
      "The BRICS group comprises Brazil, Russia, India, China, and South Africa, the host of the upcoming meeting scheduled for August 22-24.",
      "The potential expansion of the group is slated for discussion during the summit, with South Africa noting that numerous nations have expressed interest in joining.",
      "The strained relations between South Africa and Morocco, attributed to South Africa’s support for the Polisario front’s quest for an independent state in Western Sahara—a territory that Morocco regards as its own—have influenced the dynamics between the two nations.",
      "READ: Morocco: 75 migrants rescued after boat intercepted"
    ],
    "topics": [
      "south africa",
      "south african",
      "august 19",
      "19 2023",
      "2023 pm",
      "pm flag",
      "flag morocco",
      "morocco kristin",
      "kristin morocco",
      "morocco refrained"
    ]
  },
  {
    "title": "South Africa: 8 Arab countries request to join BRICS",
    "source": "Middle East Monitor",
    "url": "https://www.middleeastmonitor.com/20230815-south-africa-8-arab-countries-request-to-join-brics/",
    "publishedAt": "2023-08-15T08:33:00Z",
    "sentences": [
      "August 15, 2023 at 8:33 am South Africa’s Minister of International Relations and Cooperation Naledi Pandor (C) gives a speech during “BRICS Foreign Ministers Meeting” in Cape Town, South Africa [BRICS / Handout/Anadolu Agency] Eight Arab countries have officially applied to join the BRICS group of fast-developing economies, the South African foreign minister said.",
      "Naledi Pandor told reporters that a total of 23 countries have officially applied to join the group, including eight Arab countries, noting that BRICS leaders will discuss expanding the group and the submitted applications during their upcoming summit between 22-24 August.",
      "“South Africa, as chairman of BRICS, will hold talks at the summit on the enlargement model, its principles and standards.",
      "We are gradually moving towards consensus on BRICS expansion issues, and we hope to reach it at the summit,” Pandor said.",
      "Algeria, Bahrain, Egypt, Kuwait, Morocco, Palestine, Saudi Arabia and the United Arab Emirates (UAE) were named as the countries that applied.",
      "The remaining countries are Bangladesh, Iran, Kazakhstan, Nigeria, Senegal, Ethiopia, Belarus, Bolivia, Argentina, Venezuela, Vietnam, Cuba, Honduras, Indonesia and Thailand.",
      "READ: Brazil president supports accession of Saudi Arabia, UAE to BRICS"
    ],
    "topics": [
      "south africa",
      "naledi pandor",
      "eight arab",
      "arab countries",
      "countries officially",
      "officially applied",
      "applied join",
      "saudi arabia",
      "august 15",
      "15 2023"
    ]
  },
  {
    "title": "Vladimir Putin to miss South Africa summit amid row over possible arrest",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/jul/19/vladimir-putin-to-miss-south-africa-summit-amid-row-over-possible-arrest",
    "publishedAt": "2023-07-19T17:46:14Z",
    "sentences": [
      "Cyril Ramaphosa faced demands for Russian president to be detained under ICC warrant if he attended Brics summit Vladimir Putin will not attend a Brics summit in South Africa next month amid speculation that he could be detained under an international criminal court warrant for his arrest for war crimes in Ukraine.",
      "South Africa’s presidential office announced that the Russian president would not be attending the summit after holding a “number of consultations” with the Kremlin.",
      "South Africa is an ICC signatory and would be expected to aid in his arrest if the Russian leader came to the summit.",
      "Putin’s potential attendance had sparked a domestic political scandal.",
      "President Cyril Ramaphosa said taking part in arresting Putin would risk a war with Russia.",
      "His remarks came after the Democratic Alliance, the largest opposition party, sued the government to demand that Putin be arrested if he arrived in the country.",
      "“Russia has made it clear that arresting its sitting president would be a declaration of war,” Ramaphosa responded, according to court documents.",
      "“It would be inconsistent with our constitution to risk engaging in war with Russia.” The Kremlin denied that it had explicitly told Pretoria that an attempt to arrest Putin in South Africa would be tantamount to a declaration of war.",
      "But it did not deny that fact either.",
      "“Nobody informed anyone about anything,” said Dmitry Peskov, the Kremlin spokesperson.",
      "“In this world, it’s absolutely clear to everyone what an attempt to encroach on the Russian leader means.” “Therefore, there’s no need to explain anything to anyone here.” In March, the ICC issued an arrest warrant for Putin for overseeing the abduction of Ukrainian children in its invasion of Ukraine.",
      "Both Putin and Russia’s children’s rights commissioner Maria Alekseyevna Lvova-Belova bore responsibility for the “unlawful deportation” of thousands of Ukrainian children, the court, based in The Hague, said.",
      "It was a rare indictment of a sitting head of state.",
      "Russia has denounced the ICC decision and said it does not apply to Russia because Moscow is not a signatory to the treaty.",
      "But Putin has not travelled abroad, save for the occupied territories of Ukraine, since the ICC warrant was announced.",
      "Putin will attend the Brics summit by videoconference, the Kremlin has said.",
      "The Russian foreign minister, Sergei Lavrov, will lead a delegation to South Africa.",
      "The summit is set to take place on 24-26 August.",
      "It will bring together representatives of Brazil, Russia, India, China and South Africa.",
      "It is the first in-person Brics summit since Covid."
    ],
    "topics": [
      "south africa",
      "brics summit",
      "cyril ramaphosa",
      "russian president",
      "icc warrant",
      "putin attend",
      "attend brics",
      "president would",
      "russian leader",
      "declaration war"
    ]
  },
  {
    "title": "South Africa may seek way out of hosting Brics summit over Putin arrest",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/jun/11/south-africa-may-seek-way-out-of-hosting-brics-summit-over-putin-arrest",
    "publishedAt": "2023-06-11T16:48:24Z",
    "sentences": [
      "Pretoria would be required to arrest Putin if he attended and send him to The Hague for trial on war crimes charges South Africa may abandon its role as host of this year’s Brics summit in an attempt to avoid international pressure to arrest the Russian president, Vladimir Putin, who is wanted by the international criminal court on charges of war crimes.",
      "In a flurry of diplomatic activity around Ukraine, South Africa with five other African states is trying to garner support for a new peace plan.",
      "South Africa’s president, Cyril Ramaphosa, on Saturday briefed Chinese leader, Xi Jinping, on the upcoming visit by African leaders to Russia and Ukraine in an attempt to end hostilities.",
      "China has its own peace mission under way, and it is not clear what the Africa mission might add.",
      "Ramaphosa has recruited Zambia, Senegal, Republic of Congo, Uganda, and Egypt to join his peace delegation.",
      "As a party to the Rome statute, the treaty underpinning the court, Pretoria would be required to arrest Putin and then send him to The Hague for trial.",
      "But China and India, if they hosted the summit, would not face the same obligation, leading some South African officials to suggest handing the summit to Beijing.",
      "Brazil, the fifth member of Brics (Brazil, Russia, India, China and South Africa) is also a party to the court, so faces the same dilemma as South Africa.",
      "Ukraine hopes to capitalise on the proliferation of peace plans emerging from the global south by staging a peace conference in July, possibly in Denmark, at which it would set out its terms for a settlement to the conflict.",
      "The aspiration is that by then Ukraine’s counteroffensive would have changed the dynamic of the war, and Kyiv hopes the global south will realise that Russia needs to leave Ukraine to avoid further bloodshed.",
      "The Danish foreign minister, Lars Løkke Rasmussen, has already said he is willing to host such an event.",
      "The Ukrainian president, Volodymr Zelenskiy, said he would speak on Sunday to the Polish president, Andrzej Duda, about a dinner Duda intends to attend on Monday with the German chancellor, Olaf Scholz, and the French president, Emmanuel Macron, focused on Ukraine’s bid for Nato membership at a summit in Vilnius in July.",
      "The three leaders are expected to discuss the postwar security guarantees that can be offered to Ukraine, and how specific a route map to Nato membership can be offered.",
      "Zelenskiy said: “Let’s hope that our colleagues are thinking about how to speed up Ukraine’s accession to Nato.",
      "Or not.",
      "Let’s see.” In an unprecedented speech in Bratislava this month, Macron not only held out an olive branch to eastern European states he has criticised in the past, including Poland, but proposed guarantees to Ukraine that match those provided by the US to Israel.",
      "The guarantees would not necessarily be provided by Nato itself but by Nato member states.",
      "He said Ukraine warranted “strong, concrete and tangible” security guarantees and argued that it should be offered “a path towards membership”.",
      "However, Scholz struck a different tone, saying last Thursday that the focus should not be on Nato membership.",
      "He said: “It is also clear that we will have to discuss what security guarantees can be provided in the postwar situation” The exact nature of the offer that could be made to Ukraine is complicated by the fact that when the Nato members meet, the context may have changed depending on perceptions of the state of the counteroffensive currently under way.",
      "Ukraine could not be offered Nato membership while at war with Russia since that would require the alliance taking on a commitment to go to war with Moscow.",
      "US envoy to Nato, Juliette Smith, told Politico last week: “I think the allies now are in agreement that a proper invitation is unlikely while they’re engaged in a full-scale war.” At the same time, the fear is that if the Vilnius summit sends out a weak signal to Ukraine, that may encourage Putin to believe western support is wavering and that he could ultimately win the war or at least achieve a frozen conflict.",
      "Poland wants the focus to be on the guarantees that can be provided before membership, covering ammunition production inside Ukraine, continued supplies of arms and air power to Ukraine and the interoperability of Ukrainian and Nato weaponry.",
      "The US president, Joe Biden, is also being urged to make progress on the issue at Vilnius rather than wait until next year’s Nato summit in Washington, which will fall in the middle of an election campaign consumed by the question of whether the US should extend its defence commitments with Europe."
    ],
    "topics": [
      "south africa",
      "nato membership",
      "security guarantees",
      "pretoria would",
      "would required",
      "required arrest",
      "arrest putin",
      "send hague",
      "hague trial",
      "war crimes"
    ]
  },
  {
    "title": "South Africa grants Putin and Brics leaders diplomatic immunity for summit",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2023/may/30/south-africa-grants-putin-and-brics-leaders-diplomatic-immunity-for-summit",
    "publishedAt": "2023-05-30T14:51:35Z",
    "sentences": [
      "ICC warrant for Russian president’s arrest issued in March over alleged war crimes in Ukraine South Africa has issued blanket diplomatic immunity to all leaders attending an August summit, meaning Vladimir Putin might be able to travel to Johannesburg and not fear the country acting on an international criminal court warrant for his arrest.",
      "South African officials insisted the broad offer of immunity, issued in a government gazette, may not trump the ICC arrest warrant.",
      "As an ICC member, South Africa would be under pressure, and possibly under a legal requirement, to arrest Putin.",
      "The court issued a warrant for his arrest in March over the alleged forcible deportation of children from Ukraine to Russia.",
      "South Africa is hosting a summit of the Brics group: Brazil, China, India, Russia and South Africa, in August.",
      "A two-day planning meeting of foreign ministers is due to take place this Thursday.",
      "“This is a standard conferment of immunities that we do for all international conferences and summits held in South Africa, irrespective of the level of participation,” the Department of Foreign Affairs said on Tuesday.",
      "“The immunities are for the conference and not for specific individuals.",
      "They are meant to protect the conference and its attendees from the jurisdiction of the host country for the duration of the conference.” In April, South African president, Cyril Ramaphosa, appointed an inter-ministerial committee headed by his deputy president, Paul Mashatile, to look into how the law applied to a visit by the Russian president.",
      "The government is looking into the wording of the Rome Statute, the charter that established the ICC, for a loophole that would enable Putin to attend without South Africa having to arrest him.",
      "Article 98 of the ICC Rome Statute states: “The court may not proceed with a request for surrender or assistance which would require the requested State to act inconsistently with its obligations under international law with respect to the State or diplomatic immunity of a person … of a third state, unless the court can first obtain the cooperation of that third State for the waiver of the immunity.” Some say this wording provides South Africa with a chance to invite Putin and not be under any obligation to arrest him.",
      "A similar row occurred in 2005 when the then Sudanese president Omar al-Bashir came to South Africa.",
      "He swiftly left the county as it became increasingly likely that the South African high court was about to rule that he had to be arrested.",
      "Russia has stepped up its drive to boost ties with Africa to help offset a chill in relations with the west prompted by its invasion of Ukraine, and plans to hold an Africa-Russia summit in St Petersburg in July.",
      "It is not clear yet if Putin would be willing to save South Africa from the diplomatic dilemma by not attending in person.",
      "The Kremlin said on Tuesday that Russia would take part at the “proper level”.",
      "The foreign minister, Sergei Lavrov, is already slated to attend the planning meeting.",
      "The Brics group of large emerging economies is increasingly seen as a rival to the G7 group of western industrialised countries.",
      "Asked at a regular news briefing about the possibility of an arrest warrant, the Kremlin spokesperson, Dmitry Peskov, said: “Of course we count as a bare minimum on partner countries in such an important format not being guided by such illegal decisions.” South Africa has been accused of fence-sitting over Russia’s invasion of Ukraine.",
      "The US embassy recently claimed South Africa had sent weapons to Russia.",
      "Support for Russia inside the ruling ANC is strong due to the Soviet Union’s role in opposing colonialism.",
      "The government notice about immunity, which was gazetted on Monday, was routine protocol to protect the conference, the foreign ministry said, adding: “These immunities do not override any warrant that may have been issued by any international tribunal against any attendee of the conference.”"
    ],
    "topics": [
      "south africa",
      "south african",
      "russian president",
      "march alleged",
      "diplomatic immunity",
      "warrant arrest",
      "arrest warrant",
      "russia south",
      "brics group",
      "planning meeting"
    ]
  },
  {
    "title": "The awkward multi-polar world of the West versus ever-wealthy developing countries",
    "source": "Sky News",
    "url": "https://news.sky.com/story/the-awkward-multi-polar-world-of-the-west-versus-ever-wealthy-developing-countries-12862152",
    "publishedAt": "2023-04-21T02:31:00Z",
    "sentences": [
      "The political clout of the BRICS is turning out to be as important as their increasing economic heft.",
      "Assumptions in 2001 that these countries would become friendly allies in a US-dominated world order are proving false.",
      "Sky News commentator @adamboultonTABB Friday 21 April 2023 03:31, UK When Jim O'Neill, the Goldman Sachs banker, popularised the term BRIC in 2001, he was talking about investment opportunities in the fastest growing economies in the world: Brazil, Russia, India and China, with South Africa added in 2010 making the acronym up to BRICS.",
      "The countries identified swiftly formed a club, with leaders meeting regularly for summits.",
      "Vladimir Putin may well dodge sanctions to attend the next meeting in August in South Africa.",
      "The political clout of the BRICS is turning out to be as important as their increasing economic heft.",
      "Assumptions in 2001 that these countries would become friendly allies in a US-dominated world order are proving false.",
      "None of the BRICS have backed the West - roughly comprising the US, UK, EU and Japan - in opposing Russia's invasion of Ukraine.",
      "Russia is the aggressor in Ukraine, and China is its \"partner without limits\", as agreed by presidents Xi and Putin, so no surprise there.",
      "India and South Africa have economic and energy needs and colonial resentment, which Russia and China have been keenly exploiting.",
      "Hopes were highest that Brazil might support the Western position, under the newly restored leadership of President Luiz Ignacio Lula da Silva.",
      "Instead, Lula celebrated his first 100 days back in office with a state visit to China, and by playing host to the Russian foreign minister Sergei Lavrov.",
      "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot In public statements, Lula attacked the US for \"encouraging\" and \"incentivising\" the Ukraine conflict, bemoaned the US dollar's role as the global reserve currency and argued for \"new geopolitics to change world governance by giving more representation to the UN\".",
      "His foreign minister, Fernando Haddad, warned bluntly that Brazil is \"too big to be choosing partners\".",
      "Brazil is a major power in the world.",
      "It is the largest country with the biggest population in Latin America, its economy is in the world's top 10 in terms of size and its Amazonian rain forest is essential to reducing climate change.",
      "Brazil's international political stance is also critical when the United States' \"unipolar moment\" of world dominance is over and new superpowers such as China and India are rising, potentially threatening the \"Western democratic\" notions of governance established after the Second World War.",
      "Lula served two terms as president of Brazil between 2003 and 2010.",
      "A working-class trade unionist from the Workers Party, his repeated electoral success consolidated his country as a representative democracy.",
      "He was feted as a regular guest at the summits of the G7 club of rich nations.",
      "After standing down as president in 2010 he was convicted and imprisoned on corruption charges.",
      "These were subsequently annulled, enabling him to run for office again in 2022.",
      "European leaders barely hid their satisfaction when he beat the right-wing Trumpian incumbent Jair Bolsonaro in the second round of voting.",
      "Western leaders praised Lula Prime Minister Rishi Sunak tweeted: \"Congratulations to @LulaOficial on his victory in Brazil's election.",
      "\"I look forward to working together on the issues that matter to the UK and Brazil, from growing the global economy to protecting the planet's natural resources and promoting democratic values.\"",
      "Keir Starmer was similarly effusive: \"Congratulations to @LulaOficial on the great news of his election as president of Brazil.",
      "This win must also be the start of a new era of global cooperation and action in the fight against climate change.\"",
      "Lula reappointed his sometime rival Marina Silva, a widely respected politician and environmentalist, as minister of the environment and climate change, but so far delivery by his administration has been disappointing.",
      "The rate of deforestation in the Amazon went up 75% under President Bolsonaro and it has not yet slowed down.",
      "February 2023 was the worst ever month.",
      "According to the DEFER surveillance by Brazil's own INPE (National Institute for Space Research) 209 square kilometres of forest were destroyed, the equivalent of 30,000 football pitches.",
      "Lula's priorities for his presidency are fighting hunger and poverty and managing de-industrialisation through investment in new technologies.",
      "He has also set the ambitious target of zero deforestation by 2030.",
      "This is largely dependent on international donations to the Amazon Fund.",
      "Both Germany and Norway have resumed their pledged contributions since his return to office.",
      "But the European Union is getting anxious about Brazil's evolving stance.",
      "A briefing paper for next week's EU foreign ministers summit, seen by Politico, \"is concerned about Brazil's position on Russia's war on Ukraine and Brazil's lack of delivery on climate environment\".",
      "These concerns are likely to further delay completion of an historic trade and cooperation pact with the Mercosur trade bloc (Brazil, Argentina, Uruguay and Paraguay) which has been under discussion for 20 years.",
      "After signing a Double Tax Agreement with Brazil in December the UK is also hoping for a deal and increased trade with Brazil.",
      "Environmental concerns v closer economic ties Closer economic ties are threatened by environmental concerns in Europe.",
      "To take the area of agricultural exports as an example, the UK government is being pressed to take a tougher line on so-called \"Cattle-laundering\", the practice whereby animals are raised on illegally deforested land but moved to other farms to qualify as legal meat at slaughter.",
      "The censorious imposition of trade sanctions by the US and Europe for political reasons and perceived violations of international laws is antagonizing other countries.",
      "Instead of entering into multilateral rules-based agreements, Brazil, like many other middle to high income economies, is striking bilateral deals with China and Russia.",
      "In China's case, this is often backed up by inward investment and foreign aid.",
      "Please use Chrome browser for a more accessible video player At this month's IMF World Bank meeting the former US Treasury Secretary Larry Summers admitted he is troubled that the US and its allies are becoming isolated as other powers get together.",
      "People from developing countries are saying to him: \"What we get from China is an airport.",
      "What we get from America is a lecture.\"",
      "China is already, by far, Brazil's greatest trading partner, exchanges are at a record of high of $150 billion annually.",
      "\"The West\" may broadly agree on political outlook but their circumstance means that the US and European nations are dealing with Chinese expansionism in different ways.",
      "The US has the capacity to be largely self-sufficient and, encouraged by incentives in President Biden's Inflation Reduction Act, is \"re-shoring\" key technologies.",
      "Ford has closed its electronic vehicle plant in Brazil.",
      "Friction over Ukraine European politicians want to increase investment in energy and digital in Latin America and they are in desperate need of raw materials and rare earth minerals from there for new technology.",
      "From Bolivia to Afghanistan, China is investing in lithium extraction, a key element in batteries.",
      "Following outcry in the US and Europe, President Lula has not repeated his early view of Ukraine's President Zelenskyy that \"this guy is responsible as Putin for the war\" and has conceded that Russia is in \"violation of Ukraine's territorial integrity\".",
      "Next week, Lula is due to visit Spain - his country's closest historical links are with Iberia.",
      "It remains to be seen if he will take up Zelenskyy's invitation to come and see what is happening for himself.",
      "Please use Chrome browser for a more accessible video player Lula has suggested that Ukraine should be ready to \"give up Crimea\".",
      "His stance is consistent with Brazil's longstanding non-aligned advocacy of \"peace\".",
      "It is also a de facto strengthening of Russia's position in the eyes of the world community if and when peace negotiations take place.",
      "It undermines NATO's determined opposition to reverse the violent occupation of the party of another sovereign state.",
      "The stakes over Taiwan and its world-beating micro-chip industry have been raised even higher.",
      "The alternative diplomatic and economic path being taken by the BRICS, and especially Lula's democratic Brazil, which was potentially the West's most natural ally in the Ukraine crisis, is writing on the wall for the UK and its European neighbours.",
      "Our values are not supreme.",
      "The US umbrella is not a sufficient shield.",
      "Welcome to the awkward multi-polar world."
    ],
    "topics": [
      "south africa",
      "climate change",
      "political clout",
      "clout brics",
      "brics turning",
      "turning important",
      "important increasing",
      "increasing economic",
      "economic heft",
      "heft assumptions"
    ]
  },
  {
    "title": "Putin’s errors over Ukraine could herald big change for global finance",
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/2022/mar/01/putin-errors-ukraine-global-finance-sanctions-russia",
    "publishedAt": "2022-03-01T11:40:02Z",
    "sentences": [
      "The inventor of the Brics acronym says sanctions against Russia have exposed nations’ dependence on the western economic system During the brief heyday of Russia as a “Bric”, the acronym I dreamed up in 2001 to describe the possible future largest emerging economies in the world – Brazil, Russia, India and China – I would go to Russia reasonably frequently.",
      "In 2008, I was asked by the organisers to give a special presentation on where Russia’s economy might be, by 2020, to the St Petersburg Summit, Russia’s own version of Davos.",
      "To my slight embarrassment, I hadn’t really appreciated that they would be quite irritated if I didn’t suggest that Russia was likely to be in the top five largest economies of the world by 2020, which I did realise afterwards, when my presentation and comments caused a bit of stir in the post-event coffee areas and media.",
      "Essentially I suggested that given Russia’s challenging demographics, and that crude oil prices were unlikely to continue the one-way rise that had characterised the decade to date, Russia’s potential growth rate was probably not much more than 2%.",
      "And if they really wanted to have the powerful economic growth that had been experienced in (those) recent years, they needed to undertake significant reforms to boost productivity.",
      "The reaction to my presentation among officialdom was my first real suspicion that Russia might have challenges ahead, which of course, was without realising the scale of chaos that was about to unfold in the global financial system and the subsequent economic collapse around much of the world.",
      "That set of circumstances contributed to a major multi-year peaking in oil prices, and much of what happened since, which for Russia, has been persistent economic disappointment.",
      "I have no great expertise at geopolitics but I have broadly assumed in the past decade or so that Vladimir Putin had decided that his huge domestic popularity would decline because he couldn’t achieve the growth that had taken place pre-crisis.",
      "Nor could he really reform, because much of his personal financial benefit and those of some close to him depended on the status quo, so he had to shift to another platform, which was loosely based around the idea of making Russia great.",
      "During those years, I got to know several senior technocrats in the policy world, primarily from the central bank and finance ministry, and leading economic influencers, and I was often struck by how widely the belief was about Putin’s excellence as a strategist.",
      "I had for some years been expecting some great era of big reforms to be unleashed due to these views but alas, they never came, and instead, this game of playing on his perception of western weakness dominated his apparent strategic thinking.",
      "Well, after the weekend just passed, and the western financial sanctions announced, it seems to me that Putin isn’t such a great strategist after all.",
      "I don’t know where the idea of freezing the central bank’s foreign exchange reserves originated, but whoever thought of it has come up with a cracker, alongside the bold move by leading western nations to agree to remove key Russian banks from the Swift plumbing network of the financial system.",
      "In one fell swoop, that announcement has essentially eradicated the relevance of Russia’s massive official foreign exchange reserves, and with it, sowed the seeds for big problems for the Russian economy.",
      "I had been thinking throughout recent weeks: how can a country that is no longer in the top 10 largest of the world’s economy (barely 2% of global GDP now) have such apparent military importance around the world?",
      "After the further collapse of the currency, the ability of Russia to remain anywhere near as important globally is starting to rapidly fade.",
      "Based on the exchange rate on Monday, Russia could at the end of 2022 rank no higher than 15th.",
      "While the background to recent awful events had included a picture of increasing closeness between Beijing and Moscow, I suspect the Chinese leadership might be scathing about what Putin has provoked as a response from the west.",
      "Now any country thinking of using its supposed military might to pick on a small neighbour to the dislike of the western democratic alliance will have to calculate the consequences for their own central bank being frozen out of the system, and with it, economic warfare being used in such speedy form as a much more powerful form of influence.",
      "Of course, there are many other aspects that go along in parallel, not least the remarkable shift in German policy on its own defence spending, its decision to pay for some weapons for Ukraine, and, of course, its sudden opposition to the previously agreed deal for a pipeline for more Russian gas.",
      "And with this, there has been a much more joined-up and robust EU policy response.",
      "It is now likely the case that some thinkers around the large emerging economies will have to, once again, rethink their happy dependency on the western-dominated financial system, and it is not impossible that current events sow the seeds for a big reform of the global financial system.",
      "There is no way that is going to happen unless such countries, China included, shift their approach to the use of their currency, and with it, many aspects of their economic and related systems.",
      "As for Russia, some huge reflection on its leadership must surely soon occur."
    ],
    "topics": [
      "financial system",
      "central bank",
      "emerging economies",
      "economies world",
      "oil prices",
      "global financial",
      "foreign exchange",
      "exchange reserves",
      "seeds big",
      "many aspects"
    ]
  }
]