[
  {
    "title": "Diplomatic success for Putin was also demonstration of Brics dynamism",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/asia-pacific/2024/10/25/diplomatic-success-for-putin-was-also-demonstration-of-brics-dynamism/",
    "publishedAt": "2024-10-25T04:00:00Z",
    "sentences": [
      "With more than 20 leaders showing up in the Russian city of Kazan, this week’s Brics summit was a diplomatic success for Vladimir Putin, who faces an arrest warrant from the International Criminal Court for alleged war crimes in Ukraine.",
      "It was also a display of the dynamism of the informal group, which now has nine member states and on Thursday added 13 new “partner countries” including Turkey, Indonesia and Malaysia.",
      "The 43-page Kazan Declaration included a call to reform the United Nations and Bretton Woods institutions and a condemnation of the western sanctions regime.",
      "But the most important moment came on the sidelines of the summit with a public rapprochement between Xi Jinping and India’s prime minister Narendra Modi.",
      "Before the meeting, China and India reached an agreement on how to patrol their disputed border in the Himalayas, which saw deadly clashes between their forces in June 2020.",
      "Relations between Beijing and New Delhi have been getting worse with the imposition of trade sanctions and the mutual expulsion of journalists and there are currently no scheduled flights between the two countries.",
      "When Xi and Modi met on Wednesday, it was their first formal meeting for almost five years but they had plenty of warm words for one another.",
      "“China and India are each other’s development opportunity rather than threat, and co-operation partner rather than competitor,” Xi told the Indian prime minister.",
      "He said that they should strengthen communication and co-operation, “properly handle divergences and differences” and shoulder their international responsibilities.",
      "Xi added that China and India could “set an example for developing countries to seek strength through unity and contribute to a multipolar world and democratisation of international relations”.",
      "The official Chinese readout of the meeting said the two leaders agreed to handle China-India relations “from a strategic height and long-term perspective” and not to let specific differences affect their overall bilateral relations.",
      "Indian officials said after the meeting that the restoration of “peace and tranquillity” on the border would create space for a return to the normalisation of relations between the two countries.",
      "A thaw in relations between the world’s two most populous countries promises economic benefits for both and Wednesday’s meeting follows pressure on Modi from Indian companies worried about being shut out of the Chinese market.",
      "It could also help both countries in their dealings with the United States after next month’s presidential election, regardless of the outcome.",
      "It is further evidence that Washington’s efforts to isolate China within Asia have failed and it is a powerful reminder that India, which has moved closer to the US in recent years, has other options.",
      "Warmer relations between Beijing and New Delhi would also benefit Brics itself, which has operated in the shadow of the discord between its biggest members.",
      "“Brics is an indicator of how profoundly the old world order is changing,” India’s foreign minister Subrahmanyam Jaishankar told the summit.",
      "Brazil, Russia, India, China and South Africa last year invited four new countries to join: Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "Argentina was going to join but far-right president Javier Milei dropped the plan and Saudi Arabia is still considering whether to accept an invitation to join.",
      "The Kazan Declaration reflects the grievances and aspirations shared by the disparate countries that are part of Brics.",
      "Top of the agenda is their demand for fairer representation in international bodies such as the International Monetary Fund (IMF) and the World Bank, which are meeting in Washington this week.",
      "The declaration calls for the elimination of “unlawful unilateral coercive measures”, including economic sanctions and secondary sanctions.",
      "Partly in response to sanctions, Brics countries trading with one another are encouraging the use of local currencies rather than the US dollar and are developing an alternative to the Swift cross-border payments system.",
      "Although Brics includes Russia, China and Iran and wants to change the western-dominated international system, it is non-western rather than anti-western.",
      "Most of its members and partner countries such as Turkey pursue instead a foreign policy approach that has been identified in Latin America as active non-alignment.",
      "[ Xi tells Putin the world is in chaos but friendship with Russia will endureOpens in new window ] “Active non-alignment is not about neutrality or equidistance between great powers.",
      "Rather, it is dynamic.",
      "This means that on some issues (such as democracy or human rights), Latin American countries may take positions closer to the United States’, while on others (such as international trade) they may take positions closer to China’s.",
      "What countries will not do is side unequivocally with one or the other,” according to Jorge Heine and Thiago Rodrigues.",
      "[ The Irish Times view on the Brics summit: signs of shifting international alliancesOpens in new window ] “This, of course, requires a highly calibrated diplomacy that evaluates each issue on its own merits and then decides how to respond.",
      "It is a much more exacting task than doing as one is told on every issue, as aligned countries are expected to do.",
      "But this position also lends developing nations greater leverage in their dealings with great powers.”"
    ],
    "topics": [
      "china india",
      "brics summit",
      "partner countries",
      "kazan declaration",
      "prime minister",
      "relations beijing",
      "beijing new",
      "new delhi",
      "two countries",
      "one another"
    ]
  },
  {
    "title": "Commonwealth and Brics",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/opinion/letters/2024/10/25/commonwealth-and-brics/",
    "publishedAt": "2024-10-24T23:30:00Z",
    "sentences": [
      "Sir, – You gave an apt description in your editorial (October 22nd) of “a shifting world order” to the international summits taking place on our planet.",
      "Leaders of the Commonwealth headed to Samoa while Brazil, India, China and South Africa went to Kazan for the Brics summit hosted by Russia.",
      "The Commonwealth is but a paper tiger and a historical remnant of colonial times while the Brics is a growing world powerhouse representing 4.1 billion people of the developing south and 35 per cent of the world’s economic output.",
      "There is no doubt that those increasing countries united in the loose organisation of Brics will dominate the world’s economic, political and military structures in the near future while the present dominance of by the western alliance will inversely wane.",
      "The peoples of the developing world are demanding a new global economic order based on a just sharing of the world’s resources.",
      "The Brics alliance is the vehicle for these just demands.",
      "Hopefully, the western and the Brics alliances can learn to coexist together in a new world order based on mutual respect and not on militarism.",
      "– Yours, etc, BRENDAN BUTLER, Drumcondra, Dublin 9."
    ],
    "topics": [
      "world order",
      "world economic",
      "order based",
      "sir gave",
      "gave apt",
      "apt description",
      "description editorial",
      "editorial october",
      "october 22nd",
      "22nd shifting"
    ]
  },
  {
    "title": "The Irish Times view on the Brics summit: signs of shifting international alliances",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/opinion/editorials/2024/10/22/the-irish-times-view-on-the-brics-summit-signs-of-shifting-international-alliances/",
    "publishedAt": "2024-10-22T19:10:00Z",
    "sentences": [
      "Two international summits opened yesterday, with leaders of the Commonwealth heading to Samoa, while Russia hosted the Brics – also including Brazil, India, China and South Africa – in Kazan.",
      "The decisions by Indian prime minister Narendra Modi and South African president Cyril Ramaphosa to skip the Commonwealth gathering in favour of the one in Russia says much about the shifting sands of global power dynamics, the eclipse of empire, and the emergence of new forums in which giant emerging economies are finding common cause.",
      "In the name of inclusiveness the 56-country, 2.7 billion-people, Commonwealth is being rebranded the “Commonwealth of Nations”, the British now just one of equals, and will focus on social mobility, inclusion, economic development, good governance and environmental protection.",
      "But the legacy of its association with colonialism will not go away – reparations for slavery by colonial power Britain are pushing their way on to the agenda to the embarrassment of King Charles III., who faced protests on the issue as he passed through Australia.",
      "The Brics group is a sometimes uncomfortable alliance of some major economies that has expanded this year to include Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "It represents almost half the world’s population and more than 35 percent of global economic output, although China is responsible for the bulk of this.",
      "Very much driven by Russia and China, the Brics aspires to be a global counterweight to western power, both economic and political, and – among other things – to upgrade their representation and influence in the multinational institutions like the UN and IMF.",
      "Russia will not have it all its own way – it might hope to get support for its Ukrainian war, but will have difficulty persuading India, Brazil and South Africa, the group’s major democracies, to take a more adversarial stance towards the US.",
      "To those countries, the Brics group is a way to strike a balance between Beijing and Washington in a world of shifting alliances."
    ],
    "topics": [
      "south africa",
      "brics group",
      "two international",
      "international summits",
      "summits opened",
      "opened yesterday",
      "yesterday leaders",
      "leaders commonwealth",
      "commonwealth heading",
      "heading samoa"
    ]
  },
  {
    "title": "Brics and Global South directly shifting world order dominated so far by G7",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/asia-pacific/2024/09/27/brics-and-global-south-directly-shifting-world-order-dominated-so-far-by-g7/",
    "publishedAt": "2024-09-27T04:00:00Z",
    "sentences": [
      "The dynamics of global governance are likely to shift significantly in favour of the emerging economies of the Global South as they engage forcefully with their affluent and more developed rivals from the Global North.",
      "A cross-section of diplomats and analysts in New Delhi anticipate that the face-off between these two opposing blocs – the South led by the expanded and financially resurgent 10-nation Brics federation (Brazil, Russia, India, China and South Africa) and the industrialised North, epitomised by the G7 states – will precipitate a reworked multipolar, mutually equitable and sustainable world order.",
      "The economically burgeoning Brics group, along with the Global South, comprising African, Asian and Latin-American states, is not only directly challenging the North’s dominance in financial, trade and technological sectors, but is also demanding comprehensive structural reforms of the UN, the International Monetary Fund and the World Bank.",
      "It has repeatedly claimed that, over decades, all three have jointly failed to represent their interests.",
      "Additionally, Brics has presented its New Development Bank (NDB), founded in 2014, as an alternative to western-led financial organisations to bankroll infrastructure and sustainable developmental projects for its members and assorted Global South states, particularly across Africa.",
      "By the end of 2022, the NDB claimed to have disbursed $32 billion (€28.67 billion) in loans to developing countries to construct roads, bridges, railways, ports, water supply and energy projects, alongside digital infrastructure and environmental protection undertakings.",
      "[ Denis Staunton: Russia and China rewrite global rule bookOpens in new window ] Brics has also prioritised co-operation among developing countries through reduced trade and tariff agreements to augment local markets and commerce in a direct challenge to the Global North’s economic hegemony.",
      "Such palpable South-North animosity was drolly highlighted recently in a quip by India’s foreign minister Subrahmanyam Jaishankar at the Global Centre for Security Policy in Switzerland, in which when he derided the G7′s opposition to and animosity towards Brics.",
      "In a clip that went viral on social media on September 12th, he said the Brics “club” came into being after the established G7 club refused entry to anybody else, and expressed amazement over the Global North’s abiding insecurity over it once it was instituted.",
      "“Somehow, something seems to get under their [G7s] skin” he added.",
      "India, along with Brazil, China and Russia were the original Brics founders in 2006.",
      "South Africa joined the grouping four years later.",
      "In January 2024, Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates became members.",
      "[ Jack Power: EU failed to pay attention to Global South for yearsOpens in new window ] A former Indian ambassador who had served with Brics, and later at the UN, said that in recent years Brics has accelerated the Global South’s economic rise at the expense of the G7 states comprising Canada, France, Germany, Italy, Japan, the UK and the US, as well as the EU.",
      "The ambassador, who declined to be named, said Brics has provided the necessary “impetus and enablement” to rebalance the financial inequities in the “skewed” global order.",
      "He said this has facilitated a shift away from the unipolarity of the post-cold-war era dominated by the US and its allies to multipolarity, encompassing emerging economies.",
      "The envoy said the collective economic heft of Brics, embodying 35-37 per cent of the world’s gross domestic product, is firmly poised to “confront” western dominance in finance, trade and technology.",
      "Elaborating on this, other retired diplomats said enhanced intra-collaboration among Brics members and many emerging Global South countries would divert investment flows away from G7/Global North economies.",
      "And, as Brics expanded financially, so would its bargaining power in leveraging commodity markets and trade in assorted natural resources, which its members and others from the Global South possess in abundance.",
      "That being said, Brics and Global South states are amenable to collaborating with the Global North to address common challenges such as climate change, economic instability and health crises.",
      "In this potentially symbiotic relationship, the former aims to leverage the latter’s vastly superior technological and financial resources, offering innovative grassroots strategies in return.",
      "[ Bill Corcoran: Africa fights for influenceOpens in new window ] But despite broad consensus among Brics members, many relationships contain rivalries stemming from historical conflicts, territorial disputes, economic competition and differing political ideologies.",
      "There is a major discord between China and India, two of Brics’ largest economies, whose armies have been locked in a standoff over an unresolved border in the Himalayas since May 2020.",
      "India also views China’s foreign policy (the Belt and Road Initiative), striving to connect Asia, Africa, and Europe via land and sea routes, as a hegemonic ploy to encircle it and dominate South Asia.",
      "And though China and Russia recently cultivated a strategic relationship, apprehension remains regarding the latter’s financial reliance on Beijing.",
      "[ Kevin O'Sullivan: Vulnerability of Africa and Global South needs to be addressedOpens in new window ] Russia’s ambition to maintain its status as a global power rivals China’s analogous objectives, spawning uncertainty and a delicate balancing act.",
      "Alongside this, Brazil’s internal economic and political instabilities have curtailed its capacity to exert adequate influence on the Brics group, while South Africa, the group’s smallest economy, often finds itself sidelined.",
      "Meanwhile, analysts believe that the UN’s role in mentoring a potentially refurbished global governance paradigm is paramount.",
      "Likewise, they say that despite shortcomings, the UN structurally remains the solitary global forum to consensually formulate strategies to tackle transnational issues such as climate change, pandemics, economic justice and security threats.",
      "Saturday: Daniel McLaughlin on how Russia plays champion of the Global South in battling the “collective West” in world affairs"
    ],
    "topics": [
      "global south",
      "global north",
      "new window",
      "south africa",
      "said brics",
      "global governance",
      "emerging economies",
      "expanded financially",
      "g7 states",
      "brics group"
    ]
  },
  {
    "title": "European Union ‘failed to pay attention’ to Global South for years",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/europe/2024/09/26/european-union-failed-to-pay-attention-to-global-south-for-years/",
    "publishedAt": "2024-09-26T04:00:00Z",
    "sentences": [
      "The European Union and other major western powers have for years failed to pay enough attention to the Global South, and as a result are struggling to understand the shifting world order, according to several experts and academics.",
      "After long periods of both the United States and Europe focusing inward, the reaction of much of the rest of the world to the Russian invasion of Ukraine proved a sharp wake-up call for the West.",
      "The support that the EU and the US felt they would have had in forums such as the United Nations, to squeeze Russia on the international stage, was not there.",
      "“I think the EU assumed that African nations would vote with it on Ukraine,” says Tanya Cox, director of Concord, an umbrella body of European NGOs working on sustainable development.",
      "“They didn’t vote for Russia either, but they were absolutely ambivalent and didn’t automatically stand behind the EU.",
      "I think the EU is struggling at the moment because it built its vision of a world order based on a rules-based order and the rules-based order is crumbling.” China, the rival superpower, has been seen as backing Russia after the latter’s full-scale invasion of Ukraine in early 2022.",
      "India has continued to be a major buyer of cheap Russian oil, as Europe weaned itself off fuel coming from Russia.",
      "Other countries, like many African nations, took a “count-me-out approach” to the global political arm wrestle, according to Stewart Patrick, a senior fellow in US think tank Carnegie’s global order and institutions programme.",
      "“Within the West there is a little bit of shock to the extent countries wanted to sit on the fence on Ukraine,” he says.",
      "Much of this was linked to a “growing disenchantment” among the Global South with the international institutions.",
      "There was a sense these bodies set up in the aftermath of the second World War were “made for the West, by the West”, Patrick says.",
      "At the same time as the US and European countries seemed to be retreating over the last decade, China has increased its diplomatic presence, seeking to use its huge financial heft to spread its influence.",
      "Its Belt and Road Initiative saw the country invest billions into large infrastructure projects in Africa, Asia and Latin America.",
      "The plan has been viewed as an attempt to gain leverage over poor countries in the Global South, many of which are now heavily indebted to China.",
      "[ A new global order: Rising China and Russia rewrite the international rulebookOpens in new window ] The US and the EU seemed to be slow to grasp the extent to which China was gaining significant sway over others, Patrick says.",
      "“The West took its eye off the ball, particularly with regard to Africa ... and is now playing catch-up.” The EU has since responded with a plan called the Global Gateway, which aims to funnel public and private investment into Africa.",
      "André Sapir, a former senior European Commission adviser, said the EU had been taking too narrow a view of the Global South, which it sometimes just saw as a “provider of raw materials”.",
      "Sapir, a professor at Université libre de Bruxelles who also works with Bruegel economic think tank, says Europe is still “not paying enough attention” to the developing world.",
      "How the EU handled the roll-out of vaccines during the Covid-19 pandemic was not something that many African nations would quickly forget, Cox said.",
      "“It was more than protectionist.",
      "The fact is that by putting European countries first and not worrying about any other countries, it created some very bad blood.” The EU’s “shameful” failure to challenge Israel over its invasion of Gaza was seen as an example of western double standards by many countries, when compared to Russia’s invasion of Ukraine, Cox says.",
      "[ Lack of action to stop attacks on Gaza is a moral injury to us allOpens in new window ] The group of countries known as Brics is seen as one of the main vehicles through which the Global South is able to have influence on the international stage.",
      "The club was made up of Brazil, Russia, India, China, then South Africa, and since the start of this year it includes Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates.",
      "The expanded Brics group triggered some “anxiety in the West”, which for now is “overblown,” according to Patrick.",
      "The band of quickly growing economies is “wildly dominated by China”, which often “steamrolls” the others if it needs to.",
      "At present it is more of an “oppositional force” that could try to block policy, but is less coherent in what it proposes, he says.",
      "“The Brics countries are very successful in their own way ...",
      "They do not have to kowtow to the EU because they have their own power,” Cox says.",
      "“They are players on this chessboard that the EU is struggling to manoeuvre around and to know how exactly to manage.”"
    ],
    "topics": [
      "global south",
      "invasion ukraine",
      "african nations",
      "enough attention",
      "world order",
      "international stage",
      "think eu",
      "nations would",
      "ukraine says",
      "eu struggling"
    ]
  },
  {
    "title": "Robotaxi rides in San Francisco have taken on a whole new meaning",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/business/2023/08/26/enjoying-the-ride-robotaxis-in-san-francisco-give-rise-to-a-new-kind-of-auto-eroticism-with-mixed-results/",
    "publishedAt": "2023-08-26T05:30:00Z",
    "sentences": [
      "On the streets of San Francisco, some citizens have been finding a new way to guarantee the earth will move during sex: by hiring a “robotaxi” for the occasion.",
      "Yes, while some of us are just worried about the springs in our mattresses popping at the wrong moment, the San Francisco Standard reports that more adventurous types have been hiring self-driving cars operated by autonomous taxi service Cruise and, well, enjoying the ride every which way they can.",
      "Robotaxis operated by Cruise, which is a subsidiary of General Motors, and Alphabet-owned Waymo were only this month permitted to expand their experimental test runs in San Francisco to a full day-and-night paying passenger service, backed by an approval from the California Public Utilities Commission despite vociferous opposition from residents and the city’s police and fire departments.",
      "So far, this round-the-clock “infestation” of robotaxis is going about as well as the protesters expected.",
      "After a number of collisions, including one with a firetruck, authorities have told Cruise to cut its fleet by 50 per cent, while no one is ready to forget an incident in May in which a Waymo robotaxi killed a small dog.",
      "Frankly, this brave new world is all a bit of a turn-off.",
      "Days that members of the Writers Guild of America have been on strike.",
      "The previous record length of strike action by the US screenwriters union, set back in 1988, was 153 days.",
      "Length of the previous WGA strike in 2007-2008.",
      "When this threshold was crossed earlier in August, the guild’s negotiating committee co-chairs dubbed it a “milestone of shame” for the AMPTP, the producers’ body representing the big US studios and streamers.",
      "Days that members of actors’ body SAG-AFTRA have also been pounding the picket lines in their fight for better pay and conditions and resistance against the advent of cheap AI-generated content.",
      "It’s a collective tour de force.",
      "As chief product officer of Bloomberg since January 2022, Russia-born Vlad Kliatchko has been responsible for leading a diverse team of technologists who are tackling complex technical challenges and building advanced systems and applications that serve financial market participants around the world.",
      "This sounds like a lot of fun and it has obviously gone well for Kliatchko as he has now been promoted to chief executive of the New York-headquartered financial terminals business, which he first joined as a computer engineer in 2003.",
      "The appointment was part of a reshuffle at the top of the company by its founder, the billionaire Michael Bloomberg (81), who started his second stint as chief executive in 2014.",
      "He wrote in an internal memo that he was not going anywhere: “I’ve never used a title in the company, so I won’t change what I’ll be called – just ‘Mike’.” Earlier this year, Kliatchko was identified by a former Bloomberg executive speaking to the Financial Times as one of “only two people” who run the company, the other being chief commercial officer JP Zammitt, who will have to make do with his elevation to president.",
      "“Bric” started out in 2001 as a term used in a Goldman Sachs report to refer to the economies of Brazil, Russia, India and China.",
      "But via the time-honoured tradition of holding massive summits, the countries then formed a proper organisation, adding South Africa – host of this week’s summit – to become Brics in 2010.",
      "Now six new countries have got their wish to become full members.",
      "1.",
      "Argentina: China and Brazil supported Argentina’s successful bid to join Brics.",
      "Anyone for Bricas?",
      "Probably not, as that acronym is going to get unwieldy fast.",
      "2 and 3.",
      "Egypt and Ethiopia: The two countries are not the only African nations that want to be part of an alliance that could potentially reduce the global dominance of the US dollar.",
      "4.",
      "Iran: The diplomatically isolated home to about a quarter of the Middle East’s oil reserves was among those hoping for formal entrance criteria to be agreed upon this week.",
      "Like the others admitted this week, it will become a Brics country in June 2024.",
      "5.",
      "Saudi Arabia: The country took a break from golf and football to participate in “Friends of Brics” talks in Cape Town earlier this summer.",
      "Its accession to Brics is a “pretty big deal”, said economist Jim O’Neill, who authored the original Goldman Sachs report.",
      "6.",
      "The United Arab Emirates: Like Saudi Arabia, the UAE was regarded as one of the “front-runners” to be allowed into a club that – unsurprisingly given Russia’s involvement – is often quite fractious at the top table.",
      "Get the latest business news and commentary from our expert business team in your inbox every weekday morning"
    ],
    "topics": [
      "san francisco",
      "days members",
      "chief executive",
      "goldman sachs",
      "sachs report",
      "become brics",
      "saudi arabia",
      "streets san",
      "francisco citizens",
      "citizens finding"
    ]
  },
  {
    "title": "Brics group set to expand with six more countries to join next year",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/08/24/brics-group-set-to-expand-with-six-more-countries-to-join-next-year/",
    "publishedAt": "2023-08-24T14:57:00Z",
    "sentences": [
      "The leaders of the Brics states have agreed to invite six countries from Africa, the Middle East and South America to join the group from the beginning of next year.",
      "On the final day of the 15th Brics (Brazil, Russia, India, China and South Africa) Summit in Johannesburg, South Africa’s president Cyril Ramaphosa announced that Argentina, Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates would join the group.",
      "To facilitate the expansion, Mr Ramaphosa said the group had also reached agreement on the principles, standards, criteria and procedures that would guide the admission process.",
      "[ Vladimir Putin defends Ukraine war during address to Brics summit in JohannesburgOpens in new window ] “We have consensus on the first phase of this expansion process and other phases will follow,” he told a press conference at the Sandton Convention Centre on Thursday morning.",
      "Mohammad Jamshidi, a senior adviser to Iran’s president Ebrahim Raisi, wrote on X (formerly known as Twitter) that the country’s admission to Brics was a triumph of diplomacy for his country.",
      "Ethiopia’s prime minister Abiy Ahmed also welcomed his country’s admission as a “great moment”.",
      "Prior to the summit, it was unclear whether the five permanent members could agree on expanding the group, but as the conference progressed over the week it became clear there was a real desire among the leaders to do so.",
      "The purpose and effectiveness of the group has often been questioned since it emerged in 2009 as an alternative for developing states to the global institutions and financial bodies dominated by the US and EU countries.",
      "[ Brics leaders unite in stand over dominance of trade and finance by WestOpens in new window ] However, in recent years, countries from the developing world have felt bodies such as the UN, World Bank and International Monetary Fund (IMF) have failed to treat them fairly.",
      "Consequently, many have been on the lookout for new institutional bodies to align with.",
      "According to Mr Ramaphosa, 23 countries from around the world had officially asked to become members of the Brics group over the past year and a similar number have shown an interest in joining.",
      "A key attraction of the group is the New Development Bank, created in 2015, which aims to offer developing countries an alternative to the World Bank and IMF.",
      "Following the announcement, India’s prime minister Narendra Modi said the new countries’ addition to Brics would strengthen the belief among other states that a new multipolar world order was attainable.",
      "[ Brics leaders look to reduce trade barriers in AfricaOpens in new window ] For the countries that expressed a desire to join Brics, but did not make the cut at this summit, Mr Modi said “India will contribute to the building of a consensus for them to be a part of Brics as partner countries”.",
      "Brazil’s president Luiz Inácio Lula da Silva said the expansion meant “the GDP of Brics is going up to 37 per cent of the world GDP in terms of purchasing power, and 46 per cent in terms of the world population”.",
      "Chinese president Xi Jinping called the Brics expansion “historic” and a new starting point for co-operation between members and other countries in the global south.",
      "He added it would help “to further the cause for world peace and development”.",
      "Russia’s Vladimir Putin had little to say other than to welcome the new members, even though the next annual Brics summit will be held in his country.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "south africa",
      "new window",
      "join group",
      "mr ramaphosa",
      "vladimir putin",
      "brics summit",
      "country admission",
      "prime minister",
      "brics leaders",
      "world bank"
    ]
  },
  {
    "title": "Vladimir Putin defends Ukraine war during address to Brics summit in Johannesburg",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/08/23/vladimir-putin-defends-ukraine-war-during-address-to-brics-summit-in-johannesburg/",
    "publishedAt": "2023-08-23T20:37:00Z",
    "sentences": [
      "Russia’s president Vladimir Putin has used his platform at the Brics Summit in Johannesburg to defend his war against Ukraine and to praise the group of emerging market economies, saying its growing influence will lead to a multipolar world.",
      "The five Brics (Brazil, Russia, India, China and South Africa) leaders had gathered on the second day of the summit to discuss the bloc’s common interests and how best they could help the African continent to develop economically.",
      "But Russia’s leader spent much of his time condemning the West and justifying a conflict that has left tens of thousands dead and millions displaced since his regime invaded Ukraine in late February 2022.",
      "Mr Putin started out by saying the Brics group stands for a multipolar world order built on international law and order, before taking a swipe at countries that prefer to promote “their hegemony, exceptionality, and policy of ongoing colonialism” around the globe instead.",
      "He then went to note that Western countries’ desire to preserve their hegemony had led to a dire crisis in the Donbas region of Ukraine eight years ago and that Russia had stepped in to “support people that fight for their culture, for their traditions, their language, and their future”.",
      "He said: “Our actions in Ukraine are guided by only one thing, to put an end to the war that was unleashed by the West against people in Donbas.” Mr Putin made his address virtually, as he faces an International Criminal Court arrest warrant for alleged war crimes in Ukraine.",
      "South Africa is a member of the Hague-based court and would be obliged to arrest him if in the country.",
      "Before Mr Putin spoke, Brazil’s president Luiz Inácio Lula da Silva told delegates that although he did not underestimate the difficulties that needed to be overcome to achieve peace between Russia and Ukraine, he insisted his country was willing to try.",
      "“We cannot bypass or retreat from the main conflict today that is happening in Ukraine,” he said.",
      "“Brazil is ready to join the peace efforts and we can effectively contribute to achieving an immediate ceasefire, and an ever-lasting peace.",
      "Everybody suffers from the consequences of the war.” The Brics leaders also touched on the subject of the group’s expansion on Tuesday before cancelling the day’s remaining public engagements to engage in unscheduled discussions behind closed doors.",
      "Chinese president Xi Jinping called for the expansion of Brics during his address, saying it would make global governance fairer, while South African president Cyril Ramaphosa ended the session by saying: “We stand on the cusp of expanding Brics formally”.",
      "On Tuesday Indian prime minister Narendra Modi also publicly supported the Brics expansion and last night all leaders who travelled to South Africa gathered for a private dinner at which the group’s expansion was one of the main topics discussed.",
      "At least 20 countries have formally applied to join the group while another 20 have shown an interest in becoming members, according to Mr Ramaphosa.",
      "The Brics summit continues on Thursday for its final gathering of the three-day event.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "south africa",
      "mr putin",
      "brics summit",
      "multipolar world",
      "group expansion",
      "russia president",
      "president vladimir",
      "vladimir putin",
      "putin used",
      "used platform"
    ]
  },
  {
    "title": "Brics leaders unite in stand over dominance of trade and finance by West",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/business/economy/2023/08/22/brics-leaders-unite-in-stand-over-dominance-of-trade-and-finance-by-west/",
    "publishedAt": "2023-08-22T18:32:00Z",
    "sentences": [
      "Leaders of the Brics nations have taken a united stand against the dominance the US and EU exert over international trade and financial systems in their opening remarks at the group’s 15th annual summit in Johannesburg.",
      "The leaders of Brazil, Russia, India, China and South Africa (Brics) positioned the group as an alternative to a unipolar world currently dominated by the West.",
      "South Africa’s president, Cyril Ramaphosa, said they had agreed to consider requests from more than 20 countries to join the group, which accounts for a quarter of global GDP.",
      "Mr Ramaphosa also called for a deepening of multilateralism in the world to counter the growing trend of protectionism that was gaining traction.",
      "And he repeated his call for the reform of global finance institutions, which attach unacceptable conditions to their loans.",
      "Brazil’s president, Luiz Inácio Lula da Silva, told delegates that Brics provides members with a better solution to the current global financial systems, and he reiterated that the group could not accept the “colonial systems” that were still in place today.",
      "He added that Brazil also wanted a new unit for trade in the group – although it would not replace national currencies – as it would make it cheaper for the groups’ members to do business.",
      "Chinese president Xi Jinping’s statement was delivered by the country’s minister of commerce, Wang Wentao, although the former is in South Africa for the Brics Summit.",
      "Mr Wentao referenced the growing global tensions that had emerged in recent years, saying the world did not want another Cold War.",
      "“Many emerging markets have become strong after shaking off the yoke of colonialism,” he said before adding that “hegemony is not in China’s DNA.",
      "We stand firmly on the right side of history.” Mr Wentao concluded that China would welcome additional members to Brics.",
      "Russia’s president, Vladimir Putin, provided a pre-recorded speech that was delivered virtually as he faces an International Criminal Court (ICC) arrest warrant for alleged war crimes in Ukraine.",
      "Were Mr Putin to travel to South Africa, the local authorities would be obliged to arrest him as the country is a member of The Hague-based ICC.",
      "Mr Putin said Brics nations had surpassed the G7 countries in terms of economic activity, and that the summit would discuss “the detailed transition to national currencies for trade between our countries” to reduce their reliance on the dollar.",
      "India’s prime minister, Narendra Modi, called the Brics group “a ray of hope for the global economy” due to the volatility it was experiencing, as its economies were outperforming many of the more developed nations.",
      "“India is the fastest-growing economy.",
      "India has converted crises and difficulties into opportunities,” he said before adding that India had managed to rapidly scale up its rail, road and air infrastructure in less than a decade.",
      "“The number of airports have doubled over the past nine years.",
      "India is among the world’s leaders in the area of renewable energy.",
      "It is but natural that India will become a huge market for renewable energy,” he said.",
      "The Brics Summit, which is a trade, development and finance conference for emerging market economies, continues on Thursday.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa Get the latest business news and commentary from our expert business team in your inbox every weekday morning"
    ],
    "topics": [
      "south africa",
      "brics nations",
      "financial systems",
      "africa brics",
      "national currencies",
      "brics summit",
      "mr wentao",
      "said adding",
      "mr putin",
      "said brics"
    ]
  },
  {
    "title": "South Africa’s Ramaphosa gives full support to expansion of Brics group ahead of summit",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/08/21/south-africas-ramaphosa-gives-full-support-to-expansion-of-brics-group-ahead-of-summit/",
    "publishedAt": "2023-08-21T18:17:00Z",
    "sentences": [
      "South Africa’s president Cyril Ramaphosa has given his full support to the expansion of the Brics group ahead of its summit in Johannesburg, insisting that doing so would result in a more balanced world order.",
      "In a television address on Sunday night ahead of the conference of leading emerging economies this week, Mr Ramaphosa also emphasised South Africa’s commitment to non-alignment, saying it would not be forced to side with any nation.",
      "South Africa has been heavily criticised by some observers in the West for refusing to condemn Russia’s invasion of Ukraine.",
      "However, Mr Ramaphosa’s African National Congress-led government has remained steadfast in its view that taking sides in the war will not help to end it.",
      "“We have resisted pressure to align ourselves with any one of the global powers or with influential blocs of nations,” he said, adding that when African countries did so during the cold war their stability and sovereignty had been undermined.",
      "“This experience has convinced us of the need to seek strategic partnerships with other countries, rather than be dominated by any [one] country,” he said.",
      "Mr Ramaphosa said South Africa strove to work with all nations to achieve global peace and development.",
      "“It is for this reason that South Africa is a member of the Non-Aligned Movement, a forum of some 120 countries that are not formally aligned with or against any major power bloc,” he said.",
      "South Africa is hosting the 15th Brics – Brazil, Russia, India, China, and South Africa – summit from Tuesday to Thursday, and during the gathering the leaders of the member nations aim to increase their political and economic ties as well as explore the group’s expansion.",
      "Mr Ramaphosa says more than 20 nations have formally asked to join the group, and a similar number have expressed an interest in doing so.",
      "Among those seeking to join Brics are Venezuela, Cuba and Iran, countries that have fallen foul of the West’s political and economic sanctions and are seeking an alternative home on the global stage.",
      "The Brics expansion was first mooted at its annual conference last year in China, and senior officials from each member nation were tasked with exploring how best to increase the group’s number in a viable way.",
      "China’s president Xi Jinping, India’s prime minister Narendra Modi and Brazil’s president Luiz Inácio Lula da Silva will all attend the summit in person.",
      "Russia’s Vladimir Putin will participate virtually, as he faces an International Criminal Court arrest warrant for alleged war crimes in Ukraine.",
      "Were Mr Putin to travel to South Africa, the local authorities would be obliged to arrest him as the country is a member of The Hague-based ICC.",
      "Russia’s foreign minister Sergey Lavrov will attend the summit in Mr Putin’s absence.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "south africa",
      "mr ramaphosa",
      "said south",
      "political economic",
      "attend summit",
      "mr putin",
      "africa president",
      "president cyril",
      "cyril ramaphosa",
      "ramaphosa given"
    ]
  },
  {
    "title": "Brics summit in South Africa to look at expanding group of five nations",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/08/20/brics-summit-in-south-africa-to-look-at-expanding-group-of-five-nations/",
    "publishedAt": "2023-08-20T20:00:00Z",
    "sentences": [
      "Although economic development is the central theme of a Brics summit South Africa is hosting this week, expanding the group of five nations to increase its influence over world affairs is also high on the bloc’s agenda.",
      "South Africa’s leader Cyril Ramaphosa will host Chinese president Xi Jinping, Brazil’s Luiz Inácio Lula da Silva and Indian prime minister Narendra Modi at the three-day Johannesburg event, which opens on Tuesday.",
      "It is the 15th summit of the group now comprising Brazil, Russia, India, China and South Africa.",
      "Russia’s Vladimir Putin will attend the conference virtually, though it is the first to be held in-person since 2019, as he faces an International Criminal Court (ICC) arrest warrant for alleged war crimes in Ukraine.",
      "Were Putin to travel local authorities would be obliged to arrest him as South Africa is a member of The Hague-based International Criminal Court.",
      "Consequently a decision was taken in June by the Brics leaders that Russia’s president would stay away.",
      "According to South African government statistics the Brics nations account for over 42 per cent of the world’s population, 30 per cent of its territory, 31.7 per cent of global GDP and 18 per cent of global trade.",
      "But only about 6 per cent of the group’s trade is between its current members.",
      "Until recently Brics has been regarded as more of an economic, development and financial alliance than a political one, but at last year’s summit officials from the member nations were mandated to look at a Brics expansion.",
      "Last month the officials’ findings were handed over to member states’ foreign ministers, who then presented recommendations to the heads of state for the summit.",
      "Despite this details of exactly what will be discussed and announced at the conference have been scarce in the run-up.",
      "The conference is themed Brics and Africa, so the continent’s development is expected to play a significant role.",
      "Despite Putin’s physical absence this year’s summit is being touted as the largest one to be held since the original four members – South Africa joined the group in 2010 – gathered for the first Brics summit in Yekaterinburg, Russia, in June 2009.",
      "Aside from the current members’ delegations, 67 other heads of state and leaders of Global South bodies have been invited to attend.",
      "Indeed, interest in joining Brics has gathered pace in recent years as a growing number of nations seek to tap into a group that has positioned itself as a viable alternative to the unipolar world dominated by the US.",
      "South African officials say 22 nations have formally applied to join the bloc, and the same number have informally shown an interest.",
      "The applicants include nations traditionally opposed to the West, such as Iran, Venezuela, and Cuba, so admitting them to a bloc already containing Russia and China could create further international tensions at a difficult time in global affairs.",
      "Given that western nations are also major trading partners for South Africa, Brazil and India, Jo-Ansie Van Wyk, professor of international politics at the University of South Africa, believes Brics’s expansion will be dealt with sensitively, being promoted as an act of “unity, solidarity and cohesion” at the summit.",
      "“Any announcements will be spun that these are the countries ready to join, that they are not the favourites but rather part of a staggered process that has already begun.",
      "What I’m really keen to see is what the requirements are to joining Brics,” she said.",
      "Van Wyk said countries from the oil-rich Middle East – Bahrain, the United Arab Emeritus and Saudi Arabia have applied to join – are strong candidates as they would add financial clout to the bloc, which she expects to unveil new developmental institutions that require funding.",
      "South Africa is also lobbying for the inclusion of other African states Nigeria, Kenya, Algeria, Egypt and Rwanda have all applied to join.",
      "But former ambassador of India to Denmark, Yogesh Gupta, told The Irish Times that equally vital to Brics’s development was the need to further develop relationships between its member states to tackle trade barriers and resolve currency issues among other things.",
      "“My point is that expanding Brics is something that a few countries are talking about, but developing linkages and interactions between the existing members, these are equally important, and the summit should not lose sight of this,” he said.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "south africa",
      "per cent",
      "applied join",
      "economic development",
      "brics summit",
      "held since",
      "international criminal",
      "criminal court",
      "south african",
      "cent global"
    ]
  },
  {
    "title": "Putin calls off trip to emerging economies conference in South Africa",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/07/19/putin-calls-off-trip-to-emerging-economies-conference-in-south-africa/",
    "publishedAt": "2023-07-19T13:42:00Z",
    "sentences": [
      "Russian president Vladimir Putin will no longer attend a major conference for emerging economies in Johannesburg next month, South Africa’s presidency has confirmed.",
      "In a statement released on Wednesday, President Cyril Ramaphosa’s office announced that Mr Putin will be replaced by Russia’s foreign minister, Sergei Lavrov, at the Brics (Brazil, Russia, India, China and South Africa) summit.",
      "The summit, which is taking place from August 22-24th, will be attended by the leaders of the other four member countries, the statement added.",
      "Confirmation that Mr Putin will not travel to South Africa comes days before the Democratic Allianceparty was due to seek a court order compelling the government to comply with an International Criminal Court (ICC) arrest warrant for Mr Putin.",
      "The ICC issued the warrant for Mr Putin in March, accusing him and his government of committing war crimes related to the abduction of thousands of children during Russia’s invasion of Ukraine, which began in February 2022.",
      "Even though South Africa has stated it is non-aligned in the Russia-Ukraine conflict, as an ICC member its government is legally obliged to comply with the arrest warrant.",
      "As a result, Mr Putin would leave himself open to arrest were he to attend the summit.",
      "Mr Ramaphosa and the ruling African National Congress (ANC) had been reluctant to commit to arresting Mr Putin, with many analysts pointing to the ruling party’s close ties to the Russian president’s regime.",
      "South Africa has previously declined to comply with one of The Hague-based court’s warrants.",
      "In 2015 an ANC-led government allowed Sudan’s then-president, Omar al-Bashir, to leave the country even though the ICC had sought his arrest for war crimes.",
      "As a result, the Democratic Alliance had approached South Africa’s courts to compel the government to adhere to its ICC obligations.",
      "On Tuesday an affidavit submitted by Mr Ramaphosa to the Gauteng high court for the Democratic Alliance’s case, which was to be heard on Friday, was made public.",
      "In the document he outlined the reasons behind his government’s reluctance to arrest Mr Putin.",
      "According to Mr Ramaphosa, arresting Mr Putin next month would amount to a declaration of war against Russia.",
      "It would also undermine a peace mission he launched with six other African leaders in June that is designed to bring Ukraine and Russia to the negotiating table, he said.",
      "“It would be a reckless, unconstitutional and unlawful exercise of the powers conferred upon the government to declare war with Russia by arresting president Putin,” Mr Ramaphosa stated in his submission.",
      "But Democratic Alliance leader John Steenhuisen called Mr Ramaphosa and the government’s arguments “flimsy”, saying they were an attempt to “mask its inability to stand up to war-mongers”.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "mr putin",
      "south africa",
      "mr ramaphosa",
      "democratic alliance",
      "russian president",
      "next month",
      "arrest warrant",
      "warrant mr",
      "war crimes",
      "even though"
    ]
  },
  {
    "title": "South Africa insists summit immunity will not override warrant for Putin",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/africa/2023/05/30/south-africa-insists-summit-immunity-will-not-override-warrant-for-putin/",
    "publishedAt": "2023-05-30T16:18:00Z",
    "sentences": [
      "South Africa’s government has moved to allay fears that its decision to grant immunity to foreign officials participating in the Brics Summit in August means Russia’s president Vladimir Putin would escape arrest if he attended.",
      "On Monday, international relations officials insisted the diplomatic immunities for those attending the summit, issued in a government gazette, had “nothing to do” with Mr Putin, who has been accused of war crimes by the International Criminal Court (ICC).",
      "According to a statement released by the department of international relations and co-operation the immunities are meant to protect conference attendees from the jurisdiction of the host nation.",
      "“These immunities do not override any warrant that may have been issued by any international tribunal against any attendee of the conference,” the department said in a statement.",
      "In March, the ICC charged Mr Putin and members of his regime of being complicit in the illegal deportation of more than 16,200 children from Ukraine to Russia since his forces invaded its neighbour in February 2022.",
      "[ Putin’s planned visit to Durban poses a geopolitical dilemma for South AfricaOpens in new window ] [ Prosecution of Putin for war on Ukraine will require hybrid tribunal of The HagueOpens in new window ] South Africa’s presidency has invited all the leaders of the Brics (Brazil, Russia, India, China and South Africa) nations to the summit for emerging markets in Johannesburg from August 22nd to 24th which will discuss the bloc’s enlargement among other issues.",
      "So far Mr Putin’s government has indicated he will attend the event.",
      "Since the war in Ukraine broke out, South Africa’s government has refused to condemn the Russian invasion, stating it has adopted a non-aligned approach to the conflict.",
      "However, over the past 15 months, its western allies have become concerned that South Africa is surreptitiously supporting Russia.",
      "Earlier this month, the US’s envoy to South Africa, Ruben Brigety, told reporters that Washington believed weapons and ammunition were loaded on to a Russian naval vessel called the Lady R in Cape Town in December.",
      "[ South Africa to launch independent inquiry into alleged arms shipment to RussiaOpens in new window ] [ Frustrations with South Africa over Ukraine may force US to reconsider financial aidOpens in new window ] Just hours before the immunities were made public, South Africa’s main opposition party, the Democratic Alliance, launched a court action aimed at forcing the African National Congress-led government to arrest Mr Putin if he attended the summit.",
      "At the Gauteng High Court in Pretoria, the Democratic Alliance sought a declaration from the court stating the government was “duty-bound in terms of the Rome Statute and the Implementation Act to arrest President Putin upon his arrival in South Africa”.",
      "The Democratic Alliance said in a statement on Monday that its court application outlined the precise steps to be taken should a request for Mr Putin’s arrest and surrender be forthcoming from the ICC.",
      "Bill Corcoran is a contributor to The Irish Times based in South Africa"
    ],
    "topics": [
      "south africa",
      "mr putin",
      "new window",
      "democratic alliance",
      "africa government",
      "international relations",
      "said statement",
      "war ukraine",
      "government moved",
      "moved allay"
    ]
  },
  {
    "title": "Lula says Putin has congratulated him on Brazil election win",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/2022/12/20/lula-says-putin-has-congratulated-him-on-brazil-election-win/",
    "publishedAt": "2022-12-20T18:23:00Z",
    "sentences": [
      "Brazil’s President-elect Luiz Inacio Lula da Silva has said that Russia’s President Vladimir Putin had congratulated him on his recent election win and talked of stronger relations between the two countries.",
      "Putin said earlier this year he had \"good relations\" with both Lula and far-right incumbent Jair Bolsonaro, who made an official trip to Moscow in February, just days before the start of the war in Ukraine.",
      "Lula, who plans to visit the United States and China early in his term, has tried to highlight that Brazil is \"back\" on the world stage since he won an election in October.",
      "\"Putin congratulated me on my election victory and wished me a good administration and the strengthening of relations between our countries,\" the leftist leader tweeted.",
      "\"Brazil is back, seeking dialogue with everyone and committed to the search for a world without hunger and with peace,\" Lula added.",
      "[ Brazil military’s tolerance of coup demands a worry for LulaOpens in new window ] [ Risky strategy in Brazil for Lula implies compromise ahead of taking up office on January 1stOpens in new window ] Brazil and Russia are both members of the BRICS group of emerging economies that also includes China, India and South Africa.",
      "In a separate statement, the Kremlin said both men had expressed confidence that the countries' \"strategic partnership...will develop successfully, including within the BRICS framework\".",
      "Lula had also governed Brazil from 2003 to 2010, during Putin’s first stint as Russian president.",
      "– Reuters"
    ],
    "topics": [
      "putin congratulated",
      "brazil back",
      "new window",
      "brazil luiz",
      "luiz inacio",
      "inacio lula",
      "lula da",
      "da silva",
      "silva said",
      "said russia"
    ]
  }
]