[
  {
    "title": "FACT CHECK: Post falsely claims 159 countries adopted BRICS Pay system",
    "source": "Rappler",
    "url": "https://www.rappler.com/newsbreak/fact-check/brics-payment-system-not-adopted-159-countries/",
    "publishedAt": "2025-01-14T04:00:00Z",
    "sentences": [
      "SUMMARY This is AI generated summarization, which may have errors.",
      "For context, always refer to the full article.",
      "Claim: 159 countries have signed up to use a payment system developed by the BRICS member countries that enables cross-border transactions using their national currencies.",
      "Why we fact-checked this: The TikTok video containing the claim has 827,800 views, 55,500 likes, 4,413 shares, and 7,423 comments as of writing.",
      "Text in the video states: “BREAKING: 159 out of 193 countries have signed up to use the new BRICS settlement system.",
      "[The] US and European Union will no longer be able to use economic sanctions as [weapons].” The video seems to be referring to BRICS Pay, a payment system proposed by the BRICS countries (Brazil, Russia, India, China and South Africa) to enable trade using their own currencies.",
      "This move is in response to what BRICS sees as unfair sanctions restricting countries like Russia and Iran from using global financial systems dominated by the US dollar.",
      "The facts: The 159 figure refers to institutions — not countries — connected to Russia’s System for Transfer of Financial Messages (SPFS), not BRICS Pay.",
      "The false claim originated from an incorrect report by Russia Today (RT), which misquoted a Russian official’s statement and falsely stated that 159 countries would adopt the BRICS payment system.",
      "The official said that 159 “participants” had adopted the SPFS, which Russia uses as an alternative to the SWIFT interbank payments system.",
      "Despite RT issuing an apology and removing the report in August 2024, the false information continues to circulate, with several articles still perpetuating the claim.",
      "AFP Fact Check has also published an article debunking the false claim.",
      "Financial systems: After Russia’s 2014 annexation of Crimea triggered the threat of expulsion from SWIFT, Moscow created SPFS as an alternative system to avoid being completely cut off from global financial transactions.",
      "In 2022, the European Union (EU) and its allies suspended several Russian banks from the SWIFT system due to Russia’s invasion of Ukraine, disrupting Russia’s ability to transfer funds across borders seamlessly.",
      "Meanwhile, the members of BRICS proposed the creation of its own payment system, BRICS Pay, which would allow members to make and receive payments in their own currencies, making cross-border payments more efficient.",
      "However, there are concerns that BRICS Pay would allow participants to “circumvent USD as a payment intermediary by replacing it with blockchain technology and an alternative to the SWIFT financial payment system,” according to an analyst from the think tank American Action Forum.",
      "BRICS Pay is currently still a proposal, with no confirmed timeline for when it will be operational.",
      "Evading sanctions: Russia and other countries are exploring alternative cross-border financial instruments to reduce reliance on Western financial systems and potentially circumvent economic sanctions by the US and EU.",
      "However, David Asher, a Hudson Institute senior fellow, said in a VOA report that such an alternative payment system can still be subject to sanctions.",
      "– Marjuice Destinado/Rappler.com Marjuice Destinado is a Rappler intern.",
      "She is a third-year political science student at Cebu Normal University (CNU), serving as feature editor of Ang Suga, CNU’s official student publication.",
      "Keep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com.",
      "Let us battle disinformation one Fact Check at a time.",
      "There are no comments yet.",
      "Add your comment to start the conversation.",
      "How does this make you feel?"
    ],
    "topics": [
      "payment system",
      "brics pay",
      "financial systems",
      "159 countries",
      "countries signed",
      "signed use",
      "european union",
      "economic sanctions",
      "global financial",
      "false claim"
    ]
  },
  {
    "title": "Indonesia welcomes its entry into BRICS bloc",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/314544113/indonesia-welcomes-its-entry-into-brics-bloc.html",
    "publishedAt": "2025-01-07T04:35:00Z",
    "sentences": [
      "Jakarta, Indonesia—Indonesia welcomed on Tuesday Brazil’s announcement that it had become a full member of BRICS, a bloc of developing economies increasingly seen as a counterweight to the West.",
      "The Brazilian foreign ministry said in a statement on Monday that Southeast Asia’s most populous country “shares with the other members the will to reform the institutions of global governance and contribute positively to cooperation within the Global South.” Brazil, which holds the rotating presidency of the grouping in 2025, said Indonesia’s bid to join the bloc had been approved during a summit in 2023 in Johannesburg.",
      "Indonesia in turn said it “welcomes” the announcement of its inclusion.",
      "“This achievement shows Indonesia’s increasingly active role in global issues and commitment to strengthening multilateral cooperation to create a global structure that is more inclusive and fair,” the Ministry of Foreign Affairs said in a statement on Tuesday.",
      "BRICS was created in 2009 by founding members Brazil, Russia, India and China.",
      "South Africa joined the following year.",
      "The bloc was expanded again last year with Iran, Egypt, Ethiopia and the United Arab Emirates becoming full members.",
      "Indonesia sees its BRICS membership as “a strategic step to improve the collaborations and cooperation with other developing nations, based on the principle of equality, mutual respect, and sustainable development,” the Jakarta statement said.",
      "It also expressed Indonesia’s “gratitude to Russia,” the 2024 BRICS chair, “for its support and leadership in facilitating Indonesia’s joining,” as well as to Brazil.",
      "During its presidency, Brazil aims to boost cooperation between countries of the “Global South” and reform multilateral institutions.",
      "One of the objectives, according to the government of left-wing President Luiz Inacio Lula da Silva, is the “development of means of payment” to facilitate trade between member countries.",
      "During the last BRICS summit in Kazan, Russia, in November 2024, member nations discussed boosting non-dollar transactions and strengthening local currencies.",
      "This raised the ire of US President-elect Donald Trump, who threatened the group’s members with “100 percent tariffs” if they undercut the US dollar.",
      "This year’s BRICS summit will take place in Rio de Janeiro in July.",
      "© All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "said statement",
      "brics summit",
      "jakarta welcomed",
      "welcomed tuesday",
      "tuesday brazil",
      "brazil announcement",
      "announcement become",
      "become full",
      "full member",
      "member brics"
    ]
  },
  {
    "title": "Putin wants high-profile summit to rival West",
    "source": "manilastandard.net",
    "url": "https://manilastandard.net/news/world-news/314512999/putin-wants-high-profile-summit-to-rival-west.html",
    "publishedAt": "2024-10-20T13:15:00Z",
    "sentences": [
      "MOSCOW — Two dozen world leaders will meet in Russia next week for a summit of the BRICS group, an alliance of emerging economies that the Kremlin hopes will challenge Western “hegemony”.",
      "The summit will be the biggest in Russia since the Ukraine conflict began and comes as Russian President Vladimir Putin seeks to show Western attempts to isolate Moscow over the two-and-a-half-year offensive have failed.",
      "UN Secretary General Antonio Guterres, Chinese leader Xi Jinping, Brazilian President Luis Inacio Lula da Silva and Turkish President Recep Tayyip Erdogan are scheduled to join the event in the city of Kazan from October 22 to 24.",
      "Russia has said it is expecting Indian Prime Minister Narendra Modi as well.",
      "Moscow has made expanding the BRICS group — an acronym for core members Brazil, Russia, India, China and South Africa — a pillar of its foreign policy.",
      "The main issues on the agenda include Putin’s idea for a BRICS-led payment system to rival SWIFT, an international financial network that Russian banks were cut off from in 2022, as well as the escalating conflict in the Middle East.",
      "The Kremlin has touted the gathering as a diplomatic triumph that will help it build an alliance able to challenge Western “hegemony”.",
      "The United States has dismissed the idea that BRICS could become a “geopolitical rival” but has expressed concern about Moscow flexing its diplomatic muscle as the Ukraine conflict rages.",
      "Moscow has been steadily advancing on the battlefield in eastern Ukraine this year while strengthening its ties with China, Iran and North Korea — three of Washington’s adversaries.",
      "By gathering BRICS in Kazan, the Kremlin “aims to show that not only is Russia not isolated, it has partners and allies,” Moscow-based political analyst Konstantin Kalachev told AFP.",
      "Putin was declared wanted by the International Criminal Court (ICC) in 2023 over the illegal deportation of children from Ukraine, and abandoned plans to attend the previous summit in ICC member South Africa.",
      "This time round, the Kremlin wants to show an “alternative to Western pressure… and that the multipolar world is a reality,” Kalachev said, referring to Moscow’s efforts to shift power away from the West to other regions.",
      "Putin has repeatedly accused the West of “provoking” Russia into sending troops into Ukraine, rejecting the idea his offensive is an imperial-style land grab — despite Moscow seizing four Ukrainian regions and claiming them as its own.",
      "The Kremlin has said it wants global affairs to be guided by international law, “not on rules that are set by individual states, namely the United States.” © All Rights Reserved.",
      "2025 | Manila Standard | Developed by Neitiviti Studios"
    ],
    "topics": [
      "brics group",
      "challenge western",
      "western hegemony",
      "ukraine conflict",
      "south africa",
      "moscow two",
      "two dozen",
      "dozen world",
      "world leaders",
      "leaders meet"
    ]
  }
]