[
  {
    "title": "A new compass for the Global South",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1260637-a-new-compass-for-the-global-south",
    "publishedAt": "2024-12-11T19:00:00Z",
    "sentences": [
      "President Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support each other in taking the path to moderniaation” and announced the formation of a Global South Think Tanks Alliance to “promote people-to-people exchanges and experience-sharing”.",
      "Politicians and policymakers of the developing countries were quick to heed the call coming from the leader of a country that has accounted for close to three-quarters of global poverty reduction since 1980.",
      "In Nanjing in China’s Jiangsu province, during a historic conclave of political leaders and representatives of think tanks from over 100 countries, the Global South Think Tanks Alliance was officially launched on Thursday, November 14, 2024.",
      "This pool of resources from more than 200 universities and institutions from China and other developing counties will investigate, among others, the reasons behind the failures of Western theories of development and globalisation and conduct research to highlight how each developing country can forge its own unique path of modernisation, as demonstrated by the success of China.",
      "After World War I, the establishment of the Bretton Woods institutions and the UN system inaugurated the first-ever global security and economic order.",
      "However, the emergence of the USSR as an ideological rival prevented the US from exercising uncontested hegemony.",
      "All this changed when the curtain fell on the Soviet Union in December 1991.",
      "All international institutions were now under the political and ideological sway of the US and its European allies.",
      "For the next quarter century, the West purveyed its values, political institutions, economic models, security organisations, and cultural norms as the inexorable destiny of all mankind.",
      "No society could find stability, develop economically, or make social progress except within the framework of liberal democracy, market economy, and Western notions of freedom and human rights.",
      "Russia, other republics of the former Soviet Union, and nations of Eastern Europe were the first to experience the transformation of their societies in the ‘new world order’.",
      "These countries were cajoled and coerced by Washington into accepting the ‘shock therapy’ of disarmament, denuclearisation, democratisation, privatisation, and wholesale deregulation and liberalisation.",
      "The results were less than salubrious.",
      "Following the collapse of the Soviet Union, Russia, the biggest member state of the now-defunct Warsaw Pact countries, underwent an economic contraction worse than the one faced by the US during the Great Depression.",
      "It experienced a decade of political chaos, hyper-inflation, unemployment, breakdown of internal security, and disintegration of the moral fabric of society.",
      "The Russian population has been declining ever since.",
      "Countries in Africa, Latin America, and Asia were made to follow the same set of policies through soft and hard power tactics.",
      "After nearly three decades, the results outside Eastern Europe and the Commonwealth of Independent States are even less encouraging.",
      "Economically, countries in Latin America have either regressed or remain stagnant.",
      "Politically multi-party democracy has failed to flourish on the continent.",
      "During the same period, Africa’s share of the poor population of the world has risen from 56 per cent to over 67 per cent despite more than $2 trillion in development assistance according to some estimates.",
      "Sub-Saharan Africa is home to more failed states than any other part of the world.",
      "Only in East and Southeast Asia have countries succeeded in achieving regional peace, domestic stability, and economic progress.",
      "This has been made possible not by copying the Western template but by deviating from it in terms of ideology, institutional arrangements, and policy framework.",
      "China is the most notable example of this East Asian exceptionalism.",
      "Since the reform and opening up beginning in 1978, China has modernised and engaged with the outside world without succumbing to the Western model of development and global integration.",
      "China reestablished relations with the World Bank and the IMF in 1980 but has avoided falling into a debt trap or requiring financial bailouts.",
      "In the late 1980s, despite extreme national and international pressure, China wisely resisted calls for Western-style democracy.",
      "Ignoring the policy advice of multilateral institutions for en masse privatisation, China successfully incentivised and made its state-owned enterprises (SOE) profitable.",
      "Similarly, it protected its industrial base while successfully integrating into the global economy following accession to the World Trade Organization (WTO) in 2001.",
      "Most significantly, China rejected the West’s trickle-down economic theories and employed state machinery to divert resources towards less developed regions, sectors, and population groups.",
      "As a result, while other countries faltered, China succeeded in lifting nearly 800 million people out of poverty.",
      "China’s economic success has shattered the spell of Western ideological hegemony and opened new possibilities for developing countries to pursue policies that suit their social, political, and historic realities.",
      "These nations, a majority of whom are falling short in their goal to end extreme poverty by 2030, can draw encouragement from the example of China which has met the poverty reduction target of the UN’s 2030 Agenda for Sustainable Development ahead of schedule.",
      "China’s continuing modernisation drive since the election of Xi Jinping to the post of general secretary of the Communist Party of China (CPC) by the 18th National Congress in 2012 has defied the West’s ‘end of history’ thesis and proved wrong its predictions that economic growth would either turn China into a mirror image of Western society or the country would face social unrest and implode economically.",
      "The Western argument that multi-party adult franchise democracy and laissez-faire economic policies provide the sole pathway to prosperity no longer appears persuasive.",
      "The rise of China is not just characterised by strategic autonomy but also by humility, the principle of non-interference, and strategic restraint.",
      "While China has displayed leadership by initiating the Global South Think Tanks Dialogue and forming an alliance of research institutions from more than one hundred countries, it has no desire to export its political institutions and economic model.",
      "China only functions as a mirror.",
      "It is for the public intellectuals of the Global South to ponder why their societies are falling behind despite being the poster children of Western globalisation while China has succeeded in rejuvenating its civilisation by following a path forged by its people and history.",
      "The message of President Xi Jinping to the Global South, delivered at the G20 Summit in Rio de Janeiro on November 18, can serve as a source of inspiration: “if China can make it, other developing countries can make it too”.",
      "The writer is the chairperson of Crescent Foundation, Pakistan.",
      "Researchers have developed tiny, skin-penetrating microsensor that promises to solve many of these issues From very start, Indian media outlets abandoned any notion of journalism and descended into pure fiction 18th Amendment devolved education to provinces, ostensibly empowering them to tailor solutions to local needs Claim that ordinance bypasses parliament and violates Article 77 of constitution is inaccurate It's time to shift toward Keynesian model, where industrial demand creation becomes anchor for generation planning It breathes through every young mind that dares to dream of better future despite obstacles"
    ],
    "topics": [
      "global south",
      "think tanks",
      "xi jinping",
      "south think",
      "developing countries",
      "soviet union",
      "president xi",
      "countries global",
      "tanks alliance",
      "poverty reduction"
    ]
  },
  {
    "title": "Trump warns BRICS nations of 100% tariffs over plans against US dollar",
    "source": "BOL News",
    "url": "https://www.bolnews.com/international/2024/12/trump-warns-brics-nations-of-100-tariffs-over-plans-against-us-dollar/",
    "publishedAt": "2024-12-01T18:43:08Z",
    "sentences": [
      "01st Dec, 2024.",
      "11:43 pm Share Listen Font size Dark Mode Save Print President-Elect Trump announces first foreign trip post-election President-elect Donald Trump has issued a warning to BRICS nations, threatening a 100% tariff if their proposed currency plans undermine the US dollar.",
      "On his Truth Social platform, Trump stated, “We require a commitment… that they will neither create a new BRICS Currency nor support any other currency to replace the mighty US Dollar, or they will face 100 percent tariffs.” BRICS includes Brazil, Russia, India, China, South Africa, and others.",
      "The warning follows last month’s BRICS summit in Kazan, Russia, where the group discussed reducing reliance on the US dollar in trade and strengthening local currencies.",
      "Since its creation in 2009, BRICS has grown to include countries like Iran, Egypt, and the UAE, representing a significant portion of the global economy.",
      "At the October summit, Moscow secured a declaration to boost correspondent banking within BRICS and promote local currency settlements under the BRICS Cross-Border Payments Initiative.",
      "However, Russian President Vladimir Putin noted no progress had been made on creating an alternative to SWIFT, the global financial messaging system.",
      "He also clarified that BRICS is not currently considering a unified currency.",
      "Trump, maintaining his protectionist stance, warned BRICS nations that pursuing these plans would mean losing access to the US market.",
      "“They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in international trade, and any country that tries should wave goodbye to America,” he wrote.",
      "Catch all the International News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "us dollar",
      "brics nations",
      "bol news",
      "01st dec",
      "dec 2024",
      "2024 pm",
      "pm share",
      "share listen",
      "listen font",
      "font size"
    ]
  },
  {
    "title": "Trump warns BRICS nations against replacing US dollar",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1257273-trump-warns-brics-nations-against-replacing-us-dollar",
    "publishedAt": "2024-11-30T19:00:00Z",
    "sentences": [
      "ISLAMABAD: Instead of threatening to impose 100 percent tariffs on member countries of BRICS backed by China and Russia for their bids to scale down reliance on the US dollar for international trade, President-elect of the USA Donald Trump needs to find out why countries are moving away from using the US dollar for trade.",
      "The blatant use of economic sanctions in US dollars and increasing tariffs to punish the countries are the main reasons forcing the vital economies to assemble under the platform of BRICS and initiate trade in their own currencies keeping US dollars aside, Pakistan’s eminent economist Dr Ashfaque H Khan responds to the statement of Donald Trump on BRICS.",
      "“Imposing 100 percent tariff is not a child’s play as such measures will further accelerate de-dollarization,” Dr Khan said.",
      "Sakib Sherani, a seasoned economist of the country, says: “Since the Bretton Woods system was put in place after the Second World War, the US has sought to insert the dollar as the go-to currency for global trade.",
      "After the move away from the gold standard, the US has actively sought to protect the reserve currency status of the greenback and the exorbitant privilege that comes with it.” Many commentators believe that some of the US conflicts in recent history, such as the military campaign to remove Col Muammar Gaddhafi in Libya, were the result of moves by countries involved to shift away from selling oil in US dollar, for example, or becoming part of an alternate global payment system.",
      "The latest salvo fired against the BRICS nations is a continuation of the same.",
      "It is unlikely to stop the BRICS countries from exploring an alternate to the US dollar because the USA has weaponized its currency as well as the dollar-based global payments system.",
      "Threats by the US, combined with tariff measures and protectionism, will only encourage more countries towards finding an alternate system.",
      "This will accelerate the global geo-economic fragmentation already taking place.",
      "“Countries like Pakistan stand to lose from such developments because any move to reverse globalization will hurt developing countries the most,” Sherani opined.",
      "“The US has used its control over the dollar-based financial system to sanction countries like Russia (for its actions in Ukraine), Iran (over nuclear proliferation concerns) and North Korea (for its missile programs).",
      "As the US dollar is the dominant global currency for trade and finance, countries that rely on it can find their economies severely impacted by sanctions.” Dr Abid Qaiyum Sulehri, head of SDPI (Sustainable Development Policy Institute), said that 100 percent hike in tariff on imports from BRICS countries will also cause an increase in sufferings of American consumers.",
      "He said that to stabilize a multipolar world and to avoid consequences of unipolar economic system, the world needs alternatives of the US dollar for trade.",
      "Dr Sulehri argued that there are already more than one currencies in the IMF basket, so Trump’s attempt to discourage BRICS currency would be an absurd initiative.",
      "The statement by Donald Trump says: “The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is over.",
      "We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US Economy.” BRICS (Brazil, Russia, India, China, and South Africa) was established to promote economic cooperation and development among emerging economies.",
      "The group aims to provide an alternative to Western-dominated financial systems, including institutions like the International Monetary Fund (IMF) and the World Bank, which have historically been seen as serving the interests of developed nations, particularly the United States and Europe.",
      "BRICS countries formed the group in 2006 (with South Africa joining in 2010), recognizing the growing influence and potential of emerging economies in the global economic landscape.",
      "The primary motivations behind its creation include: BRICS countries sought to create a platform for their economic growth and development by focusing on cooperation in trade, investment, and infrastructure development; the group aimed to challenge the dominance of the West in global institutions and advocate for reforms in global governance systems, particularly those centered around the United Nations, World Trade Organization (WTO), and international financial institutions; and BRICS also aimed to increase the political clout of its member nations in global decision-making processes, positioning themselves as a counterbalance to Western influence.",
      "China’s move to internationalize the yuan is partly a strategic response to US economic sanctions and the dominance of Western financial systems.",
      "The US has used its control over the global financial system, including the dollar-based SWIFT network, to impose sanctions on countries like Russia, Iran, and North Korea.",
      "By promoting the yuan, China seeks to protect itself and its trading partners from potential US sanctions, ensuring that it can continue to engage in global trade without interference.",
      "China has already taken significant steps to internationalize the yuan.",
      "In 2016, the International Monetary Fund (IMF) included the yuan in its Special Drawing Rights (SDR) basket, which consists of a basket of reserve currencies.",
      "This was a milestone in recognizing the yuan as an international reserve currency.",
      "To solidify its role in global finance, China is working to increase the yuan’s usage in trade, investment, and central bank reserves around the world.",
      "Trump’s threats against BRICS countries on the use of US dollar were likely a reaction to the perceived threat to US economic dominance, especially in global trade, finance and geopolitics.",
      "The US dollar plays a critical role in maintaining the US’s global influence — in terms of economic leverage, sanctions power and financial stability.",
      "Therefore, any efforts by countries like China, Russia, and India to move away from the dollar would have undermined US interests, prompting Trump’s response to prevent such shifts and preserve US economic power on the world stage.",
      "“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US economy,” Trump wrote on his social media platform, Truth Social.",
      "“They can go find another ‘sucker’.",
      "There is no chance that the BRICS will replace the US dollar in International Trade, and any country that tries should wave goodbye to America.” Police received information that unidentified kidnappers were trying to move abducted trader to another location A policeman was martyred in exchange of fire with assailants It is not yet known whether venue will remain same or would be changed to Doha or Dubai On Pakistan side of LoC, families wearied by decades of sporadic firing began to return home for now This additional charge has been given for three months or until regular appointment to same position China and Pakistan reaffirmed their commitment to strengthening friendly ties with Afghanistan"
    ],
    "topics": [
      "us dollar",
      "brics countries",
      "countries like",
      "100 percent",
      "donald trump",
      "global trade",
      "move away",
      "brics currency",
      "us economic",
      "china russia"
    ]
  },
  {
    "title": "'100% tariff': Trump warns BRICS nations against replacing US Dollar",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1257269-trump-issues-strong-warning-to-brics-nations-over-the-us-dollar",
    "publishedAt": "2024-11-30T19:00:00Z",
    "sentences": [
      "US President-elect Donald Trump on Saturday demanded that BRICS nations commit to not creating a new currency or endorsing any alternative to the US dollar, threatening severe tariffs if they do, Reuters reported.",
      "“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs, and should expect to say goodbye to selling into the wonderful US economy,” Trump wrote on his Truth Social account.",
      "He added, “They can go find another ‘sucker.’ There is no chance that the BRICS will replace the US dollar in international trade, and any country that tries should wave goodbye to America.” Brazil and Russia have led discussions about creating a new currency to reduce the US dollar’s dominance, but progress has stalled due to internal disagreements within the BRICS group.",
      "Trump’s remarks are being viewed by some of his allies as part of a negotiation strategy.",
      "Republican Senator Ted Cruz defended the use of tariffs, pointing to their effectiveness in previous negotiations.",
      "“You look at the threat of tariffs against Mexico and Canada, immediately [it] produced action,” Cruz said on CBS News’ Face the Nation on Sunday.",
      "While Qatar emphasised that aircraft would not be a gift but a temporary arrangement Chinese officials were expected to brief reporters in Geneva later on Sunday evening Non-profit organisation AfghanEvac says 11,000 Afghans are currently covered by TPS in US Western countries accuse Iran of seeking to acquire nuclear weapons \"We are trying to establish whether it was a mechanical failure or if the driver fell asleep,\" say police Ukrainian president says \"there is no point in continuing the killing even for a single day\""
    ],
    "topics": [
      "us dollar",
      "creating new",
      "new currency",
      "us donald",
      "donald trump",
      "trump saturday",
      "saturday demanded",
      "demanded brics",
      "brics nations",
      "nations commit"
    ]
  },
  {
    "title": "Trump warns to ban BRICS nations in US economy over anti-dollar plans",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1256881-trump-warns-to-ban-brics-nations-in-us-economy-over-anti-dollar-plans",
    "publishedAt": "2024-11-29T19:00:00Z",
    "sentences": [
      "President-elect Donald Trump has warned BRICS nations of a potential ban from the US economy if they proceed with plans to undermine the US dollar.",
      "\"We require a commitment... that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100 percent Tariffs,\" Trump wrote on his Truth Social website, referring to the grouping that includes Brazil, Russia, India, China, South Africa and others.",
      "The statement comes after a BRICS summit held last month in Kazan, Russia, where the countries discussed boosting non-dollar transactions and strengthening local currencies.",
      "The BRICS group has expanded significantly since its inception in 2009, and now includes countries such as Iran, Egypt and the United Arab Emirates.",
      "Altogether the BRICS coalition accounts for a significant minority of the world’s economic output.",
      "At the Kazan summit in October, Moscow secured a joint declaration encouraging the \"strengthening of correspondent banking networks within BRICS and enabling settlements in local currencies in line with BRICS Cross-Border Payments Initiative.\"",
      "But at the end of the summit Putin indicated that little progress had been made on launching a possible competitor to the Belgium-based SWIFT financial messaging system.",
      "\"As for SWIFT and any alternatives, we have not created and are not creating any alternatives,\" Putin told reporters at the end of the summit.",
      "He added: \"As for a unified BRICS currency, we are not considering that question at the moment.\"",
      "Trump has vowed to pursue a protectionist agenda, threatening hefty tariffs on neighbors and rivals.",
      "If BRICS countries continue with their plans, Trump warned, they \"should expect to say goodbye to selling into the wonderful US Economy,\" he wrote.",
      "\"They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in International Trade, and any Country that tries should wave goodbye to America.\"",
      "While Qatar emphasised that aircraft would not be a gift but a temporary arrangement Chinese officials were expected to brief reporters in Geneva later on Sunday evening Non-profit organisation AfghanEvac says 11,000 Afghans are currently covered by TPS in US Western countries accuse Iran of seeking to acquire nuclear weapons \"We are trying to establish whether it was a mechanical failure or if the driver fell asleep,\" say police Ukrainian president says \"there is no point in continuing the killing even for a single day\""
    ],
    "topics": [
      "us dollar",
      "trump warned",
      "us economy",
      "brics currency",
      "local currencies",
      "end summit",
      "donald trump",
      "warned brics",
      "brics nations",
      "nations potential"
    ]
  },
  {
    "title": "BRICS 2024: Putin scores a rare victory",
    "source": "BOL News",
    "url": "https://www.bolnews.com/business/2024/10/brics-2024-putin-scores-a-rare-victory/",
    "publishedAt": "2024-10-23T17:27:38Z",
    "sentences": [
      "23rd Oct, 2024.",
      "10:27 pm Share Listen Font size Dark Mode Save Print BRICS 2024: Putin scores a rare victory KAZAN: Chinese President Xi Jinping and Indian Prime Minister Narendra Modi utilized the BRICS summit in Russia on Wednesday to express aspirations for a more harmonious relationship between the two most populous countries, following years of tension.",
      "Their meeting, the first formal talks in five years, was a significant highlight of a summit that President Vladimir Putin aimed to use to demonstrate that the West has failed to isolate Russia amid the ongoing Ukraine conflict.",
      "The summit’s final communique outlined several initiatives designed to enhance trade among BRICS nations, including the establishment of an alternative payment system to the dollar, though specifics and timelines were not provided.",
      "Just days after New Delhi announced a deal with Beijing to resolve a four-year military standoff over their disputed Himalayan border, Xi urged Modi to strengthen communication and cooperation while effectively managing their differences.",
      "“It is in the fundamental interests of the two countries and peoples for China and India to correctly grasp the trend of history and the direction of development of their relations,” Xi stated, according to Chinese state broadcaster CCTV.",
      "Modi responded by emphasizing the importance of maintaining peace and stability along their frontier, asserting that mutual trust, respect, and sensitivity should form the foundation of their relationship.",
      "“We welcome the agreement on the issues that had come up over the last four years,” Modi added in comments broadcast by India’s state broadcaster Doordarshan.",
      "BRICS, a concept initially proposed by Goldman Sachs two decades ago to illustrate the growing economic influence of China and other emerging markets, now represents 45% of the global population and 35% of the world economy.",
      "The summit coincides with the annual meetings of the International Monetary Fund and World Bank in Washington.",
      "Former Goldman economist Jim O’Neill, who coined the BRIC acronym in 2001, expressed skepticism about the BRICS bloc as long as China and India remain divided.",
      "“It seems to me basically to be a symbolic annual gathering where important emerging countries, particularly noisy ones like Russia, but also China, can basically get together and highlight how good it is to be part of something that doesn’t involve the U.S. and that global governance isn’t good enough,” O’Neill stated.",
      "Regarding the Ukraine war, Putin, who has dismissed Western claims of war crimes for Russia’s actions, hosted over 20 leaders at the summit, including NATO member Turkey’s President Tayyip Erdogan and Iranian President Masoud Pezeshkian.",
      "Modi publicly expressed a desire for peace in Ukraine, while Xi engaged in closed-door discussions about the conflict with Putin, along with United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, who has sought to mediate.",
      "The 43-page final communique from the summit covered a range of topics, including geopolitics, narcotics, artificial intelligence, and the preservation of big cats, but only briefly mentioned Ukraine.",
      "It acknowledged “relevant proposals of mediation and good offices, aimed at a peaceful resolution of the conflict through dialogue and diplomacy.” The strongest language was reserved for the Middle East, where the leaders called for a ceasefire in Gaza and the West Bank, condemning Israeli “attacks against humanitarian operations, facilities, personnel and distribution points.” While the BRICS leaders expressed interest in developing alternative payment systems, details were scarce, and they tasked central bankers to provide updates under the next presidency.",
      "“The trend for the BRICS’ leading role in the global economy will only strengthen,” Putin asserted, citing factors such as population growth, urbanization, capital accumulation, and productivity growth.",
      "China and India account for about 90% of Russia’s oil purchases, which is Moscow’s primary foreign currency source.",
      "The leaders indicated a desire to further enhance BRICS’ institutional development but offered little clarity on the potential expansion of the group.",
      "Putin noted that over 30 countries had shown interest in joining but emphasized the importance of maintaining a balance in any expansion.",
      "“I will take the BRICS group seriously when I see signs that the two countries that really matter, China and India, actually really trying to agree on things, rather than effectively trying to confront each other all the time,” O’Neill remarked.",
      "Birmingham Airport Cancels Flights and Evacuates Due to Suspicious Vehicle Report.",
      "West... Catch all the Business News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "china india",
      "final communique",
      "alternative payment",
      "two countries",
      "state broadcaster",
      "importance maintaining",
      "bol news",
      "23rd oct",
      "oct 2024",
      "2024 pm"
    ]
  },
  {
    "title": "BRICS Summit: Several world leaders meet in Russia next week",
    "source": "BOL News",
    "url": "https://www.bolnews.com/pakistan/2024/10/brics-summit-several-world-leaders-meet-in-russia-next-week/",
    "publishedAt": "2024-10-20T15:40:42Z",
    "sentences": [
      "20th Oct, 2024.",
      "08:40 pm Share Listen Font size Dark Mode Save Print BRICS Summit: Several world leaders meet in Russia next week Next week, two dozen world leaders will gather in Russia for a BRICS summit, an alliance of emerging economies that the Kremlin hopes will counter Western dominance.",
      "This summit will be the largest held in Russia since the onset of the Ukraine conflict and aims to demonstrate that Western efforts to isolate Moscow during the two-and-a-half-year offensive have been unsuccessful.",
      "Among those expected to attend the event in Kazan from October 22 to 24 are UN Secretary General Antonio Guterres, Chinese President Xi Jinping, Brazilian President Luis Inacio Lula da Silva, and Turkish President Recep Tayyip Erdogan.",
      "Russia has announced that it is expecting Indian Prime Minister Narendra Modi to attend the upcoming BRICS summit.",
      "Expanding the BRICS group, which includes Brazil, Russia, India, China, and South Africa, has become a key focus of Russia’s foreign policy.",
      "The agenda will cover important topics, including creating a BRICS-led payment system to compete with SWIFT, a financial network that Russian banks were banned from using in 2022, and addressing the ongoing conflict in the Middle East.",
      "The Kremlin is promoting this summit as a diplomatic success, aiming to demonstrate that it can build alliances that challenge Western dominance.",
      "The United States has expressed concern about Russia’s increasing diplomatic influence while the conflict in Ukraine continues.",
      "This year, Russia has made progress in eastern Ukraine and strengthened its ties with China, Iran, and North Korea—countries that are seen as adversaries by Washington.",
      "Political analyst Konstantin Kalachev noted that by hosting the BRICS summit in Kazan, Russia wants to show that it is not isolated and has allies.",
      "In 2023, the International Criminal Court (ICC) issued an arrest warrant for President Putin over the illegal deportation of children from Ukraine, leading him to skip the previous summit in South Africa.",
      "This time, the Kremlin aims to present an “alternative to Western pressure” and highlight the reality of a multipolar world, which shifts power away from the West.",
      "Putin has often accused the West of provoking Russia into the Ukraine conflict and denies that the military offensive is an imperialistic land grab.",
      "The Kremlin advocates for global governance based on international law, rather than rules set by individual countries like the United States.",
      "Kremlin aide Yuri Ushakov described BRICS as a model of multipolarity, bringing together nations from the Southern and Eastern hemispheres based on mutual respect and sovereignty.",
      "He added that BRICS is gradually working to create a more democratic and just global order.",
      "Since its founding in 2009 with four members, BRICS has expanded to include several other emerging countries, including South Africa, Egypt, and Iran.",
      "Turkey, a NATO member with complicated relations with both Russia and the West, expressed its desire to join BRICS in September.",
      "Ushakov confirmed that all BRICS countries will be represented by their leaders at the Kazan summit, except for Saudi Arabia, which will send its foreign minister instead.",
      "Kalachev noted that while the Kremlin hoped to see the Saudi Crown Prince, overall, things are going well for Russia.",
      "Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "brics summit",
      "south africa",
      "world leaders",
      "next week",
      "western dominance",
      "ukraine conflict",
      "united states",
      "kalachev noted",
      "bol news",
      "20th oct"
    ]
  },
  {
    "title": "BRICS Moscow Seminar: Mushahid welcomes ‘winds of Change in South Asia’",
    "source": "BOL News",
    "url": "https://www.bolnews.com/business/2024/09/brics-moscow-seminar-mushahid-welcomes-winds-of-change-in-south-asia/",
    "publishedAt": "2024-09-23T14:00:31Z",
    "sentences": [
      "23rd Sep, 2024.",
      "07:00 pm Share Listen Font size Dark Mode Save Print BRICS Moscow Seminar: Mushahid welcomes ‘winds of Change in South Asia’ Moscow, 23 September: Senator Mushahid Hussain Sayed was specially invited to give Keynote address at BRICS Seminar, where he said ‘Pakistan looks forward to joining BRICS’ & welcomed ‘winds of change blowing all across South Asia which reject hegemony, status quo & seek change’, referring to recent radical changes in the Maldives, Nepal, Bangladesh and Sri Lanka.",
      "As a consequence, he said the so-called ‘Indo-Pacific Strategy is now drowning in the waters of the Indian Ocean’.",
      "He criticised the recent US sanctions against Pakistan and China, terming these ‘immoral, unjust, unacceptable and illegal’ as sanctions under International Law can only be imposed by the UN Security Council.",
      "He Alsó condemned ‘Western hypocrisy and double standards on Palestine’.",
      "Senator Mushahid Hussain said the Global Order was marked by turbulence and transformation, with two contrasting narratives.",
      "China and Global South are focused on connectivity and trade and economic cooperation, conversely, the US is busy with pushing a New Cold War with a militaristic mindset, evident in yesterday’s QUAD meeting hosted by President Biden, where he again showed his China-obsession.",
      "Senator Mushahid Hussain urged the BRICS Seminar to define a new narrative based on emerging ground realities to counter propaganda, fake news and disinformation.",
      "For the future, Mushahid put forward a 3-D Strategy for BRICS: Democratisation of the world order based on multipolarity, multilateralism, UN Charter and International Law, Demilitarisation of international relations, rejecting any new military alliances like ‘Asian NATO’, QUAD or AUKUS, Dedollarisation of the world economy and greater trade in non-dollar currencies as dollar was being weaponised.",
      "Senator Mushahid Hussain was warmly welcomed by the host, Mikhail Shvydkoy, Special Envoy of President Putin, as well China’s Minister for International Communication, Wang Gang.",
      "Apart from Russia and China, other countries represented at BRICS Seminar included India, Brazil, South Africa, Egypt, Iran and UAE.",
      "Senator Mushahid Hussain was the only representative from a non-BRICS member state.",
      "Catch all the Business News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "senator mushahid",
      "mushahid hussain",
      "brics seminar",
      "winds change",
      "south asia",
      "international law",
      "bol news",
      "23rd sep",
      "sep 2024",
      "2024 pm"
    ]
  },
  {
    "title": "Day after Putin's visit, Azerbaijan applies to join Russia and China in the BRICS alliance",
    "source": "Yahoo Finance",
    "url": "https://finance.yahoo.com/news/day-putins-visit-azerbaijan-applies-170126480.html",
    "publishedAt": "2024-08-20T17:01:26Z",
    "sentences": [
      "Oops, something went wrong BAKU, Azerbaijan (AP) — Azerbaijan formally applied Tuesday to join the BRICS bloc of developing economies, a day after Russian leader Vladimir Putin's visit to the oil-rich South Caucasus country to shore up regional ties and secure Moscow’s under-pressure trade routes.",
      "The announcement from the foreign ministry in Azerbaijan's capital, Baku, comes as the BRICS alliance has seen a major expansion.",
      "For over a decade, the bloc included just five nations: Brazil, Russia, India, China and South Africa.",
      "Iran, Egypt, Ethiopia and the United Arab Emirates joined in January, and Saudi Arabia has said it's considering doing so as well.",
      "The club already includes some of the world’s biggest oil producers, and accounts for well over a quarter of the world’s GDP.",
      "Its members Russia and Iran have had their relations with the West stretched to breaking point over Moscow’s war on Ukraine and Iran's regional policies.",
      "Business ties were high on the agenda during the meeting between Putin and Azerbaijani President Ilham Aliyev on Monday, with Aliyev announcing that $120 million had been earmarked to boost cargo transport between the two countries.",
      "Putin increasingly depends on countries such as Azerbaijan to access global markets because of sanctions imposed on Moscow over its actions in Ukraine, according to political scientist Zardusht Alizade.",
      "For Azerbaijan, retaining Moscow’s good-will is important for national security over tensions with neighboring Armenia, said Alizade.",
      "Russia has been Armenia’s longtime sponsor and ally since the fall of the Soviet Union.",
      "But relations between them became increasingly strained since Sept. 2023, when Azerbaijan's military took control of the Karabakh region, ending three decades of ethnic Armenian separatist rule.",
      "Armenia accused Russian peacekeepers deployed to the region of failing to stop Azerbaijan’s onslaught.",
      "Moscow, which has a military base in Armenia, argued that its troops didn’t have a mandate to intervene.",
      "Sign in to access your portfolio"
    ],
    "topics": [
      "oops something",
      "something went",
      "went wrong",
      "wrong baku",
      "baku azerbaijan",
      "azerbaijan ap",
      "ap azerbaijan",
      "azerbaijan formally",
      "formally applied",
      "applied tuesday"
    ]
  },
  {
    "title": "BRICS: India, Nigeria ditch US dollar, will trade in local currency",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/1188930-brics-india-nigeria-ditch-us-dollar-will-trade-in-local-currency",
    "publishedAt": "2024-05-13T19:00:00Z",
    "sentences": [
      "In a bid to counter the United States dollar's supremacy, BRICS member countries India and Nigeria have agreed to trade in their local currencies and not the greenback anymore, Watcher Guru reported.",
      "The two countries have officially signed a trade agreement where it is stated that the majority of the payments will be made in local currency.",
      "The BRICS, comprising Brazil, Russia, India, China, and South Africa, is an intergovernmental organisation that was made to establish deeper ties between member nations and cooperate on economic expansions, such as trade.",
      "It was set to counterbalance Western alliances.",
      "The alliance will meet in October for its annual summit, where it is being reported that the developing countries may announce setting up a new currency.",
      "Nigeria has applied to join BRICS and expressed interest in being a part of the organisation.",
      "The trade between India and Nigeria comprise collaboration on energy, pharmaceuticals, and transport sectors.",
      "In FY 2022–2023, trade between both nations amounted to $11.8 billion.",
      "In FY 2023–2024, the trade has reached $7.89 billion so far.",
      "If BRICS countries continue to sign deals to not trade in dollars, the US economy, which is already in turmoil due to inflation and high debts, will further inch towards the risk of plummeting.",
      "OpenAI introduced \"capped-profit\" model in 2019 to allow some return on investment MPC says decision driven by sharp drop in inflation in March and April Two operating entities contribute 9% of their revenue to the GPA, a third provides 15% Hikes also follow calls from Trump for OPEC+ to raise output, ahead of his visit to Saudi Arabia later in May India's Directorate General of Foreign Trade says ban will take effect immediately as trade relations dwindle Adviser to Pakistan’s finance minister says IMF programme is “well on track”"
    ],
    "topics": [
      "india nigeria",
      "fy trade",
      "bid counter",
      "counter united",
      "united states",
      "states dollar",
      "dollar supremacy",
      "supremacy brics",
      "brics member",
      "member countries"
    ]
  },
  {
    "title": "Mushahid hopes Pakistan can join BRICS with Russian support",
    "source": "BOL News",
    "url": "https://www.bolnews.com/pakistan/2024/02/mushahid-in-moscow-hopes-pakistan-can-join-brics-with-russian-support/",
    "publishedAt": "2024-02-18T15:36:37Z",
    "sentences": [
      "18th Feb, 2024.",
      "08:36 pm Share Listen Font size Dark Mode Save Print Mushahid in Moscow hopes Pakistan can join BRICS with Russian support MOSCOW: An intergovernmental organisation being evolved into a cohesive geopolitical bloc, and welcomed ‘Russian goodwill for Pakistan’.",
      "The Senator is visiting Russia on the invitation of the ruling ‘United Russia’ party, during which he met Former President Dmitri Medvedev (who’s number two to President Putin) and Foreign Minister Sergey Lavrov, a news release here received said.",
      "He also attended the newly-formed International Forum for ‘Freedom of Nations’ where he was elected as a Member of the Forum’s 20-member Standing Committee.",
      "The Forum was organized by the United Russia party.",
      "Senator Hussain Co-Chaired the Forum’s plenary session where Foreign Minister Lavrov spoke and Senator Hussain had a comprehensive exchange with former President Dmitri Medvedev, now Deputy Chairman of the Security Council of Russia.",
      "Senator Hussain and Dmitri Medvedev discussed Pakistan-Russia relations, the situation in Afghanistan, the war in Gaza, and the ‘unlimited possibilities for Pakistan-Russian collaboration in the region, particularly on energy & economic connectivity’, adding ‘Pakistan core interests are linked to this region, where Russia is a key factor’.",
      "Senator Hussain told Mr Medvedev that the probable election of President Trump in the US Presidential elections in November 2024 would qualitatively change the region’s geopolitics.",
      "Senator Hussain said he found ‘tremendous goodwill’ for Pakistan in all official and popular circles in Moscow.",
      "During the visit, Senator Mushahid Hussain also delivered a lecture at the Russian Diplomatic Academy, the first prominent Pakistani to be invited to address the Diplomatic Academy in 50 years.",
      "The topic of the talk was ‘Pakistan and the changing regional scenario’.",
      "Senator Hussain during his talk also highlighted the fact that there’s ‘no fundamental conflict of interest’ between Pakistan and Russia‘, therefore, ‘Pakistan has remained neutral on Ukraine, abstaining on voting in the United Nations on this issue’.",
      "He welcomed growing relations between Pakistan and Russia especially in the field of energy, connectivity, education, regional security including Afghanistan and cooperation at multilateral fora including SCO and UN.",
      "He also expressed optimism on Pakistan joining BRICS with Russian cooperation, as Russia is Chair of BRICS in 2024.",
      "He said in the future four Muslim Middle Powers-Pakistan, Iran, Saudi Arabia & Turkey, would play a decisive role in regional affairs.He also appreciated President Putin’s stance on Islamophobia.",
      "The lecture was followed by a question and answer session from the students of the diplomatic academy.",
      "Senator Mushahid Hussain also met Senator Chizhov, President of the Russia-Pakistan Parliamentary Friendship Group.",
      "Senator Mushahid Hussain also met leading members of the small Pakistani community in Moscow plus had several interviews with the Russian media.",
      "Giving his impressions of his visit to Russia, Senator Mushahid Hussain met three fundamental points: a) both countries have ‘Strategic Space’ after ending of foreign intervention in Afghanistan, to build relations anew in various fields; b) Pakistan needs ‘Regional Reset’ in its foreign relations to take substantial initiatives for regional connectivity with Russia and other neighbouring countries; c) China is a common factor of unity & connectivity for Pakistan and Russia given both countries have close strategic ties with Beijing.",
      "Senator Mushahid Hussain was also invited to be part of International Observers who will visit to observe Presidential Elections during March 15-17, 2024.",
      "Catch all the Business News, Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "senator hussain",
      "senator mushahid",
      "mushahid hussain",
      "hussain also",
      "dmitri medvedev",
      "diplomatic academy",
      "pakistan russia",
      "brics russian",
      "goodwill pakistan",
      "united russia"
    ]
  },
  {
    "title": "International fashion had its star moment at the BRICS+ Fashion Summit in Moscow",
    "source": "DAWN.com",
    "url": "https://images.dawn.com/news/1192127/international-fashion-had-its-star-moment-at-the-brics-fashion-summit-in-moscow",
    "publishedAt": "2024-01-03T10:53:58Z",
    "sentences": [
      "Fashion was in the air — and on the runway — at the BRICS+ Fashion Summit in Moscow at the start of December.",
      "With 10 fashion shows featuring 13 designers during the five-day event, the summit was bursting with style — and you know how we love fashion.",
      "From Hany El Behairy’s glamorous gowns to Shruti Sancheti’s handwoven masterpieces, the pieces on display were quite diverse and, in my opinion, for a variety of audiences.",
      "There was no set audience to which these clothes were being marketed.",
      "View this post on Instagram From over-the-top glam to muted elegance, there was something for everyone.",
      "Check out this list of my favourite designers (and their designs) from the summit.",
      "The top spot absolutely had to go to Hany El Behairy of Egypt.",
      "His stunning designs oozed glamour and elegance as well as the kind of bling we’re used to seeing in Faraz Manan or Elan designs in Pakistan.",
      "With the kind of intricate bead and thread work in his designs, is it any wonder that he created what was then the most expensive dress in the world — worth a whopping $15 million?",
      "According to the designer, he used real jewels in the dress — which were later returned to the jeweller, of course.",
      "@dawn_images We caught up with Egyptian designer Hany El-Behairy at rhe #bricsfashionsummit in #moscow and he told us why he’d come to show his collection!",
      "#hanyelbehairy ♬ original sound - Dawn IMAGES We caught up with Egyptian designer Hany El-Behairy at rhe #bricsfashionsummit in #moscow and he told us why he’d come to show his collection!",
      "#hanyelbehairy He told Images that he came to the BRICS+ Fashion Summit to present his new collection because he was looking for collaborations — be it through the purchase of new materials, inspiration from the culture or deals.",
      "“Designers from all over the world are excited to come to Moscow.",
      "I know Moscow and Russia [have a really good background] in dresses, fabric and fashion, so for me, it was perfect.” His inspiration, he said, comes from museums — specifically the Louvre in Paris.",
      "Ever since he was young, Behairy has been interested in embroidery — an interest encouraged by his mother and grandmother, who taught him how to embroider.",
      "That love continues today, especially in his designs which are bold, loud and beautiful.",
      "People, he said, have told him to make clothes that are a bit more simple, perhaps to attract more customers, but that isn’t his style.",
      "@dawn_images The fashion was fashioning at the #bricsfashionsummit in #moscow — especially the uber glam collection by Egyptian designer #hanyelbehairy ✨ ♬ Imagination - Lize Mynhardt The fashion was fashioning at the #bricsfashionsummit in #moscow — especially the uber glam collection by Egyptian designer #hanyelbehairy ✨ Turkish designer Arzu Caprol’s designs were all about sleek glamour and shimmery elegance.",
      "Unlike Behairy’s, most of her designs seemed more appropriate for clubs or parties as opposed to weddings or balls but her designs had the same wow factor Behairy’s did.",
      "The use of beadwork and different materials made Caprol’s designs quite eye-catching.",
      "This dress was one of my favourites simply due to how over the top yet understated it is.",
      "There’s no beadwork or embroidery — it stands out solely based on the colour and the design.",
      "There’s something to be said for avant garde fashion but, in my opinion, there’s even more to be said for fashion that makes it off the runway and into people’s closets.",
      "Some clothes look nice to look at but most people can’t actually see themselves wearing those clothes.",
      "That’s why I liked Shruti Sancheti’s collection so much — hers were clothes I could see myself or other people wearing.",
      "Mixing traditional materials and designs with streetwear elements, I enjoyed both her show and checking out her clothes in person at the B2B showroom at the summit.",
      "Sancheti told Images that the fabric used in her line, Hut to High Streets, was entirely handcrafted.",
      "@dawn_images One of our favourite designers at the #bricsfashionsummit Shruti Sancheti spoke to us about her collection and the ethos behind her designs.",
      "#moscow #indianfashion ♬ original sound - Dawn IMAGES One of our favourite designers at the #bricsfashionsummit Shruti Sancheti spoke to us about her collection and the ethos behind her designs.",
      "#moscow #indianfashion “In parts of South East Asia, we still have hand-weaving as a tradition and all my fabrics are handmade and handcrafted.",
      "And what we’ve done is add a very contemporary touch to the garments because though these textiles are beautiful and our country has this unsurpassed legacy of textiles and crafts we realise that what was relevant years ago is not relevant now,” she explained.",
      "“The whole idea is to take India to a global arena and so [my clothes] are a merger of international styling with Indian craftsmanship and the result is easy separates that anyone in the world can wear.” And a merger they are indeed — long baggy dresses, flowing pants and comfortable shirts paired with long coats lined with traditional tassels and prints, her clothes were a mix of traditional and contemporary.",
      "Comfort seemed to be an overarching theme with the Indian designers who showcased their work at the BRICS+ Fashion Summit.",
      "Ritesh Kumar, another designer from across the border, showcased far more contemporary fits, playing with materials and jacket silhouettes to create more casual outfits that I could see on any high street in the world.",
      "I especially liked the materials used in his designs, which like Sancheti’s, looked incredibly wearable.",
      "If Kumar’s designs were ultra modern, then designer Naushad Ali was a mix of modern and traditional, incorporating traditional embroideries and patterns to create more feminine, flowing silhouettes that wouldn’t be out of place anywhere.",
      "I may be belabouring the point, but all of the Indian designers had clothes that looked like they were meant to be worn.",
      "These were no collections made for magazines and runways alone — these were made for people to wear and I loved that so much.",
      "@dawn_images Indian designer Naushad Ali was pretty happy to be in Moscow for the #bricsfashionsummit ☺️ #naushadali #moscow ♬ original sound - Dawn IMAGES Indian designer Naushad Ali was pretty happy to be in Moscow for the #bricsfashionsummit ☺️ #naushadali #moscow He described the experience of being at the summit in Moscow as “amazing”.",
      "“It’s been an amazing experience to be alongside fellow designers from India.",
      "We showcased something incredible from different parts of India with craftsmen and each of us did a very unique collection in its own way and what better way to talk about India on an international platform?” he told Images.",
      "Perhaps one of my favourite designers at the summit was Gaurav Khanijo, who seamlessly blended modernity with eclectic designs, showcasing a range of menswear that we need to see men wearing.",
      "There was colour, there was playing with embroidery and patterns and there was gorgeous mehndi.",
      "Though some of the clothes may seem too outré for everyday wear, I think they could be the statement pieces so many men need in their closets.",
      "Get rid of the boring black coats and pants and get yourself something that makes people do a double take.",
      "The additional details of the mehndi on the models’ hands and feet and the anklets around their ankles was amazing — giving his show a touch of personalisation and colour.",
      "@dawn_images There was a lot to take in at the faahion shows at the #bricsfashionsummit in #moscow There were designers from all over the world showcasing their designs including #turkish and #indian designers ♬ Neon Bass - Tangelene Bolton There was a lot to take in at the faahion shows at the #bricsfashionsummit in #moscow There were designers from all over the world showcasing their designs including #turkish and #indian designers Indonesian designer Aldrè wowed with his designs that combined asymmetrical cuts, black and white accents and — rather perplexingly — dragon scales and horns.",
      "The designer was able to use these interesting elements to create eye-catching pieces that were as at home on the runway as they would be on the streets.",
      "Like the true Pakistani I am, I had to go get a feel for the clothes — literally — and the dragons were made of what seemed to be a hard, heavy plastic.",
      "Aldrè’s designs are also wearable, at least in my eyes.",
      "His would be statement pieces, lighting up your wardrobe and giving your basics the upgrade they truly need.",
      "The most interesting thing to me was how each designer I spoke to wanted to reach new audiences with their clothes.",
      "None of them were making clothes just for their own country-people — they wanted their clothes to reach new people and they all believed coming all the way to Russia was the way to do it."
    ],
    "topics": [
      "bricsfashionsummit moscow",
      "shruti sancheti",
      "favourite designers",
      "egyptian designer",
      "indian designers",
      "fashion summit",
      "original sound",
      "sound dawn",
      "dawn images",
      "told images"
    ]
  },
  {
    "title": "Pakistan eyes BRICS membership, seeks Russia’s help",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/1131693-pakistan-eyes-brics-membership-seeks-russia-s-help",
    "publishedAt": "2023-11-22T19:00:00Z",
    "sentences": [
      "ISLAMABAD: Pakistan has applied for BRICS membership and sought Russia’s support, the country’s envoy to Moscow Muhammad Khalid Jamali has said.",
      "There has been no comment from the Foreign Office without whose approval Jamali (who is yet to present his credentials) would not have made this revelation.",
      "According to media reports, Jamali was talking to the Russian news agency TASS in which he revealed that Pakistan had filed an application to join the BRICS and was counting on Russia’s assistance.",
      "Jamali said Pakistan had already applied for membership of the BRICS, which was set to expand next year with the admission of six new members.",
      "Jamali said Islamabad planned to join the group under Russia’s presidency next year.",
      "Pakistan would like to be a part of this important organisation and we are in the process of contacting member countries for extending support to Pakistan’s membership in general and the Russian Federation in particular, he said.",
      "Police received information that unidentified kidnappers were trying to move abducted trader to another location A policeman was martyred in exchange of fire with assailants It is not yet known whether venue will remain same or would be changed to Doha or Dubai On Pakistan side of LoC, families wearied by decades of sporadic firing began to return home for now This additional charge has been given for three months or until regular appointment to same position China and Pakistan reaffirmed their commitment to strengthening friendly ties with Afghanistan"
    ],
    "topics": [
      "jamali said",
      "next year",
      "islamabad pakistan",
      "pakistan applied",
      "applied brics",
      "brics membership",
      "membership sought",
      "sought russia",
      "russia support",
      "support country"
    ]
  },
  {
    "title": "The rise of BRICS",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/975620-the-rise-of-brics",
    "publishedAt": "2022-07-21T19:00:00Z",
    "sentences": [
      "The G7 summit in Elmau, Germany, June 26-28, and the NATO summit in Madrid, Spain, two days later, were practically useless in terms of providing actual solutions to ongoing global crises – the war in Ukraine, the looming famines, climate change and more.",
      "But the two events were important, nonetheless, as they provide a stark example of the impotence of the West, amid the rapidly changing global dynamics.As was the case since the start of the Russia-Ukraine war, the West attempted to display unity, though it has become repeatedly obvious that no such unity exists.",
      "While France, Germany and Italy are paying a heavy price for the energy crisis resulting from the war, Britain’s Boris Johnson is adding fuel to the fire in the hope of making his country relevant on the global stage following the humiliation of Brexit.",
      "Meanwhile, the Biden Administration is exploiting the war to restore Washington’s credibility and leadership over Nato – especially following the disastrous term of Donald Trump, which nearly broke up the historic alliance.",
      "Even the fact that several African countries are becoming vulnerable to famines – as a result of the disruption of food supplies originating from the Black Sea and the subsequent rising prices – did not seem to perturb the leaders of some of the richest countries in the world.",
      "They still insist on not interfering in the global food market, though the skyrocketing prices have already pushed tens of millions of people below the poverty line.Though the West had little reserve of credibility to begin with, Western leaders’ current obsession with maintaining thousands of sanctions on Russia, further NATO expansion, dumping yet more ‘lethal weapons’ in Ukraine and sustaining their global hegemony at any cost, have all pushed their credibility standing to a new low.From the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’.",
      "“You are either with us or with the terrorist,” he declared in October 2009.",
      "But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches.",
      "One can, indeed, want an end to the war, and still oppose US-western unilateralism.",
      "The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org As was the case since the start of the Russia-Ukraine war, the West attempted to display unity, though it has become repeatedly obvious that no such unity exists.",
      "While France, Germany and Italy are paying a heavy price for the energy crisis resulting from the war, Britain’s Boris Johnson is adding fuel to the fire in the hope of making his country relevant on the global stage following the humiliation of Brexit.",
      "Meanwhile, the Biden Administration is exploiting the war to restore Washington’s credibility and leadership over Nato – especially following the disastrous term of Donald Trump, which nearly broke up the historic alliance.",
      "Even the fact that several African countries are becoming vulnerable to famines – as a result of the disruption of food supplies originating from the Black Sea and the subsequent rising prices – did not seem to perturb the leaders of some of the richest countries in the world.",
      "They still insist on not interfering in the global food market, though the skyrocketing prices have already pushed tens of millions of people below the poverty line.Though the West had little reserve of credibility to begin with, Western leaders’ current obsession with maintaining thousands of sanctions on Russia, further NATO expansion, dumping yet more ‘lethal weapons’ in Ukraine and sustaining their global hegemony at any cost, have all pushed their credibility standing to a new low.From the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’.",
      "“You are either with us or with the terrorist,” he declared in October 2009.",
      "But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches.",
      "One can, indeed, want an end to the war, and still oppose US-western unilateralism.",
      "The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Even the fact that several African countries are becoming vulnerable to famines – as a result of the disruption of food supplies originating from the Black Sea and the subsequent rising prices – did not seem to perturb the leaders of some of the richest countries in the world.",
      "They still insist on not interfering in the global food market, though the skyrocketing prices have already pushed tens of millions of people below the poverty line.Though the West had little reserve of credibility to begin with, Western leaders’ current obsession with maintaining thousands of sanctions on Russia, further NATO expansion, dumping yet more ‘lethal weapons’ in Ukraine and sustaining their global hegemony at any cost, have all pushed their credibility standing to a new low.From the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’.",
      "“You are either with us or with the terrorist,” he declared in October 2009.",
      "But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches.",
      "One can, indeed, want an end to the war, and still oppose US-western unilateralism.",
      "The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Though the West had little reserve of credibility to begin with, Western leaders’ current obsession with maintaining thousands of sanctions on Russia, further NATO expansion, dumping yet more ‘lethal weapons’ in Ukraine and sustaining their global hegemony at any cost, have all pushed their credibility standing to a new low.From the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’.",
      "“You are either with us or with the terrorist,” he declared in October 2009.",
      "But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches.",
      "One can, indeed, want an end to the war, and still oppose US-western unilateralism.",
      "The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org From the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’.",
      "“You are either with us or with the terrorist,” he declared in October 2009.",
      "But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches.",
      "One can, indeed, want an end to the war, and still oppose US-western unilateralism.",
      "The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Times have changed.",
      "Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance.",
      "These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda.",
      "To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se.",
      "The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org China and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential.",
      "If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west.",
      "This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org China is not wrong.",
      "Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan.",
      "Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Two main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise.",
      "First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation.",
      "From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org This is precisely why Beijing did not join the chorus of western condemnations of Russia.",
      "Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org While Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention.",
      "According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7.",
      "The German paper is correct.",
      "BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org In his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”.",
      "The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Reportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany.",
      "This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Excerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’.",
      "Courtesy: Counterpunch.org Researchers have developed tiny, skin-penetrating microsensor that promises to solve many of these issues From very start, Indian media outlets abandoned any notion of journalism and descended into pure fiction 18th Amendment devolved education to provinces, ostensibly empowering them to tailor solutions to local needs Claim that ordinance bypasses parliament and violates Article 77 of constitution is inaccurate It's time to shift toward Keynesian model, where industrial demand creation becomes anchor for generation planning It breathes through every young mind that dares to dream of better future despite obstacles"
    ],
    "topics": [
      "russia china",
      "china global",
      "brics summit",
      "june 23",
      "us dollar",
      "rise brics",
      "brics economic",
      "economic giant",
      "giant taking",
      "taking west"
    ]
  },
  {
    "title": "India’s diplomatic success",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/973188-india-s-diplomatic-success",
    "publishedAt": "2022-07-12T19:00:00Z",
    "sentences": [
      "India has established mutually beneficial bilateral and multilateral relations with various countries; it is a member of pertinent alliance systems like BRICS (Brazil, Russia, India, China and South Africa), Quadrilateral Security Dialogue (QUAD), which includes Australia, Japan, and the US, and the Association of SouthEast Asian Nations (ASEAN).India’s tactful handling of international relations has transitioned the country from a ‘non-allied’ country to an ‘ally’ of all.",
      "India is going to be part of a new alliance in the making, the I2U2, which includes Israel, the US and the UAE.",
      "Inclusion in alliance systems has benefitted India in three ways.",
      "First, the perception of India as a non-allied country has been changed; second, its trade relations with ally countries have improved, leading to foreign investments; third, India’s ‘say’ in international politics has become meaningful.Other than becoming part of alliances, India has adroitly developed bilateral relations with various countries.",
      "India has free trade agreements (FTAs) with 13 countries, including economic giants like the US and Australia.",
      "It is also in the process of negotiating an FTA with Israel.",
      "India has preferential market access and economic cooperation agreements with over 50 countries.India’s ‘Act Asia’ policy opened up India with countries in the Far East.",
      "In 2021, Singapore was the top investor in India with investments worth $15.",
      "7 billion.",
      "In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea.",
      "Indian exports to Korea alone stands at $8 billion.Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "India’s tactful handling of international relations has transitioned the country from a ‘non-allied’ country to an ‘ally’ of all.",
      "India is going to be part of a new alliance in the making, the I2U2, which includes Israel, the US and the UAE.",
      "Inclusion in alliance systems has benefitted India in three ways.",
      "First, the perception of India as a non-allied country has been changed; second, its trade relations with ally countries have improved, leading to foreign investments; third, India’s ‘say’ in international politics has become meaningful.Other than becoming part of alliances, India has adroitly developed bilateral relations with various countries.",
      "India has free trade agreements (FTAs) with 13 countries, including economic giants like the US and Australia.",
      "It is also in the process of negotiating an FTA with Israel.",
      "India has preferential market access and economic cooperation agreements with over 50 countries.India’s ‘Act Asia’ policy opened up India with countries in the Far East.",
      "In 2021, Singapore was the top investor in India with investments worth $15.",
      "7 billion.",
      "In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea.",
      "Indian exports to Korea alone stands at $8 billion.Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Inclusion in alliance systems has benefitted India in three ways.",
      "First, the perception of India as a non-allied country has been changed; second, its trade relations with ally countries have improved, leading to foreign investments; third, India’s ‘say’ in international politics has become meaningful.Other than becoming part of alliances, India has adroitly developed bilateral relations with various countries.",
      "India has free trade agreements (FTAs) with 13 countries, including economic giants like the US and Australia.",
      "It is also in the process of negotiating an FTA with Israel.",
      "India has preferential market access and economic cooperation agreements with over 50 countries.India’s ‘Act Asia’ policy opened up India with countries in the Far East.",
      "In 2021, Singapore was the top investor in India with investments worth $15.",
      "7 billion.",
      "In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea.",
      "Indian exports to Korea alone stands at $8 billion.Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Other than becoming part of alliances, India has adroitly developed bilateral relations with various countries.",
      "India has free trade agreements (FTAs) with 13 countries, including economic giants like the US and Australia.",
      "It is also in the process of negotiating an FTA with Israel.",
      "India has preferential market access and economic cooperation agreements with over 50 countries.India’s ‘Act Asia’ policy opened up India with countries in the Far East.",
      "In 2021, Singapore was the top investor in India with investments worth $15.",
      "7 billion.",
      "In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea.",
      "Indian exports to Korea alone stands at $8 billion.Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "India’s ‘Act Asia’ policy opened up India with countries in the Far East.",
      "In 2021, Singapore was the top investor in India with investments worth $15.",
      "7 billion.",
      "In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea.",
      "Indian exports to Korea alone stands at $8 billion.Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Most interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011.",
      "In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country.",
      "It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table.",
      "China and subsequently Pakistan did not take part in the moot.Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Other than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries.",
      "Indian exports to Saudi Arabia are nearly $8 billion.",
      "Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "India is maintaining ‘strategic autonomy’ in its relations with all countries.",
      "Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran.",
      "In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India.",
      "Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US.",
      "On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran.",
      "India is the only country to get a waiver from sanctions on Iran to buy crude oil.This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "This shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms.",
      "India also has good relations with Russia.",
      "Its exports to Russia are around $3 billion.",
      "And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022.",
      "Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "India abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it.",
      "Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran.",
      "In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”.",
      "And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Even China is keen to have working relations with India.",
      "China has been the largest trading partner of India, other than the US.",
      "The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year.",
      "This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "India has transitioned from a protectionist country to a global trading partner.",
      "It has improved the procedures of doing business in the country.",
      "In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position.",
      "Pakistan is at 108th position, out of 188 countries.",
      "This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "The question is: why are countries eager to establish security and economic relations with India?",
      "The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order.",
      "Therefore, the US and other Western countries are more than willing to establish security and economic relations with India.",
      "Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "For investment to take root, stability is the first prerequisite.",
      "In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built.",
      "With stability within, India is now on the road to become the third biggest economy.The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "The writer is a research analyst at the Institute of Regional Studies, Islamabad.",
      "Researchers have developed tiny, skin-penetrating microsensor that promises to solve many of these issues From very start, Indian media outlets abandoned any notion of journalism and descended into pure fiction 18th Amendment devolved education to provinces, ostensibly empowering them to tailor solutions to local needs Claim that ordinance bypasses parliament and violates Article 77 of constitution is inaccurate It's time to shift toward Keynesian model, where industrial demand creation becomes anchor for generation planning It breathes through every young mind that dares to dream of better future despite obstacles"
    ],
    "topics": [
      "relations india",
      "economic relations",
      "establish security",
      "security economic",
      "trading partner",
      "within india",
      "relations russia",
      "india also",
      "relations iran",
      "writer research"
    ]
  },
  {
    "title": "BRICS at the crossroads",
    "source": "The Nation",
    "url": "https://nation.com.pk/2022/07/04/brics-at-the-crossroads/",
    "publishedAt": "2022-07-04T01:09:34Z",
    "sentences": [
      "Get Alerts Karachi Commissioner office hosts victory celebration honoring Pakistan's success in conflict with India The writer is a former Ambassador of Pakistan and author of eight books in three languages.",
      "He can be reached at najmussaqib1960@msn.com.",
      "The writer is a former Ambassador of Pakistan and author of eight books in three languages.",
      "He can be reached at najmussaqib1960@msn.com.",
      "NIPCO House, 4 - Shaharah e Fatima Jinnah, Lahore, Pakistan Tel: +92 42 36367580 | Fax : +92 42 36367005 Nawaiwaqt Group | Copyright © 2025 Nawaiwaqt Group | Copyright © 2025"
    ],
    "topics": [
      "writer former",
      "former ambassador",
      "ambassador pakistan",
      "pakistan author",
      "author eight",
      "eight books",
      "books three",
      "three languages",
      "languages reached",
      "reached najmussaqib1960"
    ]
  },
  {
    "title": "BRICS member blocked invite to China dialogue: FO",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/print/969816-brics-member-blocked-invite-to-china-dialogue-fo",
    "publishedAt": "2022-06-27T19:00:00Z",
    "sentences": [
      "ISLAMABAD: The Foreign Office disclosed on Monday that a member of the five-nation summit BRICS (Brazil-Russia-India-China-South Africa) blocked Pakistan's participation in the High-Level Dialogue on Global Development (HLDGD) hosted by China on June 24.",
      "The clarification came three days after the dialogue and it stated that the event had taken place on the sidelines of BRICS summit.",
      "Incidentally, a Chinese spokesman had also offered a clarification on account of Pakistan’s absence where the reference of it being blocked by a country and the forum’s holding on the sidelines of the BRICS were evidently missing.",
      "Meanwhile, in response to media queries about the High-level Dialogue on Global Development held virtually on the sidelines of the BRICS meetings, a Foreign Office spokesperson said that Pakistan — with the cooperation of China — is fully committed to taking bilateral and multilateral cooperation to new heights.",
      "According to the foreign ministry spokesperson, a number of developing and emerging economies were invited to the high-level dialogue on global development.",
      "As the host country, China was engaged with Pakistan prior to the BRICS meetings, where decisions are made after consultations with all BRICS members, including invitations to non-members, the statement read.",
      "“Regrettably, one member blocked Pakistan from participating,” it added.",
      "According to sources, India blocked Pakistan from participating in the BRICS summit.",
      "“We hope that the organisation’s future engagement will be based on principles of inclusivity, with the overall interests of the developing world in mind, and free of narrow geopolitical considerations,” the spokesperson's statement read.",
      "It said Pakistan values China's role in advancing the interests of developing countries, adding that Pakistan, along with China, has been a strong advocate for global peace, shared prosperity and inclusive development.",
      "Pakistan is the current chair of the G77+China and a member of the Global Development Initiative's (GDI) group of friends.",
      "\"Pakistan and China are all-weather strategic partners and our iron brotherhood is unbreakable,\" the statement read.",
      "\"Pakistan stands ready to work with all developing countries, including BRICS members, to address the global community's challenges,\" it concluded.",
      "Police received information that unidentified kidnappers were trying to move abducted trader to another location A policeman was martyred in exchange of fire with assailants It is not yet known whether venue will remain same or would be changed to Doha or Dubai On Pakistan side of LoC, families wearied by decades of sporadic firing began to return home for now This additional charge has been given for three months or until regular appointment to same position China and Pakistan reaffirmed their commitment to strengthening friendly ties with Afghanistan"
    ],
    "topics": [
      "global development",
      "blocked pakistan",
      "dialogue global",
      "sidelines brics",
      "statement read",
      "foreign office",
      "brics summit",
      "brics meetings",
      "said pakistan",
      "brics members"
    ]
  },
  {
    "title": "BRICS member blocked Pakistan’s invitation to event in China: FO",
    "source": "BOL News",
    "url": "https://www.bolnews.com/latest/2022/06/brics-member-blocked-pakistans-invitation-to-event-in-china-fo/",
    "publishedAt": "2022-06-27T08:43:52Z",
    "sentences": [
      "27th Jun, 2022.",
      "01:43 pm Share Listen Font size Dark Mode Save Print China hosted High-level Dialogue on Global Development.",
      "ISLAMABAD: The Foreign Office has confirmed that Pakistan’s invitation to a development dialogue held in China on June 24 was blocked by a BRICS member.",
      "BRICS is the acronym coined to associate five major emerging economies – Brazil, Russia, India, China, and South Africa.",
      "This year, China hosted a BRICS event and invited 13 other countries.",
      "The absence of Pakistan from the event had raised eyebrows amid Beijing’s push to expand the bloc.",
      "Responding to media queries about a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS meetings, the Foreign Office spokesperson confirmed that “regrettably” one member blocked Pakistan’s participation.",
      "The spokesperson said Pakistan congratulates China on the successful hosting of the BRICS meetings.",
      "He noted that a “High-level Dialogue on Global Development” was held as a BRICS side event in which a number of developing/emerging economies were invited.",
      "“China being the host country engaged with Pakistan prior to the BRICS meetings, where decisions are taken after consultations with all BRICS members, including extending invitation to non-members,” the spokesperson added.",
      "READ MORE: Russia urges BRICS countries to integrate payment systems and cards Without naming any country, the spokesperson said one BRICS member blocked Pakistan’s participation in the event.",
      "“We hope that future engagement would be based on the principles of inclusivity keeping in view the overall interests of the developing world and in a manner that is devoid of narrow geo-political considerations,” the statement added.",
      "The Foreign Office appreciated China’s role in promoting the interests of the developing countries.",
      "it added that together with China, Pakistan has been a strong voice for global peace, shared prosperity and inclusive development.",
      "Pakistan is the current chair of G77+China and also part of group of friends of the Global Development Initiative (GDI).",
      "“Pakistan and China are all-weather strategic partners and our iron brotherhood remains rock solid.",
      "The two countries are fully committed to take our all-round cooperation to higher levels both bilaterally and multilaterally.” “Pakistan stands ready to work with all developing countries, including the BRICS members for addressing the challenges faced by the global community,” it concluded.",
      "Catch all the Pakistan News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "global development",
      "dialogue global",
      "foreign office",
      "brics meetings",
      "china hosted",
      "brics member",
      "development held",
      "member blocked",
      "blocked pakistan",
      "pakistan participation"
    ]
  },
  {
    "title": "FO confirms Pakistan’s participation in BRICS summit was blocked by a member",
    "source": "The News International",
    "url": "https://www.thenews.com.pk/latest/969587-fo-confirms-pakistans-participation-in-brics-summit-was-blocked-by-a-member",
    "publishedAt": "2022-06-26T19:00:00Z",
    "sentences": [
      "ISLAMABAD: The Foreign Office (FO) on Monday confirmed that Pakistan’s participation in a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS meetings was blocked by a member.",
      "In response to media queries about why Pakistan was not invited to the summit, the FO spokesperson said, “China being the host country engaged with Pakistan prior to the BRICS meetings, where decisions are taken after consultations with all BRICS members, including extending invitations to non-members.” “Regrettably one member blocked Pakistan’s participation,” it added.",
      "BRICS has five member namely Brazil, Russia, India, China and South Africa and considering the rift between Pakistan and India, it is believed that New Dehli might have blocked Islamabad's participation in the conference.",
      "Congratulating China on the successful hosting of the BRICS meetings, the FO hoped that future engagement of the organisation would be based on the principles of inclusivity keeping in view the overall interests of the developing world and in a manner that is devoid of narrow geo-political considerations.",
      "“We appreciate China’s role in promoting the interests of the developing countries.",
      "Together with China, Pakistan has been a strong voice for global peace, shared prosperity and inclusive development.",
      "Pakistan is the current chair of G77+China and also part of the group of friends of the Global Development Initiative(GDI).” The spokesperson added that Pakistan and China are all-weather strategic partners and their iron brotherhood remains rock solid.",
      "“The two countries are fully committed to take our all-round cooperation to higher levels both bilaterally and multilaterally.",
      "The FO reiterated that Pakistan stands ready to work with all developing countries, including the BRICS members for addressing the challenges faced by the global community.",
      "As per notification, academic activities in all schools will resume as per normal schedule Analysts say Trump’s intervention reflects growing recognition of Kashmir as central issue fuelling Pak-India... Karachi, Lahore, and Islamabad saw dozens of cancellations on Sunday alone PM urges nation to offer collective prayers across country as expression of gratitude to Allah Almighty Fragile ceasefire holds between Islamabad and New Delhi following intense overnight clashes Premier thanks US President Trump for his sincere role in brokering ceasefire between nuclear-armed rivals"
    ],
    "topics": [
      "brics meetings",
      "pakistan participation",
      "global development",
      "brics members",
      "interests developing",
      "developing countries",
      "islamabad foreign",
      "foreign office",
      "office fo",
      "fo monday"
    ]
  },
  {
    "title": "Russia urges BRICS countries to integrate payment systems and cards",
    "source": "BOL News",
    "url": "https://www.bolnews.com/latest/2022/04/russia-urges-brics-countries-to-integrate-payment-systems-and-cards/",
    "publishedAt": "2022-04-09T17:25:39Z",
    "sentences": [
      "09th Apr, 2022.",
      "10:25 pm Share Listen Font size Dark Mode Save Print Russia urges BRICS countries to integrate payment systems and cards The Russian government has asked the BRICS group of developing economies, which includes Brazil, China, India, Russia, and South Africa, to use national currencies for import-export transactions and to integrate payment systems.",
      "Russia has been slammed by unprecedented Western sanctions since its invasion of Ukraine on February 24, cutting it off from the global financial system and nearly half of its gold and foreign exchange reserves, which stood at $606.5 billion in early April.",
      "Meanwhile, Visa and MasterCard, two major international payment cards, ceased operations in Russia in early March, and Russia’s largest banks lost access to the SWIFT global banking messaging system.",
      "According to a statement from his ministry, Russian Finance Minister Anton Siluanov told a ministerial meeting with BRICS on Friday that the global economic situation has deteriorated significantly as a result of the sanctions.",
      "According to Siluanov, the punitive measures also destroy the foundation of the present international monetary and financial system based on the US dollar.",
      "“This pushes us to the need to speed up work in the following areas: the use of national currencies for export-import operations, the integration of payment systems and cards, our own financial messaging system and the creation of an independent BRICS rating agency,” Siluanov said.",
      "As an alternative to SWIFT, Russia developed its own banking messaging system, known as SPFS.",
      "MIR, the company’s own card payment system, went live in 2015.",
      "They were part of Moscow’s efforts to establish homegrown financial tools that were similar to Western ones in order to safeguard the country in the event that sanctions against Moscow were expanded.",
      "Catch all the International News, Trending News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "payment systems",
      "messaging system",
      "integrate payment",
      "systems cards",
      "use national",
      "national currencies",
      "financial system",
      "banking messaging",
      "bol news",
      "09th apr"
    ]
  },
  {
    "title": "African experts call for BRICS to expand scope after COVID-19",
    "source": "BOL News",
    "url": "https://www.bolnews.com/health/2022/02/african-experts-call-for-brics-to-expand-scope-after-covid-19/",
    "publishedAt": "2022-02-23T19:43:24Z",
    "sentences": [
      "24th Feb, 2022.",
      "12:43 am Share Listen Font size Dark Mode Save Print Google JOHANNESBURG, Feb. 23 (Xinhua) — After COVID-19 exposed some challenges bedeviling the BRICS countries, there is a need to re-examine its strategies and integrate and expand its scope, said South African experts on Wednesday at the webinar “South Africa and the BRICS: Revisiting developmental priorities”.",
      "The Witwatersrand University School of Governance lecturer Lihle Ngcobozi said COVID-19 showed the problems of patents and vaccine nationalism that BRICS should address.",
      "“BRICS should lead and be trend or policy setters.",
      "They should lead in vaccine democratization,” she said.",
      "She pointed out that BRICS countries have a potential influence on global decisions such as climate change and COVID-19.",
      "It should have a blueprint on infrastructure development, economic reforms, fiscal prudence, and post-economic recovery while respecting the sovereignty of the countries.",
      "Krish Chetty, the chief researcher at one of the country’s think tanks, the Human Science Research Council, said COVID-19 created new areas of cooperation.",
      "She said while China quickly managed to adjust to online learning at a large scale, countries like South Africa, India and Brazil faced challenges.",
      "“We should continue with knowledge sharing on BRICS as think-tank and universities.",
      "There is a space to work together in renewable energy platforms and new technology.",
      "We must promote mass digital skills training for students and lecturers,” she said.",
      "Sanusha Naidu, senior researcher at Institute for Global Dialogue concurred with other experts.",
      "She pointed out that while BRICS made progress in building institutions like Contingent Reserve Arrangement, New Development Bank, there have been calls for the establishment of the digital payment system.",
      "Naidu called on members to address tariff and non-tariff measures which are barriers to trade within BRICS countries.",
      "The webinar was organized by the South African Institute of International Affairs and South African BRICS Think Tank.",
      "LONDON, Feb 23, 2022 (AFP) - Oil prices pushed higher while stocks struggled... Catch all the Health News, International News, Breaking News Event and Latest News Updates on The BOL News Download The BOL News App to get the Daily News Update & Follow us on Google News."
    ],
    "topics": [
      "brics countries",
      "south african",
      "south africa",
      "pointed brics",
      "bol news",
      "24th feb",
      "feb 2022",
      "2022 share",
      "share listen",
      "listen font"
    ]
  },
  {
    "title": "India makes canny attempts to misuse BRICS to fulfill anti-Pakistan designs",
    "source": "The Nation",
    "url": "https://nation.com.pk/29-Aug-2021/india-makes-canny-attempts-to-misuse-brics-to-fulfill-anti-pakistan-designs",
    "publishedAt": "2021-08-28T19:00:00Z",
    "sentences": [
      "Get Alerts ISLAMABAD - Deviating from BRICS’ sole objective of limited purpose partnership, India is making cunning attempts to use the forum to undermine Pakistan’s anti-terror achievements and sabotage the indigenous freedom movement of Kashmir through agenda-setting.",
      "Constituting Brazil, Russia, India, China and South Africa, the BRICS brings together four continents with five major emerging economies accounting for 42% of the world’s population.It is a “limited purpose partnership” as it was meant for interstate cooperation among group to rebalance global economy.",
      "With India holding its current chair, the BRICS summit is scheduled to be held on September 9 this year.",
      "Prelude to the summit, meeting of BRICS Counter Terrorism Working Group (CTWG) was also held in July and discussed the Foreign Terrorist Fighters (FTF).Though the NSAs’ meeting discussed the current situation in Afghanistan, India as usual tried its best to drag Pakistan into discussion without directly mentioning its name.",
      "India also remarked that Lashkar-e-Taiba (LeT) and Jaish-e-Mohammad (JeM) are enjoying a “state support”.",
      "In fact, in order to hide its internal vulnerabilities and embarrassment faced after takeover of Afghanistan by Taliban, India is once again using the “mantra” of “cross border terrorism” hinting Pakistan at BRICS forum which is not even meant to discuss such issues between two states.",
      "The forum is supposed to focus on economic gains instead of being exploited as a tool for political gains.",
      "National agendas of one particular member country should have no place in the forum.",
      "Historically, India has been using BRICS to target Pakistan and setting of terrorism as agenda for the meet by India is a canny attempt to undermine Pakistan’s extensive and successful efforts against terrorism.India is attempting to overshadow Pakistan’s counter terrorism achievements especially proscription of LeT and JeM and collaboration with global and regional countries amid US withdrawal to bring peace to Afghanistan.",
      "Besides, India is also likely to use this forum to sabotage the indigenous Kashmir freedom movement by labeling the freedom fighter as “Pakistan sponsored Foreign Terrorist Fighters (FTFs) during the upcoming BRICS Summit.The Narendra Modi regime would try to convince the member states to tighten the monitoring and removal of material uploaded by Kashmiris on social media in the name of cyber security as “use of social media by terrorists is already on the BRICS meeting agenda.India is also likely to link the terror financing issue with the FATF and would try its utmost through “fake facts” to orchestrate a case to continue to keep Pakistan on the grey list.The misuse of BRICS by India is nothing new as the country always misled forum members.",
      "While the rest of the BRICS members would never openly endorse either side in the Indo-Pakistan tension, India in a way tried to secure its stance vis-à-vis Pakistan by taking advantages of its agenda-setting powers for the summits.",
      "As a matter of fact, India is involved in financing and supporting terrorism in Pakistan but plays innocent at international forums including BRICS.India is totally flabbergasted and confused over the takeover of Afghanistan by the Taliban as all its mischievous notions carried out with the support of previous Afghan govt have failed and billions of dollars flooded in Afghanistan by India have gone for a six.Two of the BRICS members, China and Russia have already welcomed Taliban and have shown their strong willingness to work with future Afghanistan leaving India in a great fix.",
      "Karachi Commissioner office hosts victory celebration honoring Pakistan's success in conflict with India NIPCO House, 4 - Shaharah e Fatima Jinnah, Lahore, Pakistan Tel: +92 42 36367580 | Fax : +92 42 36367005 Nawaiwaqt Group | Copyright © 2025 Nawaiwaqt Group | Copyright © 2025"
    ],
    "topics": [
      "limited purpose",
      "purpose partnership",
      "use forum",
      "undermine pakistan",
      "sabotage indigenous",
      "freedom movement",
      "counter terrorism",
      "foreign terrorist",
      "terrorist fighters",
      "afghanistan india"
    ]
  },
  {
    "title": "BRICS seeks to prepare legally binding tool to prevent Arms Race in space",
    "source": "The Nation",
    "url": "https://nation.com.pk/17-Nov-2020/brics-seeks-to-prepare-legally-binding-tool-to-prevent-arms-race-in-space",
    "publishedAt": "2020-11-16T19:00:00Z",
    "sentences": [
      "Get Alerts During Tuesday’s meeting, the heads of the BRICS member states – Brazil, Russia, China and South Africa – touched on issues of global importance, including the war in Syria, the fight against international terrorism, and the production and distribution of a coronavirus vaccine.",
      "BRICS countries want to prepare a legally binding tool to prevent an arms race in space, reads a declaration adopted at the group's 12th summit, which is being held on 17 November in Moscow.",
      "\"We emphasise the urgent need to agree on a multilateral legally binding accord that can fill the gap in the international framework regarding space, including an agreement that will prevent countries from deploying weapons, threatening, or using force against objects in outer space\", the BRICS group said in a statement.",
      "Last year, the United States created a sixth branch of the military called the Space Force, a decision that was criticised both domestically and abroad.",
      "Opponents of the move say it may result in an arms race in space, which may threaten the world.",
      "Karachi Commissioner office hosts victory celebration honoring Pakistan's success in conflict with India Moscow has repeatedly stressed that it opposes the deployment of any types of weapons in space and has urged Washington to work together to prevent a new arms race.",
      "During the 12th summit of the BRICS group, which was held earlier today, the leaders of the member states discussed issues of global importance.",
      "In the declaration adopted at Tuesday’s meeting, BRICS also spoke about: the need to adopt a UN convention on the fight against international terrorism; a renewal of talks on the Biological Weapons Convention.",
      "The group stressed that it is necessary to adopt a legally bindingprotocol that would create a verification mechanism to monitor how signatories honour their obligations; the importance of the New Strategic Arms Reduction Treaty and called on the parties to agree on an extension of the accord; a diplomatic resolution of the Korea issue; NIPCO House, 4 - Shaharah e Fatima Jinnah, Lahore, Pakistan Tel: +92 42 36367580 | Fax : +92 42 36367005 Nawaiwaqt Group | Copyright © 2025 Nawaiwaqt Group | Copyright © 2025"
    ],
    "topics": [
      "arms race",
      "tuesday meeting",
      "member states",
      "issues global",
      "global importance",
      "fight international",
      "international terrorism",
      "legally binding",
      "race space",
      "declaration adopted"
    ]
  }
]