[
  {
    "title": "Trump tariffs on Canada, Mexico to begin over weekend",
    "source": "NBC News",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-administration-tariff-canada-mexico-dei-plane-crash-live-updates-rcna190078",
    "publishedAt": "2025-01-31T17:09:35Z",
    "sentences": [
      "Suzanne Gamboa Julia Ainsley Gabe Gutierrez Laura Strickler As arrests of immigrants increase, the administration is scrambling to make sure it has the room to house its detainees and keep Trump’s promise to deport them.",
      "Trump’s “border czar,” Tom Homan, told NBC News that Immigration and Customs Enforcement needs 100,000 beds total, more than double what it has currently.",
      "Trump alluded to the need for more room when he ordered the Pentagon and the Department of Homeland Security on Wednesday to prepare 30,000 beds at Guantánamo Bay for who he said would be detainees posing the greatest threat to Americans’ safety.",
      "An immigration detention room is used to hold people until they are deported, and it “is really kind of a backbone of the mass deportation plan,” said Jesse Franzblau, a senior policy analyst with the National Immigrant Justice Center.",
      "Read the full story here.",
      "Raquel Coronell Uribe Trump signed a proclamation today recognizing February 2025 as Black History Month, calling it “an occasion to celebrate the contributions of so many black American patriots who have indelibly shaped our Nation’s history.” In the order, Trump said: “I call upon public officials, educators, librarians, and all the people of the United States to observe this month with appropriate programs, ceremonies, and activities.” Earlier today, several federal agencies banned activities and events celebrating Black History Month to comply with Trump’s anti-DEI executive orders.",
      "A Defense Intelligence Agency memo obtained by NBC News ordered a pause on events related to Martin Luther King Jr. Day, Black History Month, Juneteenth, LBTQ Pride Month, Holocaust Remembrance Day and other “special observances.” The Office of the Director of National Intelligence issued written guidance saying no official work time or work spaces should be used for DEI-related activities, a separate memo obtained by NBC News said.",
      "Raquel Coronell Uribe Democrats are condemning Trump’s purge of FBI agents and officials.",
      "\"By working to fire hundreds of dedicated career law enforcement agents and undermine the principled, patriotic public servants of the FBI, far-right extremists are once again proving that they are the party of lawlessness and disorder,\" House Minority Leader Hakeem Jeffries, D-N.Y., said in a statement tonight.",
      "Rep. Jim Hines, D-Conn., the top Democrat on the House Intelligence Committee, said in a statement that the president's move would “undermine” the country's ability to protect itself from national security and criminal threats, and “undermine the independence of our justice system.” Rep. Jamie Raskin, D-Md., another member of the Intelligence Committee, called Trump's actions a “repulsive affront to the rule of law and our nation’s law enforcement officers.” Senate Democratic Whip Dick Durbin, D-Ill., called it a “brazen assault on the rule of law.” “Unelected Trump lackeys are carrying out widespread political retribution against our nation’s career law enforcement officials.",
      "President Trump would rather have the FBI and DOJ full of blind admirers and loyalists than experienced law enforcement officers,” Durbin added in his statement.",
      "Dennis Romero Aria Bendix Some government webpages briefly went dark today after federal agencies were told to comply with a White House order on removing certain language pertaining to diversity, equity and inclusion.",
      "Pages for the Federal Aviation Administration, the Census Bureau and the Justice Department were among those that went blank.",
      "The FAA and Justice Department later came back online.",
      "Trump signed an executive order this week that stated only the genders male and female are to be recognized by the federal government.",
      "The Office of Personnel Management (OPM) distributed a memo, obtained by NBC News, ordering that all federal government references to “gender ideology” be removed by 5 p.m. today.",
      "Read the full story here.",
      "Daniel Barnesis reporting from the federal courthouse.",
      "Dareh Gregorian A federal judge today sided with a coalition of 22 states and temporarily blocked a federal aid funding freeze directed by the Trump administration — the second such order this week.",
      "U.S. District Judge John J. McConnell, in Rhode Island, said in his ruling that the wide-ranging directive in the Office of Management and Budget memo that caused chaos and confusion this week in Washington and across the country appeared to violate the law.",
      "“The Executive’s action unilaterally suspends the payment of federal funds to the States and others simply by choosing to do so,” the judge wrote.",
      "Read the full story here.",
      "Ken Dilanian Tom Winter Ryan J. Reilly Michael Kosnar Trump administration officials have forced out all six of the FBI’s most senior executives and multiple heads of various FBI field offices across the country, current and former FBI officials told NBC News.",
      "They included the high-profile leader of the Washington, D.C., field office, which was involved in the prosecutions of Trump.",
      "It was not immediately clear why the officials had been ousted.",
      "The FBI declined to comment.",
      "Asked by a reporter about the removals this afternoon, Trump said he was not aware of them.",
      "Read the full story here.",
      "Raquel Coronell Uribe Homeland Security Secretary Kristi Noem will travel to the U.S.-Mexico border tomorrow, according to a DHS news release.",
      "It will be her first trip to the border as head of Homeland Security.",
      "The former South Dakota governor will visit Del Rio, Texas, until Sunday, where she will meet with Customs and Border Protection workforce, review operations and tour the border, DHS said.",
      "Frank Thorp Vproducer and off-air reporter Raquel Coronell Uribe Three Republican senators introduced legislation that would restrict birthright citizenship by specifying who would be eligible for citizenship if they're born in the U.S.",
      "The measure — introduced by Sen. Lindsey Graham, R-S.C., and co-sponsored by Sens.",
      "Katie Britt, R-Ala., and Ted Cruz, R-Texas — would limit citizenship to children born to at least one parent who is either a U.S. citizen, a permanent resident or an immigrant performing active service in the armed forces.",
      "The provisions would apply only to children born after the date of the bill's enactment.",
      "Its introduction comes after Trump’s executive order targeting birthright citizenship, which has prompted a series of lawsuits from state attorneys general and immigrant rights groups.",
      "A federal judge in Seattle last week issued a temporary injunction of Trump's order, calling it \"blatantly unconstitutional.\"",
      "The 14th Amendment has long been interpreted as granting automatic citizenship to anyone born on U.S. soil except the children of foreign diplomats.",
      "Annemarie Bonner Trump said diversity, equity and inclusion initiatives, if he didn't roll them back, posed a threat to the country.",
      "\"DEI would have ruined our country, and now it’s dead,\" he said.",
      "He also added that removing DEI initiatives from federal websites \"doesn't sound like a bad idea.\"",
      "Alexandra Marquez Speaking to reporters today in the Oval Office, Trump said the tariffs he's set to impose tomorrow on China, Mexico and Canada are not a negotiating tactic.",
      "He also said there's nothing those countries could do to avoid the tariffs taking effect.",
      "\"No, we’re not looking for a concession.",
      "We’ll just see what happens,\" he said.",
      "\"In one case,\" Trump said, seemingly referring to China, \"they’re sending massive amounts of fentanyl, killing hundreds of thousands of people a year with the fentanyl.\"",
      "\"And in the other two cases,\" he said, seemingly referring to Canada and Mexico, \"they’re making it possible for this poison to get in.\"",
      "Raquel Coronell Uribe Canadian Prime Minister Justin Trudeau said the country is \"ready with a forceful and immediate response\" if the U.S. moves ahead with its threatened tariffs tomorrow.",
      "\"I met with our Canada-U.S. Council today.",
      "We’re working hard to prevent these tariffs, but if the United States moves ahead, Canada’s ready with a forceful and immediate response,\" Trudeau said on X. Berkeley Lovelace Jr. Benjamin Ryan The Centers for Disease Control and Prevention is scrubbing a swath of HIV-related content from the agency’s website as a part of President Donald Trump’s broader effort to wipe out diversity, equity and inclusion initiatives across the federal government.",
      "The CDC’s main HIV page was down temporarily but has been restored.",
      "The CDC began removing all content related to gender identity today, according to one government staffer.",
      "HIV-related pages were apparently caught up in that action.",
      "CDC employees were told in a Jan. 29 email from Charles Ezell, the acting director of the U.S. Office of Personnel Management, titled “Defending Women,” that they’re not to make references or promote “gender ideology” — a term often used by conservative groups to describe what they consider “woke” views on sex and gender — and that they are to recognize only two sexes, male and female, according to a memo obtained by NBC News.",
      "Employees initially struggled with how to implement the new policy, with a deadline of Friday afternoon, the staffer said.",
      "Ultimately, agency staffers began pulling down numerous HIV-related webpages — regardless of whether they included gender — rushing to meet the deadline.",
      "It was unclear when the pages might be restored.",
      "Read the full story here.",
      "Abigail Williams In line with the new Office of Personnel Management memo, State Department employees have also been instructed to remove all gender-identifying pronouns from their email signatures by 5 p.m. “The Department of State is reviewing all agency programs, contracts, and grants that promote or inculcate gender ideology, and we are removing outward facing media that does the same,” The new Under Secretary for Management Ambassador Tibor P. Nagy wrote in an email reviewed by NBC News.",
      "“Bureaus have already been alerted to review trainings, forms, and plans that involve gender ideology.” The subject line of the email sent Friday afternoon just hours before the imposed deadline was “Defending Women.” “Your cooperation is essential as we navigate these changes together,” Tagy wrote in closing.",
      "Vaughn Hillyard Yamiche Alcindor Jesse Rodriguez NBC News has obtained a memo from the Office of Personnel Management ordering that all references to “gender ideology” be removed by 5 p.m.",
      "ET today across the federal government.",
      "The memo orders agencies to, among other things, take down all public-facing websites and social media accounts that \"promote gender ideology\" and turn off Microsoft Outlook features that prompt staff to write out their pronouns.",
      "It also orders an end to any \"employee resource groups\" that \"promote gender ideology.\"",
      "Shannon Pettypiece The White House said today that President Donald Trump would impose a 25% tariff on goods coming to America from Canada and Mexico and a 10% tariff on those from China tomorrow, a move that could drive up prices for products coming into the U.S. from those countries.",
      "Trump had previously said he would issue those tariffs on the first day of his presidency, then said on Inauguration Day that the tariffs would be put in place Feb. 1.",
      "White House press secretary Karoline Leavitt told reporters today that Trump would carry through on that Feb. 1 deadline.",
      "Leavitt said the tariffs were being put in place in response to “the illegal fentanyl that they have sourced and allowed to distribute into our country, which has killed tens of millions of Americans.” The tariffs could increase how much U.S. consumers and businesses pay for goods coming from Canada, Mexico and China — including electronics, toys, shoes, fresh produce, lumber and cars.",
      "Tariffs are paid by companies importing goods into the U.S., similar to a tax.",
      "Read the full story here.",
      "Ben Kamisar Reporting from NATIONAL HARBOR, Md.",
      "Democrats will take their first tangible step this weekend to drag themselves forward from their 2024 election loss: electing the next chair of the Democratic National Committee.",
      "The party’s committee members will meet tomorrow to vote on a new slate of officers, chief among them the person who will replace outgoing chair Jaime Harrison, the former South Carolina Democratic Party leader whom Joe Biden tapped to helm the party during his time in office.",
      "But while Democrats are set to pick their party’s next chair, they’re not anointing the party’s next leader.",
      "Read the full story here.",
      "Michael Kosnar Ken Dilanian The assistant director in charge of the FBI's Washington field office, David Sundberg, has been fired, two senior law enforcement sources told NBC News.",
      "Sundberg is the highest-ranking field agent to be ousted so far in the Trump administration's purge of top executives at FBI headquarters and leaders of the bureau's field offices across the country.",
      "Sundberg, who joined the FBI in 2002, was notified yesterday that he was going to lose his job and is preparing to exit in the next few days, the law enforcement sources said.",
      "Sundberg was named to the post by then-FBI Director Christopher Wray in December 2022; the position is one of highest-profile spots that an agent can assume in the field.",
      "In that role, Sundberg was in charge of nearly 1,600 employees and led FBI operations across Washington, D.C., and northern Virginia, including major cases involving terrorism and public corruption.",
      "Agents from the Washington field office were heavily involved in both of special counsel Jack Smith’s investigations of Trump.",
      "Courtney Kube The Pentagon has rescinded a Biden administration policy that reimbursed service members and dependents for travel to states where abortions and other reproductive health procedures are legal.",
      "The Pentagon’s Defense Travel Management Office issued the memo Wednesday, ending reimbursements immediately.",
      "Read the full story here.",
      "Annemarie Bonner Leavitt said at today's press briefing that, contrary to a news report, Trump's planned tariffs on Canada, Mexico and China will go into effect tomorrow, but she refused to say whether the administration would reverse the levies if prices of imported goods rise as a result.",
      "\"The president is intent on ensuring that he effectively implements tariffs while cutting inflation and costs for the American people,\" she said.",
      "\"If the president at any time decides to roll back those tariffs, I’ll leave it to him to make that decision,\" she added.",
      "\"But starting tomorrow, those tariffs will be in place.\"",
      "Canadian Prime Minister Justin Trudeau said earlier today that he \"won't relent until tariffs are removed\" and that Canada \"won't back down\" on the issue.",
      "Leavitt responded to Trudeau's comments by saying he \"would be wise to talk to President Trump directly before pushing outlandish comments like that.\"",
      "Alexandra Marquez Occupying the \"new media seat\" in the White House briefing room today is a member of the Ruthless Podcast, a conservative talk show.",
      "John Ashbrook, one of the podcast's hosts, asked press secretary Karoline Leavitt if the media is \"out of touch with Americans demanding action on our border crisis?\"",
      "\"The media out of touch?",
      "I think that the media certainly is out of touch,\" Leavitt answered.",
      "Annemarie Bonner White House press secretary Karoline Leavitt said Trump will sign a proclamation honoring Black History Month.",
      "\"It’s in the works of being approved, and it’s going to be ready for the president’s signature to signify the beginning of that tomorrow,\" she said.",
      "NBC News obtained a memo from the Defense Intelligence Agency that indicated it has ordered a pause of all activities and events related to Martin Luther King Jr. Day, Black History Month, Juneteenth, LGBTQ Pride Month, Holocaust Remembrance Day and other \"special observances\" to bring the agency into alignment with Trump's cancellation of diversity, equity and inclusion programs.",
      "Kyla Guilfoil Julia Jester A dozen attorneys general from blue states called Trump's recent executive orders seeking to dismantle federal diversity, equity and inclusion programs \"unnecessary and disingenuous.\"",
      "\"We strongly oppose the President’s attempts to weaponize decades-old policies, which have been supported by Democratic and Republican administrations alike, to combat historical inequities faced by underrepresented communities and the ongoing, insidious discrimination that still exists in our country,\" they said in a joint statement.",
      "Trump signed an executive order on his first day in office ending DEI programs at federal agencies, leading to hundreds of thousands of federal workers being put on leave.",
      "On Thursday, Trump blamed DEI hires within the Federal Aviation Administration for the fatal plane crash in Washington, D.C.",
      "In their statement, the attorneys general from Connecticut, California, Delaware, Illinois, Hawaii, Massachusetts, Maryland, Minnesota, New Jersey, New York, Vermont and Washington said the orders \"have nothing to do with combatting discrimination.\"",
      "\"The Trump administration has longstanding civil rights laws at its disposal to combat real discrimination, and we would be willing partners if it chose to pursue this path,\" they said.",
      "\"Instead, the administration is targeting lawful policies and programs that are beneficial to all Americans.\"",
      "\"Contrary to President Trump's assertions,\" they said, the DEIA policies Trump has attacked \"do not diminish the importance of individual merit, nor do they mean that employers are lowering their standards, hiring unqualified candidates, or engaging in race-and-sex-based preferences.\"",
      "Ken Dilanian Alexandra Marquez The Defense Intelligence Agency has ordered a pause of all activities and events related to Martin Luther King Jr. Day, Black History Month, Juneteenth, LGBTQ Pride Month, Holocaust Remembrance Day and other “special observances” to comply with Trump’s executive order, according to a memo obtained by NBC News.",
      "It comes as the Trump administration has made it a top priority to go after any programs perceived to be related to promoting diversity, equity and inclusion in the federal government.",
      "Read the full story here.",
      "Lawmakers are weighing the fates of some of Trump’s most controversial Cabinet picks, including Robert F. Kennedy Jr., Tulsi Gabbard and Kash Patel.",
      "With none expected to receive a single Democratic vote, the nominees will need strong support from Republicans, but it remains unclear if all three have cleared that threshold.",
      "NBC’s Ryan Nobles reports for \"TODAY.\"",
      "Vaughn Hillyard Abigail Williams U.S. Agency for International Development officials have removed artwork on the walls of the agency's offices to ensure the decor aligns with the new administration’s \"America First\" mission, multiple current and former USAID employees told NBC News.",
      "The removal of the images depicting the agency’s various global missions is reflective of the near total freeze on foreign aid, the placing of dozens of senior civil servants on leave, and the furloughing of hundreds of contractors that carry out the work of the agency, the employees said.",
      "The taking down of artwork is not typical in the change of administrations.",
      "Annemarie Bonner In his first video remarks as EPA administrator, former Rep. Lee Zeldin, R-N.Y., sounded an optimistic note, expressing his dual goals of safeguarding environmental stewardship alongside the pursuit of “exciting” opportunities in American innovation and U.S. energy dominance.",
      "\"We must connect the greatness of American innovation with the greatness of conservation and environmental stewardship,\" Zeldin said in the video posted to X.",
      "\"We will and we must ensure our nation is energy dominant, whether bringing back American auto jobs, or turning the U.S. into the AI capital of the world.\"",
      "At the same time, Zeldin vowed that his EPA would \"respect the rule of law\" and protect human health and the environment, calling it a cause that's personal to him, harking to his early years growing up on the east end of Long Island, \"an area almost completely surrounded by water.\"",
      "“I am committed to this cause.",
      "President Trump is committed to this cause,\" he said.",
      "\"And I’m confident we will be able to look back on this moment four years from now and feel extraordinarily proud of our effort, our progress, and our achievements.\"",
      "Chloe Atkins Daniel Barnesis reporting from the federal courthouse.",
      "Trump kicked off his second presidential term with dozens of executive orders, many of which focus on hot-button culture war issues, from transgender and abortion rights to diversity, equity and inclusion initiatives.",
      "The job of enforcing the administration’s position on those issues will largely fall to the Justice Department’s Civil Rights Division.",
      "During past handovers between Democratic and Republican administrations, the Civil Rights Division has undergone major policy shifts.",
      "During the George W. Bush administration, for example, the division focused resources on fighting religious discrimination.",
      "After Barack Obama took office, the division prioritized preventing racial and ethnic discrimination.",
      "The scale of the expected civil rights policy changes between the Biden and Trump administrations may eclipse those of past transitions.",
      "Read the full story here.",
      "Jane Weaver During RFK Jr.’s two-day confirmation hearings for health secretary, he repeatedly compared the health of Americans in 2025 to the 1960s, specifically the years during his uncle John F. Kennedy’s presidency, from 1960 to 1963.",
      "“When my uncle was president, 3% of Americans were obese, and today 74% are obese or overweight,” he said in his prepared statement for the Senate committees.",
      "When promoting the theme of “Make America Healthy Again,” Kennedy hasn’t explicitly identify when America was at its healthiest.",
      "The 1960s might be a touchstone of American health in Kennedy’s view, but many in the U.S. weren’t at their healthiest during those years.",
      "In 1960, heart disease was the leading cause of death for adults, men and women, the same as it is now, but the number of people who died from a heart attack was 1 in 2 in the 1950s.",
      "Now, it’s an estimated 1 in 8.5, according to the American Heart Association.",
      "Heart attacks have become less deadly, partly because of prescription medications and surgical procedures such as angioplasty.",
      "In the statement, Kennedy said: “Diabetes is 10 times more prevalent than in 1960.” According to government research, from 1960–1962 and 1999–2000, the prevalence of diagnosed diabetes in the U.S. population increased from 1.8% to 5.8%.",
      "In 2023, 11.6% of the U.S. population had a diagnosis of diabetes.",
      "Tobacco use reached its peak in 1964, when more than half of men smoked and most smokers, both men and women, began smoking in their teens, setting a deadly stage for lung diseases and many other types of cancer.",
      "In 1960, the life expectancy for men and women in the U.S. was 69.7 years, according to U.S. Census data.",
      "Last year, a Centers for Disease Control and Prevention report found that life expectancy at birth was 78.4 years.",
      "Life expectancy increased for most of the last six decades, although those improvements have taken a hit in recent years, mostly due to opioid drug overdoses, Covid and deaths from cardiovascular disease.",
      "At the same time, fewer people are dying from chronic lung disease because of a steep drop in smoking since the 1960s.",
      "Kennedy has also criticized the number of vaccines recommended for children now compared to the early 1960s, when children were routinely given vaccines for diphtheria, tetanus, pertussis vaccine, polio and smallpox.",
      "The CDC currently recommends vaccinating children for 14 potentially deadly infectious diseases, including measles, rubella, diphtheria, polio and pneumococcal disease before the age of 2.",
      "Smallpox was declared eradicated around the world in 1980, thanks to vaccination.",
      "After the measles vaccine was approved in 1963, the highly contagious and deadly infection was eliminated in the U.S. in 2000, until the anti-vaccination movement began to take hold among parents.",
      "Steve Kopack Prime Minister Justin Trudeau said Canada has been responding to what Trump is \"focused on and what is motivating him to consider applying tariffs as early as tomorrow.” “Right now, we’re showing the new American administration that they have a strong partner in Canada when it comes to upholding border security, all while simultaneously underscoring that we won’t back down, that if tariffs are implemented against Canada, we will respond.",
      "We won’t relent until tariffs are removed and, of course, everything is on the table.” However, Trudeau warned that Canada “could be facing difficult times in the coming days and weeks” if Trump does follow through with his promise of 25% tariffs.",
      "Trudeau was speaking at the Council on Canada-U.S. Relations, a group of Canadian business executives and politicians that he launched to evaluate how to respond to Trump’s tariff threat.",
      "Natasha Korecki Illinois Gov.",
      "JB Pritzker is blocking those who took part in the Jan. 6, 2021, attack on the U.S. Capitol from working in state jobs, ignoring Trump’s attempt to offer them a clean slate last week in a sweeping set of pardons and commutations.",
      "Late Thursday, Pritzker directed the state’s Department of Central Management Services, the state’s primary hiring authority, to restrict hiring those who took part in the attack on the Capitol, saying their “infamous and disgraceful conduct ... is antithetical to the mission of the State.” Read the full story here.",
      "Annemarie Bonner Sen. Tim Kaine, D-Va., said RFK Jr. is unfit to lead the Department of Health and Human Services after he couldn't answer yesterday in his hearing what he meant by saying he couldn't take sides on 9/11.",
      "\"As I was looking at my Republican colleagues across the aisle that they were having some significant concerns about a guy who won't even take sides on 9/11,\" he said.",
      "\"I don't even know what that means.\"",
      "In July 2024, Kennedy posted that he \"won't take sides on 9/11 or any of the other debates.\"",
      "Steve Kopack Peter Navarro, Trump’s senior trade and manufacturing adviser, told CNBC that he does not know when the president will impose tariffs on Canada and Mexico that the president promised to implement by Saturday, Feb. 1.",
      "Trump reiterated the pledge as recently as yesterday afternoon.",
      "“I have no breaking news for you on that,” he said.",
      "“I can’t tell you when; I can talk a little about why.” “One of the big reasons we think about tariffs, and that’s the fentanyl.” Navarro also mentioned immigration and trade deficits as a reason why tariffs have been threatened against two of the United States’ top trading partners.",
      "“The boss wants to do something about that,” Navarro said, referring to the president.",
      "Sarah Dean Defense Secretary Pete Hegseth in an interview on \"Fox and Friends\" did not rule out the military going into Mexico to target cartels now that they are designated foreign terrorist organizations — saying “all options will be on the table” but the decision is up to the president.",
      "\"Ultimately, we will hold nothing back to secure the American people,\" he said.",
      "Hegseth also said the Defense Department is “preparing options for the actual detention facilities” at Guantanamo Bay to be used to temporarily house the most violent criminals in transit upon deportation.",
      "This is a shift, as the administration had previously talked about housing migrants at the current migrant facility there, distinguishing that from the prison facilities.",
      "Abigail Williams Vaughn Hillyard An order sidelining almost 60 senior career leaders at the U.S. Agency for International Development was temporarily rescinded yesterday by one of the few remaining senior career civil servants with the authority to do so, two current and two former USAID employees told NBC News.",
      "Hours later, the same career employee was also placed on administrative leave.",
      "“The materials show no evidence that you engaged in misconduct,” Nick Gottlieb, USAID’s director of employee and labor relations, said in an email to the dozens of senior USAID employees placed on paid leave Monday.",
      "“As a result, I no longer have authority to maintain you in this status.” Gottlieb acknowledged that he did not know how long his decision would hold.",
      "Read the full story here.",
      "Reuters Colombian President Gustavo Petro today urged undocumented Colombians in the United States to quit their jobs “immediately” and return to Colombia.",
      "He added in a post on X that the Department of Social Prosperity would offer credits to returnees who enroll in its programs.",
      "Read the full story here.",
      "Kash Patel, Trump’s nominee for FBI director, and Tulsi Gabbard, Trump’s nominee for director of national intelligence, faced intense questioning at their Senate confirmation hearings.",
      "When pressed about his independence, Patel said he would “always obey the law.” Gabbard pushed back on accusations that she parroted Russian talking points.",
      "NBC News’ Ryan Nobles reports.",
      "Chloe Atkins Daniel Barnesis reporting from the federal courthouse.",
      "Trump kicked off his second presidential term with dozens of executive orders, many of which focus on hot-button culture war issues, from transgender and abortion rights to diversity, equity and inclusion initiatives.",
      "The job of enforcing the administration’s position on those issues will largely fall to the Justice Department’s Civil Rights Division.",
      "During past handovers between Democratic and Republican administrations, the Civil Rights Division has undergone major policy shifts.",
      "During the George W. Bush administration, for example, the division focused resources on fighting religious discrimination.",
      "After Barack Obama took office, the division prioritized preventing racial and ethnic discrimination.",
      "Read the full story here.",
      "Natasha Korecki Brandy Zadrozny Reporting from Washington, D.C. Sen. Bill Cassidy, R-La., cast doubt yesterday over whether Robert F. Kennedy Jr. is qualified to be the next leader of the government’s largest and most powerful health agency.",
      "Cassidy, a doctor, has emerged as a key swing vote in Kennedy’s bid to be the secretary of health and human services.",
      "He chairs the Health, Education, Labor, and Pensions Committee and sits on the Finance Committee, the two panels Kennedy testified before this week.",
      "Read the full story here."
    ],
    "topics": [
      "read full",
      "full story",
      "nbc news",
      "diversity equity",
      "equity inclusion",
      "black history",
      "history month",
      "law enforcement",
      "gender ideology",
      "civil rights"
    ]
  },
  {
    "title": "Donald Trump Warns BRICS Over Dollar Move: 'Go Find Another Sucker Nation'",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/brics-dollar-donald-trump-tariffs-2024004",
    "publishedAt": "2025-01-31T09:52:35Z",
    "sentences": [
      "Jordan King is a Newsweek reporter based in London, U.K.",
      "Her current focus is on religion, health, food safety and population.",
      "She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse.",
      "Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London.",
      "You can get in touch with Jordan by emailing j.king@newsweek.com.",
      "Languages: English.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "President Donald Trump has threatened BRICS countries, warning them against replacing the U.S. dollar as a reserve currency and telling them, \"Go find another sucker nation.\"",
      "Newsweek has contacted the White House and the foreign ministries of major BRICS members Brazil, Russia, India, China and South Africa for comment via email.",
      "BRICS countries' continued use of the dollar plays a major role in it being the world's reserve currency and widely used for international trade.",
      "If the bloc decides to step away from the dollar, it could decrease the U.S.'s financial dominance.",
      "Trump's \"America First\" approach to trade and foreign policy has included tariff threats to several economic partners, namely Canada and Mexico but also BRICS member China.",
      "On Thursday, Trump wrote on Truth Social: \"The idea that the BRICS Countries are trying to move away from the Dollar, while we stand by and watch, is OVER.",
      "\"We are going to require a commitment from these seemingly hostile Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy.",
      "\"They can go find another sucker Nation.",
      "There is no chance that BRICS will replace the U.S. Dollar in International Trade, or anywhere else, and any Country that tries should say hello to Tariffs, and goodbye to America!\"",
      "The idea that the BRICS Countries are trying to move away from the Dollar, while we stand by and watch, is OVER.",
      "We are going to require a commitment from these seemingly hostile Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace… South Africa's Department of International Relations and Cooperation told Newsweek: \"South Africa has the largest economy in Africa, while Brazil, India and China are among the world's top 10 countries by population, area and GDP.",
      "\"BRICS owns the New Development Bank, which has invested US$30 billion (note the investment is in dollars) in infrastructure development projects in member states and other developing economies.",
      "\"All five initial BRICS nations are members of the G20, alongside the United States.",
      "BRICS leaders have called for a reformed international financial system to facilitate trade in local currencies.",
      "\"However, BRICS is not discussing the creation of a common BRICS currency.",
      "Instead, South Africa supports the increased use of national currencies in international trade and financial transactions to mitigate the impact of foreign exchange fluctuations, rather than focusing on de-dollarisation.",
      "\"The strengthening of correspondent banking networks and the development of infrastructure for settlements in national currencies could further this aim.",
      "Enhancing BRICS payment systems to accommodate trading in local currencies does not imply de-dollarisation.\"",
      "In November, Trump posted an almost identical message: \"The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER.",
      "\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy.",
      "\"They can go find another 'sucker!'",
      "There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America.\"",
      "Brazil, Russia, India and China formed the BRIC trading bloc in 2009.",
      "One year later, South Africa joined, and the group adopted the name BRICS.",
      "In 2023, the members voted to greatly expand membership, and Iran, Ethiopia, Egypt and the United Arab Emirates accepted invitations and joined the following year, as the bloc looks to effectively disrupt the global strength of the dollar.",
      "Argentina received an invitation, but after the shock victory of libertarian candidate Javier Milei, the nation's new government withdrew from the ascension process.",
      "In January, Indonesia became the bloc's 10th full member.",
      "The nation's inclusion brings a substantial boost to the bloc, which accounts for almost 45 percent of the world's population and 35 percent of global gross domestic product, measured by purchasing power parity.",
      "There has been talk of the bloc shifting to a shared currency called the Unit, which would be backed 40 percent by gold and 60 percent by local currencies of BRICS members.",
      "Liu Pengyu, a spokesperson of the Chinese Embassy in the U.S., previously told Newsweek: \"The U.S. has long used its dollar hegemony to shift crises, spread U.S. inflation to other parts of the world, and made it become a geopolitical tool, which damages international economic and financial stability, and disrupts international order.\"",
      "Dmitry Peskov, a Kremlin spokesperson, said in December: \"More and more countries are switching to the use of national currencies in their trade and foreign economic activities … If the U.S. uses force, as they say economic force, to compel countries to use the dollar it will further strengthen the trend of switching to national currencies [in international trade].\"",
      "Despite the bloc's talk of moving away from the dollar, the currency's dominance has strengthened recently, thanks to a strong U.S. economy, Reuters reported.",
      "So it remains to be seen whether the BRICS countries will try to move away from the dollar and how Trump would respond to such a move.",
      "Update 1/31/25, 08:00 a.m.",
      "ET: This article was updated to include comment from the South Africa's Department of International Relations and Cooperation.",
      "Jordan King is a Newsweek reporter based in London, U.K.",
      "Her current focus is on religion, health, food safety and population.",
      "She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse.",
      "Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London.",
      "You can get in touch with Jordan by emailing j.king@newsweek.com.",
      "Languages: English.",
      "Jordan King is a Newsweek reporter based in London, U.K.",
      "Her current focus is on religion, health, food safety and population.",
      "She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse.",
      "Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London.",
      "You can get in touch with Jordan by emailing j.king@newsweek.com.",
      "Languages: English.",
      "Jordan King is a Newsweek reporter based in London, U.K.",
      "Her current focus is on religion, health, food safety and ... Read more"
    ],
    "topics": [
      "brics countries",
      "south africa",
      "away dollar",
      "international trade",
      "jordan king",
      "king newsweek",
      "newsweek reporter",
      "reporter based",
      "based london",
      "london current"
    ]
  },
  {
    "title": "Trump mistakes Spain for a member of the BRICS bloc and repeats the threat of massive tariffs",
    "source": "WDIV ClickOnDetroit",
    "url": "https://www.clickondetroit.com/news/world/2025/01/21/trump-mistakes-spain-for-a-member-of-the-brics-bloc-and-repeats-the-threat-of-massive-tariffs/",
    "publishedAt": "2025-01-21T14:05:49Z",
    "sentences": [
      "Joseph Wilson Associated Press Published: January 21, 2025 at 9:05 AM Joseph Wilson Associated Press BARCELONA – U.S. President Donald Trump has apparently confused Spain for a member of the BRICS bloc of developing economies, causing some head-scratching and jitters over possible tariffs in Madrid.",
      "Spain is not in BRICS, whose initials stand for Brazil, Russia, India, China and South Africa.",
      "Spain is a member of NATO, along with the U.S., and of the European Union.",
      "Recommended Videos Trump erroneously said Spain was in BRICS when a journalist asked him about NATO countries like Spain which don’t meet the NATO minimum of spending 2% of economic output on defense.",
      "Spain ranked last in the 32-nation military alliance, estimated to spend 1.28% on defense last year.",
      "Trump started his answer by saying “Spain is very low,” referring to its defense expenditures, but quickly veered into speaking about the BRICS.",
      "“They’re a BRICS nation, Spain.",
      "Do you know what a BRICS nation is?",
      "You’ll figure it out,” he told the reporter from the presidential desk in the Oval Office.",
      "Trump repeated his threat to put costly tariffs on BRICS, saying “we are going to put at least a 100% tariff on the business they do with the United States,\" part of his economic plans that would overturn decades of free trade consensus.",
      "Spanish Education Minister Pilar Alegría, who acts as a spokeswoman for the government, said she wasn't sure why Trump made the comment.",
      "“I don’t know if the affirmation made by President Trump was the result of a mix-up or not, but I can confirm that Spain is not in BRICS,” Alegría told reporters Tuesday.",
      "Spain has been a committed member of NATO for the past four decades, she added, and the Spanish government considers the U.S. “a natural ally.\"",
      "Spain is one of eight countries that failed to meet NATO's 2% spending target last year.",
      "Trump has said he wants NATO members to reach 5% spending on defense.",
      "Copyright 2025 The Associated Press.",
      "All rights reserved.",
      "This material may not be published, broadcast, rewritten or redistributed without permission.",
      "Click here to take a moment and familiarize yourself with our Community Guidelines."
    ],
    "topics": [
      "associated press",
      "spain brics",
      "joseph wilson",
      "wilson associated",
      "spain member",
      "member nato",
      "meet nato",
      "last year",
      "year trump",
      "brics nation"
    ]
  },
  {
    "title": "The BRICS bloc is growing - and Trump's tariff threat isn't expected to put off aspiring members",
    "source": "CNBC",
    "url": "https://www.cnbc.com/2025/01/17/the-brics-bloc-is-growing-and-trumps-tariff-threat-isnt-expected-to-put-off-aspiring-members.html",
    "publishedAt": "2025-01-17T06:11:39Z",
    "sentences": [
      "President-elect Donald Trump has pledged a 100% tariff against BRICS nations if they continue to undermine the U.S. dollar — but the threat won't rein in the group's expansion, analysts tell CNBC.",
      "Most recently, Brazil announced Indonesia's admittance into the bloc as a member last Monday.",
      "Under outgoing President Joe Biden's administration, Washington has been relatively dismissive of the 10-member coalition, with White House National Security Communications Advisor John Kirby saying during a press briefing last October that the U.S. does not view BRICS — an economic coalition of emerging markets — as a \"threat.\"",
      "Sentiment could change once Trump enters the White House later this month, following early indications that he may impose tariffs on alliance members if they subvert the U.S. dollar.",
      "\"A key policy shift with the incoming Trump administration is its explicit treatment of BRICS as an entity,\" Mihaela Papa, director of research at the MIT Center for International Studies, told CNBC by email.",
      "Originally established by Brazil, Russia, India, and China in 2009, then joined by South Africa in 2010, the Beijing-led BRICS was set up as a force to rival Western dominance on the international stage.",
      "The alliance's 16th annual summit in Kazan saw Egypt, Ethiopia, Iran and the United Arab Emirates officially admitted into the group.",
      "According to Russian officials and official paper of the Chinese Communist Party's Central Committee, more than 30 countries have expressed interest in joining the coalition in 2024.",
      "CNBC could not independently verify this estimate.",
      "The size of the bloc makes it increasingly unlikely that the U.S. will apply punitive 100% tariffs on BRICS countries, according to Duncan Wrigley, chief China+ economist at Pantheon Macroeconomics.",
      "Doing so would risk steering nations neutral in the U.S.-China rivalry toward Beijing and interfere with U.S. interests, Wrigley told CNBC by email.",
      "The world's second-largest economy could even step in to ease the pain of any potential U.S. trade measures against BRICS members, according to David Lubin, senior research fellow at Chatham House.",
      "\"From Beijing's point of view, establishing China as an alternative pillar of global order is a critically important objective and it can't be met without the support of the developing world,\" Lubin said in emailed comments.",
      "\"And since some 120 countries count China as their main trading partner, this shouldn't be too difficult.\"",
      "China is already starting to do this, putting forward a zero-tariff policy for least developed countries with diplomatic ties with Beijing, which came into effect from December last year and builds on similar measures extended to the least developed African countries.",
      "Trump's tariff threat is conditional on BRICS dethroning the U.S. dollar as the world's most widely used trade currency — which could prove to be a tall order for the alliance.",
      "Russia has been pushing for de-dollarization in a bid to sidestep the SWIFT network, a globally recognized standard for bank transactions, and to curtail the impact of U.S sanctions against Moscow.",
      "In the Kazan talks, Vladimir Putin reiterated the use of the dollar as a \"weapon\" and a \"big mistake,\" The Guardian reports.",
      "One of the group's options to topple the dollar was to create a unified BRICS currency — a proposal spearheaded by Brazil, which has yet to gain traction.",
      "Another possibility was setting up multi-currency trade, which is already taking place among several members: some Chinese and Russian trade is being done through the yuan and ruble.",
      "Nations have also agreed to continue to strengthen trading through local currencies and expressed support for the idea of an independent cross-border settlement infrastructure for payments.",
      "Chatham House's Lubin notes that the Chinese currency is \"much less useable internationally than dollars,\" given that financial markets are largely denominated in the greenback.",
      "The lack of a concrete allied strategy and action from BRICS members raises doubts over whether it will be considered a threat to the U.S., with Pantheon Macroeconomics' Wrigley saying the emerging markets alliance is currently not much more than a \"talking shop.\"",
      "The bloc is still too loose and unorganized to create any substantive change, with the 2024 Kazan summit resulting in \"nothing really concrete\", according to Cecilia Malmström, nonresident senior fellow at the Peterson Institute for International Economics.",
      "This might just insulate BRICS members and partner countries from a trade war with the U.S. — which has China as one of its main targets.",
      "While Beijing holds a significant position in the group, there is still much internal caution amongst other member nations over Beijing's dominance and potential trade imbalances, according to MIT's Papas.",
      "\"Even if China seeks to leverage its position, internal caution among members is likely to remain a limiting factor,\" she adds.",
      "Many BRICS members also still maintain their friendly relations with the U.S. as a \"crucial trade partner,\" Gustavo Medeiros, head of research at Ashmore Group told CNBC by email.",
      "\"There is no reason to believe members of the bloc would be automatically at economic or geopolitical risk in the case of a trade war between the U.S. and China,\" Medeiros says.",
      "Correction: This article has been updated to accurately reflect the name of Mihaela Papa, director of research at the MIT Center for International Studies."
    ],
    "topics": [
      "brics members",
      "told cnbc",
      "cnbc email",
      "white house",
      "emerging markets",
      "mihaela papa",
      "papa director",
      "director research",
      "research mit",
      "mit center"
    ]
  },
  {
    "title": "BRICS aims to 'build' global ties as Trump takes office: Brazil",
    "source": "Raw Story",
    "url": "https://www.rawstory.com/brics-aims-to-build-global-ties-as-trump-takes-office-brazil/",
    "publishedAt": "2025-01-10T17:12:30Z",
    "sentences": [
      "Brazil will seek to build relationships and not worsen an already tense global mood, while holding the rotating presidency of the BRICS bloc of developing economies, a top official told AFP.",
      "Diplomat Eduardo Saboia, head of the BRICS summit to be held in Rio de Janeiro in July, brushed off recent threats from incoming US president Donald Trump to impose 100 percent tariffs on BRICS nations if they undercut the dollar.",
      "Saboia said in an interview Thursday that there was no plan to replace the dollar, but rather to boost the use of local currencies.",
      "\"We want to increase trade between us, increase investments and reduce transaction costs.",
      "There is a discussion about the use of local currencies in transactions, but not in an impositional way,\" he said.",
      "\"BRICS countries are holders of dollar reserves.",
      "But we do have to diversify the options so that economic actors can decide and have the possibility of making more transactions.\"",
      "The bloc has increasingly emerged as a counterweight to the West, but Saboia said its members did not want ties to deteriorate.",
      "\"BRICS members are not anti-something, anti-West.",
      "On the contrary, after the 2008 crisis, the large developed economies sought the collaboration of BRICS countries in the effort to relaunch the world economy.",
      "In English, 'bricks' denotes a desire to build something, BRICS countries come to build, they do not come to worsen things.\"",
      "Asked about Trump's refusal to rule out military intervention to bring the Panama Canal and Greenland under US control, Saboia declined to weigh in.",
      "\"There is no focus on other countries, other leaders.",
      "The focus is on collaboration and building a better world,\" he said.",
      "\"We have so many things to do among ourselves... collaborations in science and technology, finance, health and actively participating in international forums, providing a vision of the global South.\"",
      "BRICS was created in 2009 by founding members Brazil, Russia, India and China.",
      "South Africa joined the following year, and in 2024 the grouping expanded with Iran, Egypt, Ethiopia and the United Arab Emirates becoming full members.",
      "Brazil announced the entry of Indonesia last week.",
      "© Agence France-Presse Copyright © 2025 Raw Story Media, Inc. PO Box 21050, Washington, D.C. 20009 | Masthead | Privacy Policy | Manage Preferences | Debug Logs For corrections contact corrections@rawstory.com , for support contact support@rawstory.com ."
    ],
    "topics": [
      "brics countries",
      "saboia said",
      "use local",
      "local currencies",
      "members brazil",
      "brazil seek",
      "seek build",
      "build relationships",
      "relationships worsen",
      "worsen already"
    ]
  },
  {
    "title": "Ukraine's Drones Wreak Havoc in Russia's BRICS Summit Host City",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/russia-ukraine-drones-kazan-2004571",
    "publishedAt": "2024-12-21T10:17:17Z",
    "sentences": [
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "Officials in Russia say drones launched by Kyiv have hit Kazan, a city more than 600 miles from Ukraine which hosted an international economic summit two months earlier.",
      "Video on social media shared Saturday showed the drones striking apartment blocks in the capital of the Russian republic of Tatarstan where a meeting of the Moscow-led BRICS bloc took place in October.",
      "Newsweek has contacted the Ukrainian and Russian defense ministries for comment.",
      "Tatarstan is a multiethnic Russian republic which is home to a significant Muslim minority.",
      "Between October 22 and October 24, its capital, Kazan hosted the summit of BRICS countries which include Brazil, India, China and South Africa, and is considered by Russia to be the Global South's alternative to the G7.",
      "Saturday morning's drone attack took place in a city far from the front line of the war in Ukraine, potentially showing capabilities to strike deep inside Russia.",
      "There has been a spike in drone attacks deep inside Russian territory which Moscow blames on Ukraine which Kyiv often does not claim responsibility for.",
      "These strikes target energy infrastructure like oil processing facilities to hamper Russia's war efforts.",
      "Something very important must have been on the 15th floor of this building 1000km from Ukrainian border.Two precise drone strikes, same spot.Kazan, Russia.",
      "pic.twitter.com/QfZpFicUPc In a dawn attack, two precise strikes on an office building in the Russian city of Kazan, approximately 1000km from Ukraine.",
      "pic.twitter.com/rlVt5J0OwO But the devices have also hit buildings in strikes which Russian authorities have dubbed acts of \"terrorism\" which are considered a response to the barrage of missiles and drones which Moscow regularly launches against Ukrainian infrastructure.",
      "On Friday night, Ukrainian authorities said Russian forces attacked buildings in Zaporizhzhia in the south as well as Kharkiv in the north on Friday night.",
      "Authorities in Tatarstan said that at least eight drones were involved in the attack on Kazan between 7.40am and 9.20 a.m. Saturday, with six hitting residential blocks, one an industrial enterprise and one shot down.",
      "Russia's defense ministry did not mention the strikes in its statement which said \"three unmanned aerial vehicles (UAVs) of Ukraine's Armed Forces were destroyed by air defense systems on duty, three more UAVs were suppressed by electronic warfare systems.\"",
      "But Kazan mayor's office said drones hit residential buildings in the city's Sovetsky, Kirovsky and Privolzhsky districts.",
      "A clip posted on the Sirena Telegram channel showed two drones crashing into a 37-storey residential building and other video showed two drones hitting a 23-storey complex.",
      "Telegram channel VCHK-OGPU which claims to have links to Russia's security services posted a clip of a residential building on fire.",
      "Local authorities have said that there were no casualties although the Shot telegram channel reported that three people were injured, mostly with cuts from broken windows.",
      "Russia's Investigative Committee has opened a terrorist attack investigation.",
      "Buildings and a nearby school were evacuated.",
      "Video showed crowds of people taking shelter in the underground metro system.",
      "Russia's defense ministry said on Telegram three Ukrainian drones (UAVs) were \"destroyed by air defense systems on duty, three more UAVs were suppressed by electronic warfare systems.\"",
      "Pro-Ukrainian Jay in Kyiv, said on X, formerly Twitter: \"Something very important must have been on the 15th floor of this building 1,000 km from Ukrainian border.",
      "Two precise drone strikes, same spot.",
      "Kazan, Russia.\"",
      "Pro-Ukrainian X account Jürgen Nauditt posted: \"More Ukrainian kamikaze UAVs hit the roof of the 21-story Manhattan residential complex in Kazan, russia.",
      "Ukrainian UAVs traveled over 1,000 kilometers.\"",
      "The drone attack prompted Russia's Federal Air Transport Agency to suspend flights into Kazan and the nearby city of Saratov and all public events for the weekend have been canceled, independent outlet Meduza reported.",
      "As of Saturday morning, Ukraine had not claimed responsibility either directly or indirectly but such drone strikes deep inside Russian territory are likely to continue.",
      "Meanwhile, Russia has launched dozens of missiles and drones against Ukraine on Saturday, with at least one person killed in Kyiv.",
      "Moscow has also said it would respond to a Ukrainian missile attack on Friday that it said killed at least five people in Rylsk, a town in Russia's border region of Kursk.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular ... Read more"
    ],
    "topics": [
      "brendan cole",
      "cole newsweek",
      "newsweek senior",
      "senior news",
      "news reporter",
      "reporter based",
      "based london",
      "london uk",
      "uk focus",
      "focus russia"
    ]
  },
  {
    "title": "‘De-Dollarization Is Certainly Not Our Objective’-India Says After Trump’s 100% Tariff Threat Over BRICS Currency",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/siladityaray/2024/12/06/de-dollarization-is-certainly-not-our-objective-india-says-after-trumps-100-tariff-threat-over-brics-currency/",
    "publishedAt": "2024-12-06T05:00:00Z",
    "sentences": [
      "BySiladitya Ray BySiladitya Ray, Forbes Staff.",
      "The head of India’s central bank on Friday said the country was not pursuing a policy of de-dollarization and no decisions have been made so far on the BRICS currency, a week after President-elect Donald Trump threatened to slap 100% tariffs on the BRICS group of nations if they attempt to replace the dollar in international trade.",
      "Indian Prime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi ... More Jinping attend a family photo during the BRICS summit in Kazan.",
      "In a press briefing on Friday, Reserve Bank of India Governor Shaktikanta Das was asked about Trump’s comments and said: “There is no step which we have taken that specifically wants to de-dollarize.” Das said India “entered into local currency-denominated trade agreements” to reduce risk in some circumstances, as “Dependence on one currency can be problematic at times because of appreciation or depreciation.” Das reiterated that de-dollarization was “certainly not our objective” and said the concept of a BRICS currency was raised by one of the members of the group, but no decision has been taken on the matter.",
      "“The geographical spread of the countries has also to be kept in mind, unlike the euro zone which has geographical contiguity,” Das added.",
      "When asked specifically about Trump’s tariff threat, Das said it was too early to comment and added, “Let the policy come first.” Get Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines.",
      "Text “Alerts” to (201) 335-0739 or sign up here.",
      "BRICS is an acronym for Brazil, Russia, India, China and South Africa, and it initially began as a group of top developing economies and an alternative to the G7 Group of developed nations.",
      "Last year, the BRICS group announced an expansion that resulted in the addition of four new members: Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "Earlier this year, Brazilian President Luiz Inacio Lula da Silva called on the BRICS nations to create an alternative currency to replace the dollar in global trade.",
      "At the most recent BRICS summit in Kazan, Russia in October, a symbolic BRICS banknote was unveiled while the group endorsed the use of their local currencies to settle bilateral trade.",
      "In a post on his Truth Social platform last week, Trump lashed out at the idea of a BRICS currency and warned he would impose a 100% tariff on all imports from BRICS members if they followed through with a plan to establish such a common trade currency.",
      "In his post, Trump wrote that the tariff would target all BRICS members unless they commit “that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar.” He then added: “There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America.” Donald Trump Threatens BRICS Countries—Including Russia, India—With 100% Tariffs (Forbes)"
    ],
    "topics": [
      "brics currency",
      "replace dollar",
      "bysiladitya ray",
      "donald trump",
      "100 tariffs",
      "brics group",
      "dollar international",
      "international trade",
      "brics summit",
      "summit kazan"
    ]
  },
  {
    "title": "Trump vows to defend U.S. dollar hegemony, but is it under threat?",
    "source": "Raw Story",
    "url": "https://www.rawstory.com/trump-vows-to-defend-us-dollar-hegemony-but-is-it-under-threat/",
    "publishedAt": "2024-12-03T11:40:07Z",
    "sentences": [
      "U.S. President-elect Donald Trump has threatened retaliation against governments that challenge the US dollar, vowing \"100 percent tariffs\" on countries that undercut the US currency.",
      "The Republican vowed the action on states that \"create a new BRICS Currency\" or otherwise \"replace the mighty US dollar,\" according to a post on Truth Social on Monday.",
      "BRICS refers to a grouping that includes Brazil, Russia, India, China and South Africa, and has expanded in recent years to include Iran, Egypt, Ethiopia and the United Arab Emirates.",
      "Trump's statement, however, comes at a time when the greenback's hegemony does not appear to be facing an immediate threat, having been the world's reserve currency for decades.",
      "The US dollar currently comprises 58 percent of foreign exchange reserves held worldwide, according to the International Monetary Fund (IMF), down from 67 percent in 2000.",
      "But the greenback accounts for 74 percent of export invoices in the Asia-Pacific region, which is the most active in terms of international trade, the IMF says.",
      "The dollar has maintained its unique position globally since the 1944 Bretton Woods accords, the international agreement that established the IMF and required signatories to peg their currencies to the US currency.",
      "The system has evolved since that time and several countries have stopped indexing their currencies to the dollar, but without challenging its status as the global reserve currency.",
      "The United States' massive role in monetary policy also reflects the country's position as the world's largest consumer of goods and services and the source of more than $8 trillion in government debt held by foreign investors.",
      "The dominance of the US currency has not been affected by the huge scale of its debt, nor by the shakiness of its financial system during the 2008 global financial crisis.",
      "\"The US dollar remains as dominant as ever as a global funding currency, a payment currency for international transactions, and a reserve currency,\" said Eswar Prasad, a professor of international trade policy at Cornell University in New York state.",
      "\"Without the dollar as the dominant international currency, the multilateral trading system would effectively cease to exist –- making the global economy much less efficient,\" said Benn Steil, a senior fellow at the US-based Council on Foreign Relations.",
      "Trump's comments came on the heels of a BRICS summit in October in Kazan, Russia, where members discussed boosting non-dollar transactions and strengthening local currencies.",
      "\"The BRICS today might be where Europe was in the 1970s and that's optimistic in terms of integrating,\" said Adam Button, chief currency analyst at ForexLive.",
      "Recent years have seen an uptick in transactions involving local currencies, especially between China and Russia, in light of international sanctions on Moscow following its invasion of Ukraine in 2022.",
      "There has not, however, been an official effort to employ a currency throughout the group, or at forming an official monetary union.",
      "\"I don't know if there (are) any of those countries (that) would give up monetary sovereignty,\" Button said.",
      "\"So it's a wholly fringe idea, and I'm not even sure why Trump decided to validate it.\"",
      "While China and India are by far the world's two most populous states, their currencies are not widely used outside of their borders.",
      "Trump's broadside did not mention the euro, which plays a key role in facilitating commerce within the eurozone but has not been envisioned as having global aspirations.",
      "The influence of the dollar means many countries can see their fortunes affected by the fluctuations of the US currency.",
      "When the dollar is strong -- such as currently -- other countries face pressure to raise their interest rates to counter the risk of capital flight.",
      "\"The US has wielded the dollar's dominance as a weapon against its rivals through financial sanctions and even freezing of dollar reserves,\" Prasad said.",
      "Jonathan Kirshner, a political scientist at Boston College who has written extensively on currencies and international relations, sees Trump's comments as largely \"irrelevant for real-world international politics.\"",
      "\"Despite Trump's bluster, you can't force people to use the dollar -- an international currency thrives because people *want* to hold it -- and thus such coercion will only backfire,\" he said in an email to AFP.",
      "© Agence France-Presse Copyright © 2025 Raw Story Media, Inc. PO Box 21050, Washington, D.C. 20009 | Masthead | Privacy Policy | Manage Preferences | Debug Logs For corrections contact corrections@rawstory.com , for support contact support@rawstory.com ."
    ],
    "topics": [
      "us dollar",
      "us currency",
      "reserve currency",
      "recent years",
      "international trade",
      "international currency",
      "trump comments",
      "local currencies",
      "donald trump",
      "trump threatened"
    ]
  },
  {
    "title": "Why is Trump threatening a 100% tariff on the BRICS nations?",
    "source": "CBS News",
    "url": "https://www.cbsnews.com/news/trump-tariffs-brics-nations-china-russia-brazil/",
    "publishedAt": "2024-12-02T20:41:51Z",
    "sentences": [
      "Watch CBS News President-elect Donald Trump on Nov. 30 threatened to slap a 100% tariff on a group of nine nations — the so-called BRICS — if they try to replace the U.S. dollar with another currency.",
      "The BRICS countries include Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "Trump said he'll enact the tariffs if the countries either move to create a new rival currency to the dollar or back an alternative currency to replace the greenback as the world's reserve medium of exchange.",
      "\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,\" Trump said on Truth Social.",
      "Trump's move comes after he recently threatened to impose 25% tariffs on all products from Canada and Mexico entering the U.S., along with an additional 10% tax on goods from China, in what he says would force the countries to do more to halt the flow of unauthorized migrants and illicit drugs into the U.S.",
      "The BRICS — named after the original five members (Brazil, Russia, India, China and South Africa) — was formed in 2009 to advance the interests of emerging economies and to make them less dependent on the U.S. dollar, which is by far the most commonly used currency in global commerce.",
      "The primacy of the dollar in international trade gives the U.S. a number of advantages, including lower borrowing costs for the federal government and enormous geopolitical influence around the world.",
      "In October, Russian President Vladimir Putin called for a new international payments system at a BRICS summit, saying \"the dollar is being used as a weapon,\" the Associated Press reported.",
      "In 2023, meanwhile, Brazilian President Luiz Inácio Lula da Silva proposed creating a new, common currency in South America to reduce its reliance on the dollar in international trade.",
      "Creating a competing new currency would be difficult given how widely used the dollar is to conduct business around the world.",
      "Despite the existence of the euro and growing importance of China's renminbi, the dollar remains the world's main reserve currency, representing roughly 58% of the world's foreign exchange reserves, according to the IMF.",
      "Also, critical commodities like oil and gold are still mostly bought and sold using dollars.",
      "\"Economically, it's not a major issue because the idea of the BRICS countries being able to put together an alternative as a reserve currency for the U.S. dollar is not plausible in the short or intermediate term,\" said Mark Weinstock, a global trade expert and professor of economics at Pace University.",
      "In other words, BRICS nations would struggle to create a viable currency given the relative strength and stability of the U.S. economy and the faith that global investors and trading partners have in U.S. government debt.",
      "And while the group's members have some interests in common, unifying behind a single currency would be politically fraught and technically complex.",
      "\"Fundamentally, if you are going to create your own form of money, that desirability is commensurate with the economic strength and integrity of the issuer.",
      "BRICS countries don't have the type of institutions that inspire global confidence to convince people that it is a satisfactory alternative to the dollar,\" Weinstock said.",
      "Some BRICS members are already downplaying the push to get a new currency off the ground.",
      "After Trump's tariff threat last weekend, South Africa's government on Monday issued a statement on social media saying there are no plans to create a BRICS currency.",
      "\"Recent misreporting has led to the incorrect narrative that BRICS is planning to create a new currency,\" South Africa's Department of International Relations and Cooperation said.",
      "\"This is not the case.",
      "The discussions within BRICS focus on trading among member countries using their own national currencies.\"",
      "While economists largely agree that a 100% tariff on goods imported to the U.S. from BRICS nations is a long shot, if it came to pass the move would not benefit U.S. consumers, they say.",
      "Such levies would drive up the cost of goods from BRICS member nations, potentially fueling inflation and leading to higher prices for consumers.",
      "\"Like any tariffs, this would mean higher prices for consumers,\" Weinstock said.",
      "\"That's always the impact of the tariff.\"",
      "Among the leading products the U.S. gets from BRICS countries are coffee from Brazil, electronics and clothes from China, and minerals from South Africa, according to trade data.",
      "Some experts criticized Trump's threat to punish the BRICS, saying it makes the U.S. look weak.",
      "\"It isn't a good look, as it indirectly elevates the stature of a non-threat and suggests a lack of confidence in the dollar,\" Brad Setser, a senior fellow at the Council on Foreign Relations and former Treasury Department economist, wrote on X. Trump's threat could actually accelerate a move away from the dollar by other countries, according to Setser, who said that an effort to effectively coerce countries to use the dollar \"is actually a long-run threat to the dollar's global role.\"",
      "\"It makes the use of the dollar appear to be a favor to the U.S.,\" he added.",
      "The Associated Press contributed to this report.",
      "Megan Cerullo is a New York-based reporter for CBS MoneyWatch covering small business, workplace, health care, consumer spending and personal finance topics.",
      "She regularly appears on CBS News 24/7 to discuss her reporting."
    ],
    "topics": [
      "south africa",
      "brics countries",
      "create new",
      "new currency",
      "cbs news",
      "100 tariff",
      "brazil russia",
      "russia india",
      "india china",
      "china south"
    ]
  },
  {
    "title": "China Reacts to Trump's BRICS Threat",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/china-reacts-donald-trump-brics-threat-1993886",
    "publishedAt": "2024-12-02T14:11:40Z",
    "sentences": [
      "Micah McCartney is a reporter for Newsweek based in Taipei, Taiwan.",
      "He covers U.S.-China relations, East Asian and Southeast Asian security issues, and cross-strait ties between China and Taiwan.",
      "You can get in touch with Micah by emailing m.mccartney@newsweek.com.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "China has rebuked the United States for destabilizing global finance and leveraging the dollar's dominance as a geopolitical weapon, following President-elect Donald Trump's threat to impose tariffs on BRICS nations pursuing de-dollarization efforts.",
      "\"The U.S. has long used its dollar hegemony to shift crises, spread U.S. inflation to other parts of the world, and made it become a geopolitical tool, which damages international economic and financial stability, and disrupts international order,\" Liu Pengyu, spokesperson of the Chinese Embassy in the U.S., told Newsweek.",
      "He contrasted this with BRICS, which he said would continue to promote economic cooperation and a financial system that is \"more inclusive and just.\"",
      "Newsweek reached out to a spokesperson for Trump with an emailed request for comment.",
      "BRICS—originally comprising Brazil, Russia, India, China, and South Africa—accounts for a substantial portion of global economic growth.",
      "The grouping represents more than 40 percent of the global population and 31.5 percent of the world's GDP in purchasing power parity terms, compared to the G7's 30 percent, according to a 2023 report by U.K. economic research company Acorn Macro Consulting.",
      "BRICS expanded in 2023, adding Ethiopia, Egypt, Iran, and the United Arab Emirates.",
      "Saudi Arabia has also been invited but has not yet formally joined the group.",
      "Argentina declined the invitation.",
      "Though the bloc lacks a shared currency, some in the U.S. view its efforts to develop alternative financial systems and reduce reliance on the dollar for trade as a long-term strategic challenge.",
      "Trump on Saturday fired a warning shot on his X (formerly Twitter) and Truth Social accounts.",
      "\"The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is over,\" Trump wrote.",
      "He vowed to impose 100 percent tariffs on BRICS nations unless they committed to abandoning plans for a shared currency or any alternative to the U.S. dollar.",
      "Many analysts remain skeptical about BRICS' ability to displace the dollar.",
      "Earlier this year, Washington, D.C.-based think tank the Atlantic Council said that the dollar accounts for 58 percent of global foreign exchange reserves, compared to the euro's 20 percent.",
      "Despite Beijing's push for broader use of the Chinese yuan, that currency commanded only 2.3 percent as of late 2023, down from a peak of 2.8 percent the previous year.",
      "Trump launched the ongoing trade war against China during his first term, citing unfair trade practices.",
      "During his election campaign, he pledged to impose a 60-percent blanket tariff on Chinese goods.",
      "Last week, he threatened an additional 10 percent tariff on Chinese exports and a 25 percent tariff on goods from Mexico and Canada unless the flow of the opioid fentanyl into the United States is stopped.",
      "China has warned against new U.S. import duties, saying they hinder trade and will hurt U.S. consumers.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Micah McCartney is a reporter for Newsweek based in Taipei, Taiwan.",
      "He covers U.S.-China relations, East Asian and Southeast Asian security issues, and cross-strait ties between China and Taiwan.",
      "You can get in touch with Micah by emailing m.mccartney@newsweek.com.",
      "Micah McCartney is a reporter for Newsweek based in Taipei, Taiwan.",
      "He covers U.S.-China relations, East Asian and Southeast Asian security issues, and cross-strait ties between China and Taiwan.",
      "You can get in touch with Micah by emailing m.mccartney@newsweek.com.",
      "Micah McCartney is a reporter for Newsweek based in Taipei, Taiwan.",
      "He covers U.S.-China relations, East Asian and Southeast Asian ... Read more"
    ],
    "topics": [
      "micah mccartney",
      "mccartney reporter",
      "reporter newsweek",
      "newsweek based",
      "based taipei",
      "taipei taiwan",
      "taiwan covers",
      "covers relations",
      "relations east",
      "east asian"
    ]
  },
  {
    "title": "Trump threatens 100% tariffs on China and Russia if BRICS issues new currency",
    "source": "New York Post",
    "url": "https://nypost.com/2024/12/01/us-news/trump-threatens-100-tariffs-on-china-and-russia-if-brics-issues-new-currency/",
    "publishedAt": "2024-12-01T22:48:29Z",
    "sentences": [
      "US President-elect Donald Trump has threatened to levy 100% tariffs on BRICS — a China- and Russia-led group of nations with emerging economies — if the countries decide to issue their own currency.",
      "Trump said Saturday that his incoming administration will not allow the nine-nation group, which has 34 other countries interested in joining, to undermine the US dollar.",
      "“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” Trump wrote on Truth Social — referring to the group whose acronym stands for founding members Brazil, Russia, India, China and South Africa.",
      "“We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful US Economy,” he added.",
      "BRICS was founded by the five original countries in 2011.",
      "Iran, the United Arab Emirates, Ethiopia and Egypt have since joined, with Saudi Arabia accepting an invitation but yet to officially become a member.",
      "More than two other countries have expressed interest in joining the economic alliance, too.",
      "Last year, Brazilian President Luiz Inacio Lula de Silva proposed that BRIC create its own common currency, similar to the European Union’s euro, to reduce its members’ reliance on the US dollar.",
      "Under a united BRICS currency system, member nations such as Russia, China, and Iran could circumvent Western sanctions placed on them over their military aggression.",
      "It would also mitigate the West’s efforts to isolate Russia and Iran, and it gives China the opportunity to strengthen its foreign partnerships and challenge America’s role as a global leader.",
      "Still, the likelihood of the BRICS nations coming together to form their own currency remains slim, given each nation’s vast economic and political differences.",
      "The US’s threat of tariffs to discourage the move has remained Trump’s key tool for socio-economic issues as he prepares to return to the White House next month.",
      "Last week, Trump vowed to issue an executive order imposing 25% tariffs on all US imports from Mexico, Canada and China on his first day in office.",
      "The president-elect wrote on social media that the tariff would “remain in effect until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!” Trump further pledged that he would slap China with an additional 10% tariff — on top of existing ones — for failing to curb illicit fentanyl exports.",
      "Advertisement"
    ],
    "topics": [
      "100 tariffs",
      "us dollar",
      "brics currency",
      "us donald",
      "donald trump",
      "trump threatened",
      "threatened levy",
      "levy 100",
      "tariffs brics",
      "brics group"
    ]
  },
  {
    "title": "Trump threatens 100% tariff on BRICS countries if they pursue creating new currency",
    "source": "Cable News Network",
    "url": "https://edition.cnn.com/2024/11/30/politics/trump-brics-currency-tariff/index.html",
    "publishedAt": "2024-12-01T01:57:15Z",
    "sentences": [
      "Follow: President-elect Donald Trump said he would require countries that are part of BRICS — a China- and Russia-backed group of emerging economies — to commit to not creating new currency or face 100% tariffs during his administration.",
      "“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER.",
      "We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,” Trump posted on Truth Social on Saturday afternoon.",
      "Related article Trump announces he intends to replace current FBI director with loyalist Kash Patel BRICS had been made up of Brazil, Russia, India, China and South Africa since 2011.",
      "Earlier this year, Iran, the United Arab Emirates, Ethiopia and Egypt formally joined — the first expansion in over a decade.",
      "Thirty-four countries have submitted an expression of interest in joining the bloc of major emerging economies, South African Foreign Minister Naledi Pandor said in February.",
      "The leader of one member country, Brazil’s Luiz Inácio Lula da Silva, in 2023 proposed creating a common currency in South America to reduce reliance on the US dollar.",
      "Using BRICS currencies and banking networks outside the US dollar-denominated system could allow member countries such as Russia, China and Iran to circumnavigate Western sanctions.",
      "But the chances of a new currency are probably slim due to the alliance’s economic and geopolitical differences.",
      "Speaking to reporters ahead of a summit of BRICS countries in Russia in October, President Vladimir Putin said the group was “not considering this issue.” “Its time has not come yet.",
      "We need to be very careful and act gradually, without any rush,” Putin said when asked about any steps toward developing a common currency.",
      "He added the group was studying “the possibilities to make wider use of national currencies” and enhancing coordination between their central banks to support trade.",
      "The expanding group is valuable to China as it looks to forge closer partnerships with key players to challenge the United States’ global leadership.",
      "And it’s also a boon to Russia, which has been shunned economically and diplomatically by the West following its 2022 invasion of Ukraine.",
      "This year, Russia assumed rotating chairmanship of the group.",
      "During the BRICS summit in October, Putin and Chinese leader Xi Jinping sought to project the message that the West stands isolated in the world, while a “global majority” of countries support their bid to challenge American global leadership.",
      "Trump’s latest economic threat comes days after he pledged massive hikes in tariffs on goods coming from Mexico, Canada and China starting on the first day of his administration.",
      "The move, Trump said, will be in retaliation for illegal immigration and “crime and drugs” coming across the border.",
      "Since that announcement, Trump spoke with Mexican President Claudia Sheinbaum for the first time following the tariff announcement, but they have offered conflicting statements about the call.",
      "Canadian Prime Minister Justin Trudeau, meanwhile, traveled to Trump’s Mar-a-Lago estate in Florida to meet with the president.",
      "Trudeau said the Friday dinner with Trump “was an excellent conversation,” and the president-elect called it a “very productive meeting.” CNN’s Simone McCarthy, Robert Ilich and Kit Maher contributed to this report.",
      "Correction: An earlier version of this article stated that Saudi Arabia had joined BRICS earlier this year.",
      "Saudi Arabia was invited to join the group but does not appear to have formally joined.",
      "It was represented by its foreign minister at the BRICS summit in Kazan in October."
    ],
    "topics": [
      "trump said",
      "emerging economies",
      "new currency",
      "face 100",
      "100 tariffs",
      "brics countries",
      "earlier year",
      "formally joined",
      "foreign minister",
      "common currency"
    ]
  },
  {
    "title": "Trump threatens a 100% tariff on BRICS countries if they abandon U.S. dollar",
    "source": "NBC News",
    "url": "https://www.nbcnews.com/politics/white-house/trump-threatens-100-tariff-brics-countries-abandon-us-dollar-rcna182300",
    "publishedAt": "2024-11-30T22:04:47Z",
    "sentences": [
      "In a post on Truth Social Saturday, President-elect Donald Trump said he would impose a 100% tariff on the BRICS geopolitical coalition of non-Western countries if the group moves away from trading using the U.S. dollar.",
      "“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” Trump wrote.",
      "“We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy.” “They can go find another ‘sucker!’ There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America,” the president-elect added.",
      "The BRICS alliance is a coalition of non-Western countries that convened for the first official BRIC summit in 2009, with Brazil, Russia, India and China joining the informal group.",
      "South Africa joined a year later, cementing the BRICS name.",
      "At a 2023 summit, the group expanded for the first time in over a decade, inviting Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates.",
      "At the same summit, the issue of “de-dollarization,” or reducing the influence of the U.S. dollar in global trade, gained steam, though it’s not a new idea for the group.",
      "Experts are skeptical that BRICS would succeed in creating its own currency for global trade, pointing to infighting between the member nations and major differences in the way the countries run their economies and financial institutions.",
      "Still, some members of BRICS are among the U.S.’ largest trading partners, including India and China.",
      "According to the Office of the U.S. Trade Representative, the U.S.’ goods-and-services trade with China totaled an estimated $758.4 billion in 2022 and the goods-and-services trade between the U.S. and India totaled an estimated $191.8 billion in 2022.",
      "Representatives for the BRICS countries’ embassies in the U.S. did not immediately respond to requests for comment.",
      "This is Trump’s second time this week threatening to raise tariffs on outside nations.",
      "On Monday, the president-elect wrote in a post on Truth Social that he planned to impose a 25% tariff on products imported from Mexico and Canada.",
      "He argued that the purpose of the tariff would be to curb the fentanyl crisis.",
      "In the same post, he threatened to slap a 10% tariff on China, writing, “I have had many talks with China about the massive amounts of drugs, in particular Fentanyl, being sent into the United States — But to no avail.",
      "Until such time as they stop, we will be charging China an additional 10% Tariff, above any additional Tariffs, on all of their many products coming into the United States of America.” On Friday, Canadian Prime Minister Justin Trudeau traveled to West Palm Beach to meet with Trump at his Mar-a-Lago resort.",
      "On Saturday, in a separate social media post, Trump called their conversation “very productive.” Trump added, “I made it very clear that the United States will no longer sit idly by as our Citizens become victims to the scourge of this Drug Epidemic, caused mainly by the Drug Cartels, and Fentanyl pouring in from China.",
      "Too much death and hardship!",
      "Prime Minister Trudeau has made a commitment to work with us to end this terrible devastation of U.S. Families.” In a letter sent to Trump Tuesday, Mexican President Claudia Sheinbaum wrote that “migration and drug consumption in the United States cannot be addressed through threats or tariffs.” “What is needed is cooperation and mutual understanding to tackle these significant challenges.",
      "For every tariff, there will be a response in kind, until we put at risk our shared enterprises,” she added.",
      "Sheinbaum and Trump spoke over the phone on Wednesday, but the conversation spurred a “he said, she said” controversy over whether Sheinbaum had agreed to stop immigration from Mexico into the U.S., something Trump alleged she did.",
      "In her own recollection of the conversation, Sheinbaum wrote on X that “I explained to him the comprehensive strategy that Mexico has followed to address the migration phenomenon, respecting human rights.",
      "We reiterate that Mexico’s position is not to close borders but instead build bridges between government and people.” Alexandra Marquez is a politics reporter for NBC News."
    ],
    "topics": [
      "united states",
      "post truth",
      "truth social",
      "coalition countries",
      "brics countries",
      "india china",
      "global trade",
      "totaled estimated",
      "estimated billion",
      "10 tariff"
    ]
  },
  {
    "title": "Trump promises 100% tariffs on BRICS nations if they create rival currency",
    "source": "UPI News",
    "url": "https://www.upi.com/Top_News/US/2024/11/30/Trump-promises-100-tariffs-BRICS-nations-create-rival-currency/5881732999940/",
    "publishedAt": "2024-11-30T21:58:00Z",
    "sentences": [
      "Nov. 30 (UPI) -- President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar.",
      "Writing on his Truth Social social media platform, Trump said the so-called BRICS nations -- which include Brazil, Russia, India, China and South Africa -- could \"wave goodbye to America\" if they advance plans to develop a common currency.",
      "Russian President Vladimir Putin said during the 2023 BRICS summit in Johannesburg that the member countries should work closely to overcome problems standing in the way of creating a common currency to challenge to the U.S. dollar and the Euro.",
      "Any country participating in such a \"de-dollarization\" effort would be met by a 100% tariff, the president-elect warned.",
      "Related Trudeau warns of economic damage from Trump's tariffs, flies to Fla. for meeting Biden calls proposed Trump tariffs 'counterproductive' Mexico's president has 'excellent' conversation with Trump amid tariff row Trump threatens Canada, Mexico, China with tariffs over border concerns \"The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,\" he wrote.",
      "\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,\" he added.",
      "The comments continued a string of tariff threats made by the incoming president in recent days.",
      "Late Friday, he met with Canadian Prime Minister Justin Trudeau at his Mar-a-Lago estate in Palm Beach, Fla., who traveled there for an unscheduled meeting amid Trump's promise to impose blanket 25% tariffs on all products from Canada and Mexico unless they do more to stop the flow of illegal drugs such as fentanyl and undocumented migrants into the United States.",
      "Trump also threatened this week that China will face tariff hikes of 10% above any existing tariffs until it stops the flow of precursor chemicals used in the manufacture of fentanyl.",
      "At the 2024 BRICS nations summit in Russia last month, new bloc members Saudi Arabia, the United Arab Emirates, Egypt, Iran and Ethiopia were in attendance but participants did not explicitly discuss the creation of a new currency.",
      "Russian Deputy Foreign Minister Sergei Ryabkov on Oct. 3 said the talk of a new currency was \"premature,\" telling reporters in Moscow, \"It would be too early to speak about any common currency in the strict sense of this term.",
      "The reason is the significant differences in the approaches of our states to regulation of the payment balance, national financial markets, and inflation targets.\"",
      "During this year's presidential campaign, Trump often spoke of the need to keep the U.S. dollar as world's reserve currency.",
      "\"I would not allow countries to go off the dollar because when we lose that standard, that will be like losing a revolutionary war,\" Trump told CNBC in March, adding that he \"hates\" when countries abandon the U.S. currency.",
      "Topics BusinessDonald TrumpJustin Trudeau Latest Headlines U.S. News // 3 minutes ago Trump brothers Eric, Donald Jr. to take American Bitcoin mining firm public on Nasdaq May 12 (UPI) -- A bitcoin mining company partially owned by President Donald Trump's two eldest sons will go public on Nasdaq in an all-stock merger with Gryphon Digital Mining, American Bitcoin announced Monday.",
      "U.S. News // 14 hours ago Justice Dept.",
      "officials tapped to fill Library of Congress roles after Trump firings May 12 (UPI) -- The Trump administration fired the United States' top copyright official over the weekend, following the dismissal of the librarian of Congress late last week.",
      "U.S. News // 2 hours ago 1 dead, 4 rescued after heat-related hiking incident in Arizona May 12 (UPI) -- A man died this past weekend and four others were rescued after a medical emergency on a hiking trip in Arizona roughly 40 miles east of Phoenix.",
      "U.S. News // 4 hours ago California Gov.",
      "Gavin Newsom urges cities to remove homeless encampments May 12 (UPI) -- The governor's plan prohibits persistent camping in a single location, prohibits encampments that block sidewalks and requires local officials to provide notice and make every reasonable effort to identify shelter.",
      "U.S. News // 16 hours ago Trump signs executive order to align U.S. drug prices with other countries May 12 (UPI) -- U.S. President Donald Trump signed an executive order on Monday to reduce drug prices in the United States by between 30% and 80% with the aim of equalizing global prices.",
      "U.S. News // 7 hours ago Trump's film tariff plan threatens new hurdles for filmmakers May 12 (UPI) -- President Donald Trump's announcement that he wishes to place tariffs on internationally-produced films has people in the movie business worrying of another hurdle.",
      "U.S. News // 8 hours ago Opening arguments set to begin in Sean 'Diddy' Combs criminal trial May 12 (UPI) -- Opening arguments are slated to begin Monday as Sean \"Diddy\" Combs' criminal trial continues.",
      "The jury will also be finalized U.S. News // 12 hours ago U.S. and China agree to pause most tariffs for 90 days to allow for talks to continue May 12 (UPI) -- The United States and China said Monday that they have reached an agreement to cut most of their tariffs for 90 days to allow more time for continued economic and trade discussions.",
      "U.S. News // 18 hours ago U.S. added to int'l human rights watchlist over Trump attacks on democratic norms May 11 (UPI) -- The United States on Sunday was added to an international human rights watchlist over threats to civic freedoms under the Trump administration.",
      "U.S. News // 20 hours ago One person killed, dozens injured in fiery tour bus, SUV crash May 11 (UPI) -- One person was killed and dozens more were injured Sunday in a collision between a tour bus and a stalled SUV on a Los Angeles County freeway, police said.",
      "Nov. 30 (UPI) -- President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar.",
      "Writing on his Truth Social social media platform, Trump said the so-called BRICS nations -- which include Brazil, Russia, India, China and South Africa -- could \"wave goodbye to America\" if they advance plans to develop a common currency.",
      "Russian President Vladimir Putin said during the 2023 BRICS summit in Johannesburg that the member countries should work closely to overcome problems standing in the way of creating a common currency to challenge to the U.S. dollar and the Euro.",
      "Any country participating in such a \"de-dollarization\" effort would be met by a 100% tariff, the president-elect warned.",
      "Related Trudeau warns of economic damage from Trump's tariffs, flies to Fla. for meeting Biden calls proposed Trump tariffs 'counterproductive' Mexico's president has 'excellent' conversation with Trump amid tariff row Trump threatens Canada, Mexico, China with tariffs over border concerns \"The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,\" he wrote.",
      "\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,\" he added.",
      "The comments continued a string of tariff threats made by the incoming president in recent days.",
      "Late Friday, he met with Canadian Prime Minister Justin Trudeau at his Mar-a-Lago estate in Palm Beach, Fla., who traveled there for an unscheduled meeting amid Trump's promise to impose blanket 25% tariffs on all products from Canada and Mexico unless they do more to stop the flow of illegal drugs such as fentanyl and undocumented migrants into the United States.",
      "Trump also threatened this week that China will face tariff hikes of 10% above any existing tariffs until it stops the flow of precursor chemicals used in the manufacture of fentanyl.",
      "At the 2024 BRICS nations summit in Russia last month, new bloc members Saudi Arabia, the United Arab Emirates, Egypt, Iran and Ethiopia were in attendance but participants did not explicitly discuss the creation of a new currency.",
      "Russian Deputy Foreign Minister Sergei Ryabkov on Oct. 3 said the talk of a new currency was \"premature,\" telling reporters in Moscow, \"It would be too early to speak about any common currency in the strict sense of this term.",
      "The reason is the significant differences in the approaches of our states to regulation of the payment balance, national financial markets, and inflation targets.\"",
      "During this year's presidential campaign, Trump often spoke of the need to keep the U.S. dollar as world's reserve currency.",
      "\"I would not allow countries to go off the dollar because when we lose that standard, that will be like losing a revolutionary war,\" Trump told CNBC in March, adding that he \"hates\" when countries abandon the U.S. currency."
    ],
    "topics": [
      "hours ago",
      "may 12",
      "12 upi",
      "brics nations",
      "new currency",
      "common currency",
      "united states",
      "donald trump",
      "face 100",
      "100 tariff"
    ]
  },
  {
    "title": "Donald Trump Sends New Warning to China-Led Bloc Over US Dollar",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/donald-trump-sends-warning-china-bloc-dollar-1993716",
    "publishedAt": "2024-11-30T21:35:48Z",
    "sentences": [
      "Peter Aitken is a Newsweek Politics Editor based in New York.",
      "His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology.",
      "Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider.",
      "He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban.",
      "He graduated from the University of St. Andrews in Scotland, but is New York born and raised.",
      "You can get in touch with Peter by emailing p.aitken@newsweek.com.",
      "Languages: English.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "President-elect Donald Trump in a Truth Social post on Saturday issued a stern warning to China and its trade allies about their plans to try and displace the United States dollar as the global currency.",
      "\"The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,\" he wrote in his post.",
      "\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S.",
      "Economy.\"",
      "The president-elect added: \"They can go find another 'sucker!'",
      "There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America.\"",
      "China and Russia formed the BRIC trading bloc (formally) in 2009, along with Brazil and India.",
      "One year later, South Africa joined, and the group adopted the name BRICS.",
      "The members voted in 2023 to greatly expand membership, ultimately extending an invitation to Saudi Arabia, Iran, Ethiopia, Egypt, Argentina and the United Arab Emirates (UAE) as the bloc looks to effectively disrupt the global strength of the dollar.",
      "Newsweek has reached out by email on Saturday afternoon to the Trump transition team and the foreign ministries of China, Russia, India, Brazil and South Africa for comment.",
      "Argentina initially accepted the invitation, but after the shock victory of libertarian candidate Javier Milei, the nation's new government withdrew from the ascension process.",
      "Expanding membership seemingly would serve as the first step towards a major economic break with the West by shifting to a shared currency called the Unit, which would be backed 40 percent by gold and 60 percent by local currencies of BRICS members.",
      "While four countries formed the bloc and have voted in support of each measure of expansion, analysts have noted China's greater influence on the group's overall operations.",
      "China and India clashed over how the group might expand, with China seeking a rapid expansion while India wanted a slower integration alongside discussions with the G7 reform economic and financial systems.",
      "China ultimately won out, resulting in the vast and sudden expansion of membership and invitations for new members, according to The Atlantic Council.",
      "Trump made clear on Saturday that he views any such movements as hostile and will take economic retaliation if the bloc pursues its goals.",
      "Iran's inclusion in the plan would indicate another step in the growing cooperation between Tehran, Moscow and Beijing, which has increased in the years following Russia's invasion of Ukraine that began in February 2022.",
      "China initially backed Russia by agreeing to buy around 100 million tons of coal from Moscow just ahead of the invasion's start, and China has also bought more Iranian oil—both moves that offset the impact of American sanctions on both of Beijing's allies.",
      "Fyodor Lukyanov, chair for the Council on Foreign and Defense Policy (Russia) for the Council of Foreign Relations, in 2023 wrote that BRICS appeals to nations in the global south \"eager to have different options for building political and economic ties, free of U.S. and EU guidance and mechanisms.\"",
      "Trump's threat against BRICS members may prove effective if, as Lukyanov writes, \"not all member states consider their participation in the bloc a priority.\"",
      "\"However, the general movement toward diversification of the world order and away from any one group's domination will continue, and the BRICS will play an increasing role in this,\" he warned.",
      "Trump campaigned on a promise to introduce heavy tariffs against China until it cracks down on the production of materials used to make fentanyl as well as a possible universal tariff on all imports to the U.S. China, meanwhile, criticized Trump's tariff proposal, accusing his administration of unfairly blaming it for America's opioid crisis in connection with fentanyl flows.",
      "This past week, Trump announced he would institute 25 percent tariffs against Mexico and Canada \"until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!\"",
      "\"Both Mexico and Canada have the absolute right and power to easily solve this long simmering problem,\" he wrote in a Truth Social post on Monday.",
      "The threat prompted Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum to reach out to Trump and hold \"friendly and constructive\" conversations, with Trudeau even visiting Trump at his Mar-a-Lago residence in Florida on Friday.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Peter Aitken is a Newsweek Politics Editor based in New York.",
      "His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology.",
      "Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider.",
      "He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban.",
      "He graduated from the University of St. Andrews in Scotland, but is New York born and raised.",
      "You can get in touch with Peter by emailing p.aitken@newsweek.com.",
      "Languages: English.",
      "Peter Aitken is a Newsweek Politics Editor based in New York.",
      "His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology.",
      "Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider.",
      "He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban.",
      "He graduated from the University of St. Andrews in Scotland, but is New York born and raised.",
      "You can get in touch with Peter by emailing p.aitken@newsweek.com.",
      "Languages: English.",
      "Peter Aitken is a Newsweek Politics Editor based in New York.",
      "His focus is domestic U.S. politics, but he has ... Read more"
    ],
    "topics": [
      "new york",
      "peter aitken",
      "aitken newsweek",
      "newsweek politics",
      "politics editor",
      "editor based",
      "based new",
      "york focus",
      "focus domestic",
      "domestic politics"
    ]
  },
  {
    "title": "BBC Journalist's Question Prompts Intense Response From Vladimir Putin",
    "source": "Deadline",
    "url": "https://deadline.com/2024/10/bbc-journalist-question-vladimir-putin-response-1236158338/",
    "publishedAt": "2024-10-25T14:28:37Z",
    "sentences": [
      "By Jesse Whittock International TV Co-Editor A BBC journalist has provoked an intense response from Russian President Vladimir Putin at the BRICS summit for emerging economies.",
      "BBC Russia Editor Steve Rosenberg was granted the opportunity to quiz Putin during a press conference, and chose to ask about how Russia’s actions over the past two years matched a declaration made by the BRICS countries for global security, stability and justice.",
      "It was the first time a journalist from the British organization has been allowed to directly question the Russian leader since Putin’s troops invaded Ukraine in February 2022.",
      "Related Stories News 'Such Brave Girls': Exclusive Images From Returning BBC & Hulu Comedy News Susan Sarandon, Mike Leigh & Harriet Walter Sign Letter Urging BBC To Stop \"Censorship Of Palestinian Voices\" & Air 'Gaza: Medics Under Fire' Doc Putin flipped the question on its head and accused Western countries of aggressively expanding the North American-European alliance NATO east towards Russia.",
      "Watch on Deadline “In terms of security, is it fair that for years our constant appeal to partners not to expand Nato to the east have been ignored,” he asked.",
      "“Is it fair to lie to our face, promising that there will be no such expansion and violating their obligations and their promises to do that?",
      "Is it fair to get into our underbelly, like into Ukraine, and start building, not just preparing but building, military bases?",
      "He accused NATO of “disregarding international law” and “financing a coup” in Ukraine, while “pushing the situation for it to develop into a hot phase.” He finished his criticism, which lasted several minutes, by saying: “There is no justice here.",
      "We want to change this situation, and we’ll achieve it,” and then addressed a second part of Rosenberg’s question, which regarded MI5, the British intelligence service, claiming Russia was deliberately attempting to create “sustained mayhem on British and European streets.” “Well, this is utter rubbish,” said the Russian leader.",
      "You can watch part of the exchange here via the BBC’s YouTube channel.",
      "Get our Breaking News Alerts and Keep your inbox happy.",
      "Signup for Breaking News Alerts & Newsletters By providing your information, you agree to our Terms of Use and our Privacy Policy.",
      "We use vendors that may also process your information to help provide our services.",
      "This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
      "Deadline is a part of Penske Media Corporation.",
      "© 2025 Deadline Hollywood, LLC.",
      "All Rights Reserved."
    ],
    "topics": [
      "russian leader",
      "nato east",
      "breaking news",
      "news alerts",
      "privacy policy",
      "jesse whittock",
      "whittock international",
      "international tv",
      "tv bbc",
      "bbc journalist"
    ]
  },
  {
    "title": "Putin hosts growing BRICS alliance in Russia, touting it as an alternative to the West's \"perverse methods\"",
    "source": "CBS News",
    "url": "https://www.cbsnews.com/news/russia-putin-brics-summit-china-ukraine-war-us-nato-sanctions-perverse-methods/",
    "publishedAt": "2024-10-24T15:02:16Z",
    "sentences": [
      "Watch CBS News Kazan, Russia — Russian President Vladimir Putin on Thursday presided at the closing session of a summit of the BRICS bloc of developing economies, praising its role as a counterbalance to what he called the West's \"perverse methods.\"",
      "The three-day summit in the city of Kazan covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, efforts to settle regional conflicts and expansion of the BRICS group of nations.",
      "The alliance that initially included Brazil, Russia, India, China and South Africa when it was founded in 2009 has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.",
      "Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.",
      "The summit was attended by leaders or representatives of 36 countries, highlighting the failure of U.S.-led efforts to isolate Russia over its war in Ukraine.",
      "The Kremlin touted the summit as \"the largest foreign policy event ever held\" by Russia.",
      "Speaking at what was dubbed the \"BRICS Plus\" session, which included countries that are considering joining the bloc, Putin accused the West of trying to stem the growing power of the Global South with \"illegal unilateral sanctions, blatant protectionism, manipulation of currency and stock markets, and relentless foreign influence ostensibly promoting democracy, human rights, and the climate change agenda.\"",
      "\"Such perverse methods and approaches — to put it bluntly — lead to the emergence of new conflicts and the aggravation of old disagreements,\" Putin said.",
      "\"One example of this is Ukraine, which is being used to create critical threats to Russia's security, while ignoring our vital interests, our just concerns, and the infringement of the rights of Russian-speaking people.\"",
      "Putin ordered the full-scale invasion of neighboring Ukraine more than two years ago, and Russian forces now occupy an estimated 20% of the country.",
      "Tens of thousands of people have been killed in the war, which Putin has claimed at various stages was either a response to NATO's eastward expansion, or a defense of pro-Russian populations in eastern Ukraine.",
      "Support from the U.S. and its NATO allies has helped Ukraine prevent Russia's complete takeover, but many in the region fear the November U.S. presidential election could bring a second term for former President Donald Trump, who's seen as more sympathetic to Putin and less likely to maintain current levels of support for Kyiv.",
      "Russia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT, which would enable Moscow to dodge Western sanctions and trade with its partners — some of which are also heavily sanctioned by the U.S. and its allies — more easily.",
      "In a joint declaration Wednesday, participants voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions,\" and reiterated their commitment to enhancing financial cooperation within BRICS.",
      "They noted the benefits of \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.\"",
      "China's President Xi Jinping has emphasized the bloc's role in ensuring global security.",
      "Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it.",
      "Ukraine has rejected the proposal.",
      "\"We should promote the de-escalation of the situation as soon as possible and pave the way for a political settlement,\" Xi said Thursday.",
      "Putin and Xi had announced a \"no-limits\" partnership weeks before Russia sent troops into Ukraine in 2022.",
      "Moscow declared its intention at the time to forge a new \"democratic world order\" with China.",
      "Putin and Xi met again twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.",
      "Russia's cooperation with India also has flourished as New Delhi sees Moscow as a time-tested partner since the Cold War despite Russia's close ties with India's rival, China.",
      "While Western allies want New Delhi to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasizing a peaceful settlement.",
      "Putin, who held a series of bilateral meetings on the summit's sidelines, was set to meet Thursday with U.N. Secretary-General Antonio Guterres, who is making his first visit to Russia in more than two years.",
      "Guterres's trip to Kazan drew an angry reaction from Kyiv.",
      "Addressing the BRICS Plus session, Guterres urged an immediate end to the fighting in Gaza, Lebanon, Ukraine and Sudan.",
      "\"We need peace in Ukraine, a just peace in line with the U.N. Charter, international law and General Assembly resolutions,\" he said.",
      "Russia's Kremlin-controlled media touted the summit as a massive policy coup that left the West fearing the loss of its global clout.",
      "State TV shows and news bulletins underscored that BRICS countries account for about half the world's population comprising the \"global majority\" and challenging Western \"hegemony.\"",
      "TV hosts elaborately quoted Western media reports saying that the summit highlighted the failure to isolate Moscow.",
      "\"The West, the U.S., Washington, Brussels, London ended up isolating themselves,\" said Yevgeny Popov, host of a popular political talk show on state channel Rossiya 1."
    ],
    "topics": [
      "perverse methods",
      "financial cooperation",
      "touted summit",
      "brics plus",
      "plus session",
      "two years",
      "putin xi",
      "new delhi",
      "end fighting",
      "watch cbs"
    ]
  },
  {
    "title": "Putin presides over BRICS summit seeking to expand Russia's clout",
    "source": "WDIV ClickOnDetroit",
    "url": "https://www.clickondetroit.com/news/world/2024/10/24/putin-presides-over-brics-summit-seeking-to-expand-russias-clout/",
    "publishedAt": "2024-10-24T09:20:26Z",
    "sentences": [
      "Associated Press Published: October 24, 2024 at 5:20 AM Updated: October 24, 2024 at 10:46 PM Associated Press Copyright 2024 The Associated Press.",
      "All rights reserved United Nations Secretary-General Antonio Guterres arrives at the BRICS Summit in Kazan, Russia, Thursday, Oct. 24, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) KAZAN – Russian President Vladimir Putin closed a summit of the BRICS bloc of developing economies on Thursday, praising its role as a counterbalance to what he called the West's “perverse methods.\"",
      "The three-day summit in the city of Kazan was attended by leaders or representatives of 36 countries, highlighting the failure of United States-led efforts to isolate Russia over its actions in Ukraine.",
      "Recommended Videos The conflict came up repeatedly at the meeting, which saw the first visit to Russia from United Nations Secretary-General Antonio Guterres in more than two years and drew an angry reaction from Kyiv.",
      "Guterres called for “a just peace” in Ukraine, in line with the U.N. Charter, international law and General Assembly resolutions.",
      "He also urged an immediate end to the fighting in Gaza, Lebanon and Sudan.",
      "At a news conference Thursday night, Putin was asked about former U.S. President Donald Trump's promise to end the fighting in Ukraine.",
      "“What Mr. Trump said recently, what I heard, (is) he spoke about the desire to do everything to end the conflict in Ukraine,\" Putin said.",
      "\"It seems to me that he said it sincerely.",
      "We certainly welcome statements of this kind, no matter who makes them.” Putin also was asked about whether any North Korean troops were in Russia, which he neither confirmed nor denied.",
      "The U.S. said Wednesday that 3,000 North Korean troops have been deployed to Russia and are training at several locations.",
      "“Images are a serious thing, if there are images, then they reflect something,\" he said when asked about satellite photos of troops.",
      "Putin noted that lawmakers in Moscow earlier in the day ratified a pact with North Korea on mutual military assistance as part of a “strategic partnership” with Pyongyang.",
      "“We have never doubted that the North Korean leadership takes our agreements seriously.",
      "What and how we will do within the framework of this article (of the agreement) is our business,” he said.",
      "The summit covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, efforts to settle regional conflicts and expansion of the BRICS group of nations.",
      "The alliance that initially included Brazil, Russia, India, China and South Africa when it was founded in 2009 has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.",
      "Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.",
      "The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.",
      "Speaking at what was dubbed the “BRICS Plus” session, which included countries that are considering joining the bloc, Putin accused the West of trying to stem the growing power of the Global South with “illegal unilateral sanctions, blatant protectionism, manipulation of currency and stock markets, and relentless foreign influence ostensibly promoting democracy, human rights, and the climate change agenda.” “Such perverse methods and approaches — to put it bluntly — lead to the emergence of new conflicts and the aggravation of old disagreements,” Putin said.",
      "“One example of this is Ukraine, which is being used to create critical threats to Russia’s security, while ignoring our vital interests, our just concerns, and the infringement of the rights of Russian-speaking people.” Russia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.",
      "In a joint declaration Wednesday, participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS.",
      "They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.” China's President Xi Jinping has emphasized the bloc’s role in ensuring global security.",
      "Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it.",
      "Ukraine has rejected the proposal.",
      "“We should promote the de-escalation of the situation as soon as possible and pave the way for a political settlement,” Xi said.",
      "Putin and Xi had announced a “no-limits” partnership weeks before Russia sent troops into Ukraine in 2022.",
      "They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.",
      "Russia’s cooperation with India also has flourished as New Delhi sees Moscow as a time-tested partner since the Cold War despite Russia’s close ties with India’s rival, China.",
      "While Western allies want New Delhi to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasizing a peaceful settlement.",
      "Addressing the BRICS Plus session, Guterres urged an immediate end to the fighting in Gaza, Lebanon, Ukraine and Sudan.",
      "“We need peace in Ukraine, a just peace in line with the U.N. Charter, international law and General Assembly resolutions,” he said.",
      "Russia's Kremlin-controlled media touted the summit as a massive policy coup that left the West fearing the loss of its global clout.",
      "State TV shows and news bulletins underscored that BRICS countries account for about half the world's population comprising the “global majority” and challenging Western “hegemony.” TV hosts elaborately quoted Western media reports saying that the summit highlighted the failure to isolate Moscow.",
      "“The West, the U.S., Washington, Brussels, London ended up isolating themselves,” said Yevgeny Popov, host of a popular political talk show on state channel Rossiya 1.",
      "Copyright 2024 The Associated Press.",
      "All rights reserved.",
      "This material may not be published, broadcast, rewritten or redistributed without permission.",
      "Click here to take a moment and familiarize yourself with our Community Guidelines."
    ],
    "topics": [
      "associated press",
      "end fighting",
      "24 2024",
      "north korean",
      "october 24",
      "copyright 2024",
      "2024 associated",
      "press rights",
      "rights reserved",
      "united nations"
    ]
  },
  {
    "title": "Financial cooperation and BRICS expansion are on the table as Putin hosts Global South leaders",
    "source": "The Associated Press",
    "url": "https://apnews.com/article/russia-putin-brics-summit-china-india-d672be9b1ec2ffd0fba608e8a6aca790",
    "publishedAt": "2024-10-23T13:10:15Z",
    "sentences": [
      "China’s President Xi Jinping, India’s Prime Minister Narendra Modi and other world leaders arrived Tuesday in the Russian city of Kazan for a summit of the BRICS bloc of developing economies.",
      "Russia’s President Vladimir Putin is hosting China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the BRICS bloc of developing economies, part of Kremlin efforts to challenge Western global clout.",
      "China’s President Xi Jinping on Wednesday emphasized the need to avoid an escalation of the conflict in Ukraine as he addressed leaders and officials at a summit of the BRICS bloc of developing economies in Russia.",
      "From left, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping attend a family photo ceremony prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) From left, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping attend a family photo ceremony prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) From left: United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, Chinese President Xi Jinping, Russian President Vladimir Putin and Indian Prime Minister Narendra Modi attend a family photo ceremony prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) Chinese President Xi Jinping, left, and Russian President Vladimir Putin attend a family photo ceremony prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) From left: Ethiopian Prime Minister Abiy Ahmed, Egyptian President Abdel Fattah el-Sisi, South African President Cyril Ramaphosa, Chinese President Xi Jinping, Russian President Vladimir Putin, Indian Prime Minister Narendra Modi, United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, Iranian President Masoud Pezeshkian and Brazilian Foreign Minister Mauro Vieira pose for a family photo prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shipenkov, Pool Photo via AP) Russian President Vladimir Putin, Indian Prime Minister Narendra Modi, Egyptian President Abdel Fattah el-Sisi, Iranian President Masoud Pezeshkian, Brazilian Foreign Minister Mauro Vieira, United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, South African President Cyril Ramaphosa and Chinese President Xi Jinping attend the BRICS Summit narrow format session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexander Nemenov, Pool Photo via AP) Egyptian President Abdel Fattah el-Sisi, center, arrives at BRICS Summit in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shemetov, Pool Photo via AP) From left: Indian Prime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping attend a family photo prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shipenkov, Pool Photo via AP) From left: Chinese President Xi Jinping, Russian President Vladimir Putin and Indian Prime Minister Narendra Modi attend a family photo ceremony prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shipenkov, Pool Photo via AP) From left: South African President Cyril Ramaphosa, Chinese President Xi Jinping and Russian President Vladimir Putin pose for a family photo prior to the BRICS Summit plenary session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(AP Photo/Alexander Zemlianichenko, Pool) Russian President Vladimir Putin attends the BRICS Summit narrow format session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexander Nemenov, Pool Photo via AP) Chinese President Xi Jinping attends the BRICS Summit narrow format session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexander Nemenov, Pool Photo via AP) Indian Prime Minister Narendra Modi attends BRICS Summit extended format session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexander Nemenov, Pool Photo via AP) United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, left, arrives at BRICS Summit in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shemetov, Pool Photo via AP) Iranian President Masoud Pezeshkian, center, accompanied by Iranian Ambassador to Russia Kazem Jalali, left, arrives at BRICS Summit in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shemetov/Pool Photo via AP) Russian President Vladimir Putin gestures during BRICS Summit extended format session in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexander Nemenov, Pool Photo via AP) Russian President Vladimir Putin, right, and Iranian President Masoud Pezeshkian shake hands during their meeting on the sidelines of the BRICS summit in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Maxim Shemetov, Pool Photo via AP) United Nations Secretary-General Antonio Guterres arrives at Kazan Airport for the BRICS summit in Kazan, Russia, Wednesday, Oct. 23, 2024.",
      "(Alexey Filippov/Photo host brics-russia2024.ru via AP) KAZAN, Russia (AP) — Russia’s President Vladimir Putin on Wednesday hosted China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the BRICS bloc of developing economies, part of the Kremlin’s efforts to challenge Western global clout.",
      "Putin said the agenda covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, as well as settling regional conflicts and moving to expand the BRICS group of countries.",
      "“The BRICS strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Putin said at the start of Wednesday’s meeting.",
      "“This approach is especially relevant in the current conditions when truly radical changes are underway across the globe, including the shaping of a multipolar world.” The alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.",
      "Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.",
      "The three-day summit in the city of Kazan that began Tuesday is attended by 36 countries, highlighting the failure of U.S.-led efforts to isolate Russia over its actions in Ukraine.",
      "The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.",
      "The Kremlin has cast BRICS as a counterbalance to the Western-dominated global order and redoubled its efforts to court the countries of the Global South after sending troops into Ukraine in February 2022.",
      "Russia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.",
      "Speaking at the summit, Putin accused the U.S. of “weaponizing” the dollar and described it as a “big mistake.” “It’s not us who refuse to use the dollar,” he said.",
      "“But if they don’t let us work, what can we do?",
      "We are forced to search for alternatives.” He also proposed creating a new BRICS investment platform, saying that it could “become a powerful tool for supporting our economies, and would also provide financial resources to countries of the Global South and East.” In a joint declaration, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS.",
      "They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.” Putin and Xi had announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022.",
      "They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.",
      "On Wednesday, Xi emphasized the bloc’s role in ensuring global security.",
      "“We must work together to build BRICS into a primary channel for strengthening solidarity and cooperation among Global South nations and a vanguard for advancing global governance reform,” he said.",
      "Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it.",
      "Ukraine has rejected the proposal.",
      "“We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift deescalation of the situation,” Xi said of the Ukrainian conflict.",
      "Russia’s cooperation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China.",
      "Western allies want India to be more active in persuading Moscow to end the fighting in Ukraine, but Modi has avoided condemning Russia while emphasizing a peaceful settlement.",
      "“We support dialogue and diplomacy, not war,” Modi said during Wednesday’s BRICS meeting in remarks carried by the Indian foreign ministry.",
      "Modi’s visit to the summit marked his second trip to Russia in three months.",
      "“As a diverse and inclusive platform, BRICS can play a positive role in all areas,” Modi said.",
      "Putin on Wednesday met on the sidelines of the summit with Iranian President Masoud Pezeshkian, hailing “truly friendly” ties between Moscow and Tehran and noting that they should be further cemented by a “comprehensive strategic partnership treaty” to be signed during Pezehskian’s planned trip to Moscow.",
      "The date for that visit hasn’t been set yet, but Kremlin foreign affairs adviser Yuri Ushakov said it could happen soon.",
      "On Thursday, Putin was set to meet Thursday with U.N. Secretary-General Antonio Guterres, who has repeatedly criticized Moscow’s actions in Ukraine and is making his first visit to Russia in more than two years.",
      "Guterres’s trip to Kazan has drawn an angry reaction from Kyiv.",
      "“This is a wrong choice that does not advance the cause of peace,” Ukraine’s Foreign Ministry said on X, adding that “it only damages the U.N.’s reputation.” Farhan Haq, deputy spokesman for Guterres, responded to the Ukrainian criticism by saying that the visit is “a standard practice in attending meetings of organizations with large numbers of important member states, such as the G7 and the G20.” “There’s a meeting with great importance for the work of the United Nations, with the BRICS countries representing about half the world’s population,” Haq said.",
      "In the meeting with Putin, Guterres “will reaffirm his well-known positions on the war in Ukraine and the conditions for a just peace based on the UN Charter, international law, and the resolutions of the United Nations.",
      "He will continue to pursue his efforts to re-establish safe navigation in the Black Sea, which is critically important for global food and energy security, especially for the most vulnerable countries around the world,” Haq said"
    ],
    "topics": [
      "kazan russia",
      "brics summit",
      "russia wednesday",
      "wednesday 23",
      "23 2024",
      "xi jinping",
      "president vladimir",
      "vladimir putin",
      "session kazan",
      "via ap"
    ]
  },
  {
    "title": "Putin touts 'multipolar world order' at flagship BRICS summit",
    "source": "Raw Story",
    "url": "https://www.rawstory.com/putin-touts-multipolar-world-order-at-flagship-brics-summit/",
    "publishedAt": "2024-10-23T11:20:38Z",
    "sentences": [
      "Russian President Vladimir Putin on Wednesday touted the creation of a new \"multipolar world order\" at the BRICS summit, a gathering of world leaders he hopes will show that Western attempts to isolate Moscow over its Ukraine offensive have failed.",
      "The meeting in the city of Kazan is the largest diplomatic forum in Russia since Putin ordered troops into Ukraine in 2022, triggering a barrage of Western sanctions and international condemnation.",
      "Around 20 leaders, including from China, India, Turkey and Iran, are gathering in the central city of Kazan, where they will address topics such as developing a BRICS-led international payment system and the conflict in the Middle East.",
      "Moscow sees the platform as an alternative to Western-led international organizations like the G7 -- a position supported by key ally Chinese President Xi Jinping.",
      "\"The process of forming a multipolar world order is underway, a dynamic and irreversible process,\" Putin said at the official opening of the summit.",
      "The BRICS organization was \"strengthening its authority in international affairs\", Putin said, as he called on its members to consider how they could address the most pressing issues on the global agenda, including \"acute regional conflicts\".",
      "UN Secretary General Antonio Guterres arrived in Russia on Wednesday to attend the summit, his first visit to the country for more than two years, which has drawn scorn from Ukraine.",
      "Putin hailed Moscow's close ties and \"strategic partnerships\" with its partners during talks on Tuesday with leaders including Xi and Indian Prime Minister Narendra Modi.",
      "Xi, meanwhile, praised China's \"profound\" ties with Russia in what he called a \"chaotic\" world.",
      "Russia and China's relations have \"injected strong impetus into the development, revitalization and modernization of the two countries\", Xi said.",
      "Putin said he saw relations between Beijing and China as a foundation of global \"stability.\"",
      "- Ukraine conflict - Security in Kazan is tight around the summit, AFP journalists at the venue reported.",
      "The surrounding Tatarstan region, around 1,000 kilometers from the Ukraine border, has previously been hit in drone attacks launched by Kyiv.",
      "But Moscow is intent on not letting the conflict overshadow the summit, and is laying out a warm welcome for the arriving leaders.",
      "Women wearing traditional Tatar costumes greeted the arriving delegations, who were offered sweet Tatar pastries made from flour and honey.",
      "Starting in 2009 with four members -- Brazil, Russia, India and China -- BRICS has since expanded to include other emerging nations such as South Africa, Egypt and Iran.",
      "Underpinning his vision of the group as a challenge to the West, Putin will hold separate talks with Iran's President Masoud Pezeshkian and Venezuela's President Nicolas Maduro on Wednesday.",
      "He will also meet Turkish President Recep Tayyip Erdogan.",
      "Turkey, a NATO member, is casting itself as a possible mediator between Russia and Ukraine and strives for warm relations with Moscow.",
      "Guterres will hold talks with Putin on Thursday, where the pair will discuss the Ukraine conflict, the Kremlin said.",
      "Kyiv has railed against UN chief Guterres' trip.",
      "\"The UN Secretary General declined Ukraine's invitation to the first Global Peace Summit in Switzerland.",
      "He did, however, accept the invitation to Kazan from war criminal Putin,\" its foreign ministry said in a post on X.",
      "The UN chief's spokesperson said the trip was part of his regular attendance at \"organizations with large numbers of important member states\" and said it offered a chance to \"reaffirm his well known positions\" on the Ukraine conflict \"and the conditions for just peace\".",
      "- Modi calls for peace - Modi, who is also casting himself as a possible peacemaker, called for a quick end to the conflict during talks with Putin on Tuesday.",
      "\"We have been in constant touch over the conflict between Russia and Ukraine,\" Modi told Putin after the two shook hands and embraced.",
      "\"We believe that disputes should only be resolved peacefully.",
      "We totally support efforts to quickly restore peace and stability,\" the Indian leader added.",
      "India has walked a tightrope since the Ukraine conflict began, pledging humanitarian support for Kyiv while avoiding explicit condemnation of Moscow's actions.",
      "Moscow has been steadily advancing on the battlefield in eastern Ukraine this year as it strengthens ties with the likes of China, Iran and North Korea.",
      "Copyright © 2025 Raw Story Media, Inc. PO Box 21050, Washington, D.C. 20009 | Masthead | Privacy Policy | Manage Preferences | Debug Logs For corrections contact corrections@rawstory.com , for support contact support@rawstory.com ."
    ],
    "topics": [
      "ukraine conflict",
      "putin said",
      "multipolar world",
      "world order",
      "city kazan",
      "leaders including",
      "un secretary",
      "secretary general",
      "casting possible",
      "russia ukraine"
    ]
  },
  {
    "title": "Putin welcomes China's Xi Jinping to Russia for start of BRICS summit",
    "source": "UPI News",
    "url": "https://www.upi.com/Top_News/World-News/2024/10/23/Putin-hosts-Xi-Jinping-BRICS/4911729651804/",
    "publishedAt": "2024-10-23T04:01:00Z",
    "sentences": [
      "Oct. 22 (UPI) -- President Vladimir Putin welcomed his Chinese counterpart, Xi Jinping, to Russia on Tuesday, as the Kremlin head prepares to host several leaders of developing nations at an intergovernmental summit this week.",
      "This year's summit of the intergovernmental organization BRICS -- named after the first initial of each of its founding nations Brazil, Russia, India, China and South Africa -- is being held in Russia's southwestern city of Kazan from Tuesday through Thursday under the motto \"Strengthening multilateralism for equitable global development and security.\"",
      "Putin failed to attend last year's summit held in South Africa over fears of arrest.",
      "The International Criminal Court has issued a warrant for the Russian leader over his war in Ukraine, which has greatly limited his ability to visit foreign nations.",
      "This week's summit provides an opportunity for Putin to be seen hosting his international counterparts, shaking hands and making deals as a powerful international leader despite the weight of sanctions and global isolation over his invasion and ongoing war in Ukraine.",
      "The summit also marks the third time this year that Putin has met in-person with Xi, as their two countries have grown closer amid their increasing isolation from democratic nations.",
      "Related Britain, Germany agree to significantly deepen their defense alliance North Korea denies sending troops to Ukraine amid international condemnation European Parliament approves $38 billion loan to Ukraine The pair met on the sidelines of the summit on Tuesday, and Putin called Xi a \"dear friend\" during a joint press conference.",
      "He also described their countries' relations as an example of what others should strive to achieve.",
      "\"We can assert with complete confidence that these relations have become a paradigm of how inter-state relations should be constructed in the modern world,\" Putin said.",
      "\"Our multifaceted cooperation is characterized by equality, mutual benefit and an absolutely non-conformist nature.\"",
      "Putin boasted that their cooperation on global issues \"is one of the main stabilizing factors in the international arena\" and that they intend to further expand coordination \"to ensure global security and promote a fairer world order.\"",
      "Xi added that China-Russia relations have \"withstood the test of a changing international situation.\"",
      "He also complimented himself and Putin for doing so.",
      "\"We have taken the right path of building relations between great powers on the principles of non-alignment, non-confrontation, and non-direction against third parties,\" he said.",
      "\"Mr. president, in this new era, you and I always pay greater attention to bilateral relations and monitor them personally.\"",
      "Neither the United States nor the democratic pressure being applied to the two authoritarian nations to adhere to international norms was mentioned by either Putin or Xi, but the Chinese leader acknowledged that they were facing an unprecedented \"tectonic transformation\" of the international situation.",
      "\"However, this cannot shake my conviction that the strategic choice of the two countries in favor of firm mutual support, the deep centuries-old friendship between our countries, and China and Russia's sense of duty as great powers are inviolable,\" he said.",
      "Xi also celebrated BRICS as being \"one of the most important platforms to consolidate the broad developing world and emerging market countries.\"",
      "The meeting is the third by the two leaders, but the first since July when they met on the sidelines of an Eurasian intergovernmental security summit.",
      "Their first meeting this year was in May when Xi hosted Putin to a state visit.",
      "Topics Xi JinpingWar in Ukraine Latest Headlines World News // 1 hour ago Mexican candidate for mayor killed with 4 supporters at campaign rally in Veracruz May 12 (UPI) -- A mayoral candidate in Mexican President Claudia Sheinbaum's ruling party was killed this past weekend with four others during a campaign rally in the eastern state of Veracruz.",
      "World News // 2 hours ago After 18 months captivity in Gaza, American-Israel hostage Edan Alexander now free May 12 (UPI) -- Hamas on Monday released Edan Alexander, the last known living American hostage in Gaza after 18 months in captivity.",
      "World News // 4 hours ago First group of South African refugees to arrive in U.S. May 12 (UPI) -- The first set of 49 White South African \"Afrikaners\" granted refugee status by President Donald Trump will arrive Monday to the United States.",
      "World News // 6 hours ago Food security group warns Israeli blockade raises famine threat in Gaza May 12 (UPI) -- Gaza is under the threat of widespread famine as nearly 500,000 Palestinians are facing catastrophic food insecurity, the Integrated Food Security Phase Classification reported on Monday.",
      "World News // 7 hours ago Pope Leo XIV tells media to help promote global peace by 'disarming' words May 12 (UPI) -- Pope Leo XIV called for a kinder, gentler mass media, one that speaks up for those with no voice and in defense of free speech, and urged regimes around the world that jail journalists to set them free.",
      "World News // 8 hours ago Poland shuts another Russian consulate, expels diplomats as relations worsen May 12 (UPI) -- Poland said Monday it would closea second Russian consulate over a May 2024 blaze that destroyed the largest shopping mall in the capital, Warsaw, saying the evidence showed Moscow was behind it.",
      "World News // 9 hours ago India, Pakistan hold conference call to solidify fragile cease-fire May 12 (UPI) -- Indian and Pakistani officials were scheduled to hold direct talks Monday to build on a U.S.-brokered cease-fire between the nuclear-armed Asian rivals that came into force over the weekend.",
      "World News // 21 hours ago Hamas to release U.S.-Israeli hostage Edan Alexander May 11 (UPI) -- Hamas has announced it will release the man believed to be the last living U.S. citizen held hostage in Gaza, the group announced Sunday.",
      "World News // 13 hours ago PKK says it is dissolving and ending its conflict with Turkey May 12 (UPI) -- The Kurdistan Workers Party, a militant organization that seeks an independent Kurdistan, announced it was disbanding, a move that is expected to have wide-ranging consequences throughout the region.",
      "World News // 22 hours ago Pope calls for 'no more war' during first papal prayer May 11 (UPI) -- Pope Leo XIV Sunday called for world peace, an end to conflicts across the globe and \"no more war\" during his first papal prayer in Rome as the new pontiff.",
      "Oct. 22 (UPI) -- President Vladimir Putin welcomed his Chinese counterpart, Xi Jinping, to Russia on Tuesday, as the Kremlin head prepares to host several leaders of developing nations at an intergovernmental summit this week.",
      "This year's summit of the intergovernmental organization BRICS -- named after the first initial of each of its founding nations Brazil, Russia, India, China and South Africa -- is being held in Russia's southwestern city of Kazan from Tuesday through Thursday under the motto \"Strengthening multilateralism for equitable global development and security.\"",
      "Putin failed to attend last year's summit held in South Africa over fears of arrest.",
      "The International Criminal Court has issued a warrant for the Russian leader over his war in Ukraine, which has greatly limited his ability to visit foreign nations.",
      "This week's summit provides an opportunity for Putin to be seen hosting his international counterparts, shaking hands and making deals as a powerful international leader despite the weight of sanctions and global isolation over his invasion and ongoing war in Ukraine.",
      "The summit also marks the third time this year that Putin has met in-person with Xi, as their two countries have grown closer amid their increasing isolation from democratic nations.",
      "Related Britain, Germany agree to significantly deepen their defense alliance North Korea denies sending troops to Ukraine amid international condemnation European Parliament approves $38 billion loan to Ukraine The pair met on the sidelines of the summit on Tuesday, and Putin called Xi a \"dear friend\" during a joint press conference.",
      "He also described their countries' relations as an example of what others should strive to achieve.",
      "\"We can assert with complete confidence that these relations have become a paradigm of how inter-state relations should be constructed in the modern world,\" Putin said.",
      "\"Our multifaceted cooperation is characterized by equality, mutual benefit and an absolutely non-conformist nature.\"",
      "Putin boasted that their cooperation on global issues \"is one of the main stabilizing factors in the international arena\" and that they intend to further expand coordination \"to ensure global security and promote a fairer world order.\"",
      "Xi added that China-Russia relations have \"withstood the test of a changing international situation.\"",
      "He also complimented himself and Putin for doing so.",
      "\"We have taken the right path of building relations between great powers on the principles of non-alignment, non-confrontation, and non-direction against third parties,\" he said.",
      "\"Mr. president, in this new era, you and I always pay greater attention to bilateral relations and monitor them personally.\"",
      "Neither the United States nor the democratic pressure being applied to the two authoritarian nations to adhere to international norms was mentioned by either Putin or Xi, but the Chinese leader acknowledged that they were facing an unprecedented \"tectonic transformation\" of the international situation.",
      "\"However, this cannot shake my conviction that the strategic choice of the two countries in favor of firm mutual support, the deep centuries-old friendship between our countries, and China and Russia's sense of duty as great powers are inviolable,\" he said.",
      "Xi also celebrated BRICS as being \"one of the most important platforms to consolidate the broad developing world and emerging market countries.\"",
      "The meeting is the third by the two leaders, but the first since July when they met on the sidelines of an Eurasian intergovernmental security summit.",
      "Their first meeting this year was in May when Xi hosted Putin to a state visit."
    ],
    "topics": [
      "world news",
      "hours ago",
      "may 12",
      "12 upi",
      "year summit",
      "south africa",
      "war ukraine",
      "two countries",
      "met sidelines",
      "international situation"
    ]
  },
  {
    "title": "Financial cooperation and BRICS expansion are on the table as Putin hosts Global South leaders",
    "source": "The Boston Globe",
    "url": "https://www.bostonglobe.com/2024/10/23/wires/financial-cooperation-brics-expansion-are-table-putin-hosts-global-south-leaders/",
    "publishedAt": "2024-10-23T04:00:00Z",
    "sentences": [
      "KAZAN, Russia — Russian President Vladimir Putin on Wednesday hosted China’s Xi Jinping, India’s Narendra Modi, and other world leaders at a summit of the BRICS bloc of developing economies, part of the Kremlin’s efforts to challenge Western global clout.",
      "Putin said the agenda included deepening financial cooperation, including the development of alternatives to Western-dominated payment systems, as well as settling regional conflicts and moving to expand the BRICS group of countries.",
      "“The BRICS strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Putin said at the start of Wednesday’s meeting.",
      "“This approach is especially relevant in the current conditions when truly radical changes are underway across the globe, including the shaping of a multipolar world.” The alliance that initially included Brazil, Russia, India, China, and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates, and Saudi Arabia.",
      "Turkey, Azerbaijan, and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.",
      "The three-day summit in the city of Kazan that began Tuesday is attended by 36 countries, highlighting the failure of US-led efforts to isolate Russia over its actions in Ukraine.",
      "The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.",
      "Advertisement The Kremlin has cast BRICS as a counterbalance to the Western-dominated global order and redoubled its efforts to court the countries of the Global South after sending troops into Ukraine in February 2022.",
      "Russia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.",
      "Advertisement Speaking at the summit, Putin accused the US of “weaponizing” the dollar and described it as a “big mistake.” “It’s not us who refuse to use the dollar,” he said.",
      "“But if they don’t let us work, what can we do?",
      "We are forced to search for alternatives.” He also proposed creating a new BRICS investment platform, saying that it could “become a powerful tool for supporting our economies, and would also provide financial resources to countries of the Global South and East.” In a joint declaration, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS.",
      "They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.” Putin and Xi had announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022.",
      "They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.",
      "On Wednesday, Xi emphasized the bloc’s role in ensuring global security.",
      "“We must work together to build BRICS into a primary channel for strengthening solidarity and cooperation among Global South nations and a vanguard for advancing global governance reform,” he said.",
      "Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it.",
      "Ukraine has rejected the proposal.",
      "“We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift deescalation of the situation,” Xi said of the Ukrainian conflict.",
      "Advertisement Russia’s cooperation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China.",
      "Western allies want India to be more active in persuading Moscow to end the fighting in Ukraine, but Modi has avoided condemning Russia while emphasizing a peaceful settlement.",
      "“We support dialogue and diplomacy, not war,” Modi said during Wednesday’s BRICS meeting in remarks carried by the Indian foreign ministry.",
      "Modi’s visit to the summit marked his second trip to Russia in three months.",
      "“As a diverse and inclusive platform, BRICS can play a positive role in all areas,” Modi said.",
      "Putin on Wednesday met on the sidelines of the summit with Iranian President Masoud Pezeshkian, hailing “truly friendly” ties between Moscow and Tehran and noting that they should be further cemented by a “comprehensive strategic partnership treaty” to be signed during Pezehskian’s planned trip to Moscow.",
      "The date for that visit hasn’t been set yet, but Kremlin foreign affairs adviser Yuri Ushakov said it could happen soon.",
      "On Thursday, Putin was set to meet with UN Secretary-General Antonio Guterres, who has repeatedly criticized Moscow’s actions in Ukraine and is making his first visit to Russia in more than two years.",
      "Guterres’s trip to Kazan has drawn an angry reaction from Kyiv.",
      "“This is a wrong choice that does not advance the cause of peace,” Ukraine’s Foreign Ministry said on X, adding that “it only damages the U.N.’s reputation.” Farhan Haq, deputy spokesman for Guterres, responded to the Ukrainian criticism by saying that the visit is “a standard practice in attending meetings of organizations with large numbers of important member states, such as the G7 and the G20.” Advertisement “There’s a meeting with great importance for the work of the United Nations, with the BRICS countries representing about half the world’s population,” Haq said.",
      "In the meeting with Putin, Guterres “will reaffirm his well-known positions on the war in Ukraine and the conditions for a just peace based on the UN Charter, international law, and the resolutions of the United Nations.",
      "He will continue to pursue his efforts to re-establish safe navigation in the Black Sea, which is critically important for global food and energy security, especially for the most vulnerable countries around the world,” Haq said"
    ],
    "topics": [
      "global south",
      "putin wednesday",
      "putin said",
      "financial cooperation",
      "actions ukraine",
      "countries global",
      "modi said",
      "foreign ministry",
      "united nations",
      "haq said"
    ]
  },
  {
    "title": "BRICS Coalition Terrifies Joe Rogan as Shawn Ryan Makes Unexpected Claim on United States of America",
    "source": "Essentially Sports",
    "url": "https://www.essentiallysports.com/ufc-mma-news-brics-coalition-terrifies-joe-rogan-as-shawn-ryan-makes-unexpected-claim-on-united-states-of-america/",
    "publishedAt": "2024-09-30T08:38:57Z",
    "sentences": [
      "Sep 30, 2024 | 4:38 AM EDT What happens when two major podcasters meet for an episode together?",
      "You get a stunning show that truly leaves the fans on the edge of their seats.",
      "That’s what happened in the latest edition of The Joe Rogan Experience.",
      "Former Navy Seal and podcaster Shawn Ryan joined the UFC commentator as they shared their views on their country and its policies.",
      "The host of The Shawn Ryan Show has garnered a reputation for uncovering the brutal truths hidden by the government.",
      "Ryan initiated a conversation on the same in this edition as well.",
      "During the episode, Ryan revealed that, according to him, America is no longer the good guy as the citizens believe.",
      "In fact, he even made a stunning revelation that stunned Joe Rogan.",
      "So what did he say?",
      "The former navy seal made the massive claim that other nations are forming their own coalition to go against the countries that are a part of the North Atlantic Treaty Organization, or NATO.",
      "Why?",
      "Because they are tired of the ‘weaponization’ of the US dollar.",
      "As a result, BRICS, a coalition of the countries Brazil, Russia, India, China, and South Africa, was formed.",
      "ADVERTISEMENT Article continues below this ad “Brazil, Russia, India, China, and South Africa—BRICS—have formed a coalition… and I think they have around 22 countries now.",
      "It’s kind of like a counter to NATO.",
      "All these countries are tired of the US, tired of the tariffs, and tired of the weaponization of the US dollar.” This was major news for Rogan, who was unaware of the coalition.",
      "A clearly stunned Rogan simply stated, “I didn’t even know about it until just now.” A post shared by Shawn Ryan (@shawnryan762) Expand Post ADVERTISEMENT Article continues below this ad The idea of BRICS is to find alternatives to the U.S. dollar for international trade.",
      "One of the proposed ideas is to use a basket of their own currencies or commodities instead of the USD.",
      "This will reduce their dependency on the dollar and the policies set by the U.S. government on it.",
      "It will also lead to much easier trade between the countries.",
      "Ryan also had more in the basket for the audience, though.",
      "He further emphasized why other countries are turning their backs on the USA.",
      "Being in the military, while exciting, can also expose you to some truly horrific events.",
      "As a result, it is not uncommon for veterans to get PTSD or question their own beliefs and their government.",
      "The host of The Shawn Ryan Show experienced a similar experience while he was in the military, as he revealed on JRE.",
      "According to him, he did not believe in a lot of tasks that the government made him perform.",
      "In fact, they even turned other countries against them.",
      "ADVERTISEMENT Article continues below this ad Is Joe Rogan right to be terrified of the BRICS coalition?",
      "What's your take on this?",
      "Debate While he did not dive deep into the details, Ryan admitted that he firmly disagreed with the men in power.",
      "“That’s what I want to do—I want to start going in and talking to all these foreign dignitaries and getting a different perspective on what we’re doing.",
      "I don’t think we’re the good guys anymore.",
      "I don’t agree with a lot of the stuff I was involved in, you know, as a SEAL or CIA contractor.” Shawn Ryan also claimed that some policies did not make sense at the time.",
      "Moreover, the army shouldn’t have been deployed to some places where they ended up according to him.",
      "This has made him distrust his own government and led him to start his podcast.",
      "But what do you think?",
      "Do you believe his claims?",
      "Let us know in the comments.",
      "ADVERTISEMENT Is Joe Rogan right to be terrified of the BRICS coalition?",
      "What's your take on this?",
      "ADVERTISEMENT ADVERTISEMENT ADVERTISEMENT EssentiallySports is a digital-first sports media house that surfaces the best stories on America's favorite sports celebrities with a fan's perspective to 30+ M average monthly readers.",
      "Sports All Boxing Golf NASCAR NBA NFL Tennis UFC WNBA College Football Track and Field Gymnastics Olympics MLB Soccer Swimming EssentiallySports About Us Advertise With Us Authors Editorial Team Behind The Scenes Humans of EssentiallySports Contact Us Press FAQs Our Brands ES Think Tank Essentially Athletics She Got Game Essentially Golf Lucky Dog on Track FanCast Sports All Boxing Golf NASCAR NBA NFL Tennis UFC WNBA College Football Track and Field Gymnastics Olympics MLB Soccer Swimming Privacy Policy ES Pressroom Ethics Policy Fact-Checking Policy Corrections Policy Cookies Policy GDPR Compliance Terms of Use Editorial Guidelines Ownership and funding Information Full Spectrum Services LLP © 2025 | All Rights Reserved"
    ],
    "topics": [
      "shawn ryan",
      "joe rogan",
      "brics coalition",
      "advertisement article",
      "article continues",
      "continues ad",
      "former navy",
      "navy seal",
      "host shawn",
      "ryan show"
    ]
  },
  {
    "title": "Turkey's bid for BRICS both strategic and symbolic step, analysts say",
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/09/10/turkeys-bid-for-brics-both-strategic-and-symbolic-step-analysts-say.html",
    "publishedAt": "2024-09-10T05:14:38Z",
    "sentences": [
      "Turkey's request to join the BRICS alliance is a move seen as both strategic and symbolic as the Eurasian country of 85 million makes increasing strides in its influence and leverage on the global stage.",
      "\"Our president has already expressed multiple times that we wish to become a member of BRICS,\" a spokesperson for Turkey's leading AK Party told journalists earlier in September.",
      "\"Our request in this matter is clear, and the process is proceeding within this framework.\"",
      "BRICS, which stands for Brazil, Russia, India, China and South Africa, is a group of emerging market countries that seek to deepen their economic ties.",
      "This year, it gained four new members: Iran, Egypt, Ethiopia, and the UAE.",
      "It's also seen as a counterweight to Western-led organizations like the EU, the G7 and even NATO, although it lacks formal structure, enforcement mechanisms, and uniform rules and standards.",
      "For Turkey, a longtime Western ally and NATO member since 1952, the move to join BRICS is \"in line with its broader geopolitical journey: positioning itself as an independent actor in a multi-polar world and even becoming a pole of power in its own right,\" George Dyson, a senior analyst at Control Risks, told CNBC.",
      "\"This is not to say that Turkey is turning away from the West entirely,\" Dyson added, \"but Turkey wants to foster as many trading ties as possible and pursue opportunities unilaterally without being constrained by Western alignment.",
      "It is definitely symbolic in that Turkey is demonstrating exactly this — that it is not constrained by its good ties with the West.\"",
      "Despite decades of being aligned with Europe and the U.S., Turkey has faced consistent rejection from joining the EU, which has long been a sore spot for Ankara.",
      "Ambassador Matthew Bryza, a former White House and Senior State Department official currently based in Istanbul, said that Turkish President Recep Tayyip Erdogan and his government \"seem to be motivated mostly by two factors: A strategic tradition of securing national interests... and a desire to spook the West a bit, both out of emotional spite and as a negotiating tactic to extract concessions.\"",
      "CNBC has contacted the Turkish presidency's office for comment.",
      "Turkey has in the last few years expanded its role in global diplomacy, brokering prisoner swap deals and leading other negotiations between Ukraine and Russia, for instance, while also mending previously strained relations with regional powers like Saudi Arabia, the United Arab Emirates and most recently, Egypt.",
      "Ankara also refuses to partake in sanctions against Russia — a stance that irks its Western allies but helps it maintain an independent position as a so-called \"middle power,\" which it sees as beneficial to its relationships with China and the Global South.",
      "To that end, \"any new BRICS member is obviously eager to take advantage of stronger 'togetherness' of emerging economies in order to reduce dependency on developed economies, mainly the United States,\" said Arda Tunca, an independent economist and consultant based in Turkey.",
      "Tunca noted, however, that Turkey's unique position in the world is a \"delicate discussion point\" as the country has \"serious political problems with the EU and the United States\" despite its western alliances.",
      "Turkey's governing party, which has run the country for 22 years, is \"ideologically closer to the East than the West,\" Tunca said.",
      "\"Turkey wanted to hop on the BRICS train before it was late.",
      "It is too early to mention that the BRICS can become an alternative to the West, but the intention is clearly to stand up against the West under the leadership of China.\"",
      "Importantly, being part of BRICS allows its members to trade in currencies other than dollars.",
      "This aims to reduce dependency on the U.S.-led system and usher in a more multi-polar world.",
      "The fact that it's led by China makes some in the West wary, who see this as a potential win for Beijing.",
      "\"I don't think there is any enforcement of their [BRICS'] decisions, it's more of a geopolitical thing, sort of a symbolic counter to the G7,\" Dyson said.",
      "He also noted: \"It's interesting that Iran and UAE are both in it.",
      "It's a bit like the anti-West team.\"",
      "Erdogan has spoken of his desire to join BRICS since at least 2018, but the issue was never formalized.",
      "In June, Turkish Foreign Minister Hakan Fidan visited both China and Russia, the latter for a BRICS+ summit, during which Russian President Vladimir Putin said he \"welcomed\" Turkey's interest in joining the bloc.",
      "At the time, the then-U.S. ambassador to Turkey, Jeff Flake, said in an interview that he hoped Turkey wouldn't join the group, but added that he did not think it would negatively impact Turkey's alignment with the West."
    ],
    "topics": [
      "join brics",
      "reduce dependency",
      "united states",
      "turkey request",
      "request join",
      "brics alliance",
      "alliance move",
      "move seen",
      "seen strategic",
      "strategic symbolic"
    ]
  },
  {
    "title": "Turkey's Role in NATO Comes Under Scrutiny",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/turkey-nato-scrutiny-erdogan-1949120",
    "publishedAt": "2024-09-05T11:02:28Z",
    "sentences": [
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "Turkey's request to join two international organizations headed by Russia and China has added to questions about its role in NATO with which it has clashed in recent years.",
      "Ankara asked this week to join the BRICS economic bloc named after Brazil, Russia, India and China and South Africa.",
      "It is seen as a rival to the G7 of the world's most developed economies and aspirations to join it form the latest pivot by Turkish President Recep Tayyip Erdoğan away from the West.",
      "Erdoğan has said he also wants Ankara to join the Shanghai Cooperation Organization (SCO).",
      "It has raised concerns over the compatibility of Turkey's membership of NATO, whose security focus is the invasion of Ukraine, with being in blocs spearheaded by Moscow carrying out the aggression.",
      "Joining the SCO \"is a non-starter for a NATO country,\" said Sinan Ciddi, non-resident senior fellow on Turkey at the Foundation for Defense of Democracies (FDD), a Washington, D.C. think tank.",
      "\"They are mutually opposing organizations.\"",
      "Ankara's move to both BRICS and the SCO \"is more than just a hedge against NATO,\" he said, \"you're basically looking at Turkey inside of NATO which is a non-performer on many levels.\"",
      "Ankara has tweaked the nose of NATO several times in recent years.",
      "In 2020, the U.S. sanctioned Turkey for deploying a Russian-made S-400 surface-to-air missile system which Washington says is incompatible with alliance technology.",
      "Ankara also slowed the NATO membership bids of Sweden until an unofficial bargain saw Washington agree in February to sell it F-16 fighter jets in what Kentucky Republican Sen. Rand Paul called a \"quid pro quo.\"",
      "Erdogan was again at odds with the alliance after his labeling of Hamas as a \"liberation group\" following its October 7, 2023, attack on southern Israel that preceded the Gaza war.",
      "Without specifying how, the Turkish president, a critic of the offensive in Gaza, told a meeting of his ruling AK Party in July that Turkey may enter Israel to help Palestinians in the war as it has done in the past in Libya and Nagorno-Karabakh.",
      "Since the start of the Gaza war, Ankara has blocked co-operation with Israel, a major non-member ally of NATO.",
      "Siddi said that while predominantly Muslim countries—Turkey is officially secular—oppose Israel's actions in Gaza, Ankara \"is literally, not figuratively, offering material support to a terrorist entity considered by NATO and the European Union.\"",
      "\"I don't know how much how much more outside of the value system one can be.",
      "It's almost as like our European and NATO leaders don't want to come to terms with this,\" he said.",
      "\"I don't know how a leader could be more sort of instructive in their intent in saying where they're moving towards and how they're positioning their country.\"",
      "Newsweek has contacted NATO and the Turkish foreign ministry for comment.",
      "There are heightened tensions due to the war in Gaza and the resultant increased U.S. military presence in the region.",
      "On Monday, an anti-American youth group in Turkey attacked U.S. military service members in the port city of Izmir after which the Turkey Youth Union (TGB) involved posted a social media message that U.S. hands \"are stained with the blood of our brave soldiers and thousands of Palestinians.\"",
      "In comments for Newsweek last month, Erdogan said that Western powers were taking wrong and potentially dangerous approaches to the wars in Ukraine and Gaza which threatened to spiral into far larger confrontations.",
      "On Russia's invasion, Erdogan said that \"the solution is not more bloodshed and suffering, but rather a lasting peace achieved through dialogue,\" and more broadly that Ankara wants to \"approach issues with sincerity and rational road maps rather than with codes from hidden agendas and emotional reflexes.\"",
      "Former Turkish diplomat Sinan Ülgen, head of the Istanbul-based think tank EDAM, said that Ankara's request to join an economic group like BRICS was partly borne out of frustration at the decades-long push to join another club—the European Union, as well as stalled negotiations for modernizing an EU customs union deal.",
      "\"What we've seen really over the past decade is a desire in Ankara to really chart a path of strategic autonomy for Turkey,\" Ülgen said.",
      "\"There is a realization that the current global order opens up space for middle powers like Turkey to diversify its set of correlations away from its traditional partners in the West.\"",
      "Ülgen said the absence of any other NATO nations in BRICS for instance means that Turkey's move to join will be interpreted as a move away from the West \"even though Turkish authorities will state that this is essentially a rebalancing.\"",
      "Since the start of Putin's invasion, Turkey has played a key role in putting in place a deal to ensure grain could be shipped safely from Ukraine's Black Sea port, which later ended, and it has also supplied Kyiv with weapons such as Bayraktar TB2 attack drones.",
      "But most observers focus on the cordiality of Erdogan's relations with Putin and the Turkish leader said on the sidelines of the SCO that Ankara could be an intermediary in the Ukraine war, although the Kremlin rejected the offer.",
      "However, Erdogan's pivot away from the West appears to be by dissatisfaction of its ties with the EU and Washington, according to Yörük Işık, a geopolitical analyst and head of the Bosphorus Observer consultancy based in Istanbul.",
      "\"There is a huge lack of engagement from Brussels,\" he told Newsweek.",
      "\"They have settled into this totally unhealthy relation of transactional relations with Turkey.",
      "\"Washington is not paying attention to Turkey—from Ankara's point of view—neither to Turkey's demands nor to its concerns.\"",
      "Işık believes that Ankara sees a multi-polar world in which the old actors are not necessarily fulfilling any of Turkey's demands.",
      "\"Some of it is legitimate but the more reasonable thing is for Turkey to make its own in the existing institutions where it's appreciated more and it can relate concerns much better,\" he said.",
      "However, since Putin's full-scale invasion, he believes there is a greater appreciation for NATO which has again become \"Europe's most important institution.\"",
      "\"Turkey is a 72-year-old member of this institution, so it can relay its concerns more in the frame of NATO and work towards its goals there,\" Işık said.",
      "\"This is so much better than endless attempts to carve itself new political arenas.\"",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular ... Read more"
    ],
    "topics": [
      "brendan cole",
      "cole newsweek",
      "newsweek senior",
      "senior news",
      "news reporter",
      "reporter based",
      "based london",
      "london uk",
      "uk focus",
      "focus russia"
    ]
  },
  {
    "title": "Turkey seeks to join the BRICS bloc of emerging economies, a Kremlin official says",
    "source": "WDIV ClickOnDetroit",
    "url": "https://www.clickondetroit.com/business/2024/09/04/turkey-seeks-to-join-the-brics-bloc-of-emerging-economies-a-kremlin-official-says/",
    "publishedAt": "2024-09-04T13:39:37Z",
    "sentences": [
      "Associated Press Published: September 4, 2024 at 9:39 AM Associated Press FILE - Turkish President Recep Tayyip Erdogan speaks during a joint statement to the media in Baghdad, Iraq, April 22, 2024.",
      "(Ahmad Al-Rubaye /Pool Photo via AP, File) MOSCOW – NATO member Turkey has applied for membership in the BRICS bloc of developing economies, a senior Kremlin official said Wednesday, as Russia and China seek to counter the West's global influence.",
      "Yuri Ushakov, President Vladimir Putin's foreign affairs aide, told reporters that Turkey has submitted an application “for full membership” in the bloc that Russia this year chairs, and it will be considered.",
      "Recommended Videos Turkish President Recep Tayyip Erdogan has stated several times that his country aspires to become a member of the BRICS alliance, according to Omer Celik, a spokesman for Erdogan's ruling party.",
      "But Celik stopped short this week of confirming that Turkey has applied formally.",
      "The BRICS alliance was founded in 2006 by Brazil, Russia, India and China, with South Africa joining in 2010.",
      "It recently has undergone an expansion, and now includes Iran, Egypt, Ethiopia and the United Arab Emirates.",
      "Saudi Arabia has said it’s considering joining, and Azerbaijan and Malaysia have formally applied.",
      "BRICS has a stated aim to amplify the voice of major emerging economies to counterbalance the Western-led global order.",
      "Its founding members have called for a fairer world order and the reform of international institutions like the United Nations, the International Monetary Fund and the World Bank.",
      "Erdogan, who has been in power for more than two decades, has sought to carve a more independent foreign policy for Turkey and to enhance its global influence.",
      "The country is also frustrated by the lack of progress in its membership talks with the European Union.",
      "Last week, Erdogan said Turkey should “simultaneously” develop relations with both the East and the West.",
      "Turkey, which straddles Europe and Asia, joined the NATO military alliance in 1952.",
      "It began talks to join the European Union in 2005 but the negotiations have stalled due to concerns over democratic regression under Erdogan’s administration, and ongoing disputes with Cyprus, an EU member, among other challenges.",
      "BRICS is expected to discuss taking in new members in a meeting in Russia next month.",
      "Putin earlier this year welcomed Turkey's interest in the bloc and promised that Moscow “will support this aspiration and desire to be together with the countries of this alliance, to be together, closer, to solve common problems.” On Monday, Putin spokesman Dmitry Peskov also said Turkey expressed interest in joining BRICS.",
      "Copyright 2024 The Associated Press.",
      "All rights reserved.",
      "This material may not be published, broadcast, rewritten or redistributed without permission.",
      "Click here to take a moment and familiarize yourself with our Community Guidelines."
    ],
    "topics": [
      "associated press",
      "2024 associated",
      "turkish president",
      "president recep",
      "recep tayyip",
      "tayyip erdogan",
      "turkey applied",
      "global influence",
      "brics alliance",
      "european union"
    ]
  },
  {
    "title": "Turkey wants to join the BRICS bloc of developing economies, official confirms",
    "source": "WDIV ClickOnDetroit",
    "url": "https://www.clickondetroit.com/business/2024/09/03/turkey-wants-to-join-the-brics-bloc-of-developing-economies-official-confirms/",
    "publishedAt": "2024-09-03T15:40:11Z",
    "sentences": [
      "Associated Press Published: September 3, 2024 at 11:40 AM Associated Press Sputnik FILE - Russian President Vladimir Putin addresses the BRICS Parliamentary Forum in St. Petersburg, Russia, July 11, 2024.",
      "(Valery Sharifulin, Sputnik, Kremlin Pool Photo via AP, File) ANKARA – A senior official on Tuesday confirmed a report that Turkey wants to join the BRICS bloc of developing economies but stopped short of declaring that the NATO country had formally applied for membership.",
      "The Bloomberg news agency reported Monday that Turkey had officially applied to join BRICS several months ago.",
      "Asked about the report, Omer Celik, spokesman for Turkish President Recep Tayyip Erdogan’s ruling party, said Erdogan has stated “several times” that Turkey aspires to become a member.",
      "Recommended Videos “Our request on this issue is clear.",
      "This process is ongoing.",
      "But there is no concrete development regarding this,” Celik told reporters.",
      "\"Our president has clearly stated that Turkey wants to take part in all important platforms, including BRICS.” The BRICS alliance was founded in 2006 by Brazil, Russia, India and China, with South Africa joining in 2010, but has recently undergone a major expansion, and now includes Iran, Egypt, Ethiopia and the United Arab Emirates.",
      "Saudi Arabia has said it's considering joining and Azerbaijan has formally applied.",
      "BRICS has a stated aim to amplify the voice of the Global South.",
      "Its founding members have called for a fairer world order and the reform of international institutions like the United Nations, the IMF and the World Bank.",
      "Erdogan, who has been in power for more than two decades, has sought to carve a more independent foreign policy for Turkey and to enhance its global influence.",
      "The country is also frustrated by the lack of progress in its membership talks with the European Union.",
      "Last week, Erdogan said Turkey should “simultaneously” develop relations with both the East and the West.",
      "“We don’t have to choose between the European Union and the Shanghai Cooperation Organization,” Erdogan said in reference to the regional cooperation organization established by China and Russia.",
      "“On the contrary we have to develop our relations with both these and other organizations on a win-win basis.” BRICS is expected to discuss taking in new members in a meeting in Russia next month.",
      "Turkey, which straddles Europe and Asia, joined the NATO military alliance in 1952.",
      "It began talks to join the European Union in 2005 but the negotiations have stalled due to concerns over democratic regression under Erdogan’s administration, and ongoing disputes with Cyprus, an EU member, among other challenges.",
      "Earlier this year, Foreign Minister Hakan Fidan said Turkey was “exploring new opportunities for cooperation with several partners in different platforms, such as BRICS.” On Monday, Dmitry Peskov, spokesman for Russian President Vladimir Putin, also said Turkey has expressed its interest in joining BRICS.",
      "Copyright 2024 The Associated Press.",
      "All rights reserved.",
      "This material may not be published, broadcast, rewritten or redistributed without permission.",
      "Click here to take a moment and familiarize yourself with our Community Guidelines."
    ],
    "topics": [
      "associated press",
      "european union",
      "said turkey",
      "2024 associated",
      "russian president",
      "president vladimir",
      "vladimir putin",
      "turkey wants",
      "join brics",
      "formally applied"
    ]
  },
  {
    "title": "Turkey, NATO member, submits formal application to join BRICS",
    "source": "Al-Monitor",
    "url": "https://www.al-monitor.com/originals/2024/09/turkey-nato-member-submits-formal-application-join-brics",
    "publishedAt": "2024-09-03T04:00:00Z",
    "sentences": [
      "ANKARA — Turkey’s ruling Justice and Development Party on Tuesday confirmed that Ankara has taken further steps to join the China-led BRICS group.",
      "“Our president has already expressed multiple times that we wish to become a member of BRICS,” party spokesperson Omer Celik told journalists during a press conference.",
      "“Our request in this matter is clear, and the process is proceeding within this framework.” The remarks came in response to an earlier report by Bloomberg that NATO member Turkey formally applied to the bloc several months ago.",
      "Celik said that the application has yet to see any concrete outcome.",
      "“We will share with you if there is any assessment or decision by BRICS regarding the membership,” he said.",
      "Discussions over Turkey’s potential membership in the bloc have ramped up following Turkish Foreign Minister Hakan Fidan’s visit to China in June.",
      "After China, Fidan also attended the BRICS+ summit in Russia in June.",
      "While neither Fidan nor the ministry has officially confirmed Turkey’s formal bid to join BRICS, Russian President Vladimir Putin said he “welcomed” Turkey's interest in the bloc during a June 11 meeting with the top Turkish diplomat on the sidelines of the summit.",
      "Outgoing US Ambassador to Ankara Jeff Flake at the time expressed his hope that Turkey would not join the group, but said that Turkey's potential membership would not derail its alignment with NATO and the West.",
      "Turkish President Recep Tayyip Erdogan had expressed his country’s desire to join BRICS for the first time in 2018 while he was attending the China-led bloc’s summit in South Africa, but the issue was put on a back burner.",
      "Turkey’s formal application comes amid Ankara’s growing frustration with the European Union and as it seeks to diversify its trade and examine options outside the European bloc.",
      "Ankara’s dismay has been building with the EU, its largest trade partner, over the pending resumption of the modernization of the Customs Union Treaty between the group and Ankara.",
      "The bloc, which was founded by Brazil, Russia, India and China in 2006, added South Africa a year after and Egypt, Ethiopia, Iran and the United Arab Emirates in January, doubling its membership and including Middle Eastern countries for the first time.",
      "More than 30 countries have applied to join the alliance, according to the Russian Foreign Minister Sergey Lavrov.",
      "Algeria, Bahrain, Kuwait and Tunisia are also reportedly interested.",
      "Correction: Sept. 6, 2024.",
      "This article has been updated to clarify that Turkey had taken steps toward joining BRICS, but there is no firm confirmation of a formal application yet."
    ],
    "topics": [
      "join brics",
      "taken steps",
      "application yet",
      "turkey potential",
      "potential membership",
      "foreign minister",
      "turkey formal",
      "first time",
      "south africa",
      "formal application"
    ]
  },
  {
    "title": "Turkey Seeks to Join Putin-Xi's BRICS Union",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/turkey-brics-nato-erdogan-putin-xi-1947517",
    "publishedAt": "2024-09-02T16:15:13Z",
    "sentences": [
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "Turkey will be the first NATO member to request membership of the BRICS economic bloc spearheaded by the leaders of Russia and China, Vladimir Putin and Xi Jinping, it has been reported.",
      "Bloomberg said Monday that Ankara had formally asked to join the group of emerging market nations as it looks beyond its traditional Western allies.",
      "Newsweek has contacted the Turkish Foreign Ministry for comment.",
      "One former Turkish diplomat has told Newsweek that the move has been driven by \"accumulated frustrations\" in Ankara with the West and the European Union.",
      "\"This is not the strategy, by Ankara, to replace the West, but it's a strategy to strengthen relations with non-Western powers at a time when the U.S. hegemony is waning,\" said Sinan Ülgen, head of the Istanbul-based think tank EDAM.",
      "Named after Brazil, Russia, India and China and South Africa, the BRICS group includes countries not listed in the acronym, such as the United Arab Emirates (UAE), Ethiopia and Egypt, which all joined earlier this year.",
      "The bloc is considered to be an alternative on the global stage to the U.S.-led G7 group.",
      "Citing unnamed sources, Bloomberg said that Turkish President Recep Tayyip Erdogan's administration believed that \"the geopolitical center of gravity\" is moving away from the most developed economies.",
      "The move also shows Ankara's aims \"to cultivate ties with all sides in a multipolar world\" while still fulfilling its obligations as a key NATO member, the report added.",
      "Bloomberg said Ankara had submitted an application months ago amid frustration at its stalled bid to join the European Union, whose membership it has sought for decades.",
      "\"One driver of this is an aspiration for enhanced strategic autonomy,\" Ülgen told Newsweek.",
      "\"The second driver is these accumulated frustrations with the West and the European Union,\" one of which included stalled negotiations for modernizing an EU customs union deal.",
      "\"The bilateral relationship with the U.S. has also been problematic,\" Ülgen said.",
      "\"These type of frustrations have motivated the Turkish government to move in this direction,\" he added.",
      "There is a belief in Ankara that it can do this \"without a political cost that would be attached to this realignment.\"",
      "As a non-western forum in which Russian and China play a key role, Turkey's move toward BRICS membership will be seen as a move away from the West, even though Ankara will take pains not to portray it as being detrimental to its Western ties.",
      "\"The question remains whether you can actually do both at the same time,\" Ülgen said.",
      "The diplomatic push by Turkey to join BRICS comes amid rifts with other NATO members caused in part by Ankara's close ties with Russia, despite Putin's full-scale invasion of Ukraine.",
      "Ülgen said as there is no security component to BRICS, joining the block would not affect Turkey's role in the alliance.",
      "\"It's mostly an economic organization so it's likely to affect its relationship with the EU more than with NATO,\" Ülgen added.",
      "In June, Turkish Foreign Minister Hakan Fidan became the highest-level Turkish official to visit China since 2012, and he held talks with his Chinese counterpart Wang Yi, as well as other officials.",
      "Turkish officials have attended previous BRICS summits.",
      "In June, Kremlin spokesman Dmitry Peskov said Moscow welcomed the prospect of Ankara formally joining and that its membership would be discussed at the bloc's next summit in the Russian city of Kazan between October 22 and 24.",
      "Putin gave a virtual address at the previous meeting in South Africa due to speculation about whether the country would be obliged to carry out a March arrest warrant issued against him from the International Criminal Court.",
      "The ICC accused him of the illegal deportation of children from Ukraine to Russia.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular the war started by Moscow.",
      "He also covers other areas of geopolitics including China.",
      "Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French.",
      "You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.",
      "Brendan Cole is a Newsweek Senior News Reporter based in London, UK.",
      "His focus is Russia and Ukraine, in particular ... Read more"
    ],
    "topics": [
      "brendan cole",
      "cole newsweek",
      "newsweek senior",
      "senior news",
      "news reporter",
      "reporter based",
      "based london",
      "london uk",
      "uk focus",
      "focus russia"
    ]
  },
  {
    "title": "Palestinians Will Apply to Join Russia-China Group: Ambassador",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/palestinian-ambassador-brics-application-1944916",
    "publishedAt": "2024-08-27T16:30:53Z",
    "sentences": [
      "Joe Edwards is a Live News Reporter based in Newsweek's London Bureau.",
      "He covers topics related to weather, climate, and extreme weather events.",
      "Joe joined Newsweek in April 2024 after graduating from City, University of London with an MA in International Journalism.",
      "Prior to this, he studied History and English Literature at the University of Kent.",
      "Languages: English.",
      "You can get in touch with Joe by emailing joe.edwards@newsweek.com Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "Palestinian Ambassador to Russia Abdel Hafiz Nofal has said his state will apply to join the BRICS intergovernmental organization – a group which also includes Russia and China.",
      "Russian state news outlet TASS reported that the ambassador made the announcement during a press conference, and said an application to join BRICS would be submitted after the group's Kazan summit in October.",
      "\"After our first participation in the summit we will send an application for joining this association.",
      "Russian President Vladimir Putin promised that one session would be fully devoted to Palestine.",
      "We have the most positive expectations from this summit,\" he was reported to have said.",
      "\"This invitation means that despite all the crimes, killings and destruction in the Gaza Strip, our message is that Palestine wants to live and to develop,\" Nofal added.",
      "Nofal was selected by Palestinian President Mahmoud Abbas to his position in 2015, following his previous role as ambassador to South Africa.",
      "Prior to this, Nofal held economic ministerial positions in Abbas' government, such as Deputy Minister of the Ministry of National Economy between 2008 and 2013.",
      "Newsweek has reached out to the Palestinian embassy in Russia as well as Russia and China's foreign ministries for comment via email.",
      "Moscow hosted Abbas earlier in August, with the Russian premier reportedly reiterating his support for a \"full-fledged Palestinian state.\"",
      "\"Everyone is well aware that Russia today, unfortunately, must defend its interests and defend its people with arms in hand.",
      "But what is happening in the Middle East, what is happening in Palestine, of course, does not go unnoticed on our part,\" Putin said, according to Reuters - citing a Kremlin transcript.",
      "Abbas' visit to Russia followed the news that the death toll in Gaza has surpassed 40,000 amid Israel's ongoing war with Hamas, according to the area's Hamas-run health ministry.",
      "BRICS is an acronym that represents a group of five major emerging economies: Brazil, Russia, India, China, and South Africa.",
      "Additional members include Iran, Egypt, Ethiopia, and the United Arab Emirates.",
      "The geopolitical bloc seeks to enhance its influence on global governance, particularly in institutions like the United Nations, World Bank, and International Monetary Fund (IMF), advocating for reforms that would better reflect the interests of emerging economies.",
      "BRICS holds annual summits where member countries discuss issues related to economic cooperation, political coordination, and social and cultural exchange.",
      "The bloc has also established various cooperative mechanisms, including the New Development Bank (NDB), which funds infrastructure and development projects.",
      "The large populations, growing economies, and substantial natural resources of these nations means that the group collectively accounts for a significant portion of the world's population and economic output, playing an increasingly important role in global economic and political affairs.",
      "Do you have a story we should be covering?",
      "Do you have any questions about international politics?",
      "Contact LiveNews@newsweek.com Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Newsweek is committed to journalism that's factual and fair.",
      "Hold us accountable and submit your rating of this article on the meter.",
      "Joe Edwards is a Live News Reporter based in Newsweek's London Bureau.",
      "He covers topics related to weather, climate, and extreme weather events.",
      "Joe joined Newsweek in April 2024 after graduating from City, University of London with an MA in International Journalism.",
      "Prior to this, he studied History and English Literature at the University of Kent.",
      "Languages: English.",
      "You can get in touch with Joe by emailing joe.edwards@newsweek.com Joe Edwards is a Live News Reporter based in Newsweek's London Bureau.",
      "He covers topics related to weather, climate, and extreme weather events.",
      "Joe joined Newsweek in April 2024 after graduating from City, University of London with an MA in International Journalism.",
      "Prior to this, he studied History and English Literature at the University of Kent.",
      "Languages: English.",
      "You can get in touch with Joe by emailing joe.edwards@newsweek.com Joe Edwards is a Live News Reporter based in Newsweek's London Bureau.",
      "He covers topics related to weather, climate, and ... Read more"
    ],
    "topics": [
      "joe edwards",
      "edwards live",
      "live news",
      "news reporter",
      "reporter based",
      "based newsweek",
      "newsweek london",
      "london bureau",
      "bureau covers",
      "covers topics"
    ]
  },
  {
    "title": "The Venezuelan Perspective",
    "source": "The Intercept",
    "url": "https://theintercept.com/2024/06/21/deconstructed-venezuela-maduro-brics-sanctions-citgo/",
    "publishedAt": "2024-06-21T10:00:00Z",
    "sentences": [
      "© THE INTERCEPT ALL RIGHTS RESERVED At the end of July, Venezuelans head to the polls to elect a new president, with Nicolás Maduro seeking another six-year term.",
      "This week on Deconstructed, Ryan Grim speaks with Venezuelan Foreign Minister Yván Gil Pinto, who was in New York for a U.N. debate on unilateral sanctions.",
      "Fresh from visits to China and Russia, where he engaged with BRICS alliance leaders, Pinto discusses Venezuela’s bid to join this coalition aimed at countering Western economic dominance.",
      "They delve into the impacts of sanctions from the Trump and Biden administrations on Venezuela’s economy and migration crisis, and the battle over Citgo, a U.S.-based oil company acquired by the country in 1990.",
      "Grim also questions Venezuela’s human rights record.",
      "Transcript Ryan Grim: Welcome to Deconstructed, I’m Ryan Grim.",
      "At the end of July, Venezuelans will go to the polls to elect a new president, with Nicolás Maduro hoping for another six-year term.",
      "Venezuelan migration to the United States, meanwhile, has become a major issue in our own presidential campaign, as the Biden administration continues to slap sanctions on Venezuela and wreak havoc on its economy.",
      "Today, we’re joined by Venezuelan Foreign Minister Yván Gil Pinto, who was in New York for a debate at the United Nations on unilateral sanctions.",
      "He had just returned from a visit to China and Russia, where he met with leaders of what is known as the BRICS Alliance.",
      "BRICS, which is an intergovernmental coalition of more than 20 countries, stands for Brazil, Russia, India, China, South Africa.",
      "It’s an effort by Global South countries to build an economic power base strong enough to balance the West.",
      "With the U.S. showing little interest in cooperating with Venezuela, we talked at length about Venezuela’s bid to join BRICS, and his recent trip to China.",
      "All of this is happening while the U.S. is using its court system to seize the U.S. subsidiary of Venezuela’s energy company, Citgo.",
      "It’s quite an incredible story.",
      "The U.S. recognizes a Venezuelan government in exile, and is allowing that government — which isn’t really a government in any serious way — to basically give away a huge piece of Citgo.",
      "The irony is that the brazen move is shocking to the Venezuelan public, and even hawkish figures like Elliott Abrams — a Reagan and Trump official who previously tried to overthrow the Venezuelan government — said the timing of the attempted seizure is terrible, as it’s only helping Maduro in the polls.",
      "For the upcoming election, Venezuela is so far not allowing Western monitors to come in, and has kicked employees of the U.N. Human Rights Office out of the country, accusing them of facilitating coups.",
      "At the same time, it has invited BRICS countries to observe the elections.",
      "The result of all this aggressive U.S. policy is more migration at the southern border, higher gas prices for Americans, and economic misery for the Venezuelans who stay behind.",
      "We also discussed the nominal pretext for American sanctions, Venezuela’s human rights record which, you’ll notice, the minister was reluctant to discuss much in detail.",
      "Here’s our conversation, which was recorded inside the Venezuelan mission in New York.",
      "First of all, thank you so much for doing this interview.",
      "I very much appreciate it.",
      "Welcome to New York.",
      "Yván Gil Pinto: Thank you.",
      "RG: So, I want to start with your recent trip, both to China and the meeting regarding BRICS.",
      "First of all, at BRICS, how was Venezuela received there?",
      "What was the goal of that trip?",
      "YGP [via Interpreter]: So, prior to arriving to the U.N., we had visits, also, in Russia, China and Vietnam.",
      "In Russia, we were able to participate in the ministerial meeting of the BRICS.",
      "BRICS, for Venezuela, is very important, because it’s an emerging bloc that is about building a new world.",
      "In a world where we see that imperialism, neocolonialism, fascism’s attempts to destabilize the world, we see BRICS as an alternative against that aggression.",
      "That relationship, the new world is based on relationships of complementarity, of solidarity.",
      "Not in relationships of domination.",
      "So, we understand that BRICS is not a regional organization, or a bloc, as such, because of distance between the countries.",
      "But we see it as a unifying system that is based on common principles relating to commerce or to finance, and how relationships among countries should take.",
      "RG: Did you apply for membership?",
      "YGP [via Interpreter]: Yes, we applied for full membership to the BRICS.",
      "We have spoken to the 10 member countries.",
      "Because Venezuela has a role and a lot to contribute to that formation that is coming out of the BRICS.",
      "Not only because we have an important contribution in terms of resources — we have oil, minerals, gas — because that’s important, we are the first oil reserve in the world.",
      "I think it would be a very important contribution to the BRICS.",
      "About 40 percent of the world’s GDP is in BRICS, so having the largest oil reserve in the world is important for BRICS.",
      "But this alone wouldn’t make any sense if there was not a commitment of Venezuela to the principles of the BRICS.",
      "Venezuela’s contribution, then it would be more [in] the political area, that’s already an important contribution.",
      "Venezuela has been known for its contribution to international organizations such as Unazul, ALBA, CELAC.",
      "Venezuela is highly responsible, and a partner that is very reliable for BRICS.",
      "So, we will bring the resources that are very valuable, we have the commitment to the principles held by BRICS.",
      "We have experience in international organizations, and I think we could bring the in integration of different regional blocs, too, as a contribution to BRICS.",
      "Right now, only Brazil represents Latin America in BRICS.",
      "We hope that, soon, Venezuela can integrate.",
      "During this meeting in Russia, we met with the 10 member countries of BRICS, and we’ve talked about all these aspects in detail with them.",
      "And, at the level of ministers, I could say, we all share this vision in a very harmonic and coordinated way.",
      "So, Venezuela feels as [if it’s] part of the BRICS, now.",
      "RG: Does Brazil support Venezuela’s entry into BRICS?",
      "And do you expect that BRICS will allow Venezuela to join?",
      "When will you know?",
      "YGP [via Interpreter]: President Lula has said it publicly.",
      "The Brazilian support is unanimous [for] Venezuela [to] enter BRICS.",
      "We understand that in the recent visit that President Lula [made] to Colombia, there was also an invitation extended to Colombia to become part of BRICS.",
      "Venezuela has expressed its desire to participate in BRICS since 2000.",
      "We are working on this alternative with strength.",
      "It’s part of our government platform, our plan for the homeland.",
      "So, we have a lot of expectations on that.",
      "RG: And you visited China.",
      "Did you get any indication from China, whether China would support your bid to join BRICS?",
      "YGP [via Interpreter]: So, during our visit to China, not only were we able to discuss bilateral cooperation, which is very important, but we also received China’s support for Venezuela’s entry into BRICS.",
      "In September of 2023, president Maduro visited China and we signed an alliance, in what’s called an all-weather alliance with China; that is a comprehensive alliance in all aspects.",
      "And, in that alliance, Venezuela’s contribution to BRICS is also contemplated.",
      "So, China’s support is very strong for Venezuela.",
      "RG: Boris Johnson visited Venezuela in February, he brought a message from the United Kingdom.",
      "What was his message to Venezuela?",
      "What was the Venezuelan response?",
      "And how does that play into this conversation?",
      "YGP [via Interpreter]: I don’t really know about the contents of conversations that he held in Venezuela; at least not us, as the foreign ministry.",
      "We can say that, as foreign ministry, we had no contact with any former government official of the U.K.",
      "It was a non-official visit, so we have no information of the aspects that took place there.",
      "RG: When it comes to China and your visit there, was there anything you took away from the Chinese model that you think could be applied to Venezuela?",
      "China’s growth, obviously, has been explosive over the last couple of decades, whereas Venezuela’s has been the opposite.",
      "What elements of the Chinese model do you think are useful to Venezuela?",
      "YGP [via Interpreter]: With China, we have a relationship, it’s been important.",
      "This year will be the 50th anniversary of the China-Venezuela relations.",
      "So, we can say the first 25 years of our relationship with China, they were candid relations, but with not [many] advances.",
      "But then, the second 25 years after President Chávez came in into office have been a very intense cooperation of financing projects in Venezuela, and a lot of strong relations.",
      "The Chinese model is an admirable model.",
      "It’s a model that we can say has lifted about 800 million people out of poverty, and it’s a model that we respect.",
      "[It] has adapted to its own ideas, its own particularities, and it’s directed by the Chinese Communist Party, which has a lot of strength, and it has a robust leadership.",
      "The Venezuelan model is a model that we’ve also called “Venezuela’s socialism for the 21st century.” We’re building our own model, and we learned from different models.",
      "And, of course, from the Chinese model, we’ve also taken some ideas that are central.",
      "We are studying the model and the philosophy and the doctrine of the Chinese model but, in order to build our own model, with our own characteristics.",
      "It’s a model that has precedent which has defined it.",
      "It’s a model that also is also based on different doctrines around the world: the Chinese doctrine, the socialist doctrine, the Bolivarian Doctrine, all adapted to our conditions as a Latin American country, under our constitution that was approved by the majority of the people.",
      "So, that is to say, Venezuela has a very well-defined model.",
      "We have taken some items from the Chinese economic development model.",
      "For example, we’ve launched special economic interest zones, which China has a very deep experience in, and which are an example to the world.",
      "Those are ideas that we’re coordinating and learning from them.",
      "And other aspects, such as development of science, technology, agriculture.",
      "Those are aspects that we are starting, and trying to see how we can reach a level like theirs.",
      "RG: In the upcoming election, the Venezuelan economy has, the last three or four years, been growing at a pretty steady pace.",
      "But if you compare the standard of living to ten or fifteen years ago, Venezuelans are worse off today than they were then.",
      "Why is the government confident at all that Maduro will be returned to another term, given the collapse we’ve seen over the last decade?",
      "YGP [via Interpreter]: So, we’re going to an electoral process on July 28 where we are sure that the popular mandate of President Maduro will be legitimized.",
      "Today, all major polls clearly show the advantage that President Maduro has, and show the tendency to his victory.",
      "RG: Well, not all polls.",
      "YGP [via Interpreter]: The serious ones, yes.",
      "There’s an intent to build a public narrative that is different from reality.",
      "There’s no really serious poll that says something different.",
      "Reality is just one.",
      "There’s a wide condemnation in Venezuela to those people that asked for and requested sanctions against their own country.",
      "That doesn’t mean there’s not an opposition, there is an opposition to the government.",
      "That’s one thing.",
      "But that opposition is a majority, that’s completely false.",
      "The majority continues to be on the side of the Bolivarian revolution.",
      "There’s no doubt about that.",
      "That we can consult at any level.",
      "And we’re sure that that majority is what’s going to be reflected on that election on July 28.",
      "And that is mainly due to the rejection to those people in the opposition that have asked for sanctions and measures against Venezuela.",
      "But it’s also a sign of support for the successful policies of President Maduro during the last years.",
      "Since the year 2014, we have been victims of unilateral coerce of measures, or illegal sanctions.",
      "And this implied serious economic affectation to the country.",
      "We lost 99 percent of our income.",
      "From one year to the other, we passed from having $56 billion as income to $700 million.",
      "What country can withstand this aggression?",
      "We were able to withstand it because of the high revolutionary consciousness of the people.",
      "In the year 2013, Venezuela had the highest minimum wage in Latin America: around $400 per month, with an extraordinary level of standard of living created by the revolution.",
      "The sanctions made it possible that the salary, the minimum wage, would fall from $400 to a dollar a month.",
      "This implied that we had to do huge transformations of and in the economy and the economic model, and how we had to shape the economy for the rest of the country.",
      "And, after a few very difficult years, we started on a process of recovery.",
      "Today, the minimum income of a worker is about $130 a month.",
      "So, we went from $400 to $1, and now we’re back up to $130.",
      "And this, we’re doing it with all sanctions still in place.",
      "Which means this is a success, even within sanctions.",
      "This resistance shows that we’re going through the right path, and people are starting to feel that.",
      "Beyond that, I think the Venezuelan population understands very well who their enemy is.",
      "This ultra-right opposition in Venezuela is the same ultra-right opposition that caused all these damages to the country.",
      "Not only when they were in power before the 1998 revolution, but then, during the revolutionary times, they are the ones who have been asking for sanctions and aggressions against their country, and the population knows this very well.",
      "We’re taking part in the struggle because there’s always this intent of manipulating the political atmosphere.",
      "Today, the use of social media is very important as part of the electoral campaign.",
      "They create doubts, fake news, manipulated news.",
      "And they make believe that there are polls that favor them electorally, because the opposition is playing a game where they’re trying to make people believe that they are the majority; this particular opposition, the ultra-right opposition I’m talking about, because there are different types of opposition in Venezuela.",
      "I’m talking about the opposition that is backed by Washington.",
      "And their intent is to denounce a fraud, whether it happens or not.",
      "Venezuela’s electoral system is very strong, very robust.",
      "It’s impossible to have fraud.",
      "But the opposition has never recognized any electoral results, and they’re probably not going to do so, either, in this election, and they’re preparing the road for this.",
      "And we’re also prepared to defend the victory of President Maduro, with invitations to international alternatives, different political parties, different personalities, so they can come to Venezuela and observe what’s going on.",
      "But we are very confident of our victory, because of our successful policies implemented, a successful economic program, and the strength of our people.",
      "RG: So, Venezuela has joined South Africa’s case at the ICJ [International Court of Justice] against Israel for its attack on Gaza.",
      "But, at the same time, Venezuela’s recently kicked out the United Nations Human Rights Office.",
      "If you ask the United States, they say, we relieved some sanctions in 2023.",
      "And then, in April, we brought them back, because there were human rights abuses, and so on and so forth.",
      "So, why kick out the United Nations Human Rights [Office]?",
      "There were some other crackdowns on dissidents, both within Venezuela and outside of Venezuela; [like] Rocío San Miguel, a very high-profile human rights attorney.",
      "Does the United States have a case that there was backsliding on human rights?",
      "And why kick out the U.N. Human Rights agency?",
      "YGP [via Interpreter]: Unfortunately, Human Rights has been instrumentalized against the Bolivarian government, the Venezuelan government, in order to attack and revert the Bolivarian government.",
      "Venezuela has unbreakable commitment to human rights.",
      "Our generation was a victim of human rights violations.",
      "The Bolivarian revolution was actually born precisely after huge human rights violations.",
      "In the 1989 Caracazo Revolts, over 5,000 Venezuelans were assassinated or disappeared.",
      "All of our generation has either friends or relatives that were murdered or disappeared during those events.",
      "There’s no other case in Latin America of a relationship with human rights as Venezuela has.",
      "That means we have a very strong and high commitment to human rights.",
      "Despite them having been used against Venezuela, we have high cooperation with the U.N. High Commissioner’s office, because there has been an intent to create human rights violation cases where they don’t correspond.",
      "So, in order to counter that initiative, we talked to the High Commissioner’s office, and we set up an office of personnel of the High Commissioner’s office, in order to have activity in Caracas, so they could observe the process.",
      "They could go to the trials, to the courts, to visit the jails.",
      "And they had free access to all judicial and police institutions in Venezuela.",
      "They were there for five years.",
      "RG: With San Miguel, for instance, when she was arrested, her entire family was arrested as well.",
      "I think, when people in the United States hear that, they say, you arrest her, also her brothers, her relatives, her location is not disclosed for some time.",
      "It doesn’t feel like human rights are being respected, and it doesn’t feel like they’re being instrumentalized in that moment.",
      "TGP [via Interpreter]: I’ll say it again.",
      "The narrative that has been attempted to implement about Venezuela has been a false narrative.",
      "Our cooperation is absolute.",
      "We have [far fewer] problems in human rights than any country in the region.",
      "We know that, to advance human rights, we have to better train our judges, better train our police, to have a better system, so these things don’t occur.",
      "All cases of abuse or that denounce these abuses are attended to in Venezuela.",
      "As in any other place around the world, except for the United States.",
      "Here, human rights cases are not attended to.",
      "We tend to them, and when we’ve condemned cases as well.",
      "And, precisely, the collaboration with the office was destined to help in these cases.",
      "The problem is that the office was closed in Venezuela, due to the fact that they were doing political campaigning.",
      "We didn’t close cooperation with the office.",
      "We continue to work, continue to subscribe to the human rights agreements, and we have a constant daily interaction with the human rights offices.",
      "There are no countries that have offices of the high commissioner in their own territories.",
      "This was done in Venezuela precisely to show that human rights issues were being instrumentalized against Venezuela.",
      "But if you have human rights workers participating or taking part in other interests, that’s something that we cannot allow, because that’s precisely going against the protection of human rights.",
      "And any case of abuse in Venezuela is attended to under the law, and is sanctioned.",
      "In all exams, Venezuela has proven that there is no policy of human rights violation.",
      "Any other version is politicized.",
      "We have asked all observers of human rights to come to Venezuela at different times, but we are a country with dignity, we’re a sovereign country.",
      "The justice of Venezuela cannot be under tutelage.",
      "Venezuela is a signer of human rights treaties, it’s very well explained in our constitution.",
      "Venezuela respects human rights.",
      "And, like I said, any case of human rights abuses in Venezuela, they’re treated according to the law, as this should be.",
      "RG: Just one follow-up, real quickly.",
      "The case of San Miguel, does she have access to attorneys?",
      "What can we expect to hear from that?",
      "YGP [via Interpreter]: In the case of Rocío San Miguel, she has access to her lawyers.",
      "She has access to her family.",
      "They’ve tried to build a false narrative around this case.",
      "Rocío San Miguel is accused of terrorism actions, and she’ll have the opportunity to present her defense.",
      "That’s an issue for the justice [department].",
      "But the public prosecutor’s office has strong evidence.",
      "The prosecutor’s office is accusing her of having been involved in an attempt against the life of the president.",
      "But some of the participants have themselves admitted this publicly and, in the investigations by the prosecution, they found materials at her home that she was informed about the assassination attempt.",
      "So, from there, there’s a legal process to judge the case and have her sentenced, as anywhere else around the world.",
      "I mean, I would like to know what would happen anywhere else around the world — or here in the United States — if there was a journalist that was somehow informed about an attempted assassination attempt against the president?",
      "I’m sure their human rights here, they wouldn’t exist, like the human rights of the people that are detained at Guantanamo.",
      "And, in the case of this lady, she has a right to her trial, and to her defense.",
      "I’m not a judge or a prosecutor, but I can see that the evidence that exists is very strong.",
      "RG: Let me ask you about the case regarding Citgo.",
      "From your perspective, what is the latest on Citgo?",
      "What is Venezuela going to try to do to hold on to its assets?",
      "YGP [via Interpreter]: The Citgo case is a robbery.",
      "The government of the United States aligned with a group of Venezuelans who claimed to be the government of Venezuela.",
      "They basically began a process to steal the company.",
      "And, since then, there’s been a whole series of legal actions, that it’s amazing that these actions have been validated.",
      "Because they stem from a very illegal issue, that the government of Venezuela is not really the government of Venezuela.",
      "This doesn’t make any sense.",
      "So, anything that takes place after that is illegal.",
      "That government — the so-called government of Guaidó — they took advantage of actions and directives within Citgo, and now all of these actions are illegal.",
      "But also, they created the basis so that a trial against Citgo will take place.",
      "They basically did everything so that they would justify the courts taking illegal actions against the company.",
      "We should see how irrational this is.",
      "RG: The decision to steal, to take, to seize Citgo’s United States subsidiary is coming very soon.",
      "I’m sure you’ve seen Elliott Abrams — who himself has been involved in many coups throughout his career in South and Central America — recently said that it was stupid of the Biden administration to go forward at this moment, because it would inflame the Venezuelan public, and could help you in the elections.",
      "A backlash against the opposition — Which I found interesting, because it implied that there would be some actual voting and some real democracy, that public opinion could shift and be expressed at the ballot box, which is not typically what the United States says about Venezuelan elections.",
      "But I also found it rather interesting that he said, don’t do this now, do this immediately after the election.",
      "And so, does Venezuela have anything that it can do in this situation?",
      "Or are you just watching from the sidelines?",
      "YGP [via Interpreter]: Well, first of all, those statements made by those main actors that stole Citgo is a confession on their part.",
      "What else does public opinion need to know for it to see that it’s a robbery, and that it’s a robbery destined to hurt the Venezuelan people?",
      "The truth is, that opposition is extremely corrupt.",
      "And the truth is that that corrupt opposition was supported by Washington.",
      "They have been supported and they continue to be supported by Washington.",
      "That’s true, and we’ve seen it with this statement.",
      "Unfortunately, we have no access to the U.S. justice system, because we’re not allowed to.",
      "I mean, we’re not going to stop fighting for reestablishing the legality of what’s in Citgo, because there’s an administrative continuity in Venezuela.",
      "RG: And you have no access to the system, because you’re not recognized as the actual government of Venezuela.",
      "YGP [via Interpreter]: Exactly.",
      "For that same reason.",
      "We are being denied our right to defense.",
      "Because, again, everything around Citgo is built upon a false case, and that will be proven, sooner or later, in front of justice.",
      "Anything that happens to Citgo is illegal, and it’s important for all of those who today aspire to take the company away from us, that they must know that all this is illegal.",
      "Everything that is going on is illegal, and everything will have its consequences.",
      "It won’t die there.",
      "RG: What would you lose?",
      "A refinery in Texas?",
      "What else, what assets would be stolen if this goes through?",
      "And what would Venezuela retain?",
      "YGP [via Interpreter]: Well, right now, our struggle continues to be denouncing it in the first place.",
      "We have no other option.",
      "Beyond whatever our lawyers can do, the limited actions they can take within the U.S. system, we rely on international solidarity.",
      "And the first thing we have to do is to convince and prove around the world that the legitimate government of Venezuela is the government of President Maduro.",
      "And we also need to make the creditors understand that the best solution is to have a direct negotiation with the government of Venezuela.",
      "The path of selling off Citgo’s assets is jumping into the unknown, for the creditors.",
      "And what we are trying to do now is to denounce, and to tell the truth, and to alert, that any other creditors that think that selling off Citgo assets will be a solution, that that is the worst path.",
      "RG: If United States sanctions were lifted and if relations were normalized, what effect would that have on the outward migration from Venezuela?",
      "A huge number of people who are being encountered by U.S. Border Patrol at the southern border are Venezuelan.",
      "You recently stopped taking flights, in response to the reimplementation of sanctions.",
      "How much of that outflow do you think would stop, in the event of normal relations?",
      "YGP [via Interpreter]: So, the origin of the migration outflow in Venezuela, which is something that we didn’t really know until the sanctions policies were implemented, is precisely that.",
      "It began with the sanctions.",
      "From 1999 to 2017, we didn’t know the phenomenon of migration; if anything, we knew about a phenomenon of migration towards Venezuela.",
      "But it was when sanctions were taken against our economy that there began an outward flow of migrants, because it was a comprehensive attack against our economy and against our nation.",
      "Not only did it hurt our economy, but there were special conditions created to attract that migration.",
      "Migration was promoted from Washington during the years of 2017, ’18 and ’19.",
      "RG: Under the Trump administration?",
      "How so?",
      "YGP [via Interpreter]: Yes, under the Trump administration.",
      "RG: How did they attract?",
      "How did they incentivize?",
      "YGP [via Interpreter]: They created a special condition for those people to come into the United States, special protections for those migrants, different from conditions that existed for other migrants, like Colombians.",
      "Venezuelan migrants were treated in a special way.",
      "That was created from here, and that created a pole of attraction while, at the same time hurting our economy that stimulates people to come here.",
      "Those who created those conditions, they must assume their responsibility.",
      "A responsibility of hurting our economy, and of creating a migrant attraction towards the United States.",
      "That continues under the Biden era as well.",
      "And, today, that mistaken policy by the United States is what has generated the migrant problem here.",
      "And, in the way that the economic situation of Venezuela is improving, then that migration attraction is also decreasing.",
      "Today, the migration flux is actually negative.",
      "Right now we have more migrants coming back to Venezuela than leaving Venezuela.",
      "So, for every two migrants leaving Venezuela, three are coming back.",
      "So, the influx is now towards Venezuela.",
      "If all sanctions were lifted today, we would have an influx of migrants moving back to Venezuela.",
      "Because the majority of the Venezuelan population wants to live in Venezuela.",
      "They have conditions, they have a system that tends to them, they have social safety in Venezuela.",
      "They don’t have that here.",
      "Surely, there will be a part of immigration that will stay in the United States, because they already built their life in the United States.",
      "That generates another type of internal action, because the bipartisanship in the United States wants to benefit from the creation of an opinion group of Venezuelans inside the country, as happened with the Cubans.",
      "And there’s an interest in both parties to favor that type of migration, and to obtain a political profit from that migration.",
      "But the treatment of the migration issue by both Democrats and Republicans is highly hypocritical.",
      "They stimulated it, they live off it, and they use it to attack each other.",
      "So, that’s why we have created a social program that is called Return to the Homeland that President Maduro has created, so that people would come back to Venezuela.",
      "And I think we’re the only country in the world that has created a program to go and get the migrants, and voluntarily bring them back to the country.",
      "All those Venezuelans that want to voluntarily return to the country, we’re going to facilitate them to return.",
      "RG: What conversations are ongoing, if any, between Venezuelan officials and U.S. officials toward normalizing relations?",
      "Has there been any reaction to you traveling to the BRICS conference, to applying for membership?",
      "Does that bother the United States, have they been silent about that?",
      "And what’s the path forward here?",
      "YGP [via Interpreter]: So, negotiations with the United States are handled by the president of our National Assembly, Jorge Rodriguez.",
      "Conversations have always taken place, even during the worst moments.",
      "They’ve always been taking place.",
      "These are conversations, like you said, to normalize relations.",
      "Unfortunately, the United States has never complied with any of the agreements it has signed.",
      "But, despite that, we continue to talk.",
      "The foreign ministry is not part of the conversations.",
      "We haven’t received any contributions with regards to policies, because there’s no need to.",
      "RG: Well, thank you for your time.",
      "I appreciate you joining me.",
      "YGP [via Interpreter]: Thank you.",
      "RG: Deconstructed is a production of The Intercept.",
      "This episode was produced by Laura Flynn.",
      "It was recorded and mixed by William Stanton.",
      "Legal review by David Bralow, Shawn Musgrave, and Elizabeth Sanchez.",
      "Our theme music was composed by Bart Warshaw.",
      "And I’m Ryan Grim, D.C. Bureau Chief of The Intercept.",
      "If you’d like to support our work, go to theintercept.com/give.",
      "If you haven’t already, please subscribe to the show so you can hear it every week, and please go and leave us a rating or a review.",
      "It helps people find the show.",
      "Also, check out our other podcast, Intercepted.",
      "If you want to give us additional feedback, email us at podcasts@theintercept.com.",
      "Put “Deconstructed” in the subject line.",
      "Otherwise, we might miss your message.",
      "Thanks for listening, and we’ll see you soon.",
      "WAIT!",
      "BEFORE YOU GO on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?",
      "Consider what the world of media would look like without The Intercept.",
      "Who would hold party elites accountable to the values they proclaim to have?",
      "How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?",
      "The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable.",
      "The Intercept is an independent nonprofit news outlet.",
      "We don’t have ads, so we depend on our members to help us hold the powerful to account.",
      "Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month.",
      "That’s all it takes to support the journalism you rely on.",
      "IT’S EVEN WORSE THAN WE THOUGHT.",
      "What we’re seeing right now from Donald Trump is a full-on authoritarian takeover of the U.S. government.",
      "This is not hyperbole.",
      "Court orders are being ignored.",
      "MAGA loyalists have been put in charge of the military and federal law enforcement agencies.",
      "The Department of Government Efficiency has stripped Congress of its power of the purse.",
      "News outlets that challenge Trump have been banished or put under investigation.",
      "Yet far too many are still covering Trump’s assault on democracy like politics as usual, with flattering headlines describing Trump as “unconventional,” “testing the boundaries,” and “aggressively flexing power.” The Intercept has long covered authoritarian governments, billionaire oligarchs, and backsliding democracies around the world.",
      "We understand the challenge we face in Trump and the vital importance of press freedom in defending democracy.",
      "Israel’s War on Gaza Sam Biddle Internal Google documents show that the tech giant feared it wouldn’t be able to monitor how Israel might use its technology to harm Palestinians.",
      "Chilling Dissent Meghnad Bose, Anna Oakes After being threatened with losing their housing, several students who weren’t involved in the protests had their suspensions lifted.",
      "Israel’s War on Gaza Jonah Valdez A cargo flight will haul 14 tons of nitrocellulose from John F. Kennedy Airport in New York to an Israeli weapons manufacturer.",
      "This is not a paywall.",
      "By signing up, I agree to receive emails from The Intercept and to the Privacy Policy and Terms of Use."
    ],
    "topics": [
      "human rights",
      "via interpreter",
      "united states",
      "ygp via",
      "president maduro",
      "government venezuela",
      "around world",
      "new york",
      "chinese model",
      "san miguel"
    ]
  },
  {
    "title": "BRICS: South Africa says countries are clamoring to join the China and Russia-backed group",
    "source": "Cable News Network",
    "url": "https://edition.cnn.com/2024/02/01/china/brics-membership-applications-china-russia-intl-hnk/index.html",
    "publishedAt": "2024-02-01T05:00:00Z",
    "sentences": [
      "Follow: Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter which explores what you need to know about the country’s rise and how it impacts the world.",
      "Nearly three dozen countries are seeking entry into the China and Russia-backed BRICS economic group, member state South Africa said Wednesday, weeks after the body expanded its membership for the first time in more than a decade.",
      "Thirty-four countries have submitted an expression of interest in joining the bloc of major emerging economies, South African Foreign Minister Naledi Pandor told reporters, without naming the nations.",
      "Russia was accepting those applications after assuming rotating chairmanship of the group this year – and will be the first member to oversee the body since it significantly expanded its global footprint at the start of the year, when Iran, Saudi Arabia, the United Arab Emirates (UAE), Ethiopia, and Egypt formally joined.",
      "The growing membership is widely viewed as a win for China and Russia, which have sought to reshape an international system they see as unfairly dominated by the United States amid growing frictions with Washington and the West.",
      "BRICS, which since 2011 had been made up of Brazil, Russia, India, China and South Africa, roughly positions itself as the Global South’s answer to the Group of Seven (G7) major developed economies.",
      "China has been a key driver of its expansion as leader Xi Jinping pushes an alternative world order, forging closer partnerships with key global players from Russia to the Middle East and strengthening international bodies where Beijing holds sway.",
      "Related article China has a sweeping vision to reshape the world — and countries are listening The expansion and continued interest from dozens more countries are also a boon for Russia, which has been shunned economically and diplomatically by the West following its invasion of Ukraine.",
      "Moscow’s position as chair will be a key opportunity for Russian President Vladimir Putin to push back against that isolation and portray himself as a key player on a broad diplomatic stage, as world leaders typically travel to the host nation for an annual summit.",
      "Last year, all member state leaders besides Putin gathered in person in Johannesburg.",
      "The Russian president, who has an International Criminal Court warrant out for his arrest linked to alleged war crimes in Ukraine, participated virtually.",
      "This year’s event is expected to take place in October in the southwestern Russian city of Kazan.",
      "Earlier this year, Putin encouraged representatives “of all countries interested in cooperating with our organization” to take part in events and said Russia looked forward to “working productively with all countries in the BRICS orbit,” according to state-run news agency Tass.",
      "The group took shape as a summit-level gathering between Brazil, Russia, India and China in 2009 and expanded to include South Africa two years later.",
      "Six new BRICS countries were invited during the 2023 summit last August.",
      "Among those invited only Argentina declined to join, following the election of a new far-right administration.",
      "The expansion adds the muscle of major oil-producing Gulf economies to the body and comes as both Russia and China have bolstered their relationships with sanctions-hit Iran.",
      "Last year, Beijing played a part brokering the restoration of ties between longtime rivals Saudi Arabia and Iran.",
      "The new cohort of countries join as BRICS pushes toward more diplomatic and financial coordination, including reform of the United Nations Security Council and a move away from a US dollar-dominated trade system.",
      "Finance ministers were working to develop the use of local currencies for payments between member states and international payment platforms to “redress what we regard as a rather unfair and costly payment system,” South Africa’s Pandor said Wednesday.",
      "CNN’s Zahid Mahmood in London contributed reporting."
    ],
    "topics": [
      "south africa",
      "member state",
      "said wednesday",
      "saudi arabia",
      "brazil russia",
      "russia india",
      "india china",
      "russian president",
      "summit last",
      "last year"
    ]
  },
  {
    "title": "The rich keep getting richer in China and Russia",
    "source": "Quartz India",
    "url": "https://qz.com/china-russia-millionaires-private-wealth-brics-1851209299",
    "publishedAt": "2024-01-30T20:48:00Z",
    "sentences": [
      "The bloc of non-G7 nations known as the BRICS now has a total investable wealth of $45 trillion, and its population of millionaires will skyrocket in the coming years.",
      "This alliance’s economic power has been bolstered by the addition of new oil-rich members: Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates (UAE).",
      "The group’s name derives from an acronym of its founding members, Brazil, Russia, India, China, and South Africa.",
      "Collectively, the BRICS now represent nearly 36% of global GDP when adjusted for purchasing power parity, versus the G7’s 30%.",
      "That’s according to a new report by Henley & Partners, a firm that specializes in helping clients gain residence and citizenship through investment.",
      "These 10 countries also share a total of 1.69 million millionaires, some 4,000 centi-millionaires, and 549 billionaires, according to the report.",
      "By comparison, the US is the nation with the highest number of millionaires, at 22 million.",
      "Henley & Partners forecasts that the BRICS’ millionaire population could grow by 85% over the next decade.",
      "Among those nations, China is home to the most millionaires, at 862,400, including 2,352 centi-millionaires and 305 billionaires.",
      "During the past 10 years, the country’s private wealth grew 92%.",
      "Henley & Partners estimates that China’s per capita wealth could swell by 85% in the next decade.",
      "India takes second place, with 326,400 millionaires.",
      "The UAE finishes third, with 116,500.",
      "By contrast, Russia has seen private wealth decline 24% since 2013, but the report projects that its per capita wealth will make up that loss in the next decade.",
      "Supporting this forecast, the International Monetary Fund recently updated its outlook for Russian GDP growth in 2024 to 2.6%, from 1.1% in October, partly thanks to high military spending on its war with Ukraine.",
      "Our free, fast, and fun briefing on the global economy, delivered every weekday morning."
    ],
    "topics": [
      "henley partners",
      "next decade",
      "85 next",
      "private wealth",
      "per capita",
      "capita wealth",
      "bloc nations",
      "nations known",
      "known brics",
      "brics total"
    ]
  },
  {
    "title": "BRICS is becoming an increasingly attractive choice in the Global South",
    "source": "The Hill",
    "url": "https://thehill.com/opinion/international/4413965-brics-is-becoming-an-increasingly-attractive-choice-in-the-global-south/",
    "publishedAt": "2024-01-18T20:30:00Z",
    "sentences": [
      "The turn of the year is a time of reflections, resolutions and transformations.",
      "These apply not just to individuals but to nations and their foreign affairs.",
      "The expansion of BRICS — Brazil, Russia, India, China and South Africa’s economic coalition — is one such transition.",
      "The new year has come with new alliances.",
      "On Jan. 1, Saudi Arabia, the United Arab Emirates, Iran, Egypt and Ethiopia were added to the grouping.",
      "Argentina, which was invited to join the grouping under the recently elected President Javier Milei, withdrew its application.",
      "Nonetheless, the addition of five nations is a significant development in light of more than 60 countries attending BRICS’s August summit — a clear sign it is transforming into an association representing the nations of the Global South.",
      "Over the last few years, there has been a large void in global leadership.",
      "The rise of populism in the Western world, coupled with America’s aversion to multilateral free trade agreements since the Trump years, has created a notable absence in the economic and the broader global leadership spheres.",
      "While China continues to make inroads in critical technologies and its economic clout remains formidable, nations are not wholeheartedly jumping on its bandwagon to replace the U.S. as the leader of the world.",
      "The world’s transition from bilateral to unilateral global relations after the collapse of the Soviet Union is finally coming to an end.",
      "However, it is not a return to bilateral competition as many analysts in Washington insist.",
      "There’s a trust deficit among nations of the Global South in any one nation to take the lead or represent its interests.",
      "This has created an environment wherein multiple regional powers represent their national, and occasionally regional, interests.",
      "The lack of leadership, coupled with the increased representation of voices from nations across the Global South thanks to social media, has made nations at the bottom of the proverbial pyramid patently aware of the shifting world order.",
      "Regional powers stepping up to deliver public goods and voicing popular local views on international platforms have substantiated the realization.",
      "The COVID-19 pandemic was one such issue.",
      "Nations big and small were caught off guard in the scramble to access the required human capital and resources such as masks, personal protective equipment and oxygen cylinders, in addition to much-needed medicines.",
      "Leaders of Russia, China and India were quick to deliver vaccines and medical supplies to nations of the Global South, while many Western governments had largely restricted the export.",
      "Subsequently, the Western world rushing to support Ukraine both militarily and economically in response to Russia’s invasion sheds light on its priorities.",
      "The perceived partiality toward nations in Europe versus those in Sub-Saharan Africa or the Middle East has reignited sentiments from the colonial era and tightened bonds among the victims of Western imperialism.",
      "A case in point is South Africa’s recent move to file a complaint against the Israeli government at the International Criminal Court for its actions in Gaza in response to the Oct. 7 attacks.",
      "Furthermore, what is perceived as an act of aggression worthy of condemnation in the Global South is not necessarily validated in the Western world and vice versa.",
      "The Israel-Gaza conflict and the Russia-Ukraine war are examples of these irreconcilable differences.",
      "Voting patterns at the United Nations suggest a stark difference in attitudes regarding the conflicts.",
      "Another difference is the asymmetry in intervention in domestic politics.",
      "Until the 2016 elections, talk of foreign interference in American domestic politics was largely unheard of.",
      "However, the same cannot be said of the world’s southern nations.",
      "From Saudi Arabia to China to India, nations of the south have unanimously opposed such interventions.",
      "That said, countries in the Global South or even in the BRICS are not without differences and disputes.",
      "China and India continue to clash at their borders.",
      "While Iran and Saudi Arabia have made inroads in their peace talks with the help of Beijing, the historical dispute persists.",
      "Nonetheless, China is listening to India’s yearning for change, as witnessed by a recent article in China’s state-controlled Global Times in support of its “Atmanirbhar Bharat,” or “self-reliant India,” initiative.",
      "India, for its part, in the words of its external affairs minister, champions a policy of “maximum goodwill and minimum adversaries,” keeping doors open for talks with adversarial nations.",
      "The BRICS grouping is, above all, a movement for self-determination on the global stage.",
      "The Western world’s messages about its values — evangelism that often comes with a patronizing tone, reeking of moral superiority — do not resonate with nations trying to break from the proverbial shackles of the past.",
      "There has been ridicule and mockery of the BRICS by some in the West, including quips about the acronym with new nations joining the grouping.",
      "It may not have a catchy name yet, but analysts should be taking note of the group transforming into a body representing an increasingly large portion of the Global South.",
      "Based on recent events, the chances of the group transforming into a formal association short of an alliance are significantly higher than when the BRICS was conceived.",
      "Akhil Ramesh is the director of the India Program and Economic Statecraft Initiative at Pacific Forum.",
      "Follow him on Twitter: Akhil_oldsoul.",
      "Copyright 2025 Nexstar Media Inc. All rights reserved.",
      "This material may not be published, broadcast, rewritten, or redistributed.",
      "By clicking Next, I agree to the Terms of Use and Privacy Policy."
    ],
    "topics": [
      "global south",
      "western world",
      "saudi arabia",
      "nations global",
      "china india",
      "south africa",
      "global leadership",
      "regional powers",
      "domestic politics",
      "group transforming"
    ]
  },
  {
    "title": "Ignoring BRICS Expansion Threatens America's Economic Security | Opinion",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/ignoring-brics-expansion-threatens-americas-economic-security-opinion-1859634",
    "publishedAt": "2024-01-12T11:00:01Z",
    "sentences": [
      "Advocates for ideas and draws conclusions based on the interpretation of facts and data.",
      "Newsweek AI is in beta.",
      "Translations may contain inaccuracies—please refer to the original content.",
      "🎙️ Voice is AI-generated.",
      "Inconsistencies may occur.",
      "January 1, 2024, saw the significant expansion of a major threat to America's financial security.",
      "Curiously, the event passed largely without comment from the Biden administration.",
      "The trigger for this potential economic time bomb is the BRICS+, an alliance of nations that could soon seek to replace the U.S. dollar as the world's reserve currency.",
      "Its success would mean a lower quality of life for all Americans.",
      "The original BRICS was named after an agreement between Brazil, Russia, India, China, and South Africa to develop a multinational financial institution that would act as an alternative to the International Monetary Fund.",
      "Meeting at annual summits since 2011, the group quickly set out to recruit new members in order to advance its real goal: overturning U.S. dominance of the global financial system.",
      "On New Year's Day the group added Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates to its ranks.",
      "(It's notable that Argentina, previously set to join, rescinded its membership after the election of new pro-American President Javier Milei).",
      "By some estimates the BRICS+ countries account for 45 percent of world population, 33 percent of global GDP, and 40 percent of world oil production.",
      "The oil production is crucial, since the BRICS+ wants to be able to purchase and sell oil in its preferred currencies instead of in dollars, as has historically been the case.",
      "The reason is simple.",
      "Oil is the most important of all commodities, and like other commodities (such as gold, wheat, and other currencies) global buyers both price and buy it in dollars.",
      "This gives the U.S. what has been described as an \"exorbitant privilege\"; since the U.S. is the sole producer of dollars, it can in effect \"print\" commodities.",
      "The privilege also makes it easier for America to sustain its perennial massive deficits, as well as place restrictions on the ability of other nations to use dollars, as it routinely does through economic sanctions and restrictions on access to the U.S. banking system.",
      "The BRICS+, led by China and Russia, may seek to remove the critical role of the dollar in global finance to weaken America.",
      "But the Biden administration seems singularly unconcerned.",
      "This past summer National Security Advisor Jake Sullivan stated \"we are not looking at the BRICS as evolving into some kind of geopolitical rival to the United States or anyone else,\" and Treasury Secretary Janet Yellen told Congress that attempts to move away from the dollar are merely a \"natural desire to diversify.\"",
      "These views are dangerously misguided; there is no reason for hostile nations to develop an alternative to the dollar other than to undermine the U.S.",
      "The BRICS+ may create an alternative financial world in which member countries' individual currencies, or one they jointly create, will replace the dollar as the global financial standard.",
      "If that were to happen the dollar would drop in value, leading to increasing interest rates and higher prices.",
      "It would also make it more difficult to service our national debt, which currently stands at more than $34 trillion.",
      "Interest payments on the debt are already on track to consume more of the federal budget than we spend on defense.",
      "Having to pay more in interest, an inevitable outcome of a devalued dollar, could launch federal spending into an unsustainable feedback loop of more borrowing to pay for higher interest to pay for more borrowing, on and on until default becomes a real possibility.",
      "Unfortunately, not enough attention is being paid to this evolving disaster.",
      "Just as Russia, China, Iran, and other hostile nations are increasingly cooperating to advance their military goals, they are also working together to destroy America's economic advantages.",
      "Their success is to the detriment of those parts of the world that believe in a market-oriented, rules-based, dollar-supported economic system.",
      "There are numerous steps Washington can take to reduce the danger, such as shrinking the federal debt, encouraging domestic energy production, and discouraging other nations from joining the BRICS+.",
      "But first the administration needs to demonstrate that it recognizes the threat, and takes it seriously.",
      "Failure to deal with the BRICS+ now makes it more difficult to maintain the dollar's status and puts the prosperity of future generations of Americans at risk.",
      "Gregory Zerzan was Deputy Assistant Secretary of the U.S. Treasury under President George W. Bush.",
      "The views expressed in this article are the writer's own."
    ],
    "topics": [
      "biden administration",
      "replace dollar",
      "global financial",
      "percent world",
      "oil production",
      "dollar global",
      "hostile nations",
      "advocates ideas",
      "ideas draws",
      "draws conclusions"
    ]
  },
  {
    "title": "BRICS-Led Effort Against Greenback Should Alarm the US",
    "source": "Business Insider",
    "url": "https://markets.businessinsider.com/news/currencies/dedollarization-dollar-dominance-new-brics-china-yuan-currency-sanctions-debt-2023-12",
    "publishedAt": "2023-12-17T05:00:00Z",
    "sentences": [
      "The recent expansion of BRICS should be a key cause of concern for the US, as new members along with countries who want to join could amplify dedollarization, according to a former State Department official.",
      "Writing for the Atlantic Council, Thomas Hill noted that Egypt, among others, was added to the BRICS club while Algeria and Tunisia were turned down.",
      "And it foreshadows how North African countries may become some of the \"most aggressive advocates\" for de-dollarization, he warned.",
      "\"The BRICS-led dedollarization effort should alarm US policymakers, especially in light of the recent BRICS membership expansion,\" wrote Hill, who is currently the director for the North Africa Program at the US Institute of Peace.",
      "\"It is clear that traditional US allies, such as Egypt, Saudi Arabia, and the UAE, are already exploring ways to dedollarize, and that Beijing is helping that process move forward.\"",
      "This year, the economic bloc — originally composed of Brazil, Russia, India, China, and South Africa — has touted plans to take on the greenback's dominance in the global financial system.",
      "While BRICS' attempts to replace the dollar's hegemony have had limited impact so far, the coalition also elected to admit six new states in August, creating an opportunity for greater global coordination, Hill explained.",
      "He added that they will provide BRICS with access to fresh trade affiliations that can promote alternative currencies.",
      "\"By including Egypt, BRICS can influence Algerian and Tunisian de-dollarization through Egyptian leadership inside existing trade regimes.",
      "Through Egypt, the UAE, and Saudi Arabia, BRICS will have expanded access to the Greater Arab Free Trade Area (GAFTA) and the Common Market for Eastern and Southern Africa,\" Hill wrote.",
      "\"Collectively, the expanded BRICS network via these trade organization connections now eclipses 90 countries.\"",
      "Signs of change are showing.",
      "In October, Egypt issued yuan-denominated panda bonds to help pay its debt, while the Bank of Russia now includes the Egyptian pound among currencies used to set ruble exchange rates.",
      "Elsewhere, a joint effort between China, Hong Kong, Thailand, and the UAE looks to develop a digital currency platform that will create a digital yuan for cross-border payments, Hill said.",
      "Even a partial weaning off the greenback will likely weaken incentives to stick to the SWIFT finance mechanism, an international banking network that has been used by the US to apply sanctions.",
      "Global coordination against the dollar would also impact US fiscal health, limiting the country's ability to run large federal deficits and keep debt costs grounded, Hill said.",
      "\"For US policymakers, the BRICS de-dollarization effort should cause concern,\" he said, adding that the federal government needs an interagency process with backing from lawmakers."
    ],
    "topics": [
      "cause concern",
      "us policymakers",
      "saudi arabia",
      "global coordination",
      "hill said",
      "recent expansion",
      "expansion brics",
      "brics key",
      "key cause",
      "concern us"
    ]
  },
  {
    "title": "Russia and China big participants at Dubai Airshow",
    "source": "Al-Monitor",
    "url": "https://www.al-monitor.com/originals/2023/11/russia-and-china-big-participants-dubai-airshow",
    "publishedAt": "2023-11-16T15:58:45Z",
    "sentences": [
      "OR Create an account for a 7-day trial to access this article and all of AL-Monitor.",
      "AL-Monitor is an award-winning media outlet covering the Middle East, valued for its independence, diversity and analysis.",
      "It is read widely by US, international and Middle East decision makers at the highest levels, as well as by media, thought and business leaders and academia.",
      "By becoming an Al-Monitor subscriber, you drive our team’s rigorous and independent journalism spanning the Middle East."
    ],
    "topics": [
      "middle east",
      "create account",
      "account trial",
      "trial access",
      "access article",
      "article media",
      "media outlet",
      "outlet covering",
      "covering middle",
      "east valued"
    ]
  },
  {
    "title": "BRICS Could Swing 'Economic Wrecking Ball' at the Dollar",
    "source": "Business Insider",
    "url": "https://markets.businessinsider.com/news/currencies/dedollarization-brics-currency-wars-dollar-international-trade-central-bank-reserves-2023-11",
    "publishedAt": "2023-11-03T04:00:00Z",
    "sentences": [
      "The dollar could face a growing challenge from BRICS countries, thanks to the bloc's growing size and influence over global trade, according to former White House economist Joe Sullivan.",
      "In a recent op-ed for Foreign Policy, Sullivan pointed to mounting fears that BRICS nations could create a currency to rival the US dollar in international trade.",
      "Such a currency could potentially topple the dollar from its perch atop global trade markets and as the dominant reserve currency.",
      "Though BRICS officials have said there is no such rival currency in the works, the bloc of emerging market countries— which recently extended invites to Argentina, Egypt,Ethiopia, Iran, Saudi Arabia, and United Arab Emirates—could pose a threat to the greenback based on its growing influence, Sullivan warned.",
      "The addition of Egypt, Ethiopia, and Saudi Arabia could give BRICS influence over 12% of all global trade.",
      "That's because those three countries surround the Suez Canal, a key passage for goods to flow into international markets.",
      "Sullivan noted the bloc also has major sway in commodities markets.",
      "Saudi Arabia, Iran, and the United Arab Emirates are among the world's top exporters of fossil fuels.",
      "Brazil, China, and Russia, meanwhile, are major exporters of precious metals.",
      "The addition of Saudi Arabia in particular could give BRICS+ a major advantage.",
      "The Middle Eastern nation owns over $100 billion in US Treasury bonds, which has helped bring BRICS' total holdings in US Treasurys over $1 trillion, Sullivan said.",
      "\"The BRICS+ nations do not need to wait until a shared trade currency meets the technical conditions typical of global reserve currency before they swing their newly enlarged economic wrecking ball at the dollar,\" he added.",
      "Sullivan pointed to China's yuan, which is edging out other global currencies in trade as Beijing's trading partners ramp up their use of the renminbi.",
      "Eventually, those trends could help put the greenback in a similar position as the British pound, Sullivan warned, which slipped from international dominance in the 1800s.",
      "\"The BRICS+ states do not even necessarily need to have a shared trade currency to chip away at King Dollar's domain.",
      "If BRICS+ demanded that you pay each member in its own national currency in order to trade with any of them, the dollar's role in the world economy would go down.",
      "There would not be a clear replacement for the dollar as a global reserve.",
      "A variety of currencies would gain in importance,\" he said.",
      "Other economists argue though that the dollar's role as the world's top trading and reserve currency will likely continue for a long time.",
      "The greenback still beats rival currencies in international trade and central bank reserves by a wide margin, data from the Bank of International Settlements and International Monetary Fund show, with the yuan only making small gains recently in central banks' coffers.",
      "This story was originally published in November 2023."
    ],
    "topics": [
      "saudi arabia",
      "global trade",
      "trade currency",
      "reserve currency",
      "sullivan pointed",
      "international trade",
      "egypt ethiopia",
      "united arab",
      "sullivan warned",
      "could give"
    ]
  },
  {
    "title": "What 6 New Potential BRICS Members Have Said",
    "source": "Business Insider",
    "url": "https://markets.businessinsider.com/news/currencies/dollarization-brics-saudi-arabia-argentina-egypt-ethiopia-iran-uae-2023-9",
    "publishedAt": "2023-09-24T04:00:00Z",
    "sentences": [
      "The BRICS group of emerging nations may have wrapped up its annual summit with no common currency last month and members issuing contradictory commentary about the greenback — but it doesn't mean its drive to de-dollarize is over.",
      "The bloc is anchored by Brazil, Russia, India, China, and South Africa.",
      "It has invited six countries to join the alliance, which hopes to upset the dollar's dominance and become an alternative to the dominant Western world order.",
      "BRICS's newly invited members are Iran, the United Arab Emirates, Egypt, Argentina, Saudi Arabia, and Ethiopia.",
      "Iran, which has been heavily sanctioned by the US, has been the most vocal about transacting in non-dollar currencies, while the others have taken various positions about alternatives to the greenback.",
      "The inclusion of major energy exporters such as Saudi Arabia, Iran, and the UAE on the list of potential BRICS members is a big deal because energy commodities — which are typically denominated in US dollars — are heavily traded and a key component of the global economy.",
      "Therefore, any move by these energy exporters to trade in non-dollar currencies could gain momentum in the broader economy.",
      "\"Together with fellow oil and gas exporters Iran and the UAE, the admission of Saudi Arabia to the BRICS grouping will inevitably focus the debate on the use of non-dollar currencies in trade,\" wrote analysts at the Dutch bank ING in an August 24 note, referring to the ongoing debate over de-dollarization.",
      "Here's what the six new potential members have signaled about the move away from the dollar.",
      "Iran — a major oil producer — has been on a drive to de-dollarize for years.",
      "Tehran made a major push to de-dollarize in a May meeting with 11 other countries including India, Russia, and Sri Lanka.",
      "Given that Iran has been sanctioned for years, the Middle Eastern country has been discussing using the yuan to settle trade as far back as 2010.",
      "In 2012, China started buying crude oil from Iran using the yuan.",
      "In February, Tehran and Beijing discussed increasing the use of the yuan and the Iranian rial for bilateral trade, per the Financial Tribune, an Iranian media outlet.",
      "Iran also linked up with Russia's payment system, the System for Transfer of Financial Messages, in February, Al Jazeera reported.",
      "Tehran has also called on India to conduct bilateral trade in local currencies — specifically in the Iranian rial and the Indian rupee, Iran's Tasnim News Agency reported in May.",
      "The UAE doesn't appear to have made a public declaration on moving away from US-dollar trade — but its actions indicate otherwise.",
      "In February, top Indian oil refiners were buying Russian crude with the dirham, UAE's currency.",
      "In August, India's top oil refiner used Indian rupees to settle an oil trade with the UAE's state-owned Abu Dhabi National Oil Company.",
      "\"The UAE has long deployed a multi-alignment strategy,\" wrote Kristian Alexander and Gina Bou Serhal, from Trends Research and Advisory in Dubai, on September 13, referring to the UAE's foreign-policy stance.",
      "\"By joining the bloc, the UAE signaled that it wants to move away from overreliance on Western partnerships and play a more prominent role in shaping the global order,\" they wrote.",
      "Like Argentina, Egypt has been suffering from a shortage of greenbacks since 2022, when the US Federal Reserve started hiking interest rates, which boosted the dollar's strength.",
      "The Egyptian pound has also lost about 50% of its value since March 2022, when the Fed started its rate-hike cycle.",
      "This makes dollar-denominated imports into Egypt more expensive.",
      "In April, Ali Moselhi, the Egyptian minister of supply and internal trade, said the country was \"very, very, very strongly\" considering paying for its commodity imports in non-dollar currencies, reported Saudi Arabia's Al Arabiya news outlet.",
      "Moselhi said Egypt was discussing using the Chinese yuan, Indian rupee, or Russian ruble to pay for its imports but has not reached a deal yet with any of the countries.",
      "Egypt has already started issuing Japanese yen-denominated bonds earlier this year and is planning to issue Chinese yuan-denominated bonds soon as well.",
      "Argentina appears to be of two minds about de-dollarizing its economy.",
      "The South American country has already started moving away from the US dollar for some transactions — mainly because the country's economy has run very short on the greenback.",
      "The option it has turned to recently is the Chinese yuan.",
      "In April, Sergio Massa, the Argentinian economy minister, said the country would start to pay for imports from China in the yuan instead of US dollars.",
      "Two months later, in June, Argentina's central bank said it was allowing commercial banks to open deposit accounts in the Chinese yuan.",
      "However, Argentinians have been hoarding the dollar for years to hedge against the volatile peso, so it's hard to envision the country completely de-dollarizing.",
      "Javier Milei, the front-runner in Argentina's presidential election, has proposed replacing the peso with the dollar amid a massive slide in the local currency against the greenback.",
      "The peso has halved against the dollar so far this year.",
      "The most high-profile of the newly invited BRICS members is Saudi Arabia, an oil-exporting giant and the de facto leader of the Organization of the Petroleum Exporting Countries cartel.",
      "The kingdom's potential entry into the BRICS bloc is a surprise since it's in a strategic partnership with the US and has an agreement to price oil exclusively in the greenback.",
      "But the energy kingpin has signaled earlier this year it is open to trading in other currencies.",
      "\"There are no issues with discussing how we settle our trade arrangements, whether it is in the US dollar, whether it is the euro, whether it is the Saudi riyal,\" Mohammed Al-Jadaan, the kingdom's finance minister, told Bloomberg TV in January.",
      "\"I don't think we are waving away or ruling out any discussion that will help improve the trade around the world,\" Al-Jadaan told the news outlet.",
      "However, Saudi Arabia hasn't started pricing its prized oil exports in non-dollar currencies yet and hasn't accepted BRICS's invitation to join the bloc so far.",
      "A civil war broke out in Ethiopia in late 2020, further destabilizing the African country's economy, which was already reeling from COVID-19-wrecked supply chains and a drought.",
      "Ethiopia's civil war ended in 2022, but like Argentina and Egypt, it continues to face economic uncertainties and is experiencing a foreign-currency shortage.",
      "Ethiopia doesn't appear to have publicly said anything about moving away from US dollar-dominated trade.",
      "The country's bid for membership seemed to have stemmed from a desire for an alternative world order.",
      "The Ethiopian prime minister, Abiy Ahmed, tweeted on August 24 that BRICS endorsement of the country's membership was a \"great moment\" for the country.",
      "\"Ethiopia stands ready to cooperate with all for an inclusive and prosperous global order,\" he tweeted."
    ],
    "topics": [
      "saudi arabia",
      "moving away",
      "chinese yuan",
      "world order",
      "newly invited",
      "energy exporters",
      "iran uae",
      "brics members",
      "us dollars",
      "august 24"
    ]
  },
  {
    "title": "Gold-Backed BRICS Currency 'Makes No Sense': Market Guru",
    "source": "Business Insider",
    "url": "https://markets.businessinsider.com/news/currencies/dedollarization-gold-backed-brics-currency-makes-no-sense-david-woo-2023-9",
    "publishedAt": "2023-09-13T04:00:00Z",
    "sentences": [
      "The idea of a common currency for the BRICS nations that's backed by gold \"makes no sense whatsoever,\" said strategist David Woo.",
      "The group of major emerging economies have called for ways to end the dollar's dominance as the world's premier reserve currency, and some think gold reserves could be used to back a new note.",
      "However, that approach would mean the new currency tracks the price of gold rather than the BRICS' individual currencies, according to the former head of global interest rates, foreign exchange, and emerging market fixed income strategy and economic research at Bank of America.",
      "\"In any event, we have to ask what exactly the BRICS would accomplish by creating what would be essentially just another gold derivative?\"",
      "Woo said in a video on his Youtube channel.",
      "He pointed out that gold reserves were finite, and the more gold China used to prop up the new exchange, the less it would have to back its own currency – the renminbi.",
      "\"If you think having more gold backing a currency makes it stronger, then the more gold China allocates to the BRICS currency means there is less gold backing the RMB which, if we follow this logic, means a weaker RMB,\" he added.",
      "\"The bottom line: the BRICS can create a currency backed by gold, but its purpose would be purely symbolic.\"",
      "In recent months, China and several other countries have stepped up efforts to reduce their reliance on the greenback in international trade and investments – especially with the US leveraging the dollar's global supremacy to impose economic and financial sanctions on countries including Russia and Iran.",
      "The BRICS group – Brazil, Russia, India, China, and South Africa — has been accelerating efforts to dedollarize, and Brazilian President Luiz Inácio Lula da Silva has called for a common trading note.",
      "Even the idea of a BRICS currency was labelled \"just ridiculous\" by Jim O'Neill, the economist who first coined the BRICS acronym, last month.",
      "The broader dedollarization movement is struggling to gain momentum.",
      "SWIFT payments involving the US dollar rose to a record 46% in July, Bloomberg reported.",
      "Get the latest Gold price here."
    ],
    "topics": [
      "backed gold",
      "think gold",
      "gold reserves",
      "gold china",
      "gold backing",
      "brics currency",
      "idea common",
      "common currency",
      "currency brics",
      "brics nations"
    ]
  }
]