[
    {
        "title": "Trump unveils design of $273 billion Golden Dome shield to protect US from Russia and China",
        "description": "Elon Musk’s SpaceX has emerged as a frontrunner to build key components of the system.",
        "content": "US President Donald Trump has selected a design for the Golden Dome missile defence shield and has named a Space Force general to head the ambitious program aimed at blocking threats from China and Russia.\nTrump announced on Tuesday at a White House ... [3207 chars]",
        "url": "https://7news.com.au/news/trump-announces-golden-dome-us-defence-shield-design-c-18759861",
        "image": "https://images.7news.com.au/publication/C-18759861/42b1d9d58f7d8ac6188a096cb62bed579648362b-16x9-x0y0w1280h720.png?imwidth=1200",
        "publishedAt": "2025-05-20T22:34:31Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "US President Donald Trump has selected a design for the Golden Dome missile defence shield and has named a Space Force general to head the ambitious program aimed at blocking threats from China and Russia.\n\nTrump announced on Tuesday at a White House press conference that US Space Force General Michael Guetlein would be the lead program manager for what the president said would be a $US175 billion ($A273 billion) project, an effort widely viewed as the keystone to Trump’s military planning.\n\nGolden Dome will “protect our homeland”, Trump said from the Oval Office and added that Canada had said it wanted to be part of it. The office of Prime Minister Mark Carney was not immediately available for comment.\n\nKnow the news with the 7NEWS app: Download today\n\nFirst ordered by Trump in January, Golden Dome aims to create a network of satellites to detect, track and potentially intercept incoming missiles. The shield could deploy hundreds of satellites for missile detection and tracking.\n\nAt a cost of $US175 billion ($A273 billion), it will take years to implement, as the controversial program faces both political scrutiny and funding uncertainty.\n\nDemocratic lawmakers have voiced concern about the procurement process and the involvement of Trump ally Elon Musk’s SpaceX, which has emerged as a frontrunner alongside Palantir and Anduril to build key components of the system.\n\n“The new autonomous space-age defence ecosystem is more about Silicon Valley than it is about ‘big metal,’” Senator Kevin Cramer of North Dakota said at the White House event.\n\n“So what’s exciting about this is it makes it available to everybody to participate - to compete.”\n\n“Big metal” refers to legacy defence contractors.\n\nThe Golden Dome idea was inspired by Israel’s land-based Iron Dome defence shield that protects it from missiles and rockets. Trump’s Golden Dome is much more extensive and includes a massive array of surveillance satellites and a separate fleet of attacking satellites that would shoot down offensive missiles soon after lift-off.\n\nTuesday’s announcement kicks off the Pentagon’s effort to test and ultimately buy the missiles, systems, sensors and satellites that will make up the Golden Dome.\n\nTrump, who said the project would be completed by the end of his term in January 2029, said Alaska will be a big part of the program and named Florida, Georgia and Indiana as also benefiting from the project.\n\nMany of the early systems are expected to come from existing production lines. Attendees at the press conference named L3Harris Technologies, Lockheed Martin and RTX Corp as potential contractors for the massive project.\n\nL3 has invested $US150 million ($A234 million) in building out its new facility in Fort Wayne, Indiana, where it makes the Hypersonic and Ballistic Tracking Space Sensor satellites which are part of a Pentagon effort to better detect and track hypersonic weapons with space-based sensors and could be adapted for Golden Dome.\n\nGolden Dome’s funding remains uncertain. Republican lawmakers have proposed a $US25 billion ($A39 billion) initial investment for Golden Dome as part of a broader $US150 billion ($A234 billion) defence package, but this funding is tied to a contentious reconciliation bill that faces significant hurdles in Congress.\n\n“Unless reconciliation passes, the funds for Golden Dome may not materialise,” said an industry executive following the program.\n\n“This puts the entire project timeline in jeopardy.”"
    },
    {
        "title": "Russia’s invasion united different parts of Ukraine against a common enemy - 3 years on, that unanimity still holds",
        "description": "Ukraine has a sizable minority of Russian speakers, largely in the east. They also overwhelmingly blame Russia for hostilities.",
        "content": "When Russia invaded Ukraine in the spring of 2022, President Vladimir Putin incorrectly assumed it would be a swift takeover.\nIn fact, three years on, negotiators from both countries are tentatively exploring the idea of a negotiated way out of a lar... [6561 chars]",
        "url": "https://theconversation.com/russias-invasion-united-different-parts-of-ukraine-against-a-common-enemy-3-years-on-that-unanimity-still-holds-255092",
        "image": "https://images.theconversation.com/files/668852/original/file-20250519-62-htimth.jpg?ixlib=rb-4.1.0&rect=0%2C729%2C5808%2C2904&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-20T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "When Russia invaded Ukraine in the spring of 2022, President Vladimir Putin incorrectly assumed it would be a swift takeover.\n\nIn fact, three years on, negotiators from both countries are tentatively exploring the idea of a negotiated way out of a largely stalemated conflict.\n\nSo what did the Kremlin’s initial assessment get wrong? Aside from underestimating the vulnerabilities of Russia’s military, analysts have suggested that Moscow also miscalculated the support Russia would receive from Ukrainians in the country’s east who have close ethnic ties to Russia.\n\nOur recently published study on Ukrainian sentiment toward Russia before and after the invasion backs up that assertion. It demonstrates that even those Ukrainians who had close ties to Russia based on ethnicity, language, religion or location dramatically changed allegiances immediately following the invasion. For example, just prior to the invasion of 2022, native Russian speakers in Ukraine’s east tended to blame the West for tensions with Russia. But immediately after the invasion, they blamed Moscow in roughly the same numbers as non-Russian-speaking Ukrainians.\n\nMoreover, this shift was not just a short-lived reaction. Three years after the invasion, we followed up on our survey and found that Ukrainians still blame Russia for tensions to a degree that was never so unanimous before 2022.\n\nA natural experiment\n\nOur study is part of a larger project exploring how effective Russian propaganda has been at influencing Russian-speaking adults in certain former Soviet states. Our inaugural survey was launched in the fall of 2020, while the question regarding tensions between Ukraine and Russia was first posed in February 2022, immediately prior to Russia’s invasion of Ukraine.\n\nSurveys were completed by over 1,000 Russian-speaking people in Ukraine − excluding Crimea and the breakaway Donbas region for security reasons − and in Belarus. While the spring surveys in Ukraine were conducted in person, the others were done by telephone due to the political situation in each country.\n\nBelarus was chosen because it shares a similar historical, linguistic and ethnic background to Ukraine, but the two nations have diverged in their geopolitical paths. Shortly after the fall of the Soviet Union in 1991, Belarus, like Ukraine, forged ahead in attempting to build democratic systems. But after Belarusian President Alexander Lukashenko came to power in 1994, the country become an authoritarian state with a high dependence on Russia for political and economic support.\n\nIn broad terms, Ukraine has had an opposite trajectory. Relations between Ukraine and Russia fluctuated over the initial years of independence. But since the Maidan revolution of November 2013 to February 2014, a staunch pro-Western leadership has emerged.\n\nStill, certain segments of the population in Ukraine continued to hold affinities toward Russia – most notably, the Russian-speaking older generation in the country’s east.\n\nOur surveys provide a kind of natural experiment looking at the impact of a Russian invasion on previous pro-Russian public sentiment.\n\nUkraine serves as the “treatment” group and Belarus as a “quasi-control” group, with the distinguishing factor being a Russian invasion. The questions we asked: “Who do you think is responsible for the worsening tensions between Russia and Ukraine?” and “In general, how do Russian policies affect your country?”\n\nConverging blame\n\nWe found that in Ukraine, but not in Belarus, geopolitical views were sharply unified by the experience of the invasion. On one level, this is not surprising – after all, the people of a country being invaded would be expected to hold some degree of resentment to the invading army.\n\nBut what we found most interesting is that this effect in Ukraine massively overrode the split among various identities before the invasion. This was most prominent in people’s perceptions of who was to blame for rising tensions.\n\nPrior to the invasion, 69.7% of respondents in Ukraine overall blamed Russia for the tensions between the two countries, with 30.3% blaming NATO, Ukraine or the U.S. By August 2022, 97.3% of respondents in Ukraine blamed Russia for the tensions, with only 2.7% blaming NATO, Ukraine or the U.S.\n\nBy comparison, in the neighboring country of Belarus, 15.5% of respondents blamed Russia for the tensions prior to the invasion, and only 21.9% of respondents blamed Russia for the tensions after the invasion.\n\nThis near unanimity in Ukraine masks the massive shifts you see when broken down for demographic differences. For example, blame varied widely across regions of Ukraine before the invasion but converged after the invasion. Prior to the invasion, only 36.0% of respondents in the east of Ukraine and 51.4% of respondents in the south of Ukraine blamed Russia for the tensions. After the invasion, over 96% of respondents in both regions blamed Russia.\n\nA similar effect can be seen across other demographic differences. Only 30.6% of Catholics in Ukraine blamed Russia for the tensions prior to the invasion, while 83.0% blamed Russia later on.\n\nWhat were once stratified opinions before the invasion became uniform afterward.\n\nTo check that this trend was not just an immediate post-invasion blip, we conducted the surveys again in September 2024 and February 2025. The overall proportion of Ukrainians who blamed Russia for the tensions remained high, with 85.7% and 84.5%, respectively. And again, these results held across the various demographic breakdowns.\n\nIn February 2025, the most recent survey, 77.2% of respondents in the east of Ukraine and 83.0% of respondents in the south blamed Russia. Catholics across Ukraine continued to blame Russia, with 90.7% in September 2024 and 90.6% in February 2025. Overall, there has been a small drop in the percentages of those blaming Russia – with war fatigue a possible reason.\n\nConsequences for peace\n\nOur findings suggest that in times of collective threat, divisions within a society tend to fade as people come together to face a common enemy.\n\nAnd that could have huge consequences now, as various parties, including the U.S., look at peace proposals to end the Russia-Ukraine war. Among the options being explored is a scenario in which the current front lines are frozen.\n\nThis would entail recognizing the Russian-occupied territory of Crimea and the separatist regions of Donetsk and Luhansk as part of Russia. But it would also effectively relinquish Ukraine’s southeastern provinces of Kherson and Zaporizhzhia to Russia.\n\nWhile our surveys cannot speak to how this will go down among the people of Crimea, Donetsk and Luhansk, the study did include Kherson and Zaporizhzhia. And our findings show that the sense of Ukrainian identity strengthened even among Russian-speaking people in those areas."
    },
    {
        "title": "Europe looks to Australia in the face of an aggressive Russia and Trump 2.0",
        "description": "A proposal to strengthen ties between Europe and Australia in the face of increasing global instability could prove to be a major boost for both allies. But questions have been raised over a potential defence pact with Brussels.",
        "content": "A proposal to strengthen ties between the European Union and Australia in the face of increasing global instability could prove to be a major boost for both allies.\nHowever some experts have cautioned against Canberra signing a potential defence pact... [6965 chars]",
        "url": "https://www.abc.net.au/news/2025-05-20/europe-russia-putin-australia-alliance/105311082",
        "image": "https://live-production.wcms.abc-cdn.net.au/389a6ce3dd6a98c46ebd5d0c9c669e70?impolicy=wcms_watermark_news&cropH=1589&cropW=2825&xPos=0&yPos=0&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-20T05:04:22Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-20/europe-russia-putin-australia-alliance/105311082 on URL https://www.abc.net.au/news/2025-05-20/europe-russia-putin-australia-alliance/105311082"
    },
    {
        "title": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin",
        "description": "The Russian president has issued a surprising response after the two-hour phone call.",
        "content": "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.\n“Negotiations between Russia and U... [3255 chars]",
        "url": "https://www.perthnow.com.au/news/world/trump-says-russia-and-ukraine-to-immediately-talk-peace-deal-after-call-with-putin-c-18747589",
        "image": "https://images.perthnow.com.au/publication/C-18747589/9d4767437574b122bb43e5a6656610d15ce9ac22-16x9-x0y0w1280h720.png?imwidth=1200",
        "publishedAt": "2025-05-19T21:55:41Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.\n\n“Negotiations between Russia and Ukraine will begin immediately,” Trump said in a Truth Social post following his call with Putin, which lasted two hours.\n\nWATCH THE VIDEO ABOVE: Trump talks peace between Russia and Ukraine after phone call with Putin.\n\nAfter the call, Putin said efforts to end the war were “generally on the right track” and that the Kremlin was ready to work with Ukraine on a potential peace deal.\n\n“We have agreed with the president of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” Putin told reporters near the Black Sea resort of Sochi.\n\nTrump later said he had made progress during his call with Putin and that he also spoke to the heads of several European countries.\n\n“The tone and spirit of the conversation were excellent,” Trump said in his post on TruthSocial.\n\nKremlin presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the US, told reporters that the two countries were working out details of an exchange of prisoners jailed in Russia and the United States involving nine people on each side.\n\nUkrainian President Volodymyr Zelenskiy said he spoke to Trump one-on-one on Monday before Trump called Putin, and again afterwards in a conversation that involved the leaders of France, Finland, Germany, Italy and the European Union.\n\nHe said Ukraine and its partners were considering arranging a high-level meeting between Ukraine, Russia, the United States, European Union countries and the United Kingdom as part of a push to end the war.\n\nSpeaking to reporters in Kyiv, the Ukrainian leader said he hoped the meeting could happen as soon as possible and that it could be hosted by Turkey, the Vatican or Switzerland.\n\n“We are considering a meeting of all teams at a high level,” he said.\n\nUkraine has said it is ready for a ceasefire now while Russia has said conditions must be met first.\n\nIn his social media post, Trump said the Vatican, “as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!”\n\nPutin and Trump spoke after direct talks last week in Turkey between Russian and Ukrainian delegations, the first since 2022 in the early months of Russia’s invasion of Ukraine.\n\nTalks last week failed to agree on a truce.\n\nPutin said on Monday the memorandum would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.\n\nHe said that if appropriate agreements were reached, there could be a ceasefire, adding that direct talks between Russia and Ukraine gave “reason to believe that we are generally on the right track”.\n\n“The main thing for us is to eliminate the root causes of this crisis,” Putin said.\n\n“We just need to determine the most effective ways to move towards peace.”\n\nPutin was speaking from Russia’s Black Sea resort of Sochi while Trump was in Washington DC.\n\nShortly before the call, White House press secretary Karoline Leavitt told reporters that Trump wanted to see a ceasefire but that he had grown “weary and frustrated with both sides of the conflict”.\n\nAsked if a package of secondary sanctions against Russia remains on the table, she said: “I think everything’s on the table.”\n\n- With AP"
    },
    {
        "title": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin",
        "description": "The Russian president has issued a surprising response after the two-hour phone call.",
        "content": "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.\n“Negotiations between Russia and U... [3304 chars]",
        "url": "https://7news.com.au/news/trump-says-russia-and-ukraine-to-immediately-talk-peace-deal-after-two-hour-call-with-putin-c-18747589",
        "image": "https://images.7news.com.au/publication/C-18747589/9d4767437574b122bb43e5a6656610d15ce9ac22-16x9-x0y0w1280h720.png?imwidth=1200",
        "publishedAt": "2025-05-19T21:55:41Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "US President Donald Trump says Russia and Ukraine “will immediately start negotiations” toward a ceasefire and an end to their three-year-old war, speaking after he held a call with Russian President Vladimir Putin.\n\n“Negotiations between Russia and Ukraine will begin immediately,” Trump said in a Truth Social post following his call with Putin, which lasted two hours.\n\nWATCH THE VIDEO ABOVE: Trump talks peace between Russia and Ukraine after phone call with Putin.\n\nKnow the news with the 7NEWS app: Download today\n\nAfter the call, Putin said efforts to end the war were “generally on the right track” and that the Kremlin was ready to work with Ukraine on a potential peace deal.\n\n“We have agreed with the president of the United States that Russia will propose and is ready to work with the Ukrainian side on a memorandum on a possible future peace accord,” Putin told reporters near the Black Sea resort of Sochi.\n\nTrump later said he had made progress during his call with Putin and that he also spoke to the heads of several European countries.\n\n“The tone and spirit of the conversation were excellent,” Trump said in his post on TruthSocial.\n\nKremlin presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the US, told reporters that the two countries were working out details of an exchange of prisoners jailed in Russia and the United States involving nine people on each side.\n\nUkrainian President Volodymyr Zelenskiy said he spoke to Trump one-on-one on Monday before Trump called Putin, and again afterwards in a conversation that involved the leaders of France, Finland, Germany, Italy and the European Union.\n\nHe said Ukraine and its partners were considering arranging a high-level meeting between Ukraine, Russia, the United States, European Union countries and the United Kingdom as part of a push to end the war.\n\nSpeaking to reporters in Kyiv, the Ukrainian leader said he hoped the meeting could happen as soon as possible and that it could be hosted by Turkey, the Vatican or Switzerland.\n\n“We are considering a meeting of all teams at a high level,” he said.\n\nUkraine has said it is ready for a ceasefire now while Russia has said conditions must be met first.\n\nIn his social media post, Trump said the Vatican, “as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!”\n\nPutin and Trump spoke after direct talks last week in Turkey between Russian and Ukrainian delegations, the first since 2022 in the early months of Russia’s invasion of Ukraine.\n\nTalks last week failed to agree on a truce.\n\nPutin said on Monday the memorandum would define “a number of positions, such as, for example, the principles of settlement, the timing of a possible peace agreement”.\n\nHe said that if appropriate agreements were reached, there could be a ceasefire, adding that direct talks between Russia and Ukraine gave “reason to believe that we are generally on the right track”.\n\n“The main thing for us is to eliminate the root causes of this crisis,” Putin said.\n\n“We just need to determine the most effective ways to move towards peace.”\n\nPutin was speaking from Russia’s Black Sea resort of Sochi while Trump was in Washington DC.\n\nShortly before the call, White House press secretary Karoline Leavitt told reporters that Trump wanted to see a ceasefire but that he had grown “weary and frustrated with both sides of the conflict”.\n\nAsked if a package of secondary sanctions against Russia remains on the table, she said: “I think everything’s on the table.”\n\n- With AP"
    },
    {
        "title": "Russia and Ukraine will hold direct ceasefire talks, Trump says after call with Putin",
        "description": "A two-hour phone call between the US and Russian presidents fails to produce any breakthrough agreement on ending the war in Ukraine, but Donald Trump says the two sides will start direct talks.",
        "content": "Donald Trump and Vladimir Putin have held another lengthy phone call about Russia's invasion of Ukraine, but again failed to reach any breakthrough agreement on a ceasefire.\nInstead, the US president said Russia and Ukraine would now hold direct talk... [2610 chars]",
        "url": "https://www.abc.net.au/news/2025-05-20/donald-trump-vladimir-putin-ukraine-war-ceasefire-phone-call/105312068",
        "image": "https://live-production.wcms.abc-cdn.net.au/00227565102f93f8a22c7b9fdc8cc9ce?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=521&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-19T19:20:45Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-20/donald-trump-vladimir-putin-ukraine-war-ceasefire-phone-call/105312068 on URL https://www.abc.net.au/news/2025-05-20/donald-trump-vladimir-putin-ukraine-war-ceasefire-phone-call/105312068"
    },
    {
        "title": "Anthony Albanese tells Volodymyr Zelenskyy Australia doing 'whatever we can' to pressure on Russia",
        "description": "Prime Minister Anthony Albanese tells Ukrainian President Zelenskyy that Australia is doing \"whatever we can\" to pressure Russia.",
        "content": "Anthony Albanese has assured Volodymyr Zelenskyy that Abrams tanks are now \"on the way\" to the war-torn country to help it push back Russia's invasion after meeting Ukraine's President in Rome.\nThe prime minister has also responded cautiously to a pu... [4748 chars]",
        "url": "https://www.abc.net.au/news/2025-05-19/albanese-meets-zelenskyy-and-the-pope-in-rome/105308062",
        "image": "https://live-production.wcms.abc-cdn.net.au/9cf29fe2b046845bc9523f878a168676?impolicy=wcms_watermark_news&cropH=509&cropW=904&xPos=0&yPos=28&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-18T21:54:45Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-19/albanese-meets-zelenskyy-and-the-pope-in-rome/105308062 on URL https://www.abc.net.au/news/2025-05-19/albanese-meets-zelenskyy-and-the-pope-in-rome/105308062"
    },
    {
        "title": "Russia launches largest drone attack of war after deadlocked peace talks, killing woman near Kyiv and injuring child",
        "description": "A four-year-old child was among the injured.",
        "content": "The largest known Russian drone attack since full-scale war began in 2022 killed a woman in the Kyiv region and injured at least three people, Ukrainian authorities say, as Moscow steps up strikes following peace talks on Friday.\nRussia had launched ... [3285 chars]",
        "url": "https://7news.com.au/news/russia-launches-largest-drone-attack-of-war-after-deadlocked-peace-talks-killing-woman-near-kyiv-and-injuring-child-c-18734058",
        "image": "https://images.7news.com.au/publication/C-18734058/ef3f032a4a426de1b9dd2a7b218966fd88f360e6-16x9-x0y75w800h450.jpg?imwidth=1200",
        "publishedAt": "2025-05-18T08:00:21Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "The largest known Russian drone attack since full-scale war began in 2022 killed a woman in the Kyiv region and injured at least three people, Ukrainian authorities say, as Moscow steps up strikes following peace talks on Friday.\n\nRussia had launched 273 drones by 8am on Sunday local time (0500 GMT), targeting chiefly the central Kyiv region and the Dnipropetrovsk and Donetsk regions in the country’s east, Ukraine’s air force said.\n\nBased on data provided by the air force, this was Russia’s largest drone attack on Ukraine during the war.\n\nKnow the news with the 7NEWS app: Download today\n\nIn this photo provided by the Ukrainian Emergency Service, firefighters put out the fire following Russia's drone attack in the Kyiv region, Ukraine. Credit: Ukrainian Emergency Service / AP\n\nOn the eve of the third anniversary of Russia’s full-scale invasion of Ukraine on February 23, Moscow launched a then-record 267 drones.\n\nThe first direct talks in three years between Russia and Ukraine on Friday failed to broker the temporary ceasefire Kyiv and its allies have been urging.\n\nThe 100 minutes of talks in Istanbul yielded an agreement to trade 1000 prisoners of war on each side.\n\nUS President Donald Trump said he would speak to Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskiy on Monday.\n\nThe sustained overnight Russian drone attack on Sunday killed a 28-year-old woman in the capital region and injured at least three people, including a four-year-old, Ukrainian authorities said.\n\n“Unfortunately, as a result of the enemy attack in the Obukhiv district, a woman died from her injuries,” Mykola Kalashnik, governor of the Kyiv region, posted on Telegram.\n\nKyiv, the region around it and the eastern part of Ukraine were under raid warnings for nine hours overnight before they were called off about 9am local time (0600 GMT).\n\nAir defence units were engaged several times trying to repel attacks, the military said on Telegram.\n\n“It’s been a tough night. The Russians have always used war and attacks to intimidate everyone in negotiations,” Andriy Kovalenko, head of Ukraine’s Centre for Countering Disinformation, said on Telegram of Sunday’s attack.\n\nAir defence units destroyed 88 of the drones overnight.\n\nThe attack also included 128 simulator drones that were lost along the way without hitting anything, Ukraine’s air force said in a statement on Telegram.\n\nOn Saturday, a Russian drone attack killed nine civilians after hitting a shuttle bus in the Sumy region in northeast Ukraine, Kyiv said.\n\nUnder pressure from the United States to negotiate with Russia, President Zelensky had challenged Russian President Vladimir Putin to meet him in Turkey for direct negotiations, although Putin declined the invitation. Credit: Arda Kucukkaya/Turkish Foreign Ministry / Getty Images\n\nZelenskiy called the attack “deliberate” and urged stronger sanctions on Moscow, which said it had attacked a military facility.\n\nAll of those injured in the Obukhiv district just south of Kyiv city were taken to hospital, Kalashnik said.\n\nHe said several residential buildings in the area were damaged.\n\nIn the city of Kyiv, fragments of a destroyed drone damaged the roof of a non-residential building, the city’s military administration said on Telegram.\n\nReuters witnesses in and around Kyiv heard blasts that sounded like air defence units in operation.\n\nThere was no immediate comment from Russia.\n\nBoth sides deny targeting civilians in the war, but thousands have been killed in the conflict, the vast majority of them Ukrainian."
    },
    {
        "title": "Jailed Aussie fighter at centre of high-stakes talks between Albanese and Zelenskiy",
        "description": "Oscar Jenkins’ 13-year jail term in Russia sparks diplomatic pressure.",
        "content": "The fate of jailed Australian Oscar Jenkins is set to be discussed in face-to-face talks between Prime Minister Anthony Albanese and Ukrainian President Volodymyr Zelenskiy in Rome.\nJenkins faces 13 years in a Russian prison after a court found him g... [2192 chars]",
        "url": "https://7news.com.au/news/jailed-aussie-fighter-at-centre-of-high-stakes-talks-between-albanese-and-zelenskiy-c-18731322",
        "image": "https://images.7news.com.au/publication/C-18731322/47efb1e0aa4f1f89f18e7ed895f4e48b2de8bb83-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-18T01:25:29Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "The fate of jailed Australian Oscar Jenkins is set to be discussed in face-to-face talks between Prime Minister Anthony Albanese and Ukrainian President Volodymyr Zelenskiy in Rome.\n\nJenkins faces 13 years in a Russian prison after a court found him guilty of taking part in an armed conflict as a mercenary, which denies him the protections provided to prisoners of war under the Geneva Convention.\n\nThe Australian government insists he was fighting as a member of the Ukrainian defence forces and should be entitled to humane treatment as a prisoner of war.\n\nKnow the news with the 7NEWS app: Download today\n\n“This is an appalling decision from Russia, and another outrage in a long line of outrages when it comes to matters involving Ukraine,” federal frontbencher Murray Watt told Sky News on Sunday morning.\n\n“We consider this to be a sham trial, and we don’t accept that Jenkins should be treated this way.”\n\nThe Australian government has called for Oscar Jenkins to be treated humanely as a prisoner of war. Credit: AAP\n\nWatt said he was sure Albanese would bring up Jenkins’ treatment and prospects for release with Zelenskiy.\n\nThe pair are expected to meet on Sunday, Vatican time, on the sidelines of the inauguration of Pope Leo XIV in the Holy See.\n\nOn Saturday, Albanese told journalists he was “outraged” by Jenkins’ incarceration and that Russia was continuing to abrogate its obligations to international law.\n\nZelenskiy held direct talks with Russian officials for the first time on Friday as the two sides make abortive efforts to work towards a ceasefire deal.\n\nJenkins was captured in occupied eastern Ukraine and taken into Russian custody last December.\n\nHe was seen in social media videos visibly bruised and shaken while being interrogated and beaten by a Russian-speaking captor.\n\nThe 33-year-old is believed to be the first Australian combatant reportedly captured by Russian forces.\n\nOscar Jenkins was serving alongside Ukraine's military when he was captured by Russian forces. Credit: AAP\n\nAll sides of politics have offered their support to Jenkins, with opposition home affairs spokesman James Paterson calling his treatment “shocking”.\n\nUkrainian Ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.\n\nMore than three years have passed since Russia launched its invasion of Ukraine on February 24, 2022."
    },
    {
        "title": "Donald Trump will call Putin, then Zelensky, to push for ceasefire",
        "description": "Donald Trump said he will call Russia’s president and then Ukrainian President Volodymyr Zelensky. Follow live updates.",
        "content": "US President Donald Trump said he plans to speak by phone Monday (Tuesday AEST) with Russian leader Vladimir Putin, followed by Ukrainian President Volodymyr Zelensky and leaders of various NATO countries, about ending the war in Ukraine.\nTrump said ... [1586 chars]",
        "url": "https://www.afr.com/politics/federal/trump-to-call-putin-about-stopping-ukraine-bloodbath-20250518-p5m03d",
        "image": "https://static.ffx.io/images/$zoom_0.3337%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_247%2C$y_214/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_live_no_age_social_wm/a00cdff3bbc3590e6f5427da4998169175e49be9",
        "publishedAt": "2025-05-17T21:20:38Z",
        "source": {
            "name": "The Australian Financial Review",
            "url": "https://www.afr.com"
        },
        "full_content": "That’s a wrap. Thanks for following The Australian Financial Review’s live news coverage this Sunday, May 18, 2025. We will have more for you in the next live news coverage.\n\nHere are some of the stories we covered today:"
    },
    {
        "title": "Anthony Albanese and Penny Wong slam Russia over 13-year sentence for captured fighter",
        "description": "Former biology teacher, Oscar Jenkins, was captured by Russian troops in December 2023.",
        "content": "Foreign Minister Penny Wong has slammed the 13-year prison sentence handed to Australian citizen Oscar Jenkins by a Russian-controlled court, calling the proceedings a “sham trial” and demanding he be treated as a prisoner of war.\nJenkins, 33, from M... [3225 chars]",
        "url": "https://7news.com.au/news/anthony-albanese-and-penny-wong-slam-russia-over-13-year-sentence-for-captured-fighter-c-18727462",
        "image": "https://images.7news.com.au/publication/C-18727462/2f6661b66b4b0a64ab688eec533044632243c4f3-16x9-x0y0w1280h720.png?imwidth=1200",
        "publishedAt": "2025-05-17T13:28:40Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "Foreign Minister Penny Wong has slammed the 13-year prison sentence handed to Australian citizen Oscar Jenkins by a Russian-controlled court, calling the proceedings a “sham trial” and demanding he be treated as a prisoner of war.\n\nJenkins, 33, from Melbourne, was convicted of fighting as a mercenary alongside Ukrainian forces and sentenced to a maximum-security penal colony in the Russian-occupied Luhansk region of eastern Ukraine.\n\nThe former biology teacher, who was captured by Russian troops in December 2023, was accused of receiving up to 800,000 rubles (around A$15,000) per month to engage in military operations against Russian forces.\n\nKnow the news with the 7NEWS app: Download today\n\nState-run media claimed Jenkins had “fully admitted his guilt,” though serious concerns have been raised about the fairness of the trial and the conditions of his detention.\n\n“The Australian government is appalled at the sham trial and 13-year sentence given to Australian man Oscar Jenkins,” Wong said in a statement posted to social media.\n\n“As a full-serving member of the regular armed forces of Ukraine, Mr Jenkins is a prisoner of war. Russia is obligated under international humanitarian law to provide him with humane treatment and full POW protections.”\n\nPrime Minister Anthony Albanese echoed the condemnation, calling the sentence “an outrage” during a press conference in Rome.\n\n“Let’s be very clear. This sentence by Russia is an outrage – it is a continuation of the way they have behaved, abrogating their responsibilities,” the Prime Minister said.\n\n“This conflict began with them choosing to invade a sovereign nation, and their decision to abrogate their responsibility to uphold international law.”\n\nJenkins was formally charged with mercenary activity in April and appeared in court on Friday in a glass cage, reportedly looking frail and despondent.\n\nRussian prosecutors argued he had signed a contract with the Ukrainian Defence Ministry and fought in the Donbas region with Ukraine’s 66th Separate Mechanised Brigade.\n\nFootage of Jenkins in Russian custody circulated online after his capture, showing him bound, slapped, and aggressively interrogated. The video sparked global outrage and led to fears that he had been killed, prompting the Australian government to summon the Russian ambassador in January.\n\nNew footage later surfaced in February showing Jenkins alive but visibly unwell, with possible injuries including a broken arm — heightening concerns over his treatment.\n\nRussian state media claimed reports of his death were “fake news” orchestrated by Ukrainian intelligence.\n\nOpposition home affairs spokesman James Paterson described the sentence as a “sham” and a “gross violation” of international law, saying Jenkins must be treated as a prisoner of war under the Geneva Conventions.\n\nHuman rights groups have echoed calls for Jenkins’ release, criticising the legality of the trial and raising the possibility that he may be included in a future swap. One such deal could involve Russian spies Kira and Igor Korolev, according to speculation from the Russian branch of the International Committee for the Protection of Human Rights.\n\nJenkins’ case follows the March conviction of British national James Scott Rhys Anderson, who received a 19-year sentence from a Russian military court — the first such case involving a British citizen since the war began.\n\nThe Australian Department of Foreign Affairs and Trade has been contacted for further comment."
    },
    {
        "title": "Ukraine accuses Russia of deadly attack on bus hours after peace talks",
        "description": "The bus, which was travelling towards Ukraine's north-eastern city of Sumy, was \"targeted by the Russians\", according to the local military administration.",
        "content": "Ukrainian officials say a Russian drone strike has hit a bus, killing at least nine people and injuring four more, in the country's north-eastern Sumy region, in an attack that took place hours after Moscow and Kyiv held their first direct peace talk... [3543 chars]",
        "url": "https://www.abc.net.au/news/2025-05-17/ukraine-accuses-russia-of-deadly-attack-on-bus-after-peace-talks/105305262",
        "image": "https://live-production.wcms.abc-cdn.net.au/945787fff378ad0e4a2af14ce27db457?impolicy=wcms_watermark_news&cropH=353&cropW=627&xPos=0&yPos=135&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-17T06:26:12Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-17/ukraine-accuses-russia-of-deadly-attack-on-bus-after-peace-talks/105305262 on URL https://www.abc.net.au/news/2025-05-17/ukraine-accuses-russia-of-deadly-attack-on-bus-after-peace-talks/105305262"
    },
    {
        "title": "In The Know: MH17 Russia ruling, Sussan Ley, South Yunderup crash, Diddy trial, Go-Jo at Eurovision",
        "description": "Here’s your recap of this week’s news.",
        "content": "South Yunderup tragedy\nHarrison McElroy, 24, and Kayla Shepherd, 31, were killed on Mother’s Day when they pulled their car into the southbound emergency lane of Forrest Highway in South Yunderup and were struck by a Volvo station wagon.\nMs Shepherd’... [2270 chars]",
        "url": "https://www.perthnow.com.au/politics/in-the-know-mh17-russia-ruling-sussan-ley-south-yunderup-crash-diddy-trial-go-jo-at-eurovision--c-18712923",
        "image": "https://images.perthnow.com.au/publication/C-18712923/2def80baf49ee31fe63675bbd404a4cc8af46fd9-16x9-x1y0w2446h1376.jpg?imwidth=1200",
        "publishedAt": "2025-05-17T01:24:22Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "South Yunderup tragedy\n\nHarrison McElroy, 24, and Kayla Shepherd, 31, were killed on Mother’s Day when they pulled their car into the southbound emergency lane of Forrest Highway in South Yunderup and were struck by a Volvo station wagon.\n\nMs Shepherd’s 17-month-old daughter was found in the back seat of the parked sedan when police arrived. It is unclear why the couple had stopped on the side of the road.\n\nCamera Icon The driver of the Volvo stopped to assist at the scene and called emergency services, but both Mr McElroy and Ms Shepherd could not be saved. Credit: Supplied\n\nMH17\n\nOn Monday, a UN aviation agency issued a historic ruling finding that Russia was responsible for downing Malaysian Airlines Flight MH17 which claimed 289 lives.\n\nThe flight was scheduled to travel from Amsterdam to Kuala Lumpur on July 17, 2014 but was shot down by a surface-to-air missile while flying over eastern Ukraine.\n\nCamera Icon Malaysia Airlines flight 17 was shot down over eastern Ukraine amid fighting on July 17, 2014. Credit: AAP\n\nSussan Ley\n\nSussan Ley made history this week when she was appointed as the Liberal party’s first female leader — she defeated Angus Taylor 29 votes to 25 in a ballot of MPs in Canberra.\n\nThe 63-year-old is replacing Peter Dutton as Opposition Leader after he lost his seat at the May 3 election.\n\nCamera Icon Australia’s first female leader of the Opposition Sussan Ley. Credit: Mick Tsikas. / AAP\n\nDiddy trial\n\nOn the third day of Sean ‘Diddy’ Combs’ criminal trial, his ex-girlfriend Casandra Ventura testified that the rapper had raped her in 2018. Ventura, better known by her stage name Cassie, is the prosecution’s star witness against Combs.\n\nShe fought back tears as she described the alleged rape and testified that Combs beat her during drug-fuelled sex parties known as “Freak Offs,” and that he threatened to release videos of her taking part, warning that he would ruin her career.\n\nCamera Icon Sean \"Diddy\" Combs watches as his former girlfriend Casandra \"Cassie\" Ventura testifies at his sex trafficking trial in New York City, May 13, 2025 in this courtroom sketch. Credit: Jane Rosenberg / REUTERS\n\nGo-Jo at Eurovision\n\nManjimup’s own Marty Zambotto, aka Go-Jo, made Australia proud when he took to the Eurovision stage to belt out his tongue-in-cheek hit Milkshake Man, but he missed out on qualifying for the grand final on Thursday night.\n\nHe was the first performance of the evening, and is the tenth musical act to represent Australia at the world’s most popular singing contest."
    },
    {
        "title": "Russia-Ukraine agree to swap POWs",
        "description": "At the brief Istanbul talks, Kyiv and Moscow agreed to exchange 1000 prisoners of war each, according to the heads of both delegations.",
        "content": "Istanbul, Turkey | The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours on Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key con... [393 chars]",
        "url": "https://www.afr.com/world/europe/russia-ukraine-agree-to-swap-pows-20250517-p5lzz0",
        "image": "https://static.ffx.io/images/$zoom_0.7198%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_509%2C$y_871/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/e5a2e5513bd08ca0b2d98568c06c1d4502d1dcf4",
        "publishedAt": "2025-05-16T16:25:43Z",
        "source": {
            "name": "The Australian Financial Review",
            "url": "https://www.afr.com"
        },
        "full_content": "Istanbul, Turkey | The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours on Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the fighting.\n\nUkrainian President Volodymyr Zelensky said he discussed the results of the talks with US President Donald Trump and the leaders of France, Germany, the UK and Poland. In a post on X from a European leadership meeting in Albania, he urged “tough sanctions” against Moscow if it rejects “a full and unconditional ceasefire and an end to killings”.\n\nLoading...\n\nAP"
    },
    {
        "title": "\"A clear escalation in Russia’s crackdown on digital privacy tools\" - experts warn against recent VPN disappearances in Russia",
        "description": "The VPN purge from Russian official app stores continues as smaller providers like Samsung, Xiaomi, and Huawei become the next target. Experts at the VPN Guild are calling to hold tech platforms accountable.",
        "content": "The VPN purge from Russian official app stores continues, with smaller providers becoming the new target after Apple and Google.\nBetween May 15 and 16, 2025, Samsung and Xiaomi both removed the AdGuard VPN application at the Roskomnadzor's demand. At... [3976 chars]",
        "url": "https://www.techradar.com/vpn/vpn-privacy-security/a-clear-escalation-in-russias-crackdown-on-digital-privacy-tools-experts-warn-against-recent-vpn-disappearances-in-russia",
        "image": "https://cdn.mos.cms.futurecdn.net/MXqmsVRQzx9hefCvT8TupP.jpg",
        "publishedAt": "2025-05-16T16:02:25Z",
        "source": {
            "name": "TechRadar",
            "url": "https://www.techradar.com"
        },
        "full_content": "The VPN purge from Russian official app stores continues, with smaller providers becoming the new target after Apple and Google.\n\nBetween May 15 and 16, 2025, Samsung and Xiaomi both removed the AdGuard VPN application at the Roskomnadzor's demand. At least one more VPN provider, HideMyName VPN, has also been removed from the Huawei Store in Russia and China – a Russian VPN digital rights group, VPN Guild, confirmed to TechRadar.\n\n\"The removal of VPN apps from app stores marks a clear escalation in Russia’s crackdown on digital privacy tools,\" said VPN Guild Chair Alexey Kozliuk.\n\nNot an isolated incident\n\nvirtual private network (VPN) is a crucial tool for people in Russia, thanks to its IP-spoofing capabilities that allow bypassing of government-imposed geo-restrictions, as well as strong encryption to help fight back against online surveillance. (Image credit: Getty Images)\n\nThe recent events, Kozliuk explains, aren't isolated incidents, but part of a broader, ongoing campaign to block Russian citizens' access to uncensored information and control internet use.\n\nIn October 2023, for example, HideMyName filed the first-ever lawsuit against the Kremlin's infamous censorship body regulator Roskomnadzor. In January 2024, authorities deemed the VPN provider to be a \"foreign agent.\"\n\nIn March 2024, the government then passed a new law to criminalize the spread of information about ways to circumvent internet restrictions. This is likely the legal basis upon which the Russian censor body began issuing these removal demands to tech firms.\n\nFrom July 2024 onwards, Apple has removed at least 60 VPN apps, including AdGuard VPN, and a popular Russian service, Amnezia VPN, alongside some of the best VPN services on the market. This brought the total toll to almost 100 VPN apps unavailable in Russia's App Store.\n\nWhile Google seems mostly resistant to these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia.\n\nNow, authorities' targets have also expanded towards smaller app store providers.\n\nTechRadar needs you! We want to know what you think about the world of VPNs. Whether you're a novice or a VPN pro, we want to hear your thoughts. Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete! To take part, click the link below: https://futurenet.questionpro.eu/tr-vpn\n\n\"We’re seeing a coordinated squeeze across platforms, limiting users’ ability to bypass restrictions,\" said Kozliuk. \"What’s especially concerning is the growing role of global tech companies in enforcing local censorship, whether under direct state pressure or as preemptive compliance.\"\n\nGreatFire’s Campaign and Advocacy Director, Benjamin Ismail, also shared the same concerns. Through the organization's project AppCensorship, Ismail and the team have been busy monitoring a staggering increase in these VPN removals across both Apple and Google's official app stores.\n\nWhile it's the first time Ismail has heard of such an incident involving Samsung's Galaxy App Store, he told TechRadar that a way smaller provider (F-Droid) was also hit by a similar request in 2024.\n\nAccording to Ismail, this may mean that Roskomnadzor has understood that it can try its luck to put pressure on tech vendors. \"Smaller providers may struggle more to resist these demands as the prospect of becoming fully unavailable in Russia might be an issue for these platforms,\" he added.\n\nVPNs will remain a critical line of defense for digital freedom Alexey Kozliuk, VPN Guild Chair\n\nThis is exactly why experts have long argued that Big Tech giants, which have the means and resources, should uphold their users' human rights and challenge the Kremlin's censorship requests.\n\nCommenting on this point, Kozliuk from the VPN Guild said: \"This underscores the urgent need to give users more control and make them less reliant on centralized platforms and app ecosystems, as well as the need for stronger international advocacy to hold tech platforms accountable.\n\n\"As political tensions rise, especially around elections or protests, these crackdowns will likely intensify – and VPNs will remain a critical line of defense for digital freedom.\""
    },
    {
        "title": "Russia and Ukraine agree major prisoner of war-swap in first direct peace talks since 2022",
        "description": "Ukraine's defence minister Rustem Umerov has said Kyiv and Moscow will exchange 1,000 captives but a date for the swap will not be made public.",
        "content": "Russia and Ukraine have agreed to exchange 1,000 prisoners of war after the first direct peace talks between the two sides since 2022.\nUkraine's defence minister Rustem Umerov, who led Kyiv's delegation at the talks, in Istanbul on Friday, said the d... [5089 chars]",
        "url": "https://www.abc.net.au/news/2025-05-17/russia-and-ukraine-agree-exchange-1-000-prisoners/105304128",
        "image": "https://live-production.wcms.abc-cdn.net.au/addf21aa18c345e53f9def8816eebdf6?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=243&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-16T14:55:57Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-17/russia-and-ukraine-agree-exchange-1-000-prisoners/105304128 on URL https://www.abc.net.au/news/2025-05-17/russia-and-ukraine-agree-exchange-1-000-prisoners/105304128"
    },
    {
        "title": "Russia jails Australian man for fighting for Ukraine",
        "description": "Prosecutors in occupied Ukraine say the Melbourne teacher has been jailed for 13 years.",
        "content": "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.\nOscar Jenkins, 33, was found guilty by a court of ta... [942 chars]",
        "url": "https://7news.com.au/news/russia-jails-australian-man-for-fighting-for-ukraine-c-18718879",
        "image": "https://images.7news.com.au/publication/C-18718879/02deb47d9d2a0429da365091059ec42db6b13dbe-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-16T14:29:02Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.\n\nOscar Jenkins, 33, was found guilty by a court of taking part in an armed conflict as a mercenary, a statement from the prosecutors said on Friday.\n\nThe court had ruled he had taken part in combat operations against Russian troops between March and December 2024.\n\nKnow the news with the 7NEWS app: Download today\n\nAustralian media reported in 2024 that Jenkins, a teacher from Melbourne, was serving alongside Ukraine’s military when he was captured by Russian forces.\n\nIn January, Australia summoned the Russian ambassador over what turned out to be false reports that Jenkins had been killed after being captured by Russia.\n\nUkrainian ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.\n\nPrime Minister Anthony Albanese has said Australia has made representations to Ukraine, including a one-on-one discussion he had with Ukrainian President Volodymyr Zelenskiy.\n\nwith AAP"
    },
    {
        "title": "Australian Oscar Jenkins sentenced to 13 years in jail by Russia for fighting alongside Ukrainian forces",
        "description": "Prosecutors in the Russian-controlled part of eastern Ukraine said the Melbourne teacher had been found guilty of participating in an armed conflict as a mercenary.",
        "content": "Russia has sentenced Australian Oscar Jenkins to 13 years in a maximum-security prison for fighting alongside Ukrainian forces.\nProsecutors in the Russian controlled part of eastern Ukraine said the 33-year-old teacher from Melbourne was found guilty... [539 chars]",
        "url": "https://www.abc.net.au/news/2025-05-16/oscar-jenkins-sentence-13-years-maximum-security-russia-ukraine/105304126",
        "image": "https://live-production.wcms.abc-cdn.net.au/01bbe5511164a4f4dcd20933c2f459ab?impolicy=wcms_watermark_news&cropH=563&cropW=1000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-16T13:21:19Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-16/oscar-jenkins-sentence-13-years-maximum-security-russia-ukraine/105304126 on URL https://www.abc.net.au/news/2025-05-16/oscar-jenkins-sentence-13-years-maximum-security-russia-ukraine/105304126"
    },
    {
        "title": "Russia jails Australian man for fighting for Ukraine",
        "description": "Russia has jailed Melbourne teacher Oscar Jenkins for 13 years for fighting with Ukrainian forces, prosecutors in occupied Ukraine say.",
        "content": "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.\nOscar Jenkins, 33, was found guilty by a court of ta... [893 chars]",
        "url": "https://www.perthnow.com.au/news/crime/russia-jails-australian-man-for-fighting-for-ukraine-c-18718884",
        "image": "https://images.perthnow.com.au/publication/C-18718884/02deb47d9d2a0429da365091059ec42db6b13dbe-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-16T12:23:32Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "Russia has sentenced an Australian citizen to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in a part of eastern Ukraine controlled by Russia say.\n\nOscar Jenkins, 33, was found guilty by a court of taking part in an armed conflict as a mercenary, a statement from the prosecutors said on Friday.\n\nThe court had ruled he had taken part in combat operations against Russian troops between March and December 2024.\n\nAustralian media reported in 2024 that Jenkins, a teacher from Melbourne, was serving alongside Ukraine's military when he was captured by Russian forces.\n\nIn January, Australia summoned the Russian ambassador over what turned out to be false reports that Jenkins had been killed after being captured by Russia.\n\nUkrainian ambassador to Australia Vasyl Myroshnychenko has previously said his government added Jenkins to its list of prisoners of war and would negotiate for his release in an exchange.\n\nPrime Minister Anthony Albanese has said Australia has made representations to Ukraine, including a one-on-one discussion he had with Ukrainian President Volodymyr Zelenskiy.\n\nwith AAP"
    },
    {
        "title": "Samsung and Xiaomi remove AdGuard VPN from Russian app stores - here’s what we know so far",
        "description": "Samsung and Xiaomi join the list of Big Tech giants facilitating Russia's censorship, killing the AdGuard VPN app from their official app stores in the country.",
        "content": "Samsung and Xiaomi have removed the AdGuard VPN app from their official app stores in Russia at the government's request\nApple already killed AdGuard VPN in 2024, alongside at least 60 VPN apps\nOver 100 VPNs are currently unavailable in the Apple App... [3914 chars]",
        "url": "https://www.techradar.com/vpn/vpn-privacy-security/adguard-vpn-disappears-from-russias-samsung-galaxy-app-store-heres-what-we-know-so-far",
        "image": "https://cdn.mos.cms.futurecdn.net/hQUhXBzv9zmtmqFoY8kwYS.jpg",
        "publishedAt": "2025-05-16T08:55:24Z",
        "source": {
            "name": "TechRadar",
            "url": "https://www.techradar.com"
        },
        "full_content": "Samsung and Xiaomi have removed the AdGuard VPN app from their official app stores in Russia at the government's request\n\nApple already killed AdGuard VPN in 2024, alongside at least 60 VPN apps\n\nOver 100 VPNs are currently unavailable in the Apple App Store, with 50 also unavailable in the Google Play Store\n\nUPDATE: AdGuard confirmed to TechRadar that Xiaomi also removed its VPN app from its Russian App Store at Roskomnadzor's request on May 16, 2025, after publication. We edit the article to reflect this.\n\nYet another VPN service has disappeared from official app stores in Russia.\n\nThis time, Samsung has removed the AdGuard VPN app from its Galaxy App Store in the country at the Roskomnadzor's demand.\n\nA day after, on May 16, 2025, the tech giant Xiaomi also did the same, killing the provider's VPN application from its Russian app store after receiving a removal order from the country's censoring body.\n\nThis comes as part of the Kremlin's actions against VPNs that have seen over 100 apps disappear from the Russian Apple App Store, including some of the best VPN services on the market.\n\nDespite Google seemingly resisting most of these demands so far, recent data shows that at least 53 VPNs are also currently unavailable in the Google Play Store in Russia. AdGuard VPN, however, hasn't been affected yet.\n\n\"A regrettable development\"\n\n\"Our app has indeed been removed from the Samsung Store in Russia – a regrettable development, in our view,\" AdGuard CPO, Denis Vyazovoy, told TechRadar.\n\nThe VPN service has received a synthetic email from Samsung (see image below) to inform that its \"application information has been modified.\"\n\nThe change? \"Russia was excluded from the sales country lists according to Russian government's request. This app is banned by Russian government,\" reads the email.\n\nXiaomi has sent a similar communication to the provider (see image below), noting that \"Distribution of VPN applications in Russia is not allowed. Therefore, we have to remove your application from Russia.\"\n\nAdGuard VPN was already among the virtual private network (VPN) services affected by the big purge from Russia's Apple App Store last year. Unavailable apps also include some of TechRadar's favorites, such as NordVPN, ExpressVPN, and Proton VPN, but also the popular Russian service Amnezia VPN.\n\nThe provider confirmed to TechRadar, though, that its app is still available in Russia's Google Play Store at the time of writing.\n\nIt's also worth noting that these removals only affect Russia-based users. The AdGuard VPN app is still available across all official app stores outside Russia.\n\nImage 1 of 2 (Image credit: AdGuard) Samsung's email to AdGuard (Image credit: AdGuard) Xiaomi's email to AdGuard\n\n\"We see this as part of a broader trend of restricting access to tools that help people protect their privacy and maintain access to an open internet,\" Vyazovoy told TechRadar.\n\nThe Kremlin's actions against VPNs have intensified since a law enforced in March 2024 criminalized the spread of information about ways to circumvent internet restrictions. This is likely the legal basis upon which the Russian censor body is issuing these demands to Big Tech firms.\n\nYet, experts have long called on these companies to uphold Russian citizens' human rights by refraining from cooperating with these demands and restoring censored VPN apps.\n\nVyazovoy confirmed to TechRadar that the service continues to operate through other channels and the provider is actively looking for ways to remain accessible to all users.\n\nIf you are using a Galaxy or Xiaomi smartphone, I recommend downloading the AdGuard VPN app from the Google Play Store, where the service is still available at the time of writing.\n\nThe provider also suggests downloading it directly from their official website to be sure to get the latest and safest version.\n\nTechRadar needs you! We want to know what you think about the world of VPNs. Whether you're a novice or a VPN pro, we want to hear your thoughts. Don't worry, though, your responses are completely anonymous, and it takes less than five minutes to complete! To take part, click the link below: https://futurenet.questionpro.eu/tr-vpn"
    },
    {
        "title": "How a common enemy is pushing Afghanistan's Taliban closer to Russia",
        "description": "Russia and Afghanistan have centuries-old links, but the Kremlin's recent activity in statements about the Taliban are underscored by an evolved security and geo-political landscape of the last three years.",
        "content": "Russia's involvement in Afghanistan stretches as far back as the 19th century.\nSitting at the crossroads of Central and South Asia, Afghanistan was (and is) considered strategically important and served as a buffer between the empires of Tsarist Russ... [11883 chars]",
        "url": "https://www.abc.net.au/news/2025-05-16/russia-offers-support-to-the-taliban-to-fight-afghan-isis/105271142",
        "image": "https://live-production.wcms.abc-cdn.net.au/b8a0f259253a452469f3117b1908ea3f?impolicy=wcms_watermark_news&cropH=2420&cropW=4303&xPos=0&yPos=0&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-16T05:05:08Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-16/russia-offers-support-to-the-taliban-to-fight-afghan-isis/105271142 on URL https://www.abc.net.au/news/2025-05-16/russia-offers-support-to-the-taliban-to-fight-afghan-isis/105271142"
    },
    {
        "title": "Putin, Zelenskyy and Trump aren't going, so will the Russia-Ukraine talks amount to anything?",
        "description": "Neither Russian President Vladimir Putin nor his Ukrainian counterpart Volodymyr Zelenskyy will attend talks in Istanbul. The question now is, will these talks amount to anything?",
        "content": "As the call to prayer rang out across Istanbul at sundown on Thursday afternoon, the meeting many around the world were waiting for hadn't happened.\nHowever, after a lot of \"I'll go, if he goes\" and \"we won't go, if they won't go,\" there now appears ... [5732 chars]",
        "url": "https://www.abc.net.au/news/2025-05-16/ukraine-peace-talks-fizzle-out-in-istanbul/105299844",
        "image": "https://live-production.wcms.abc-cdn.net.au/3030b1e682018b74ba61e19cbaaeb977?impolicy=wcms_watermark_news&cropH=450&cropW=800&xPos=0&yPos=75&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-16T00:55:25Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-16/ukraine-peace-talks-fizzle-out-in-istanbul/105299844 on URL https://www.abc.net.au/news/2025-05-16/ukraine-peace-talks-fizzle-out-in-istanbul/105299844"
    },
    {
        "title": "Russia, Ukraine in first direct peace talks since 2022",
        "description": "Russian and Ukrainian teams have sat down in Istanbul for their first direct peace talks in over three years, but expectations of a major breakthrough are low.",
        "content": "Russian and Ukrainian negotiators have met in Istanbul at their first direct peace talks in more than three years, under pressure from US President Donald Trump to end Europe's deadliest conflict since World War II.\nLive Turkish television pictures o... [2311 chars]",
        "url": "https://www.perthnow.com.au/news/conflict/rubio-suggests-russia-ukraine-talks-at-logjam-c-18709173",
        "image": "https://images.perthnow.com.au/publication/C-18709173/53f523d0aef3d81d06355531629abe31190070cf-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-15T18:20:27Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "Russian and Ukrainian negotiators have met in Istanbul at their first direct peace talks in more than three years, under pressure from US President Donald Trump to end Europe's deadliest conflict since World War II.\n\nLive Turkish television pictures on Friday showed Russian and Ukrainian negotiators holding discussions together with a Turkish delegation.\n\nTurkish Foreign Minister Hakan Fidan was making a speech at the start of the meeting.\n\nThe meeting at the Dolmabahce Palace on the Bosphorus marks a rare sign of diplomatic progress between the warring sides, who had not met face-to-face since March 2022, the month after Russia's invasion.\n\nExpectations for a major breakthrough, already low, were dented further on Thursday when Trump said there would be no movement without a meeting between himself and Russia's President Vladimir Putin.\n\nTrump, winding up a Middle East tour and heading back to Washington, said on Friday he would meet the Russian leader \"as soon as we can set it up\".\n\nSetting out Kyiv's priorities, the head of Ukraine's delegation said peace was only possible if Russia agreed to a 30-day ceasefire, the return of abducted Ukrainian children and an exchange of all prisoners of war.\n\nRussia says it wants to end the war by diplomatic means and is ready to discuss a ceasefire.\n\nBut it has raised a list of questions and concerns, saying Ukraine could use the pause to rest its forces, mobilise extra troops and acquire more western weapons.\n\nUkraine and its allies accuse Putin of stalling, and say he is not serious about wanting peace.\n\nIt was Putin who proposed the direct talks in Turkey, but he spurned a challenge from Ukrainian President Volodymyr Zelenskiy to meet him there in person.\n\nInstead, he sent a team of mid-level officials, and Ukraine responded by naming negotiators of similar rank.\n\nUS Secretary of State Marco Rubio and Trump's Ukraine envoy Keith Kellogg were also in Istanbul, where a flurry of separate meetings took place earlier on Friday.\n\nRubio told reporters on Thursday night that, based on the level of the negotiating teams, a major breakthrough was unlikely.\n\n\"I hope I'm wrong. I hope I'm 100 per cent wrong,\" he said.\n\n\"I hope tomorrow the news says they've agreed to a ceasefire; they've agreed to enter serious negotiations. But I'm just giving you my assessment, honestly.\"\n\nRussia said on Friday it had captured another village in its slow, grinding advance in eastern Ukraine.\n\nMinutes before the start of the Istanbul meeting, Ukrainian media reported an air alert and explosions in the city of Dnipro."
    },
    {
        "title": "Putin dodges peace talks in Istanbul as Russia pushes for territorial concessions from Ukraine",
        "description": "Putin sent a junior delegation to Turkey, prompting Ukraine to say Russia is not taking peace talks seriously.",
        "content": "This article was first published in The Conversation UK’s World Affairs Briefing email newsletter. Sign up to receive weekly analysis of the latest developments in international relations, direct to your inbox.\nDemands by British, French, German and ... [8212 chars]",
        "url": "https://theconversation.com/putin-dodges-peace-talks-in-istanbul-as-russia-pushes-for-territorial-concessions-from-ukraine-256504",
        "image": "https://images.theconversation.com/files/668223/original/file-20250515-56-bh8zeh.jpg?ixlib=rb-4.1.0&rect=0%2C38%2C5940%2C2970&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-14T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "This article was first published in The Conversation UK’s World Affairs Briefing email newsletter. Sign up to receive weekly analysis of the latest developments in international relations, direct to your inbox.\n\nDemands by British, French, German and Polish leaders in Kyiv last weekend that Russia agree to a 30-day ceasefire in Ukraine or face possible “massive” sanctions went down in Moscow about as well as you’d expect. In an address from the Kremlin, Russian president Vladimir Putin lambasted European powers for talking to Russia “in a boorish manner and with the help of ultimatums”.\n\nHe did, however, offer a counter-proposal: an invitation for Ukraine to take part in direct talks in the Turkish city of Istanbul. Putin called the talks “the first step towards a long-term, lasting peace”. Ukraine’s president, Volodymyr Zelensky, accepted the invitation and announced he would attend the talks in person. He challenged Putin to do the same.\n\nBut on the eve of the talks it was announced that, no, Putin wouldn’t attend and a junior delegation would be sent in his place. Zelensky, who is in Turkey anyway for talks with the Turkish president, Recep Tayyip Erdoğan, has called the Russian envoy “phony” and accused Moscow of sending “stand-in props”.\n\nPutin’s no-show, alongside Russia’s refusal to agree to a ceasefire as a precursor to negotiations, probably says all you need to know about whether Moscow truly intends to bring the war to an end. But, regardless, the talks are the first to take place directly between the two warring parties since the early weeks of Russia’s full-scale invasion.\n\nSign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK. Every Thursday we’ll bring you expert analysis of the big stories in international relations.\n\nThe Russian delegation in Istanbul is being led by Vladimir Medinsky, a Putin aide who led the previous round of direct peace talks with Ukraine. This is evidence, as Stefan Wolff and Tetyana Malyarenko also point out, that Russia wants the talks to be based on the same framework as in 2022 – namely, forcing Ukraine to accept significant restrictions on its military and sovereignty.\n\nWolff and Malyarenko, who are two regular contributors to our coverage of the war in Ukraine, explain that Russia’s territorial demands have become more contentious since the start of the war. Russia’s current position is that it sees international recognition of Crimea, Sevastopol, the Donetsk and Luhansk People’s Republics, and the Kherson and Zaporizhzhia regions as part of Russia as “imperative”.\n\nThis is a non-starter for Ukraine. But Wolff and Malyarenko suggest there could be some flexibility on accepting that some parts of Ukrainian territory are under temporary Russian control in exchange for peace.\n\nThe problem, they write, is that much of the territory Russia currently occupies, including Crimea and land on the shores of the Azov Sea, is of key strategic value for Russia. Donetsk and Luhansk, meanwhile, have substantial economic value because of the resources located there.\n\nIn any case, there is no guarantee that territorial concessions from Kyiv now would put a permanent end to the war, write Wolff and Malyarenko. This is because it “does not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorstep”.\n\nRead more: Territorial concessions will be central to any Ukraine peace deal, and to Russia's long-term plan\n\nLasting peace between India and Pakistan, two countries that regularly clash over control of the disputed Kashmir region, is proving equally tricky to find. Several rounds of military strikes, prompted by a terrorist attack in Indian-administered Kashmir in April that killed at least 31 people, have recently brought the nuclear powers closer to war than they have been in decades.\n\nThe Trump administration initially expressed reluctance to get involved, saying it was “none of our business”. But as hostilities rapidly escalated, raising the prospect of nuclear war, US officials stepped in and talked down the two countries. A ceasefire was agreed that, for almost a week now, seems to have held.\n\nAlex Waterman and Sudhir Selvaraj, experts on peace studies at the University of Bradford, say the ceasefire represents an “incredibly precarious peace”.\n\nThat ceasefires have been agreed – and respected – by the two parties before is cause for optimism, they write. But cross-border tensions have increased in recent years. Waterman and Selvaraj argue this has been part of a strategy used by Pakistan’s powerful army to deflect attention away from political and economic crises at home.\n\nTensions remain high and may, at some point, spill over again. Some of the decisions taken by India after the recent terror attack, for instance, such as the suspension of a treaty governing water sharing of rivers in the Indus basin, could compel further support for militant groups in Kashmir. Despite a US offer to mediate talks between the two countries, deeper resolution looks a way off.\n\nRead more: India and Pakistan have agreed a precarious peace – but will it last?\n\nDonald Trump, meanwhile, is wrapping up his four-day tour of the Middle East. His visit has seen him sit down with the Saudi crown prince and the Qatari emir (as well as Syria’s leader, Ahmed al-Sharaa) to discuss bolstering economic and security ties.\n\nIn that sense, the trip has been a resounding success. Trump signed a US$142 billion (£107 billion) arms deal with Saudi Arabia and agreements with Qatar that, according to the White House, will “generate an economic exchange worth at least US$1.2 trillion”.\n\nAdam Hanieh, a professor of political economy at the University of Exeter, explains that arrangements like these are part of a long history in which the Gulf monarchies have supported the architecture of US global power.\n\nIn this piece, Hanieh explores how the vast amounts of income generated by the Gulf’s nationalised petroleum industries in the 20th century was invested into US financial markets. Gulf states, he writes, were essential contributors to the growth of the US as a global financial power.\n\nThe US promised military protection in return, resulting in a web of American military bases across the region. As Trump’s lavish welcome in the Middle East shows, the relationship between the US and Gulf monarchies looks robust.\n\nBut much has changed in the past two decades, says Hanieh, referring to China’s rise as a global manufacturing hub. The Gulf is a critical energy lifeline for Beijing, while China’s demand for oil, gas and petrochemicals will be a vital part of the Gulf’s economic future.\n\nRead more: Not every US president gets a free private jet, but the Gulf states have boosted US economic dominance for decades\n\nTrump is no stranger to competition with China, as his first five months in office have shown. Tit-for-tat tariffs that the US and China imposed on each other quickly snowballed into heavy duties, as high as 145% on Chinese goods looking to enter the US.\n\nHowever, after weeks of signalling that tariff levels could reduce, US and Chinese officials announced this week that US tariffs on Chinese goods would drop to 30% for a period of 90 days, while Chinese tariffs on US products would drop back to 10%. Trade negotiations between the two countries will continue.\n\nWe asked Chee Meng Tan, an assistant professor of business economics at the University of Nottingham, what the deal means for China. He says the tariff reduction has provided China with much-needed relief as it attempts to repair its ailing economy.\n\nBut China will ultimately hope to bring US tariffs down to around 10%, in line with the rest of the world. And, as Tan explains, there is more China can do to persuade the Trump administration to cut tariffs further. Ensuring the flow of critical minerals to the US and assuring its support for US agriculture, an important political support base for Trump, will be key.\n\nChina needs to engage with the US and lower US tariffs as much as possible. But it will want to look at other options, writes Tan, rather than relying on an unpredictable Trump. The next 90 days are a big deal for Beijing.\n\nRead more: China-US trade war: the next 90 days are a big deal for Beijing as it seeks long-term solutions\n\nJonathan Este is on holiday.\n\nWorld Affairs Briefing from The Conversation UK is available as a weekly email newsletter. Click here to get updates directly in your inbox."
    },
    {
        "title": "Australian feared killed while fighting Russia in Ukraine",
        "description": "Military sources believe the 25-year-old may have been killed in April.",
        "content": "A young Australian is feared killed while fighting in Ukraine against Russia.\nThere are grave concerns for Caleb List, 25, who is missing in Ukraine’s eastern Kharkiv region.\nWATCH THE VIDEO ABOVE: Australian man feared dead in war-torn Ukraine.\nKnow... [3527 chars]",
        "url": "https://7news.com.au/news/australian-feared-killed-while-fighting-russia-in-ukraine-c-18691706",
        "image": "https://images.7news.com.au/publication/C-18691706/30d3c5a7de2056ede6906c10894e8061ad29460a-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-14T06:34:47Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "The family of a young Australian feared killed while fighting in Ukraine against Russia hold hope he will be found alive.\n\nThere are grave concerns for Caleb List, 25, who is missing in the country’s eastern Kharkiv region.\n\nWATCH THE VIDEO ABOVE: Australian man feared dead in war-torn Ukraine.\n\nKnow the news with the 7NEWS app: Download today\n\nList had volunteered with Ukraine’s foreign legion, and military sources believe he may have been killed by artillery fire near the city of Izyum in April, the ABC reports.\n\nHis remains have not been recovered and his death has not been confirmed.\n\n“There’s a number of scenarios so while there’s still those possibilities we’ll hold out hope that he’ll come home to us and we’ll be able to get him home and keep him home,” List’s uncle Michael Connolly told 7NEWS.\n\nHe added: “I know Caleb and I know he’s a fairly clever young lad. If he (had a chance to get) out of that situation, well and truly, he would have gotten out of it.”\n\n7NEWS.com.au understands the Department of Foreign Affairs and Trade (DFAT) is providing consular assistance to the fighter’s family, but it has declined to comment on specific cases.\n\n“(DFAT) is aware of people attempting to travel to fight in the war and a small number of Australians reported as missing or deceased in Ukraine,” a department spokesperson said.\n\nThe Australian government has again warned citizens not to travel to the region.\n\n“We all condemn Russia’s illegal and immoral invasion but it is not for Australians to travel to Ukraine to fight,” Foreign Minister Penny Wong said.\n\nSpeaking in Perth on Wednesday, Prime Minister Anthony Albanese described the reports surrounding List as “deeply troubling”.\n\n“My heart goes out to the family and loved ones of the gentleman concerned,” he said.\n\n“There is a travel warning in place for a reason. Australians should not be travelling to Ukraine.\n\n“It is dangerous and people should follow that advice.”\n\nThere are grave fears for Australian Caleb List in Ukraine. Credit: Deutsche Welle\n\nList, a former labourer from Queensland, travelled to Ukraine three years ago to fight against Russia’s invasion.\n\nIn a 2024 interview with German broadcaster Deutsche Welle, List said he “wanted to push myself to the extreme”.\n\n“I’ve basically done that and now I just do this because it’s the only thing I’m really good at,” he said.\n\nIn 2023, he told the SBS his parents were “quite proud of me” and “happy that I’m happy”.\n\n“You can die anywhere. It’s less likely in Gladstone … but I could also breathe enough coal dust to get black lung,” he said.\n\n“At the end of the day I’m just a mercenary and I’m just a soldier of fortune.\n\n“I’m just looking for an experience and enjoyment and something to get me through life, because in Australia I didn’t really have much going for me.”\n\nHe said he had been interested in the army but that he had been rejected by Australia’s Defence Force.\n\n“He was always wanting to be in the military so his wanting to be a soldier probably outweighed his desire for anything else,” his uncle said.\n\nList was most recently in Australia about six months ago and was described as “the Caleb that we always knew”.\n\n“He wasn’t affected by the warzone... well if he was he kept it to himself,” Connolly said.\n\nList’s family were worried about his safety in Ukraine but knew he “wanted to make a difference and he wanted to help”\n\n“I would like people not to judge him harshly because he didn’t go over (to Ukraine) with an agenda,” Connolly said.\n\n‘Extremely dangerous’\n\nIt comes after confirmation Australian Nick Parson died while working for a landmine clearing charity, also in Izyum.\n\nIt is not known exactly what happened, but he was working with UK-based charity Prevail Together as a bomb disposal expert at the time.\n\nParsons was among three people critically injured, including Prevail’s British co-founder, Chris Garrett, who died from his injuries.\n\nAlbanese this week offered his “deepest condolences and sympathies” to the Australian’s family.\n\n“I can confirm he wasn’t a participant in the conflict. He was volunteering with a humanitarian organisation and so I do want to remind Australians that Ukraine is a do-not-travel zone,” Albanese said.\n\n“The situation is extremely dangerous and we continue to strongly advise all Australians not to travel to Ukraine under any circumstances.”\n\nQueenslander Jed William Danahay was killed by Russian forces in Izyum in 2022 while working as a combat medic helping injured frontline troops.\n\nMeanwhile, Ukraine leader Volodymyr Zelenskyy insists he will attend a meeting with Russia if Vladimir Putin is there.\n\nZelenskyy said he wants to negotiate an unconditional 30-day ceasefire as the first step towards ending the war.\n\nThe Kremlin has yet to confirm if Putin will take part in the talks expected to take place in Istanbul on Thursday."
    },
    {
        "title": "Could Australia learn about prepardness from Finland, the prepper nation of the Nordics?",
        "description": "Finland has long been a nation of preppers, thanks in part to its close proximity to Russia. So could its self-sufficiency be a role model for other nations, including Australia?",
        "content": "Cheerful and alert don't seem like characteristics that go hand in hand. But in Finland, they do.\nOften ranked as one of the happiest places in the world, the country is also known by another title, as the \"prepper nation of the Nordics\".\nDuring the ... [13633 chars]",
        "url": "https://www.abc.net.au/news/2025-05-14/could-finland-prepper-mindset-be-a-role-model-for-australia/105245186",
        "image": "https://live-production.wcms.abc-cdn.net.au/4450fd401375c71af1b1d440fa281cab?impolicy=wcms_watermark_news&cropH=2067&cropW=3675&xPos=0&yPos=190&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-13T21:00:00Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-14/could-finland-prepper-mindset-be-a-role-model-for-australia/105245186 on URL https://www.abc.net.au/news/2025-05-14/could-finland-prepper-mindset-be-a-role-model-for-australia/105245186"
    },
    {
        "title": "Territorial concessions will be central to any Ukraine peace deal, and to Russia’s long-term plan",
        "description": "Russia’s push for territorial concessions is part of its wider agenda of extending its regional sphere of influence and threatening Europe.",
        "content": "If the Ukrainian president, Volodymyr Zelensky, and his Russian counterpart, Vladimir Putin, meet in Istanbul on May 15, territory – and who controls it – will be high on their agenda.\nPutin offered to start direct talks between Russia and Ukraine at... [6494 chars]",
        "url": "https://theconversation.com/territorial-concessions-will-be-central-to-any-ukraine-peace-deal-and-to-russias-long-term-plan-256347",
        "image": "https://images.theconversation.com/files/667903/original/file-20250514-62-cbi7p1.jpg?ixlib=rb-4.1.0&rect=0%2C51%2C3300%2C1650&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-13T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "If the Ukrainian president, Volodymyr Zelensky, and his Russian counterpart, Vladimir Putin, meet in Istanbul on May 15, territory – and who controls it – will be high on their agenda.\n\nPutin offered to start direct talks between Russia and Ukraine at a press conference on May 11. Donald Trump pushed Zelensky to accept this offer in a social media post, saying that “Ukraine should agree to this, IMMEDIATELY.”\n\nThe Ukrainian president, still buoyed by a meeting with the British, French, German and Polish leaders that called for an unconditional 30-day ceasefire, agreed shortly afterwards.\n\nRussia has said it wants to focus on the Istanbul communique of March 2022 and a subsequent draft agreement that was negotiated, but never adopted, by the two sides in April 2022.\n\nGet your news from actual experts, straight to your inbox. Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.\n\nThese 2022 negotiations focused on Ukraine becoming a permanently neutral state and on which nations would provide security guarantees for any deal. They also relegated discussions over Crimea to separate negotiations with a ten-to-15-year timeframe.\n\nRussia uses the phrase “the current situation on the ground” as thinly disguised code for territorial questions that have become more contentious over the past three years. This relates to Russian gains on the battlefield and the illegal annexation of four Ukrainian regions in September 2022 (in addition to Crimea, which Russia also illegally annexed in 2014).\n\nRussia’s position, as articulated recently by the country’s foreign minister, Sergey Lavrov, is that “the international recognition of Crimea, Sevastopol, the DPR, the LPR, the Kherson and Zaporozhye regions as part of Russia is … imperative”.\n\nThis is clearly a non-starter for Ukraine, as repeatedly stated by Zelensky. There could, however, be some flexibility on accepting that some parts of sovereign Ukrainian territory are under temporary Russian control. This has been suggested by both Trump’s Ukraine envoy, Keith Kellogg, and Kyiv’s mayor, Vitali Klitschko.\n\nInstitute for the Study of War.\n\nBlack Sea’s strategic value\n\nThe territories that Russia currently occupies, and claims, in Ukraine have varying strategic, economic and symbolic value for Moscow and Kyiv. The areas with the greatest strategic value include Crimea and the territories on the shores of the Azov Sea, which provide Russia with a land corridor to Crimea.\n\nThe international recognition of Crimea as part of Russia, as apparently suggested under the terms of an agreement hashed out by Putin and Trump’s envoy Steve Witkoff, could expand the areas of the Black Sea that Russia can claim to legally control.\n\nThis could then be used by the Kremlin as a launchpad for renewed attacks on Ukraine and to threaten Nato’s eastern maritime flank in Romania and Bulgaria. Any permanent recognition of Russia’s control of these territories is, therefore, unacceptable to Ukraine and its European partners.\n\nRead more: Russia-China ties on full display on Victory Day – but all is not as well as Putin is making out\n\nDonetsk and Luhansk are of lower strategic value, compared with Crimea and the Kherson and Zaporizhzhia regions. However, they do have economic value because of the substantial resources located there. These include some of the mineral and other resources that were the subject of a separate deal which the US and Ukraine concluded on April 30.\n\nThey also include Europe’s largest nuclear power plant in Zaporizhzhia and a large labour force among their estimated population of between 4.5 million to 5.5 million people who will be critical to Ukraine’s post-war reconstruction.\n\nBeyond the strategic and economic value of the illegally occupied territories, the symbolism that both sides attach to their control is the most significant obstacle to any deal, given how irreconcilable Moscow’s and Kyiv’s positions are. For both sides, control of these territories, or loss thereof, is what defines victory or defeat in the war.\n\nPutin may be able to claim that some territorial gains in Ukraine since the start of the full-scale invasion in February 2022 are a victory for Russia. But even for him any compromise that would see Russia give up territory that it has conquered – often at exceptionally high cost – would be a risky gamble for the stability of his regime.\n\nAnything less than the complete restoration of the country’s territorial integrity in its 1991 borders would imply recognition of defeat in the war for Ukraine. This would critically threaten the stability of the Zelensky government, whose political programme rests on exactly the premise of a return to the 1991 borders.\n\nLong-term consequences\n\nAs a result, the Ukrainian leadership has become hostage to its own information strategy, which has placed the “return of all territories” at the top of the criteria for victory. This is a goal widely shared among Ukrainians, according to a poll conducted by the Razumkov Center in March 2025. But it will be hard to achieve.\n\nRead more: US-Ukraine minerals deal looks better for Kyiv than expected – but Trump is an unpredictable partner\n\nApart from the potential domestic fall-out from any territorial compromises that Ukraine may be forced to make, there is another reason why the territorial question has become so intractable.\n\nBeyond any strategic, economic and symbolic value that the occupied Ukrainian territories hold from the Kremlin’s perspective, control over territory has always been an instrument for Russia to pursue its broader geopolitical agenda of exercising influence over its neighbours – from Moldova, to Georgia, Armenia and Ukraine.\n\nIt is also important to remember that Russia’s territorial claims in Ukraine have gradually expanded since 2014. Until September 2022, when it annexed the other four regions, Russia laid claim to Crimea only.\n\nThere is no guarantee that any territorial concession from Kyiv now would put a permanent end to Moscow’s territorial expansionism. It is therefore worrying that Trump envoy Witkoff, in an interview with the Breitbart news website, reiterated the US view that the two sides need to find compromises on who controls which territories.\n\nRussia’s aggression against Ukraine was not a war over territory as such, but was part of Moscow’s agenda to restore the sphere of influence that it lost at the end of the cold war. This agenda is far from finished.\n\nThe strategy of both Moscow and Washington to focus on territorial consequences may lead to a ceasefire. But it will not address the fundamental issue of how to deal with a vengeful and revisionist autocracy on Europe’s doorsteps."
    },
    {
        "title": "International Civil Aviation Organization rules Russia downed flight MH17 in 2014",
        "description": "It ruled that Russia was responsible for the downing of a Malaysian airliner over Ukraine that killed all 298 people on board, including 38 Australians.",
        "content": "The International Civil Aviation Organization (ICAO) council has ruled that Russia was responsible for the downing of a Malaysian airliner over Ukraine that killed all 298 people on board, including 38 Australians citizens or residents.\nThe council f... [2252 chars]",
        "url": "https://www.abc.net.au/news/2025-05-13/russia-responsible-for-downing-of-flight-mh17/105285364",
        "image": "https://live-production.wcms.abc-cdn.net.au/fcd5142c327e2204771dc8a72d7f4ab3?impolicy=wcms_watermark_news&cropH=515&cropW=914&xPos=10&yPos=0&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-12T23:31:21Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-13/russia-responsible-for-downing-of-flight-mh17/105285364 on URL https://www.abc.net.au/news/2025-05-13/russia-responsible-for-downing-of-flight-mh17/105285364"
    },
    {
        "title": "MH17: International Civil Aviation Organisation finds Russia responsible for downing Malaysia Airlines flight",
        "description": "The International Civil Aviation Organisation has issued a historic ruling, finding Russia responsible for downing Malaysian Airlines Flight MH17 which killed 298 people, including Australians.",
        "content": "The International Civil Aviation Organisation (ICAO) has issued a historic ruling, finding Russia responsible for downing Malaysian Airlines Flight MH17 which killed 298 people, including Australians.\nMH17, scheduled to fly from Amsterdam to Kuala Lu... [1528 chars]",
        "url": "https://www.perthnow.com.au/news/australia/mh17-international-civil-aviation-organisation-finds-russia-responsible-for-downing-malaysia-airlines-flight-c-18672356",
        "image": "https://images.perthnow.com.au/publication/C-18672356/18b95732768cfd32de2534d9ffa9c43b16e97257-16x9-x0y75w800h450.jpg?imwidth=1200",
        "publishedAt": "2025-05-12T20:49:26Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "The International Civil Aviation Organisation (ICAO) has issued a historic ruling, finding Russia responsible for downing Malaysian Airlines Flight MH17 which killed 298 people, including Australians.\n\nMH17, scheduled to fly from Amsterdam to Kuala Lumpur on 17 July 2014 was shot down by a surface-to-air missile while flying over eastern Ukraine.\n\nOf the 283 passengers and 15 crew, there were no survivors.\n\n“This is a historic moment in the pursuit of truth, justice and accountability for the victims of the downing of Flight MH17, and their families and loved ones,” Foreign Minister Penny Wong said.\n\n“The ICAO Council found that Russia breached the prohibition under international law on the use of weapons against civil aircraft in flight and is responsible for the loss of 298 innocent lives, including 38 who called Australia home.”\n\nSenator Wong said the Government “welcomes the ICAO Council’s decision”, highlighting that the “fundamental principle that weapons should not be used again civil aircraft” had been upheld, but the group to “move swiftly to determine remedies for this violation.”\n\nCamera Icon Senator Penny Wong has called on Russia to ‘face up’ to responsibility for downing MH17. Credit: MICK TSIKAS / AAPIMAGE\n\n“We call upon Russia to finally face up to its responsibility for this horrific act of violence and make reparations for its egregious conduct, as required under international law.”\n\nSenator Wong offered the Government’s thoughts to those impacted by the tragedy,.\n\n“Our thoughts remain with those who lost their lives as a result of Russia’s actions, their families and loved ones,” she said.\n\n“While we cannot take away the grief of those left behind, we will continue to stand with them in that grief and pursue justice for this horrific act.”"
    },
    {
        "title": "Ukraine's Zelenskiy wants face-to-face talks with Putin",
        "description": "Volodymyr Zelenskiy insists that Ukraine-Russia talks with Vladimir Putin can only happen in person, while US President Donald Trump muses about attending them.",
        "content": "President Volodymyr Zelenskiy will only attend talks on Ukraine if Russia's Vladimir Putin is also there, the Ukrainian leader's top aide says, challenging the Kremlin to show it is genuine about seeking peace.\nUS President Donald Trump has offered t... [3324 chars]",
        "url": "https://www.perthnow.com.au/news/conflict/putin-serious-on-talks-ukraine-says-he-ignores-truce-c-18671323",
        "image": "https://images.perthnow.com.au/publication/C-18671323/cf5fcd73de18a2a60f8677e924064047eebccba2-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-05-12T17:24:44Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "President Volodymyr Zelenskiy will only attend talks on Ukraine if Russia's Vladimir Putin is also there, the Ukrainian leader's top aide says, challenging the Kremlin to show it is genuine about seeking peace.\n\nUS President Donald Trump has offered to attend Thursday's proposed meeting in Istanbul, which has become the focus of his attempts to end the deadliest conflict in Europe since World War II.\n\nPutin has yet to say if he will take part.\n\nBoth Russia and Ukraine have sought to show they are working towards peace after Trump prioritised ending the war, but they have yet to agree any clear path.\n\nPutin on Sunday proposed direct talks with Ukraine after ignoring a Ukrainian proposal for an unconditional 30-day ceasefire.\n\nTrump then publicly told Zelenskiy to accept.\n\n\"President Zelenskiy will not meet with any other Russian representative in Istanbul, except Putin,\" Ukrainian presidential adviser Mykhailo Podolyak told Reuters.\n\nHis chief of staff, Andriy Yermak, said Zelenskiy's trip to Turkey showed Kyiv was ready for talks but repeated Ukraine's stance that any negotiations must come after a ceasefire.\n\n\"Our position is very principled and very strong,\" Yermak said during a visit to Copenhagen.\n\nMoscow has not said if Putin will travel to Turkey.\n\n\"We are committed to a serious search for ways of a long-term peaceful settlement,\" Kremlin spokesman Dmitry Peskov told reporters on Monday but would not comment further on the talks.\n\nPutin launched a full-scale invasion of Ukraine in February 2022, unleashing a war that has killed hundreds of thousands of soldiers on both sides.\n\nMost of Europe has rallied around Kyiv providing arms and financial aid, while Russia has turned to Iran and North Korea for support.\n\nTrump has demanded the two nations end the war, threatening to walk away from efforts to broker a peace deal unless there are clear signs of progress soon.\n\nIf Zelenskiy and Putin, who make no secret of their mutual contempt, were to meet on Thursday it would be their first face-to-face meeting since December 2019.\n\nTrump, who is visiting Saudi Arabia, the United Arab Emirates and Qatar this week, unexpectedly offered on Monday to travel to Istanbul, which straddles the divide between Europe and Asia.\n\n\"I was thinking about actually flying over there. There's a possibility of it, I guess, if I think things can happen, but we've got to get it done,\" Trump said before leaving for his second foreign trip since returning to the White House in January.\n\n\"Don't underestimate Thursday in Turkey.\"\n\nFollowing the offer, US Secretary of State Marco Rubio discussed the \"way forward for a ceasefire\" in Ukraine with his Ukrainian, British, French, Polish, German and EU counterparts.\n\nRussian Foreign Minister Sergei Lavrov, meanwhile, held talks with his Turkish counterpart Hakan Fidan.\n\nReuters reported in 2024 that Putin was open to discussing a ceasefire with Trump, but Moscow ruled out making any major territorial concessions and insists Kyiv abandon ambitions to join NATO.\n\nUkraine has said it is ready for talks but a ceasefire is needed first, a position supported by its European allies.\n\nUkraine and its European allies have told Russia that it would have to accept an unconditional 30-day ceasefire from Monday or face new sanctions.\n\nThe Kremlin replied, saying it would not respond to ultimatums.\n\nFrance said on Monday that European leaders, who met in Ukraine at the weekend, had asked the European Commission to put together new \"massive\" sanctions targeting Russia's oil and financial sector if Russia failed to agree a ceasefire."
    },
    {
        "title": "Trump offers to join potential Russia-Ukraine talks in Turkey",
        "description": "The US president says he is open to attending a meeting with Putin and Zelensky to press for a 30-day ceasefire.",
        "content": "Kyiv/Washington | US President Donald Trump offered on Monday (Tuesday AEST) to join prospective Ukraine-Russia talks in Turkey later this week as European countries pushed to get the Kremlin to accept their demand for a 30-day ceasefire in the war i... [262 chars]",
        "url": "https://www.afr.com/world/europe/trump-offers-to-join-potential-russia-ukraine-talks-in-turkey-20250513-p5lym8",
        "image": "https://static.ffx.io/images/$zoom_0.1765%2C$multiply_4%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/d8b598b432e725df5df974a990f1e0e4fa5d6665",
        "publishedAt": "2025-05-12T17:08:31Z",
        "source": {
            "name": "The Australian Financial Review",
            "url": "https://www.afr.com"
        },
        "full_content": "Kyiv/Washington | US President Donald Trump offered on Monday (Tuesday AEST) to join prospective Ukraine-Russia talks in Turkey later this week as European countries pushed to get the Kremlin to accept their demand for a 30-day ceasefire in the war in Ukraine.\n\nTrump spoke a day after Ukrainian President Volodymyr Zelensky, in a fresh twist to the stop-start peace talks process, said he would travel to Istanbul where he would be waiting to meet Russian counterpart Vladimir Putin.\n\nLoading...\n\nReuters"
    },
    {
        "title": "Russia-China ties on full display on Victory Day - but all is not as well as Putin is making out",
        "description": "Russia’s Victory Day commemorations were a display of how close Moscow and Beijing are.",
        "content": "Chinese troops participating in Russia’s Victory Day parade in Red Square, Moscow, on May 9 is a clear indication that President Xi Jinping is fully committed to his “no-limits” partnership with his Russian counterpart, Vladimir Putin.\nXi’s own atten... [6270 chars]",
        "url": "https://theconversation.com/russia-china-ties-on-full-display-on-victory-day-but-all-is-not-as-well-as-putin-is-making-out-256385",
        "image": "https://images.theconversation.com/files/667214/original/file-20250512-56-2sx8i0.jpg?ixlib=rb-4.1.0&rect=0%2C495%2C4993%2C2496&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-12T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "Chinese troops participating in Russia’s Victory Day parade in Red Square, Moscow, on May 9 is a clear indication that President Xi Jinping is fully committed to his “no-limits” partnership with his Russian counterpart, Vladimir Putin.\n\nXi’s own attendance of the parade, which came as part of a state visit to Russia, underlines that China is not only supporting Russia. It signified that Beijing wants this support to be understood clearly in Kyiv, Washington and European capitals.\n\nTravelling to Moscow and having his troops goose-step down Red Square was not a last-minute decision by Xi. Nor was the multitude of agreements signed by the two leaders and their joint declaration anything but part of a well established pattern of deepening relations between Russia and China.\n\nThis trend has accelerated since Russia launched its full-scale invasion of Ukraine in February 2022. But the breadth and depth of China’s commitment to Russia at this particular moment is undoubtedly related to the broader upheaval in the international order that has been worsened since Donald Trump’s return to the White House.\n\nGet your news from actual experts, straight to your inbox. Sign up to our daily newsletter to receive all The Conversation UK’s latest coverage of news and research, from politics and business to the arts and sciences.\n\nThe Trump administration, possibly spooked by market wobbles, has taken steps to restore stability. China and the US have agreed a deal to slash the import tariffs they have imposed on each other. But uncertainty remains – above all about how the complex relationships in the triangle of Washington, Beijing and Moscow will work out and where this will leave the rest of the world.\n\nRead more: Trump, Xi and Putin: a dysfunctional love triangle with stakes of global significance\n\nOn May 8, in the wake of Xi and Putin’s meetings in Moscow, Russia and China released a joint statement. It stressed the intention of the two leaders to “enhance the coordination of their approaches and to deepen the practical cooperation on maintaining and strengthening global strategic stability, as well as to jointly address common challenges and threats in this sphere”.\n\nThey reiterated this determination in their press statements afterwards. Putin emphasised that he and Xi “personally control all aspects of [the] Russia-China partnership and do all we can to expand the cooperation on bilateral issues and the international agenda alike”.\n\nA Chinese read-out from the talks was similarly clear on the alignment between the countries. Xi reportedly said that “in the face of unilateralist countercurrents, bullying and acts of power politics, China is working with Russia to shoulder the special responsibilities of major countries and permanent members of the UN Security Council”.\n\nThis unequivocal display of how close Moscow and Beijing are – as well as Putin and Xi personally – is important for both nations. For Russia, it remains important to demonstrate that western attempts at international isolation have not succeeded.\n\nFor China, the very public consolidation of ties with Russia is above all a signal to the US. China is keen to stress that Trump’s efforts to engineer a split between Moscow and Beijing, which the American president described as necessary to “un-unite” the two nations during an interview with US talk show host Tucker Carlson in November 2024, have largely failed.\n\nHowever, beyond the glossy surface of the celebrations in Moscow, all is not as well for Russia as Putin is trying to make out. For all the public displays of friendship between Xi and Putin, the relationship between the two countries remains highly asymmetrical.\n\nRussia would not be able to continue to wage its war against Ukraine without Chinese support. Trade between Russia and China is critical to propping up the Russian war economy, reaching a record high of nearly US$250 billion (£190 billion) in 2024. Their trade has increased by more than 60% since 2021, yet it is only marginally up since 2023.\n\nChina’s diplomatic clout is also helpful for Russia. If Beijing had taken an unequivocal stance opposing Moscow’s aggression, fewer leaders in the developing world would have sided with Putin.\n\nIn this case, Russia would probably have lost organisations like the Shanghai Cooperation Organisation and the Brics group of emerging economies as platforms to further its broader agenda of restoring its erstwhile status as a great power.\n\nIn that agenda, Putin has been moderately successful. But with South Africa and India’s leaders absent from Russia’s Victory Day commemorations, the list of attendees was shorter than at the Brics summit in Kazan, Russia, in October 2024.\n\nA doubled-edged sword\n\nNotably absent from the celebrations in Moscow was high-level representation from North Korea and Iran. These are two key allies of Russia with whom Moscow signed strategic partnership agreements in June 2024 and January 2025, respectively.\n\nTehran simply sent its ambassador to Moscow to attend. However, it may have compensated Putin in a different and materially more significant way.\n\nAccording to reports, Iran is readying a delivery of launchers to enable Russia to use the short-range ballistic missiles already delivered last year. This would further add to Russia’s reliance on Iranian hardware in Ukraine, which has so far been most visible in the use of Iranian-made Shahed drones.\n\nNorth Korea dispatched a military delegation led by three-star general Kim Yong-bok. Kim is widely considered the commander of North Korean forces fighting alongside Russian troops in the Kursk region of western Russia, where Ukrainian forces seized territory in August 2024 as a possible bargaining chip in future negotiations with Russia.\n\nPutin officially acknowledged the participation of North Korean troops in this operation in a statement on April 28. This acknowledgment came two days after he had announced the defeat of Ukrainian forces there in a highly choreographed and televised meeting with his chief of general staff, Valery Gerasimov.\n\nThe demonstration of Russia’s close relationships with its three core allies – China, Iran and North Korea – is a double-edged sword. On the one hand, it clearly indicates that Putin is far from isolated on the international stage.\n\nBut it also signals that Russia has become a lot more dependent on these relationships than would befit Putin’s dreams of restoring Russia’s great-power status. Neither can be much comfort to Ukraine and its allies, unfortunately."
    },
    {
        "title": "Zelenskyy calls for Russia to agree to 'lasting' ceasefire before peace talks",
        "description": "Ukrainian President Volodymyr Zelenskyy welcomes his Russian counterpart's proposal for direct talks but says his team is expecting Moscow to agree to a \"lasting\" ceasefire.",
        "content": "Russian President Vladimir Putin has proposed direct peace talks with Ukraine to \"eliminate the root causes of the conflict\" after Ukraine proposed a 30-day ceasefire with the backing of NATO powers.\nUkraine's president Volodymyr Zelenskyy has welcom... [4193 chars]",
        "url": "https://www.abc.net.au/news/2025-05-11/putin-proposes-direct-peace-talks-with-ukraine/105279076",
        "image": "https://live-production.wcms.abc-cdn.net.au/2690599507bfe9694ff39e950411e59a?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-11T01:56:44Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-11/putin-proposes-direct-peace-talks-with-ukraine/105279076 on URL https://www.abc.net.au/news/2025-05-11/putin-proposes-direct-peace-talks-with-ukraine/105279076"
    },
    {
        "title": "European leaders say Donald Trump agreed to sanction Russia unless ceasefire agreed",
        "description": "The leaders of four major European countries visited Kyiv, amid a push for Moscow to agree to a truce and launch peace talks on ending the nearly three-year war.",
        "content": "Ukraine and European leaders have agreed to an unconditional 30-day ceasefire from May 12 with the backing of US President Donald Trump, threatening Vladimir Putin with new \"massive\" sanctions if he failed to comply.\nThe announcement was made by the ... [3231 chars]",
        "url": "https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224",
        "image": "https://live-production.wcms.abc-cdn.net.au/0d5964b3f7eae8d7f7570114089c0360?impolicy=wcms_watermark_news&cropH=1841&cropW=3273&xPos=1589&yPos=112&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-10T12:04:18Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224 on URL https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224"
    },
    {
        "title": "Surprisingly Advanced Ancient Spear Tip Was Not Made by Modern Humans",
        "description": "Researchers have found that a spear tip carved from bone, unearthed from Russia in 2003, is as old as 80,000 years.",
        "content": "Researchers have found that a spear tip carved from bone, unearthed from Russia in 2003, is as old as 80,000 years. This means the hunting weapon could not have been created by modern humans.\nHomo sapiens didn't venture into Europe until about 45,000... [2438 chars]",
        "url": "https://www.sciencealert.com/surprisingly-advanced-ancient-spear-tip-was-not-made-by-modern-humans",
        "image": "https://www.sciencealert.com/images/2025/05/ManWithLongishHairAndBeardDressedInFursWeildingSpear.jpg",
        "publishedAt": "2025-05-10T12:00:41Z",
        "source": {
            "name": "ScienceAlert",
            "url": "https://www.sciencealert.com"
        },
        "full_content": "Researchers have found that a spear tip carved from bone, unearthed from Russia in 2003, is as old as 80,000 years. This means the hunting weapon could not have been created by modern humans.\n\nHomo sapiens didn't venture into Europe until about 45,000 years ago, so the most likely spear-wielders in this case were the Neanderthals (Homo neanderthalensis).\n\nAlthough examples are still rare, it seems our ancient cousins had advanced their technologies beyond stone tools, using techniques that, until recently, had only been credited to our species.\n\nThe find was explored in a new paper from a team led by archeologist Liubov Golovanova of the Laboratory of Prehistory in Russia.\n\n\"The… specimen suggests that at least some groups of late Middle Paleolithic Neanderthals in Europe have started to develop bone-tipped hunting weapons,\" explain the authors.\n\n\"They made this invention independently and without influence from early Upper Paleolithic modern humans that started to arrive to the continent much later.\"\n\nThe spear tip joins a few other recent finds that demonstrate Neanderthals developed techniques specific to working with bone, such as scraping and flat cutting. These include a 50,000-year-old cache of bone tools from Siberia and 40,000-year-old leather-softening tools from Europe.\n\nBone tools as old as 400,000 years have also been found in Italy. This is about when Neanderthals first emerged, so it is possible this technology existed even before them.\n\nBut the level of craftsmanship of these really early bone tools is not as advanced as those found in Europe after modern humans arrived, Golovanova and team note.\n\nThe scarcity of Neanderthal bone tools, compared to stone ones, may be due to decay over time, without specific environmental conditions to preserve them.\n\nThe Mezmaiskaya Cave, where the spear tip was found amongst a variety of animal remains, stone tools and signs of a campfire, likely provided the conditions required for the bone's long-term preservation.\n\n\"The preservation of bones is exceptional at Mezmaiskaya Cave,\" the researchers write. \"No evidence of weathering, chemical dissolution, sediment abrasion, root etching, or trampling have been observed on the specimen, indicating that post-depositional alteration or destruction did not affect the surfaces of the bone tool.\"\n\nGolovanova and team identified cracks in the Neanderthal's bone spear tip during their analysis. These, as well as lack of wear, suggest the weapon had been used to successfully strike something soon after it was carved and bound to a wooden shaft using tar.\n\nThe bone was likely once part of a bison.\n\nThis research was published in the Journal of Archaeological Science."
    },
    {
        "title": "Russia holds Victory Day parade featuring Xi Jinping",
        "description": "It was a show of power for Vladimir Putin as China’s president and a gaggle of other world leaders attended his victory parade.",
        "content": "Moscow | Russia on Friday celebrated the 80th anniversary of the defeat of Nazi Germany in World War II, as President Vladimir Putin presided over a massive parade of tanks, missiles and troops through Red Square and welcomed over two dozen world lea... [398 chars]",
        "url": "https://www.afr.com/world/europe/russia-holds-victory-day-parade-featuring-xi-jinping-20250509-p5ly2m",
        "image": "https://static.ffx.io/images/$zoom_0.359%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_114%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/86b71bb2c3cf1585ce547698f04e8ea27f82c39e",
        "publishedAt": "2025-05-09T13:48:31Z",
        "source": {
            "name": "The Australian Financial Review",
            "url": "https://www.afr.com"
        },
        "full_content": "Moscow | Russia on Friday celebrated the 80th anniversary of the defeat of Nazi Germany in World War II, as President Vladimir Putin presided over a massive parade of tanks, missiles and troops through Red Square and welcomed over two dozen world leaders — the most since Moscow sent troops into Ukraine.\n\nVictory Day, which Russia marks on May 9, is the country’s most important secular holiday. The parade and other festivities underline Moscow’s efforts to project its global power and cement the alliances it has forged while seeking a counterbalance to the West amid the conflict in Ukraine that is grinding through a fourth year.\n\nLoading...\n\nAP"
    },
    {
        "title": "I watched the Kremlin’s new Putin documentary (so you don’t have to) − here’s what it says about how the Russian leader views himself",
        "description": "The 90-minute film depicts Vladimir Putin in the gym, the kitchen and musing about how the West is responsible for trying to bring down Russia.",
        "content": "As the chances of President Donald Trump’s peace deal in Ukraine seemingly recede, attention turns back to the question of Vladimir Putin and his war aims. What does the Russian president want to achieve from the conflict? And when – and under what c... [7560 chars]",
        "url": "https://theconversation.com/i-watched-the-kremlins-new-putin-documentary-so-you-dont-have-to-heres-what-it-says-about-how-the-russian-leader-views-himself-256159",
        "image": "https://images.theconversation.com/files/666864/original/file-20250508-56-gl4zs.png?ixlib=rb-4.1.0&rect=0%2C8%2C720%2C360&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-08T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "As the chances of President Donald Trump’s peace deal in Ukraine seemingly recede, attention turns back to the question of Vladimir Putin and his war aims. What does the Russian president want to achieve from the conflict? And when – and under what conditions – will he be willing to make peace? Thousands of lives and billions of dollars hinge on the answers to these questions.\n\nImportant insights into Putin’s worldview on this and other matters can be gleaned from a new 90-minute documentary, “Russia. Kremlin. Putin. 25 Years,” released by the state broadcaster Rossiya on May 4, 2025, and available on YouTube.\n\nThe documentary looks back on Putin’s quarter century in power.\n\nI see the film as the Kremlin’s attempt to make its case to the Russian public. The film explains how Putin sees his place in history and why he is waging the war on Ukraine. Its release coincides with the commemoration of the 80th anniversary of the end of World War II in Europe, which Russia marks on May 9, as opposed to May 8 in the rest of Europe.\n\nAs would be expected from a Kremlin-sponsored look at Russia’s leader, it is more hagiography than hard-hitting journalism. But as a scholar who has tracked Russia’s post-Soviet slide into authoritarianism, it is nonetheless revealing. It shows us the image that Putin wants to project to the Russian public, one that has been fairly consistent during his time in office.\n\nSoftening the strongman\n\nThe film starts with the loyal and somewhat obsequious journalist Pavel Zarubin interviewing Putin at the end of his long working day in the Kremlin, at 1:30 a.m. The chat with Zarubin is interspersed with archival footage of key events and earlier speeches by Putin.\n\nPutin shows Zarubin around his apartment, which includes a chapel, a gym – Putin says he works out for 90 minutes every day – and a kitchen, in which Putin awkwardly prepares snacks for their chat. The rooms are immaculate but lifeless, albeit with a surfeit of gold leaf.\n\nThe new documentary is carefully curated with clips showing Putin as a humble man of the people. “I don’t consider myself a politician, I breathe the same air as millions of citizens of Russia,” he says at one point. We do not see anything of his chain of lavish palaces, yachts and other assets.\n\nWhile Putin’s predominant image in the outside world is that of a ruthless strongman, for domestic audiences the Kremlin has tried to soften this image.\n\nHere, the documentary is treading familiar ground. On the eve of Putin’s election in May 2000, the Kremlin published an autobiography and released a documentary packed with heartwarming anecdotes about Putin’s childhood and daily life. The image being put forward contrasted to the realities of his early presidency, when Russia was waging a brutal war in Chechnya.\n\nBlaming the West\n\nA common thread running through the film is Putin’s commitment to restoring the sovereignty and independence of Russia, which he sees as under threat by the Western powers. Prominently displayed behind Putin in the apartment is a portrait of Czar Alexander III, apparently a role model for Putin. Alexander III is not well known in the West. An avowed nationalist, during his short rule from 1881 to 1894 he pursued economic modernization and avoided starting any foreign wars.\n\nThe film is laden with anti-West propaganda. It argues that Western powers were behind the movement for independence in Chechnya, which threatened to break apart the Russian Federation. Putin goes on to blame the West for the current “special military operation” in Ukraine. In the Russian president’s telling, it was the West’s failure to implement the Minsk accords of 2014-2015, which were supposed to bring peace to the restive Donbas region in eastern Ukraine. He suggests that the West used the Minsk accords as “a pause in order to prepare for a war with Russia.”\n\nZarubin asks Putin, “Why does the West hate us, do they envy us?” It’s a question that launches Putin into a potted summary of 1,000 years of Russian history.\n\nA similar thing happened during Putin’s notorious 2024 interview with former Fox News host Tucker Carlson. Putin argues that since the rift between the Roman Catholic Church and Byzantium in 1054, the West has prioritized material wealth, while in Russia spiritual values come first. The film has several prominent references to the role of the Russian Orthodox Church in Russian identity.\n\nEarly in Putin’s presidency he had been open to cooperation with the West, taking tea with Queen Elizabeth at Buckingham Palace and developing close relationships with Italian Premier Silvio Berlusconi and German Chancellor Gerhard Schroder.\n\nBut since the 2012 demonstrations protesting his return to the presidency, Putin has increasingly used the argument that the West has abandoned “traditional values” by promoting issues such as gay rights.\n\nRussian revisionism\n\nThis is the first major official biographical documentary of Putin since the 2022 full-scale invasion of Ukraine, and it may be the closest we will get to an explanation of why Putin launched this war.\n\nThere is a long feel-good segment about the “unification” of Crimea with Russia in 2014, which is presented as the most important achievement of Putin’s time in office.\n\nThe film shows images of destruction and suffering during the current war in Ukraine, without pointing out that it was Russia that started the war. It shows the devastated city of Mariupol and states incorrectly that the city was “destroyed” by Ukrainians.\n\nThe documentary portrays the war in Ukraine as a direct continuation of World War II and a struggle against the “neo-Nazi” regime in Kyiv allegedly created by the West as part of its goal to inflict a “strategic defeat” on Russia.\n\nThe film shows Putin visiting wounded soldiers and meeting the widows and mother of fallen warriors. Putin thanks the women for their sacrifice – and they thank him for the opportunity to serve the motherland. This illustrates one of the central themes of the Kremlin worldview: that Russia is strong because its people are ready to sacrifice themselves.\n\nAnother 25 years?\n\nZarubin asks, “Is it possible to make peace with the Ukrainian part of the Russian people?” It’s phrasing that denies the existence of Ukraine as a sovereign nation.\n\nPutin replies, “It is inevitable despite the tragedy we are experiencing.”\n\nHe expresses regret that there are only 150 million Russians – as a great power, Russia needs more people. He also suggests he may need more territory, something that will be alarming for Russia’s neighbors. In one clip, Putin asks a boy, “Where do the borders of Russia end?” The boy answers, “The Bering Strait with USA.” And Putin responds, “The borders of Russia never end.”\n\nThis framing also suggests that Putin is not interested in a peace deal with Ukraine in which Russia would see only limited territorial gains, which puts the breakdown of talks over a potential U.S.-sponsored deal in context.\n\nAsked about the recent falling out between Trump and Europe sparked in part by Washington’s more pro-Russian stance, Putin answers, “Nothing has changed since Biden’s time,” adding that the “collective West” is still bent on destroying Russia.\n\nToward the end of the documentary, Zarubin asks whether Putin is thinking about choosing a successor. The Russian president says he constantly thinks about succession and would prefer a choice between several candidates. But the program does not provide any clues as to who that successor could be – and none of the potential successors are given any exposure.\n\nThe Russian people have been told for years that it is impossible to imagine Russia without Putin. This film lies firmly in that tradition.\n\nThe main intended message is clear: Putin is willing and able to fight on until he achieves victory on his own terms."
    },
    {
        "title": "Keep calm and carry on buying: how Ukrainian consumers are hitting back at Russia",
        "description": "From chocolate statues of Putin to reclaiming Russian slurs, consumerism can offer unity and agency for Ukrainians.",
        "content": "Political conflicts and global tensions always affect people on the ground and across borders. Unable to influence events such as the ongoing war against Ukraine or proposed sweeping US tariffs, people turn to whatever resources are available for def... [5468 chars]",
        "url": "https://theconversation.com/keep-calm-and-carry-on-buying-how-ukrainian-consumers-are-hitting-back-at-russia-256000",
        "image": "https://images.theconversation.com/files/666159/original/file-20250506-68-h7gr5.jpg?ixlib=rb-4.1.0&rect=0%2C0%2C2408%2C1204&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-07T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "Political conflicts and global tensions always affect people on the ground and across borders. Unable to influence events such as the ongoing war against Ukraine or proposed sweeping US tariffs, people turn to whatever resources are available for defending their livelihoods, institutions and communities.\n\nThis explains the recent surge of boycotts and “buycotts” where consumers swerve a brand or actively support it for political reasons. For example, shoppers across the world are replacing US goods with local alternatives to protect national pride and economies.\n\nIn the early days of Russia’s 2022 full-scale invasion of Ukraine, shoppers were making similar public commitments to boycott Russian products.\n\nBut there are many other ways in which brands and consumers responded to the start of the invasion in 2014. Global and local reactions from brands included donations, divestment, the creation of new products or product names and advertising and social media content linked to the invasion. In turn, consumer responses to these brand initiatives are a form of civic action.\n\nIn a study we undertook (along with our colleagues Carlo Mari, Verónica Martín Ruiz and Lizette Vorster), we analysed how marketing professionals and ordinary consumers create and interpret products and brands explicitly or implicitly acknowledging the war in Ukraine. To do this, we conducted in-depth interviews with marketing managers and consumers and analyses of brand and product imagery.\n\nOur findings highlight three ways that marketing resources and consumer responses support psycho-social and cultural resilience in war-affected communities.\n\n1. Using satire to ease symbolic threat\n\nHumour and satire have long been used for addressing pressing societal issues, and many brands in Ukraine have embraced them in response to the invasion. For example, mayonnaise brand Ukrop Style, marketed by Ukrainian firm Olkom, leant on satire to boost consumer morale.\n\nThe term “Ukrop” (meaning “dill” in Ukrainian) has been used by Russia as a slur against Ukrainians since the beginning of the war. Several “ukrop”-themed products and services then sprang up to reclaim the word and its imagery. It was used in new product names and packaging, as Olkom did.\n\nSeveral participants in our study discussed engagement with brands like this to mobilise the public spirit of defiance. For them, the use of humour helped lessen the insult directed at their nation.\n\n2. National symbols for societal cohesion\n\nWhen people perceive that their society and way of life is under threat, they often turn to cultural symbols. These can help to assert connections with others.\n\nSeveral brands have incorporated symbolic references to Ukraine in their communication messages, with national flags and designs depicting vyshyvanka embroidery (which is specific to traditional Ukrainian shirts).\n\nA Samsung advert using vyshyvanka, traditional Ukrainian garments and the phrase “Evolution is beautiful” evokes Ukraine’s 2014 Revolution of Dignity and the shared Ukrainian identity built on dignity, freedom and togetherness.\n\n3. Promoting the origin of products\n\nBetween 2014 and 2022, Ukraine and Russia continued to trade in consumer goods. During this time, several major retail chains in Ukraine used flags to mark the origin of products.\n\nThese marketing signals kept consumers informed, but potentially also supported boycotts and buycotts. Since 2022, Ukraine’s trade in consumer goods with Russia has ceased. But the labelling of Ukraine-made goods has grown. The Ukrainian ministry of economy has launched a “Made in Ukraine” trademark, encouraging people to support local manufacturers.\n\nEven when brand boycotts are no longer needed – as is the case with Ukraine and Russia, since the two countries no longer trade – consumers still use their collective power to support their local economy.\n\nThe response of consumers\n\nParticipants in our study shared the view that brand activism and marketing related to political shocks can offer people an outlet for a civic response. It also opens up conversations about the distressing events affecting them and their country.\n\nSome described these marketing activities as grassroot initiatives by fellow citizens – owners and managers of brands engaging in activism. Others stressed that their willingness to support brand activism is dependent on whether they perceive it as sincere or mere profit-seeking. Few interviewees separated private consumption from political views and actions.\n\nBrand activism and marketing related to conflict and political shocks could well be a trend that will grow in scale and scope. After all, consumption remains one domain where people have collective power.\n\nBoy/buycotting movements responding to the US tariffs are gaining momentum, while the #buyforukraine and #shopukrainian initiatives have stood the test of time.\n\nBrands and governments may be tempted to leverage this social sentiment, but here our research tells a cautionary tale. The consumers we interviewed were savvy in their assessment of the sincerity of brand activism. And they held different views about its appropriateness as a form of civic action.\n\nBrand activism merely seeking to encourage sales may backfire, evoking consumer cynicism rather than support. For example, brands like Unilever and Pepsi were criticised for appearing to be insincere in their announced suspension of sales and production in Russia.\n\nAt the same time, brand activism increasingly requires careful, nuanced consideration. More widely, consumers are not united on whether companies should take positions on political and social issues. Whether brand activism proves to be this century’s “Keep Calm and Carry On” remains to be seen."
    },
    {
        "title": "Russia looks to frame war as an inevitable part of life on Victory Day",
        "description": "Russian political figures are worried that young people nowadays are disconnected from their heritage.",
        "content": "Russia celebrates the 80th anniversary of the Soviet victory in the second world war on May 9. But while the cameras will focus on the assembled ranks of elderly war survivors watching the military parade in Red Square, Moscow, the focus of senior of... [5345 chars]",
        "url": "https://theconversation.com/russia-looks-to-frame-war-as-an-inevitable-part-of-life-on-victory-day-255751",
        "image": "https://images.theconversation.com/files/666178/original/file-20250506-56-jgx6ph.jpg?ixlib=rb-4.1.0&rect=0%2C382%2C5017%2C2508&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-07T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "Russia celebrates the 80th anniversary of the Soviet victory in the second world war on May 9. But while the cameras will focus on the assembled ranks of elderly war survivors watching the military parade in Red Square, Moscow, the focus of senior officials is on Russia’s children and young people.\n\nPatriotism in Vladimir Putin’s Russia is built on exaggerated respect for key moments in the country’s history. These moments have been chosen to create a specific story about Russia. This is a story about Russia’s military might, the ability of its citizens to endure almost unimaginable suffering for the motherland, and the inevitability of victory over its enemies.\n\nVictory Day gives the Kremlin a chance to retell that story. It also allows the state to assure Russians that they, like their ancestors, will be victorious in the so-called “special military operation” in Ukraine. Moscow describes this war as the modern-day equivalent of the fight against Nazi Germany.\n\nWith fewer witnesses to that historic victory still alive, the Kremlin’s ability to manipulate society by drawing on this important memory depends on the willingness of the next generation to embrace the state’s official history. And Russian political figures are worried that young people nowadays are disconnected from their heritage.\n\nA poll conducted in December 2022 by the Russian Public Opinion Research Centre found that 76% of Russians aged 14 to 24 believe they have a good understanding of the history of their country. But the results of an alternative poll from June 2023 show that 70% of Russia’s young people do not know enough about their nation’s history.\n\nVladimir Medinsky, the chairman of the Interdepartmental Commission of Historical Education of Russia, reflected on the issue at a forum on how to interest young people in Russian history in 2023. He said: “What needs to be done to make our children interested in history? To make interesting historical performances, to make historical films.”\n\nRussia’s leaders seek to address this perceived disconnect through military patriotic education. This is a system of surrounding children and young people with state-approved messages about Russia’s historic military victories and the role of its armed forces in making their country respected – and feared – around the world.\n\nThese messages are conveyed through textbooks and in lessons at school. But one of the challenges for the Russian state is finding ways of making this material attractive enough for young people to want to engage with it.\n\nPutin himself has indicated that he understands this challenge. At a meeting with the Russian non-profit society Znaniye (Knowledge) on April 30, the Russian president argued that “it is crucial to have both an opportunity and skills to communicate the truth about past years and decades: sincerely, compellingly and – if I may say so – in a way that truly resonates”.\n\nPatriotic youth groups are an important vehicle for delivering military patriotic education in fun and exciting ways. These groups organise activities including games and competitions, as well as more immersive activities such as role-playing and re-enactments. These activities are designed to create a deeper engagement with the events of the past.\n\nOne group, Victory Volunteers, emphasises collecting personal accounts from war veterans to add to the historical record. It also actively brings young people and war veterans together so that the heroes of future wars can be inspired by real-life stories of wartime heroism.\n\nListening to these first-hand testimonials is intended to enable young people to deepen their understanding of the experience of war, including its hardships and tragedies.\n\nYunarmiya (Young Army) is probably Russia’s best-known military patriotic youth group. It works with young people to develop their appreciation of history. But its focus on dressing its members in uniforms and training them in practical military skills has captured the attention of the world’s media.\n\nThese skills include military-style activities such as marching in formation, learning how to assemble and disassemble weapons, and how to fire them.\n\nThe Russian state also supports military patriotic education through the presidential grants fund. Hundreds of charities, youth groups and local societies apply to the fund twice a year, with the winners reportedly chosen by Putin himself.\n\nMany of the successful applications involve activities to raise young people’s awareness of historical memory, especially the memory of war.\n\nIn 2022, for example, the historical reconstruction club Volnitsa received funding to organise a memorial march “in the footsteps of the winners” to mark the 80th anniversary of the liberation of the Bogucharsky region of Russia (near the border with Ukraine) from Nazi occupation.\n\nThe successful application emphasised the emotional intensity of the reenactment and its educational effects on young participants.\n\nEvents like the 80th anniversary of Victory Day have a significance for the Kremlin that goes beyond the speeches, parades and pageantry of the day itself. They are part of an effort by the Russian state to shape the expectations and behaviour of the next generation of its citizens.\n\nBy encouraging young people to feel a personal connection to Russia’s history of war, Moscow hopes to ensure that society will regard war as an inevitable part of life. The scale of this effort suggests that Putin and other senior officials anticipate the need for a society willing to make sacrifices so that Russia can achieve victories in future wars."
    },
    {
        "title": "Joe Biden likens Donald Trump's Ukraine war diplomacy to 'appeasement' of Russia",
        "description": "Joe Biden criticises his successor's approach to Ukraine ceasefire negotiations, among other policy initiatives, in the first since interview since his White House exit.",
        "content": "Former United States president Joe Biden has warned fragmentation between the US and Europe under Donald Trump's leadership threatens to \"change the modern history of the world\" for the worse, in his first interview since leaving the White House.\nSpe... [4418 chars]",
        "url": "https://www.abc.net.au/news/2025-05-07/biden-accuses-trump-of-appeasing-russia/105266354",
        "image": "https://live-production.wcms.abc-cdn.net.au/bad0351948e140ba03229ba57002c856?impolicy=wcms_watermark_news&cropH=1075&cropW=1911&xPos=0&yPos=3&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-07T11:23:09Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-07/biden-accuses-trump-of-appeasing-russia/105266354 on URL https://www.abc.net.au/news/2025-05-07/biden-accuses-trump-of-appeasing-russia/105266354"
    },
    {
        "title": "Russia and Turkey are wielding religion as soft power - but one patriarch is standing in their way",
        "description": "Russia and Turkey’s international religious influence relies on a specific national narrative – one that is challenged by the Patriarchate of Constantinople.",
        "content": "Turkish nationalists are calling on the government of President Recep Tayyip Erdoğan to revoke the passport of Archbishop Elpidophoros of America, the highest ranking Greek Orthodox cleric in the US.\nAs a Turkish citizen, the archbishop is one of the... [6066 chars]",
        "url": "https://theconversation.com/russia-and-turkey-are-wielding-religion-as-soft-power-but-one-patriarch-is-standing-in-their-way-254247",
        "image": "https://images.theconversation.com/files/662029/original/file-20250415-62-76osdf.jpg?ixlib=rb-4.1.0&rect=0%2C488%2C5268%2C2634&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-05-05T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "Turkish nationalists are calling on the government of President Recep Tayyip Erdoğan to revoke the passport of Archbishop Elpidophoros of America, the highest ranking Greek Orthodox cleric in the US.\n\nAs a Turkish citizen, the archbishop is one of the few clerics eligible to become the next Patriarch of Constantinople. The holder of this position is often called the “spiritual leader” of Eastern Orthodox Christians, though this status is contested.\n\nCritics of Elpidophoros believe he should be stripped of his Turkish citizenship for repeatedly referring to the Patriarch of Constantinople as “ecumenical”. This, which means the position represents a number of different Christian Churches, is a nod to the potential global authority of the office. Turkey does not recognise the patriarch’s ecumenical status.\n\nThey also criticise Elpidophoros for using the name Constantinople instead of Istanbul (most recently during a Greek Independence Day celebration at the White House). This was the name of the city when it was the capital of the Ottoman empire.\n\nThe situation might seem somewhere between petty and parochial – the concerns of a small and relatively unimportant corner of the world, or a momentary flare-up in the Greek-Turkish conflict. But this could not be further from the truth.\n\nThe Patriarchate of Constantinople is a critical player in two volatile regions: the Middle East and eastern Europe. Both Turkey and Russia, regional powers in these unstable areas, have made religion a central component of their propaganda.\n\nThey have each sought to present themselves as the guardian of their respective religious tradition, despite having spent much of the 20th century in various forms of state-sponsored hostility to religion. For Russia and Turkey, the Patriarchate of Constantinople stands as an obstacle to their preferred narratives.\n\nReligious politics\n\nRussia under Vladimir Putin and Turkey under Erdoğan have become deeply invested in promoting themselves as the guardians of traditional Christianity and Islam, respectively. By leveraging this position, they have garnered sympathy and support among people who were once indifferent or even hostile to them.\n\nInfluential conservative commentators in the US such as Tucker Carlson and Rod Dreher have praised Putin’s “anti-woke” rhetoric. And some ultraconservative American men are reportedly converting to Russian Orthodoxy.\n\nTurkey, for its part, began establishing mosques and training imams abroad, including in western Europe, as early as the 1970s. But in the past 23 years, under the rule of the Justice and Development party (AKP), it has significantly expanded these efforts.\n\nThe enemies Russia and Turkey claim to combat are both internal and external. Putin, Erdoğan and their aligned clerics, have been vocal in their denunciation of western “decadence”. This is usually represented by the liberal sexual and gender politics of western nations.\n\nYet they have been just as adamant in opposing those within their own traditions. In Russia’s case, this has meant perceived liberalisers largely situated in the Hellenic world – not just the Patriarchate of Constantinople, but also the Patriarchate of Alexandria, as well as the Churches of Greece and Cyprus.\n\nFor Turkey, this internal enemy has primarily taken the form of Saudi-backed Wahhabism, a strict, ultraconservative form of Sunni Islam.\n\nThe international religious influence of Russia and Turkey depends on a specific national narrative. Russia must be not only a historically Orthodox nation, but the leading Orthodox nation – the rightful inheritor of the eastern Roman world.\n\nLikewise, Turkey must present itself as an explicitly and entirely Muslim nation, the heir to an Ottoman empire reimagined as far more homogeneous than it ever truly was.\n\nThis requires both countries reject much of their 20th-century history. Neither Soviet communism nor the strict secularity of Turkey’s founder, Mustafa Kemal Atatürk, fits the current plot. It also demands the rewriting of medieval and early modern histories.\n\nAnd for both, the Patriarch of Constantinople poses a significant problem. This is especially true if he is seen as anything more than a local ethnic leader, hence the objection to the use of “ecumenical” in his title.\n\nIf the Patriarch of Constantinople is a global religious leader, then Moscow is not the undisputed head of the Orthodox world, nor is Turkey a homogeneously Muslim nation with a homogeneously Muslim past.\n\nWhy the next patriarch matters\n\nPatriarch Bartholomew, the current Patriarch of Constantinople, ascended to the throne in 1991. He has been a moderate and modernising force in the Orthodox world and beyond. Bartholomew has championed issues such as environmentalism, inter-religious dialogue and human rights, while also opposing Russian aggression in Ukraine.\n\nNow Bartholomew is 85 years old, the conversation has turned to the question of his successor. The options are limited, as the next patriarch must be a Turkish citizen.\n\nIf the patriarchate is to continue serving as a kind of opposition to Russian and Turkish expansionism, the next leader must also be a moderate. Should a more reactionary figure take the office, there is a real danger this counterbalance will be lost.\n\nFor those who hope to resist Russian and Turkish aggression and to promote values such as human rights in the Orthodox world and Middle East, there is simply no better choice than Archbishop Elpidophoros.\n\nHe has challenged Russian expansionism in Ukraine, defended democracy and pluralism and has taken a pastoral approach to the inclusion of LGBTQ+ people and women in the Church.\n\nThough the patriarch is a relatively obscure position in global terms, it is precisely because of the current global situation that there may be no more important religious leader than one who can exert influence across eastern Europe and the Middle East.\n\nThe fact that allies of Putin and Erdoğan have joined in attacking Elpidophoros suggests not only that they do not want him to become the next Patriarch of Constantinople. It also suggests that western democracies should take a deep interest in who does.\n\nThe patriarchate is a rejection of the historical lies upon which both Russian and Turkish soft power rest. Thus, the man who occupies the office must be up to the task."
    },
    {
        "title": "Bulgarian spies nabbed for feeding information to Russia facing jail time in the UK",
        "description": "Operating out of a rundown hotel in Norfolk, Russian spies known as \"The Minions\" and their ringleader who went by the codename \"Jackie Chan\" gathered information on targets of interest to Russia for years but after being caught they will soon be sentenced.",
        "content": "It was as though it came straight from a spy novel.\nThere was a beautician, a love triangle and a mixed-martial-arts fighter.\nThe operations were run out of a dilapidated guesthouse in a British seaside town.\nChildren's toys, car keys, water bottles ... [11731 chars]",
        "url": "https://www.abc.net.au/news/2025-05-03/bulgarian-spy-ring-russia-kremlin-caught-uk-face-sentencing/105211652",
        "image": "https://live-production.wcms.abc-cdn.net.au/0bab19a063343022cd47be992c981ece?impolicy=wcms_watermark_news&cropH=785&cropW=1395&xPos=325&yPos=595&width=862&height=485&imformat=generic",
        "publishedAt": "2025-05-02T19:18:15Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-05-03/bulgarian-spy-ring-russia-kremlin-caught-uk-face-sentencing/105211652 on URL https://www.abc.net.au/news/2025-05-03/bulgarian-spy-ring-russia-kremlin-caught-uk-face-sentencing/105211652"
    },
    {
        "title": "United States, Ukraine sign critical mineral deal as Donald Trump moves to secure peace with Russia",
        "description": "The United States and Ukraine have signed a historic economic deal that will give the United States access to Ukraine’s critical minerals, something Donald Trump thinks will bring peace in the region.",
        "content": "The United States and Ukraine have signed a historic economic deal that will give the United States access to Ukraine’s rare minerals, something US President Donald Trump thinks will help establish peace in the region.\nThe deal comes after Mr Trump c... [3556 chars]",
        "url": "https://www.perthnow.com.au/politics/world-politics/us-ukraine-mineral-deal-trump-says-he-is-ready-to-sign-this-afternoon-as-last-minute-changes-hold-off-peace-c-18543518",
        "image": "https://images.perthnow.com.au/publication/C-18543518/afd5b2b9ca576e564e341b3404e8627daa070b90-16x9-x0y75w800h450.jpg?imwidth=1200",
        "publishedAt": "2025-04-30T22:50:00Z",
        "source": {
            "name": "PerthNow",
            "url": "https://www.perthnow.com.au"
        },
        "full_content": "The United States and Ukraine have signed a historic economic deal that will give the United States access to Ukraine’s rare minerals, something US President Donald Trump thinks will help establish peace in the region.\n\nThe deal comes after Mr Trump called on Kyiv to repay the United States for billions spent on assistance given to repel Russian invasion.\n\nTreasury Secretary Scott Bessent said in a video posted to X that “this partnership allows the United States to invest alongside Ukraine, to unlock Ukraine’s growth assets, mobilise American talent, capital and governance standards that will improve Ukraine’s investment climate and accelerate Ukraine’s economic recovery”.\n\nTaking to social media, Ukraine’s Economy Minister Yulia Svyrydenko shared an image alongside US officials, also confirming the signing.\n\n“Thanks to the leadership and agreements between President Volodymyr Zelensky and President Donald Trump, Secretary of the Treasury Scott Bessant and I signed the agreement between Ukraine and the United States to establish the United States–Ukraine-Ukraine Reconstruction Investment Fund,” she wrote on X.\n\n“I thank everyone who contributed to this Agreement and helped make it stronger.\n\n“This document is capable of delivering success for both our countries — Ukraine and the United States.\n\n“God bless Ukraine and God bless the United States of America.\n\nMr Trump indicated in February that he wanted access to Ukraine’s rare earth materials as a condition for continuing United States support in the war, describing it as reimbursement for the billions of dollars in aid the United States has given to Kyiv.\n\nBut talks stalled after a tense Oval Office meeting of United States and Ukrainian leaders, and reaching an agreement since then has proven difficult and strained relations between Washington and Kyiv.\n\nMr Bessent said during a cabinet meeting at the White House that the Trump Administration was ready to sign a deal, but that there was still work to do.\n\n“The Ukrainians decided last night to make some last-minute changes,” Bessent said when asked about reports that Ukraine was ready to agree to the pact.\n\n“We’re sure that they will reconsider that. And we are ready to sign this afternoon if they are.”\n\nHe did not elaborate as to the late changes he said Ukraine had made.\n\nThe United States is seeking access to more than 20 raw materials deemed strategically critical to its interests, including some non-minerals such as oil and natural gas.\n\nAmong them are Ukraine’s deposits of titanium, which is used for making aircraft wings and other aerospace manufacturing, and uranium, which is used for nuclear power, medical equipment and weapons.\n\nUkraine also has lithium, graphite and manganese, which are used in electric vehicle batteries.\n\nFor Ukraine, the deal is seen as possibly key in getting future military aid from the United States.\n\nThe Ukrainian cabinet approved the agreement on Wednesday, empowering Svyrydenko to sign it in Washington.\n\nOnce signed by both sides, the deal would need to be ratified by the Ukrainian parliament before it could take effect.\n\nIn Moscow, a senior Kremlin official said on Wednesday that clinching a deal to end the Russia-Ukraine war “is far too complex to be done quickly”, as the United States labours to bring momentum to peace efforts and expresses frustration over the slow progress.\n\nThe negotiations come amid rocky progress in Washington’s push to stop the war.\n\nRussian President Vladimir Putin backs calls for a ceasefire before peace negotiations, “but before it’s done, it’s necessary to answer a few questions and sort out a few nuances,” Kremlin spokesman Dmitry Peskov said.\n\nMeanwhile, a night-time Russian drone attack on Kharkiv, Ukraine’s second-largest city, wounded at least 45 civilians, officials said.\n\n- with Rueters"
    },
    {
        "title": "Ukraine ready to sign rare-minerals deal sought by Trump",
        "description": "Kyiv hopes it will secure support from America in its war against Russia. Follow live updates.",
        "content": "Ukraine is ready to sign an agreement that would give the US access to its valuable rare minerals in the hopes of ensuring continued American support for Kyiv in its grinding war with Russia, senior Ukrainian officials said Wednesday.\nUkraine’s econo... [523 chars]",
        "url": "https://www.afr.com/politics/federal/ukraine-ready-to-sign-rare-minerals-deal-sought-by-trump-20250501-p5lvk3",
        "image": "https://static.ffx.io/images/$zoom_0.4324%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_live_no_age_social_wm/ce14841918a982f16f83173c8825e46ad30d1a66",
        "publishedAt": "2025-04-30T20:07:46Z",
        "source": {
            "name": "The Australian Financial Review",
            "url": "https://www.afr.com"
        },
        "full_content": "That’s a wrap. Thanks for following The Australian Financial Review’s live coverage this Thursday, May 1, 2025. We will have more for you in our next coverage.\n\nHere are some of the stories we covered today:"
    },
    {
        "title": "US-Ukraine minerals deal looks better for Kyiv than expected - but Trump is an unpredictable partner",
        "description": "While the agreement might signal that Donald Trump is running out of patience with Russia, it does little to change the underlying realities of the conflict.",
        "content": "The United States and Ukraine have finally signed a long-awaited agreement on Ukraine’s postwar reconstruction – and, at first reading, the details appear more favourable for Kyiv than many observers expected.\nAt the core of the “economic partnership... [5362 chars]",
        "url": "https://theconversation.com/us-ukraine-minerals-deal-looks-better-for-kyiv-than-expected-but-trump-is-an-unpredictable-partner-255723",
        "image": "https://images.theconversation.com/files/665238/original/file-20250501-56-moeqad.jpeg?ixlib=rb-4.1.0&rect=0%2C140%2C1290%2C645&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-04-30T14:00:00Z",
        "source": {
            "name": "The Conversation UK",
            "url": "https://theconversation.com"
        },
        "full_content": "The United States and Ukraine have finally signed a long-awaited agreement on Ukraine’s postwar reconstruction – and, at first reading, the details appear more favourable for Kyiv than many observers expected.\n\nAt the core of the “economic partnership agreement” is the exploitation of Ukraine’s mineral wealth. Ukraine will get access to US investment and technology, and the US will eventually get a share of the profits. The rest will finance the war-torn nation’s recovery if and when a peace agreement is signed with Russia.\n\nSeveral aspects of this deal stand out as positive for Ukraine. Unlike in previous drafts, the country retains ownership of its natural resources. All profits are to be invested in Ukraine for ten years after the agreement comes into force.\n\nWashington can also make its contribution in the form of new military aid, although it will be down to the US president to decide whether or not to do that.\n\nEarlier in the negotiations, a major sticking point was the demand from the US president, Donald Trump, that the agreement include compensation for past US aid to Ukraine, which he insisted amounted to US$350 billion (£260 billion). Many analysts estimate the figure is closer to US$120 billion.\n\nBefore the deal was signed, Ukraine’s prime minister, Denys Shmyhal, said the deal would “not include assistance provided before its signing”. And the Ukrainian government announcement stated that the new agreement “focuses on further, not past US military assistance”. But when the US treasury secretary, Scott Bessent, spoke to journalists, he described the deal as “compensation” for “the funding and the weapons”.\n\nSign up to receive our weekly World Affairs Briefing newsletter from The Conversation UK. Every Thursday we’ll bring you expert analysis of the big stories in international relations.\n\nWhether Bessent’s statement represents political spin, or whether there is still distance between Washington and Kyiv on this critical point, remains to be seen. The formal text has not been released, and many details remain to be ironed out. Trump can be an erratic negotiator who is prone to sudden changes of direction.\n\nIndeed, the signing of this agreement is just the latest twist in a broader effort to bring the war in Ukraine to an end – one which probably still has many surprises ahead. Trump appears to be losing patience with what he views as Russia’s refusal to engage with the peace process. Signing the deal may have been intended as a warning to Moscow to get serious about ending the conflict.\n\nThe new agreement reportedly states that the US and Ukraine share a “long-term strategic alignment”. That’s a far cry from Trump’s rhetoric only a few months ago, when he called Ukraine’s president, Vlodomyr Zelensky, a “dictator”“ and blamed Kyiv for starting the war with Russia. But given Trump’s changes of mood, this agreement is unlikely to be the final word on how he views the conflict.\n\nDespite talk of a long-term strategic alignment, one thing the deal doesn’t contain is any explicit security guarantees for Ukraine. But the White House argues – and other observers hope – that US investment in Ukraine will give the US an implicit stake in the country’s security. That might deter Russia from attacking Ukraine again, out of fear the US would act to protect its investment.\n\nAP Photo/Efrem Lukatsky\n\nHowever, once we move from the realm of politics and security to economics, several glaring flaws in this logic become apparent. They all come down to whether the mineral wealth at the heart of this agreement can be profitably exploited – and, indeed, whether it even exists.\n\nIs this a game-changing deal?\n\nThe American humorist Mark Twain is said to have once defined a mine as \"a hole in the ground owned by a liar”. Assessing the precise scale of underground mineral deposits is notoriously difficult – and not every deposit can be extracted in a profitable fashion.\n\nIn Ukraine, the exploratory work has simply not been done. Even the supposed size of the deposits, which are based on old Soviet surveys conducted in a superficial fashion, is not certain.\n\nMany of the minerals that supposedly lie under Ukraine’s surface are so called “rare earths”, which are critical to hi-tech supply chains. But they are also expensive and time-consuming to exploit, requiring a massive upfront investment which may eventually be lost. Even in successful cases, it generally takes over a decade to get production onstream.\n\nToday, there are few rare-earth projects under development anywhere in the world outside China – even in countries that are not current (and possibly future) war zones. Most of Ukraine’s supposed deposits lie in the east of the country in areas vulnerable to Russian attack, making investment risky.\n\nAll of this makes economic partnership agreement of doubtful long-term significance for the broader peace process. The potential gains from it are too hypothetical to make much difference within a meaningful timescale. The deal is unlikely to generate much real economic incentive for the US to defend Ukraine, and so is unlikely to become a new source of military assistance for Kyiv.\n\nFor the Russian president, Vladimir Putin, the deal doesn’t change a lot. While it might indeed be a signal that Trump is running out of patience with Russia, it does little to change the underlying realities of the conflict.\n\nWe can’t rule out the possibility that Trump, as unpredictable as ever, might make a more meaningful commitment to Ukraine in the future, one that changes the course of the war. But – at first glance, certainly – this minerals deal is not it."
    },
    {
        "title": "France accuses Russia of a decade’s worth of high-profile cyberattacks",
        "description": "France publicly attributes ‘Macron-leaks’ to the Kremlin and APT28, as France and the EU increase their pressure on Russia to withdraw from Ukraine.",
        "content": "In an unprecedented display of diplomatic aggression, French authorities publicly accused Russia of sponsoring several high-profile cyber attacks on French entities for over a decade to gather intelligence and destabilize the country. The incidents i... [2530 chars]",
        "url": "https://www.theverge.com/politics/658222/france-russia-cyberattacks-fancy-bear-apt28-macron-leaks",
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/gettyimages-2207687168.jpg?quality=90&strip=all&crop=0%2C1.1429444891634%2C100%2C78.517410454583&w=1200",
        "publishedAt": "2025-04-29T23:15:07Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "full_content": "In an unprecedented display of diplomatic aggression, French authorities publicly accused Russia of sponsoring several high-profile cyber attacks on French entities for over a decade to gather intelligence and destabilize the country. The incidents include everything from a faked Islamic State takeover of a French television broadcast signal in 2015 to the leak of President Emmanuel Macron’s emails in 2017.\n\nOn Tuesday, France’s Foreign Ministry formally attributed those cyberattacks and several others to APT28, a Russian military intelligence (GRU) hacking unit also known as Fancy Bear, best known in America for leaking Hillary Clinton’s emails during the 2016 U.S. presidential election and sustained cyberattacks on U.S. political operations. APT28’s activities in France followed the same playbook: the “Macron leaks” were published the day before France’s presidential election in the hopes of swaying voters, and the faked ISIS broadcast hijacking, which took place in the wake of the 2015 Bataclan terrorist attacks, were intended to “create a panic in France.”\n\nAccording to the French government, the GRU has escalated its cyberattacks against France and other members of the European Union since 2021, shortly before Russia invaded Ukraine. (Ukraine itself has been a longtime frequent target of Russian cyberwarfare.) The intrusions targeted entities not just in government, but also in finance, aerospace and defense, sports organizations affiliated with the 2024 Paris Olympics, think tanks, and the media. To display its own cyber defense capacities, France revealed the geographical location of one of APT28’s units – a signal that its operators were able to trace the origins of Russian cyber incursions.\n\nThis is the first time France has publicly attributed a cyber attack to a foreign government’s intelligence service, according to Le Monde. The diplomatic environment has shifted profoundly, however: Vladimir Putin refuses to end his years-long invasion of Ukraine without getting to keep the territory he’s seized – an untenable position for both Ukraine and the EU, which views Russian territorial gains as a threat to the EU’s geopolitical integrity. Russian cyberattacks pose an additional threat, both to their national security apparatus and election integrity.In an interview the day before the Ministry’s public declaration, Macron told the media that he believed that France and their Western allies – including President Donald Trump – would increase pressure on Russia “over the next eight to ten days” to accept their terms. He also announced that France and Poland would soon sign a “friendship treaty” that will include joint efforts to combat Russian election interference via cyberattacks and misinformation campaigns in both countries."
    },
    {
        "title": "Trump is good at viral moments but Ukraine is waiting for real, war-ending diplomacy",
        "description": "Donald Trump has made big promises on Russia's war in Ukraine but he's becoming an impatient broker.",
        "content": "Welcome to the wild and wacky ride of global diplomacy under America's 47th president, in which Donald Trump's opinions on the leaders of Ukraine and Russia can change in a heartbeat.\nDays after Volodymyr Zelenskyy and Trump created an image for the ... [8385 chars]",
        "url": "https://www.abc.net.au/news/2025-04-30/ukraine-russia-donald-trump-diplomacy-vatican-meeting-zelenskyy/105228574",
        "image": "https://live-production.wcms.abc-cdn.net.au/20c5b1a73a2435dca13a2c0cb99f07a5?impolicy=wcms_watermark_news&cropH=540&cropW=960&xPos=0&yPos=370&width=862&height=485&imformat=generic",
        "publishedAt": "2025-04-29T22:51:02Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-04-30/ukraine-russia-donald-trump-diplomacy-vatican-meeting-zelenskyy/105228574 on URL https://www.abc.net.au/news/2025-04-30/ukraine-russia-donald-trump-diplomacy-vatican-meeting-zelenskyy/105228574"
    },
    {
        "title": "Putin announces unilateral three-day ceasefire in Ukraine",
        "description": "Russia has announced a full ceasefire in Ukraine next month as the Allies celebrate Victory Day over Nazi Germany.",
        "content": "Russian President Vladimir Putin has declared a three-day ceasefire in the war with Ukraine next month to mark the 80th anniversary of the victory of the Soviet Union and its allies in World War II.\nThe Kremlin said the 72-hour ceasefire would run fr... [2879 chars]",
        "url": "https://7news.com.au/news/putin-announces-unilateral-three-day-ceasefire-in-ukraine-c-18506446",
        "image": "https://images.7news.com.au/publication/C-18506446/31bc2bb2007eec41ed46f09af1331a64cde4fece-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-04-28T12:21:23Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "Russian President Vladimir Putin has declared a three-day ceasefire in the war with Ukraine next month to mark the 80th anniversary of the victory of the Soviet Union and its allies in World War II.\n\nThe Kremlin said the 72-hour ceasefire would run from the start of May 8 to the end of May 10, and Russia called on Ukraine to join it as well.\n\nThe Kremlin said Russian President Vladimir Putin ordered the full cessation of hostilities on “humanitarian grounds” for the Victory Day on May 9.\n\nKnow the news with the 7NEWS app: Download today\n\nIn the event of violations by the Ukrainian side, Russia’s armed forces would give an “adequate and effective response”, the statement said.\n\nIt comes as US President Donald Trump scaled up efforts to broker a peace deal in Ukraine.\n\nMoscow and Kyiv have not held direct negotiations since March 2022, soon after the start of Russia’s full-scale war in Ukraine. Later that year, Ukrainian President Volodymyr Zelensky adopted a decree that ruled out negotiations with Putin, after Russia claimed four regions of Ukraine as its own.\n\nZelensky, who met Trump on the sidelines of Pope Francis’ funeral, has said Kyiv would be ready to hold talks with Moscow once a ceasefire deal has stopped the fighting.\n\nZelensky’s chief of staff, Andriy Yermak, said on Monday that continuing Russian attacks contradicted the Kremlin’s statements about wanting peace.\n\n“Russia is not ceasing fire at the front and is attacking Ukraine with Shaheds right now,” Yermak wrote on Telegram, referring to Iranian-made drones widely used by Russian forces.\n\n“All the Russians’ statements about peace without ceasing fire are just plain lies.”\n\nAsked by a reporter if the signal for direct talks should come from Ukraine or the United States, Kremlin spokesman Dmitry Peskov said: “Well, from Kyiv, at least Kyiv should take some actions in this regard. They have a legal ban on this. But so far we don’t see any action.”\n\nMeanwhile, Moscow would continue its “special military operation”, he said.\n\nMoscow and Kyiv are under pressure from the US to find a settlement to end the war, the deadliest in Europe since WWII. Ukraine accuses Russia of playing for time in order to try to seize more of its territory, and has urged greater international pressure to get Moscow to stop fighting.\n\nRussia accuses Ukraine of being unwilling to make any concessions and of seeking a ceasefire only on its own terms.\n\nPutin told Witkoff on Friday that Russia was ready for talks with Kyiv without preconditions, according to a Kremlin aide.\n\nTrump said on Friday the two sides were “very close to a deal”. In recent days he has been more critical than usual of Moscow, saying there was no reason for it to fire missiles into civilian areas and voicing concern that Putin was “just tapping me along”.\n\nOn Sunday, US Secretary of State Marco Rubio said the Trump administration might abandon its attempts to broker a deal if Russia and Ukraine do not make headway.\n\n“It needs to happen soon,” Rubio told the NBC program Meet the Press.\n\n“We cannot continue to dedicate time and resources to this effort if it’s not going to come to fruition.”"
    },
    {
        "title": "Russia declares temporary Ukraine ceasefire to mark 80th anniversary of the end of World War II",
        "description": "Russia has announced a temporary ceasefire in the Ukraine war to mark the 80th anniversary of the end of World War II.",
        "content": "Russia has announced a three-day ceasefire in Ukraine to mark the 80th anniversary of the end of World War II.\nThe Kremlin said the 72-hour ceasefire would run for three days either side of May 9, when Vladimir Putin will be hosting international lea... [5184 chars]",
        "url": "https://www.abc.net.au/news/2025-04-28/russia-declares-temporary-ceasefire-putin-says/105226744",
        "image": "https://live-production.wcms.abc-cdn.net.au/d225488ddb57b884c704212d468ec23b?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
        "publishedAt": "2025-04-28T11:26:34Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.abc.net.au/news/2025-04-28/russia-declares-temporary-ceasefire-putin-says/105226744 on URL https://www.abc.net.au/news/2025-04-28/russia-declares-temporary-ceasefire-putin-says/105226744"
    },
    {
        "title": "North Korea confirms Russia troop deployment, hails ‘heroes’",
        "description": "Its lack of armoured vehicles and drone warfare experience meant the nation ‘took heavy casualties’ but they ‘adapted quickly’, state media claimed.",
        "content": "North Korea has confirmed for the first time that it has sent troops to fight for Russia in the war with Ukraine, under the order of leader Kim Jong-un.\nThe victorious end of the battle to liberate Russia’s Kursk region showed the “highest strategic ... [1660 chars]",
        "url": "https://7news.com.au/news/north-korea-confirms-russia-troop-deployment-hails-heroes-c-18507739",
        "image": "https://images.7news.com.au/publication/C-18507739/d3f9dba7400968f455c4c92246f4c104156ff236-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publishedAt": "2025-04-28T01:51:12Z",
        "source": {
            "name": "7NEWS.com.au",
            "url": "https://7news.com.au"
        },
        "full_content": "North Korea has confirmed for the first time that it has sent troops to fight for Russia in the war with Ukraine, under the order of leader Kim Jong-un.\n\nThe victorious end of the battle to liberate Russia’s Kursk region showed the “highest strategic level of the firm militant friendship” between North Korea and Russia, KCNA state news agency cited the North’s ruling party as saying, and made an important contribution to the liberation of Russian territory occupied by Ukraine.\n\nRussia last week said Ukrainian forces had been expelled from the last Russian village they had been holding, although Kyiv denied the claim and said their troops were still operating in Belgorod, another Russian region bordering Ukraine.\n\nKnow the news with the 7NEWS app: Download today\n\nThe Central Military Commission of the North’s ruling Workers’ Party said Kim made the decision to deploy troops under the comprehensive strategic partnership treaty he signed with Vladimir Putin in 2024.\n\n“Under the order of the head of state, the sub-units of the armed forces of the Republic regarded the territory of Russia as the one of their country and proved the firm alliance between the two countries,” KCNA cited the Commission as saying.\n\n“They who fought for justice are all heroes and representatives of the honour of the motherland,” KCNA quoted Kim as saying.\n\nNorth Korea “regards it as an honour to have an alliance with such a powerful state as the Russian Federation,” KCNA said.\n\nNorth Korea sent an estimated total of 14,000 troops, including 3000 reinforcements to replace its losses, Ukrainian officials have said.\n\nLacking armoured vehicles and drone warfare experience, they took heavy casualties but adapted quickly.\n\nRussia confirmed on Saturday for the first time that North Korean soldiers have been fighting alongside Russians in Kursk.\n\nNeither Russia nor North Korea had previously either confirmed or denied the deployment."
    }
]