[
    {
        "title": "Ukraine war latest: Largest prisoner swap of war under way; Trump suggests it 'could lead to something big'",
        "description": "A 1,000 for 1,000 Russia-Ukraine prisoner swap is under way - with Donald Trump suggesting it could lead to \"something big\". But in Moscow, Russia's foreign minister has accused President Zelenskyy of running a \"junta\" in Ukraine. Follow the latest below.",
        "content": "Zelenskyy speaks to leaders about upcoming summit\nVolodymyr Zelenskyy has been speaking to various counterparts about the Ukraine-Southeast Europe Summit.\nA number of meetings have taken place and the Ukrainian president has been bolstering support f... [456 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-largest-prisoner-swap-of-war-under-way-trump-suggests-it-could-lead-to-something-big-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-hhs_6924761.jpg?20250523113851",
        "publishedAt": "2025-05-23T11:32:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Ukraine war latest: Largest prisoner swap of war under way; Lavrov accuses Zelenskyy of running 'junta'",
        "description": "A 1,000 for 1,000 Russia-Ukraine prisoner swap is under way - with Donald Trump suggesting it could lead to \"something bigger\". But in Moscow, Russia's foreign minister has accused President Zelenskyy of running a \"junta\" in Ukraine. Follow the latest below.",
        "content": "Analysis: Huge moment for soldiers held in horrific conditions - but swap has little bearing on peace talks\nBy Ivor Bennett, Moscow correspondent\nAssuming it is completed, this will be the largest prisoner exchange of the war so far.\nIt's a huge mome... [567 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-trump-claims-prisoner-swap-completed-lavrov-accuses-zelenskyy-of-running-junta-12541713",
        "image": "https://e3.365dm.com/25/04/1600x900/skynews-sergei-lavrov-russia_6887066.jpg?20250415092838",
        "publishedAt": "2025-05-23T10:50:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Ukraine war latest: Trump claims prisoner swap 'completed'; Lavrov accuses Zelenskyy of running 'junta'",
        "description": "Donald Trump has claimed that a 1,000 for 1,000 Russia-Ukraine prisoner swap has been \"completed\"- suggesting it could lead to \"something bigger\". But in Moscow, Russia's foreign minister has accused President Zelenskyy of running a \"junta\" in Ukraine. Follow the latest below.",
        "content": "Lavrov claims Ukraine's 'junta' under Zelenskyy targets Russian-speakers\nSergei Lavrov, Russia's foreign minister, has also been speaking today from Moscow.\nHe said the Kremlin would not allow Russian-speakers in Ukraine to remain under the rule of w... [961 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-peace-talks-zelenskyy-putin-istanbul-crimea-baltic-nato-jet-clarke-frontline-turkey-erdogan-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-trump_6924707.jpg?20250523033752",
        "publishedAt": "2025-05-23T10:09:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Putin's Stalin revival hits new level - and Russians are divided",
        "description": "At the central Taganskaya station, a new statue has been unveiled. It is of one of Russia's most well-known and controversial leaders, Joseph Stalin, a man who killed millions. Some have welcomed the monument, while others have criticised it.",
        "content": "The Moscow metro is a sight to behold.\nThe gilded interiors of its cavernous stations have the opulence of a baroque palace.\nBut amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin.\nImage: 'T... [3333 chars]",
        "url": "https://news.sky.com/story/putins-stalin-revival-hits-new-level-and-russians-are-divided-13372954",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-russia-stalin-putin_6924673.jpg?20250522230433",
        "publishedAt": "2025-05-23T03:36:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The Moscow metro is a sight to behold.\n\nThe gilded interiors of its cavernous stations have the opulence of a baroque palace.\n\nBut amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin.\n\nImage: 'The Gratitude of the People to Leader-Commander', portraying Stalin at Taganskaya subway station in Moscow. Pic: AP/Alexander Zemlianichenko\n\nThe Soviet dictator was responsible for the deaths of millions of innocent people, in purges, famines and his infamous gulag labour camps.\n\nBut there's no mention of that on the new sculpture at the central Taganskaya station.\n\nInstead, he's depicted as a leader who was loved by his people - a crowd of adoring workers and their children are reaching out towards him in adoration.\n\nIt was described as a \"gift\" to passengers by the capital's metro system to mark its 90th anniversary.\n\nImage: Police officers stand in front of the statue. Pic: AP/Alexander Zemlianichenko\n\nBehind a crowd of selfie-snapping passengers\n\nSome Muscovites have accepted it with open arms.\n\nAt Stalin's feet, there is a pile of red carnations, and in front swarms a rolling crowd of selfie-snapping passengers.\n\n\"It's excellent.\" gushes Olga. \"History of art, culture, significance, beauty.\"\n\nFor Denis, it's \"the right decision\". \"This is the history of our state,\" he says.\n\nBut as well as flowers, there is fury at what appears to be Russia's latest attempt to rehabilitate the tyrant.\n\n\"What were they thinking?!\" asks Svetlana, incredulous. \"How many died under his leadership? And suddenly he appears here, this bloodsucker. How is this possible?!\"\n\n\"We should remember and honour some of his deeds,\" believes Oleg. \"But to put him like this is disrespectful. He did a lot of bad things for the Soviet people.\"\n\nImage: Flowers were left at the statue by some. Pic: AP/Pavel Bednyakov\n\nStalin's creeping return under Putin\n\nThe sculpture is a replica of one that first appeared in 1950, three years before Stalin's death, in honour of his role in the Soviet Union's defeat of Nazi Germany in the Second World War.\n\nIt was removed in the 1960s during the period of de-Stalinisation, which sought to destroy his cult of personality.\n\nBut under Vladimir Putin's rule, the dictator has been gradually reappearing.\n\nIt's mostly been on a small scale, in towns well outside the capital. A statue so prominent and so central is a first.\n\nRead more:\n\nFormer Ukrainian politician shot dead\n\nKremlin 'gleeful' after Trump's call to Putin\n\nUkraine-Russia talks revealed a stark reality\n\nImage: Pic: AP/Pavel Bednyakov\n\nA historical rehabilitation?\n\n\"The trend comes down to the idea of ​the greatness of the state,\" says Yan Rachinsky, a human rights activist who works to expose Stalin's crimes at the Moscow branch of Memorial, a renowned rights group that now operates on a local level after the closure of its international arm.\n\n\"For the current government, the main thing is the state. The state is sacred, the state is above everything, the state is infallible. That is why criticism of Stalin is constantly decreasing.\"\n\nRussia's current leader has previously condemned Stalin's repressions. But he's also said the country shouldn't be made to feel guilty about its past.\n\n\"Putin's old statement that one should be proud of history - that's it,\" says Mr Rachinsky.\n\n\"Everything that prevents us from being proud of history fades into the shadows.\"\n\nBe the first to get Breaking News Install the Sky News app for free\n\nIt certainly feels that way, looking at the statue.\n\nStalin's historical horrors are out of sight, and seemingly, out of mind."
    },
    {
        "title": "Ukraine war briefing: G7 finance chiefs threaten further sanctions on Russia",
        "description": "Ministers meeting in Canada said if efforts to achieve a ceasefire failed they would explore more options but language weaker than before Donald Trump’s reelection. What we know on day 1,185",
        "content": "G7 finance chiefs condemned what they called Russia’s “continued brutal war” against Ukraine and said that if efforts to achieve a ceasefire failed, they would explore all possible options, including “further ramping up sanctions.” The description of... [3032 chars]",
        "url": "https://www.theguardian.com/world/2025/may/23/ukraine-war-briefing-g7-finance-chiefs-threaten-further-sanctions-on-russia",
        "image": "https://i.guim.co.uk/img/media/65bb752b63b89be7a93c32d568f008e3ca32d1bc/506_0_4339_3472/master/4339.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5fea7e3f2ee2ac0e1e65395779bb7bde",
        "publishedAt": "2025-05-23T01:13:16Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "G7 finance chiefs condemned what they called Russia’s “continued brutal war” against Ukraine and said that if efforts to achieve a ceasefire failed, they would explore all possible options, including “further ramping up sanctions.” The description of the Ukraine war was watered down from the prior G7 statement issued in October, before Donald Trump’s re-election, calling it an “illegal, unjustifiable, and unprovoked war of aggression against Ukraine.” Trump has diminished US support for Ukraine and has made statements suggesting that Kyiv was to blame for the conflict as he tries to coax Russia into peace talks.\n\nUkraine should abandon any notion of restoring its borders established with the 1991 collapse of Soviet rule or even those dating from the 2022 full-scale Russian invasion, the country’s former military commander was quoted as saying on Thursday. Valerii Zaluzhnyi, now Ukraine’s ambassador to London, was replaced as top commander in February 2024 after months of reported disagreements between him and President Volodymyr Zelenskyy. “I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022 and that there will be great happiness afterward,” the RBK Ukraine news site quoted Zaluzhnyi as telling a forum in Kyiv. “My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.”\n\nChancellor Friedrich Merz warned on Thursday that Russia threatened security in Europe as he visited Lithuania to mark the official formation of Germany’s first permanent overseas military unit since the second world war, aimed at bolstering Nato’s eastern flank. The decision to build up a 5,000-strong armoured brigade in Lithuania over the coming years came in response to Russia’s full-scale invasion of Ukraine in 2022. “There is a threat to us all from Russia,” Merz told reporters in Vilnius.\n\nRussia has appointed a key commander of the gruelling siege of Mariupol, Gen Andrey Mordvichev, as head of the ground forces, the official newspaper of the Russian army reported on Thursday. Defence minister Andrey Belousov described the 49-year-old general as “an experienced combat officer who fully demonstrated his talent as a military commander during the special military operation,” using Moscow’s term for its Ukraine offensive, according to the Red Star newspaper.\n\nRussia said it had shot down 159 Ukrainian drones over Russian regions, including about 20 headed towards Moscow, between 8 am and 8 pm on Thursday. The previous day, Russia said it shot down well over 300 Ukrainian drones. Three Moscow airports – Domodedovo, Vnukovo and Zhukovsky – suspended flights intermittently.\n\nThe EU on Thursday ordered temporary measures for Ukrainian farm imports after failing to agree on a new long-term accord with the Ukrainian government. The EU gave tariff-free access to most Ukrainian agricultural imports after Russia’s 2022 invasion to help the Ukrainian economy. But European farmers say the Ukrainian produce unfairly undercuts their own. The initial agreement with Ukraine is set to expire on 5 June, and both sides appear unable to reach an agreement before the deadline."
    },
    {
        "title": "Putin's Stalin revival hits a new level - with his crimes out of sight",
        "description": "At the central Taganskaya station, a new statue has been unveiled. It is of one of Russia's most well-known and controversial leaders, Joseph Stalin, a man who killed millions. Some have welcomed the monument, while others have criticised it.",
        "content": "The Moscow metro is a sight to behold.\nThe gilded interiors of its cavernous stations have the opulence of a baroque palace.\nBut amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin.\nImage: 'T... [3333 chars]",
        "url": "https://news.sky.com/story/putins-stalin-revival-hits-a-new-level-with-his-crimes-out-of-sight-13372954",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-russia-stalin-putin_6924673.jpg?20250522230433",
        "publishedAt": "2025-05-22T22:59:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The Moscow metro is a sight to behold.\n\nThe gilded interiors of its cavernous stations have the opulence of a baroque palace.\n\nBut amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin.\n\nImage: 'The Gratitude of the People to Leader-Commander', portraying Stalin at Taganskaya subway station in Moscow. Pic: AP/Alexander Zemlianichenko\n\nThe Soviet dictator was responsible for the deaths of millions of innocent people, in purges, famines and his infamous gulag labour camps.\n\nBut there's no mention of that on the new sculpture at the central Taganskaya station.\n\nInstead, he's depicted as a leader who was loved by his people - a crowd of adoring workers and their children are reaching out towards him in adoration.\n\nIt was described as a \"gift\" to passengers by the capital's metro system to mark its 90th anniversary.\n\nImage: Police officers stand in front of the statue. Pic: AP/Alexander Zemlianichenko\n\nBehind a crowd of selfie-snapping passengers\n\nSome Muscovites have accepted it with open arms.\n\nAt Stalin's feet, there is a pile of red carnations, and in front swarms a rolling crowd of selfie-snapping passengers.\n\n\"It's excellent.\" gushes Olga. \"History of art, culture, significance, beauty.\"\n\nFor Denis, it's \"the right decision\". \"This is the history of our state,\" he says.\n\nBut as well as flowers, there is fury at what appears to be Russia's latest attempt to rehabilitate the tyrant.\n\n\"What were they thinking?!\" asks Svetlana, incredulous. \"How many died under his leadership? And suddenly he appears here, this bloodsucker. How is this possible?!\"\n\n\"We should remember and honour some of his deeds,\" believes Oleg. \"But to put him like this is disrespectful. He did a lot of bad things for the Soviet people.\"\n\nImage: Flowers were left at the statue by some. Pic: AP/Pavel Bednyakov\n\nStalin's creeping return under Putin\n\nThe sculpture is a replica of one that first appeared in 1950, three years before Stalin's death, in honour of his role in the Soviet Union's defeat of Nazi Germany in the Second World War.\n\nIt was removed in the 1960s during the period of de-Stalinisation, which sought to destroy his cult of personality.\n\nBut under Vladimir Putin's rule, the dictator has been gradually reappearing.\n\nIt's mostly been on a small scale, in towns well outside the capital. A statue so prominent and so central is a first.\n\nRead more:\n\nFormer Ukrainian politician shot dead\n\nKremlin 'gleeful' after Trump's call to Putin\n\nUkraine-Russia talks revealed a stark reality\n\nImage: Pic: AP/Pavel Bednyakov\n\nA historical rehabilitation?\n\n\"The trend comes down to the idea of ​the greatness of the state,\" says Yan Rachinsky, a human rights activist who works to expose Stalin's crimes at the Moscow branch of Memorial, a renowned rights group that now operates on a local level after the closure of its international arm.\n\n\"For the current government, the main thing is the state. The state is sacred, the state is above everything, the state is infallible. That is why criticism of Stalin is constantly decreasing.\"\n\nRussia's current leader has previously condemned Stalin's repressions. But he's also said the country shouldn't be made to feel guilty about its past.\n\n\"Putin's old statement that one should be proud of history - that's it,\" says Mr Rachinsky.\n\n\"Everything that prevents us from being proud of history fades into the shadows.\"\n\nBe the first to get Breaking News Install the Sky News app for free\n\nIt certainly feels that way, looking at the statue.\n\nStalin's historical horrors are out of sight, and seemingly, out of mind."
    },
    {
        "title": "‘Every day there is shelling’: Ukrainian border town torn between hope and despair",
        "description": "Mayor of Bilopillya, where nine people were killed in strike on bus, says Russia has shown it does not care about talks",
        "content": "Even before the Russian strike on a shuttle bus travelling from his frontline town at the weekend, the mayor of Bilopillya, Yuri Zarko, was very sceptical that Vladimir Putin’s agreement to direct Russia-Ukraine talks in Istanbul would lead to peace.... [5665 chars]",
        "url": "https://www.theguardian.com/world/2025/may/22/ukrainian-border-town-bilopillya-sumy-hope-despair",
        "image": "https://i.guim.co.uk/img/media/ed2415ace7e38ee8974f999da4d70684126c5bc3/50_0_2005_1604/master/2005.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=109e60273c0b069c26e09eef154bfa22",
        "publishedAt": "2025-05-22T13:54:50Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Even before the Russian strike on a shuttle bus travelling from his frontline town at the weekend, the mayor of Bilopillya, Yuri Zarko, was very sceptical that Vladimir Putin’s agreement to direct Russia-Ukraine talks in Istanbul would lead to peace.\n\nThe strike, which killed nine people including five over 60, only confirmed his conviction that talks to end the war were going nowhere and Ukraine had a challenging time ahead.\n\n“I was born an optimist,” Zarko said in a cafe in the neighbouring regional capital of Sumy, which he had reached taking a lift in one of his town’s ambulances along a dangerous road that is often shelled by the Russians.\n\n“But there’s a funny story that I like about how an optimist and pessimist meet. The pessimist says: life is getting worse! The optimist replies: oh, but it will be much worse later. That describes where we are.”\n\nUkrainian and Russian delegations met face-to-face in Istanbul last week for the first time since 2022, but without Russia agreeing to a US-proposed 30-day ceasefire already accepted by Kyiv. A subsequent two-hour phone call on Monday between Putin and Donald Trump also ended without Russian agreement to a ceasefire. The war goes on.\n\n“It’s very difficult situation in my town. The centre of Bilopillya is 10km from the Russian border and the outskirts are 5-6km away,” Zarko said. “Every day and every night there is shelling, usually glide bombs. Ten days ago we had a day where there were 120 strikes throughout the area of our community. The Russians are very active now.”\n\nBetween 85 and 90% of those living in his town had now evacuated, he said, with banks, supermarkets and other key services closed for those who remain. He showed a picture on his phone of a recent strike by a 1.5-tonne bomb that left a crater 5 metres deep and 10 across, dwarfing those standing at its rim.\n\nView image in fullscreen Residents in Bilopillya, 10km from the border with Russia, collecting humanitarian aid. Photograph: Julia Kochetova/The Guardian\n\nHe knows what has happened to towns similar to his in other parts of Ukraine – to Bakhmut, Chasiv Yar, Pokrovsk and Avdiivka, where Russian artillery and bombs turned or are turning them to rubble – and hopes the same fate can be avoided for his own town of 16,000. “I need Bilopillya to survive,” he said.\n\nBut Zarko is aware that what happens next is out of his hands. “There are no peace negotiations,” he said. “We can see how the Russian side is trying to prolong the talks just to buy time. What happened with the shuttle bus was proof of that.\n\n“It was timed after the peace talks in Istanbul had broken up. It was a gesture to the civilised world, to EU leaders. It was meant to punch them on the nose, a message from the Russians to say: we don’t care about peace negotiations.”\n\nOn Zarko’s mind, and of those in the wider Sumy region, are comments made this week by Putin on a visit to the neighbouring Kursk region of Russia – where Ukraine last year launched a major incursion – that turning Sumy into a “sanitised grey zone” was a more practical solution than using Russian forces to take it, as one local municipal leader suggested.\n\nOn Thursday that threat became suddenly concrete as Putin said he had ordered his military “to create a security buffer zone” along the border and that operation was already in progress.\n\nView image in fullscreen Putin attending a meeting with volunteers during a visit to Kursk on Wednesday. Photograph: Kremlin.ru/EPA\n\nAt first glance, the situation in Sumy on a warm spring day belies the threat, with residents walking on tree-lined boulevards and sitting in cafes. But the reality of life here is constant air alarms from drones, loitering munitions and KAB glide bombs.\n\nThe city was partly occupied by Russian forces at the beginning of the war in 2022. “The first two months of the war were very tough days but then the situation stabilised for a while,” said Oksana Solodovnyk, a regional correspondent for the 1+1 channel.\n\nThe situation had got much worse again since Ukraine’s incursion into Kursk last year, she said. “Our day starts at midnight because of drones and glide bombs. They all fly over my house, not always very high. My daughter is nine and I worry about her. She can only go into her school one day a week because they are teaching in the basement.\n\n“Recently it feels like the Russians have changed tactic. Because drones coming in low can be shot down, they are using Lancets like ballistic missile. They fire them up high and then they dive down. Two days ago they attacked a big plant in Sumy with seven strikes. The lack of sleep makes people exhausted and anxious.”\n\nSolodovnyk said she and her friends hoped for something out of peace talks but were under no illusions that even if there was a ceasefire everything would stop and peace would come immediately. She said Trump was helping the side that was stronger and had more money, so Ukraine would have to rely on its military.\n\nView image in fullscreen A rescue worker rests near a university building destroyed by a Russian missile strike on Sumy in April. Photograph: Evgeniy Maloletka/AP\n\n“My personal feeling is that if we are going to have peace talks it should be between the two leaders,” she said. “And while I dream about a return to Ukraine’s 1991 border including Crimea, I realise it’s unreal. I want it but I know it is a fantastic dream and that feeling is splitting me in half because a lot of friends have died fighting for Ukraine.\n\n“But I also know that if we freeze the conflict for a while along the frontlines, Russia will never stop.”\n\n“Everyone wants peace,” said Oleksandr Miroshnychenko, an agricultural company executive. “We are living under stress every day and every night because of the explosions.\n\n“But I’m not sure anyone will help us. Europe is helping us enough to avoid Putin annexing parts of their territory. We hope America will help, but the last Trump statement saying we should just talk to Putin suggests that the situation will get worse.\n\n“If I am realistic then maybe the war will end next year. And if that happens I’ll be happy.”"
    },
    {
        "title": "Michael Clarke Ukraine war Q&A: 'Golden Domes', life after Putin and could oil price thwart Russia?",
        "description": "Professor Michael Clarke, Sky News' security and defence analyst, is answering your Ukraine war questions again. Watch below and scroll down to read the best answers.",
        "content": "Do you have a question about the war in Ukraine?\nOur security and defence analyst Michael Clarke will be back on Thursday to answer more of your questions about Ukraine.\nLast week, the backdrop to his weekly Q&A was the first direct peace talks betwe... [650 chars]",
        "url": "https://news.sky.com/story/michael-clarke-ukraine-war-qanda-golden-domes-life-after-putin-and-could-oil-price-thwart-russia-13371991",
        "image": "https://e3.365dm.com/25/04/1600x900/skynews-michael-clarke-ukraine_6894644.png?20250423141240",
        "publishedAt": "2025-05-22T13:14:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Trump's 'Golden Dome' technically and economically impossible\n\nSky News' security and defence analyst Professor Michael Clarke says this is the fourth time he has heard the idea pitched.\n\nIts failure in the 1960s was behind the anti-ballistic missile treaty because they knew a dome didn't work.\n\nThe idea was then resurrected under Reagan and Bush in the 1980s and 2000s without success, he adds.\n\n\"Donald Trump is talking about the Golden Dome as if it's a version of Israel's Iron Dome.\n\n\"Israel's land area is 22,000 square kilometres. Britain's land area is something like 240,000 - so it's ten times bigger - and America's land area is almost 10 million.\n\n\"America is 400 times bigger than Israel, and the Israeli Iron Dome system is the best in the world, and it is not 100% [effective].\n\n\"The requirement is absolutely huge,\" he says, adding it would cost at least a trillion dollars.\n\nA huge number of land-based interceptors are needed, and they have to be fired at missiles when they are launched, because otherwise the projectiles become too fast.\n\n\"The thing that might make it different... is supposing you could have the defences in space,\" says Clarke.\n\n\"That's heroic engineering. Can you take what you know exists on Earth and scale it up tenfold, put it in space, maintain it, put the whole system together, and know that the first time you use that system in anger, the first time you've ever been able to test the whole thing together, it will work to 98% effectiveness?\n\n\"Can't be done.\"\n\nCould it work in US or UK?\n\nClarke says it is \"much, much cheaper\" to put things in space than it was when this idea was previously pitched, but \"the idea of defending a big country is still economically impossible\".\n\n\"You've still got the basic problems. It will still be cheaper to overwhelm the system than to actually keep the system up.\"\n\nMissile defences are best at defending small areas - a \"special dome\" is \"not technically feasible\".\n\nThe UK could do with more missile defences for its ports and major systems, but just as an element of a deterrent, says Clarke.\n\n\"We don't have any real reliable defence at all against incoming missiles, apart from what the Navy has got in the Sea Viper system.\""
    },
    {
        "title": "FBI whistleblower claims he tried to get to Musk to warn him he was being targeted by Russia",
        "description": "Johnathan Buma, who was arrested in March and is out on bail, claims in new interview that efforts to target Musk were ‘intense’",
        "content": "View image in fullscreen Johnathan Buma in downtown Phoenix, Arizona, on 8 May. Photograph: Matt Martian/The Guardian\nA former FBI counterintelligence agent turned whistleblower has claimed he tried to gain access to Elon Musk in 2022 to warn the bil... [12072 chars]",
        "url": "https://www.theguardian.com/us-news/ng-interactive/2025/may/22/fbi-whistleblower-musk-russia",
        "image": "https://i.guim.co.uk/img/media/0c108e90f2981d5fee5e9b382541f91bf235e6d0/0_534_5464_4371/master/5464.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6173f857d2a364fe8d647789a3f17af",
        "publishedAt": "2025-05-22T10:00:46Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "View image in fullscreen Johnathan Buma in downtown Phoenix, Arizona, on 8 May. Photograph: Matt Martian/The Guardian\n\nA former FBI counterintelligence agent turned whistleblower has claimed he tried to gain access to Elon Musk in 2022 to warn the billionaire that he was the target of a covert Russian campaign seeking to infiltrate his inner circle, possibly to gain access to sensitive information.\n\nJohnathan Buma, who was arrested by the FBI earlier this year on a misdemeanor charge of disclosing confidential information, said in an interview that he tried – but ultimately failed – to gain access to Musk to personally brief and “inoculate” him against “outreach from the Kremlin”.\n\nBuma, who is on bail and living in Arizona after his 17 March arrest at New York’s Kennedy airport, spoke to both ZDF, the German broadcaster, and the Guardian. He has also recently filed paperwork to run as a Democratic candidate for a congressional House seat in Arizona.\n\nThe 48-year-old did not provide specific details about why he believed Musk was being targeted by Russian operatives, but said it involved individuals he believed were being “placed” in Musk’s inner circle at the time and were gaining influence with him.\n\n“Those efforts were intense and they were ongoing,” he said. “I can’t go into too much more detail.”\n\nMusk, the world’s richest man, was not under investigation and was not suspected of wrongdoing, Buma said.\n\nReporting by the Wall Street Journal indicates that Buma was not the only person who was concerned about individuals who were gaining access to Musk at that time.\n\nView image in fullscreen Elon Musk speaks at an America Pac town hall before the Wisconsin supreme court election, on 30 March. Photograph: Bloomberg/Getty Images\n\nA July 2022 article reported that Jared Birchall, who serves as Musk’s wealth manager, had “cornered” his boss to discuss his concerns about a then new adviser to the Tesla CEO named Igor Kurganov, a Russian-born ex-professional gambler. Birchall reportedly saw Kurganov as a “newcomer who suddenly had immense influence on what to do with Musk’s money”.\n\nThe Journal described how Kurganov had spent time sleeping in Musk’s home during the pandemic, and that Musk reportedly told Birchall he was considering leaving Kurganov in charge of his charitable giving. Musk’s personal fortune was worth about $230bn at the time. The Journal said it was basing its reporting on more than a dozen people close to Musk, Birchall and Kurganov.\n\nThe newspaper also reported at the time that Birchall had learned that an FBI agent had been making preliminary inquiries into Kurganov as part of his job “to watch for foreign interference in US companies”, citing people familiar with the matter.\n\nKurganov had not been accused of wrongdoing, the Journal reported, and he did not provide a comment to the newspaper at the time.\n\nThe Guardian is not aware of Kurganov being named as a foreign agent, and he has no known connections to Russia, other than having been born there. Efforts to reach him directly did not elicit a response. The Guardian also reached out to Kurganov’s wife, Liv Boeree, a professional poker player. She said in an emailed statement: “My husband’s only connection to Russia is that he was pushed out of his Mum’s vagina on its soil.”\n\nIn his interview with the Guardian, Buma said he did not have direct dealings with Musk. He said he tried to convey his concerns to another agent, who was described as an FBI liaison to SpaceX, but claimed the other agent was not responsive.\n\nBirchall, the Wall Street Journal reported, asked Musk to remove Kurganov from his post at Musk’s private foundation in May 2022, which Musk then agreed to do.\n\nThe FBI’s national press office did not respond to a request for comment. The Guardian also reached out to the FBI’s Los Angeles field office, which declined to comment.\n\nMusk did not respond to an emailed request for comment. The Guardian attempted to call and send messages to Birchall via WhatsApp but he did not respond.\n\nBuma’s new claims follow earlier reporting by Business Insider and the Atlantic about Buma’s relationship with another prominent billionaire, Peter Thiel, who reportedly became a source for the FBI in 2021. Buma, it has previously been reported, was Thiel’s handler. It is not clear whether Thiel has maintained a source relationship with the FBI.\n\nThiel and Musk have a long history together. The two both spent their early years in South Africa. Thiel founded PayPal, the online payment company where Musk also served as CEO before he was reportedly ousted by Thiel and his allies. The two are believed to be on good terms, with Thiel crediting Musk’s support for Trump with helping other Silicon Valley leaders support the US president in the run-up to last year’s presidential election.\n\nIn his interview with the Guardian, Buma said Thiel had been “receptive to collaboration [with the FBI] and threat briefings”.\n\nView image in fullscreen Peter Thiel speaks at the Republican national convention on 21 July 2016 in Cleveland, Ohio. Photograph: Joe Raedle/Getty Images\n\n“The purpose of the briefings was to educate [Thiel] about what to look out for, what a targeting looks like, what it’s like to be bumped by a foreign intelligence agent, and then what to do when that’s done,” Buma said. “He essentially confirmed and provided helpful information to help us identify the nodes through which these outreaches have occurred.”\n\nThiel did not respond to a request for comment.\n\nBuma has been a controversial figure inside the FBI since he filed his first internal complaint in the bureau in January 2022. An FBI affidavit, filed on 18 March in the US district court in California in connection to his arrest, describes him as working in various capacities over his 15-year career at the bureau, where from 2013 to 2022 he focused on counterintelligence and counterproliferation matters. Until December 2022, the FBI has said, his responsibilities included managing “confidential human sources”. Buma has described himself as specializing for a decade in public corruption and Russian foreign counterintelligence operations, a role that he said led the FBI to train him to speak and read Russian.\n\nIn January 2019, a tip from one of Buma’s sources led to the FBI’s first inquiry into possible tax evasion by Joe Biden’s son Hunter, who was a director at the Ukrainian company Burisma. Hunter Biden pleaded guilty in 2024 to federal tax evasion charges connected to his foreign business deals. He was later pardoned by his father, the then president Joe Biden, who in a statement said he believed his son had been “selectively and unfairly prosecuted”.\n\nBuma was also involved in an FBI investigation into possibly illegal lobbying and campaign violations involving Rudy Giuliani, the former prosecutor, mayor of New York and personal attorney to Donald Trump. Giuliani’s home and office were raided in 2021 in connection to FBI suspicions around his dealings with Ukrainian figures, but all of the investigations were ultimately dropped and Giuliani was never charged with any crime as a result of the inquiry.\n\nBuma began seeking whistleblower protection, both inside the FBI and later in Congress, beginning in 2022, when he began to report what he called “highly suspicious suppression of investigations and intelligence gathering” in matters related to the Russian intelligence service. At the heart of his allegations, which were submitted to the Senate judiciary committee in a 22-page statement, was Buma’s contention that investigations into Giuliani had been quashed and that he had faced internal FBI retaliation, which he said led to the suppression of his intelligence reporting.\n\nIt also led, Buma said, to his diagnosis of post-traumatic stress disorder on 25 October 2023. At that time, he began to take unpaid leave from the FBI.\n\nView image in fullscreen Buma has been involved in investigations of Hunter Biden and Rudy Giuliani during his career at the FBI. Photograph: Matt Martian/The Guardian\n\nWeeks later, on 13 November 2023, federal law enforcement officials raided Buma’s home, according to the FBI affidavit filed in March 2025. The affidavit claimed that agents found “numerous” FBI documents, including a compilation of emails, in that search. But Buma was not arrested at that time. He remained on unpaid leave from the FBI until he submitted a resignation letter on 16 March 2025.\n\nThe FBI affidavit also alleged that Buma began emailing chapters of a book draft to associates between October and December 2023, including information that the FBI said was subject to restrictions. The FBI has alleged that Buma sent messages to individuals at that time that discussed his involvement in press reports about confidential human sources. Buma has denied wrongdoing.\n\nEven as the FBI officer was facing scrutiny, so was Elon Musk. The Wall Street Journal reported on 25 October 2024 that Musk, who had emerged as an important supporter of Donald Trump’s re-election campaign, had been “in regular contact” with Russia’s president, Vladimir Putin, since late 2022.\n\nThe report cited several current and former US, European and Russian officials and said the conversations touched on personal topics, business and geopolitical tensions. The Journal report also noted that the contacts raised potential national security concerns, given Musk’s security clearance connected to SpaceX, which has billions of dollars in contracts with the Pentagon, and Musk’s access to classified information.\n\nMusk did not respond to the Journal’s request for comment at the time but posted a comment on X following the story’s publication, including one tweet that said: “Welp, the Swamp’s ‘Trump is Hitler’ didn’t work. Might as well give ‘Elon is a Russian agent’ a whirl.”\n\nMusk has had a high-profile role at the White House since Trump’s November 2024 election victory as the unofficial head of the so-called “department of government efficiency”, or Doge, which has overseen the firing of thousands of federal workers and an attempted dismantling of federal agencies. Among a myriad of controversies over Doge’s actions was an official whistleblower complaint by a member of the IT department at the National Labor Relations Board, whose disclosure was detailed in a 15 April 2025 report by NPR. The whistleblower, Daniel Berulis, grew alarmed when technical staff members noticed a spike in sensitive data leaving the NLRB after Doge engineers were granted access to the data, followed by what was described as “suspicious log-in attempts” from an IP address in Russia.\n\nNPR said Berulis’s account was corroborated by internal documentation that was reviewed by 11 technical experts across other government agencies and the private sector. The report added that Doge’s access to data was a “widespread concern”.\n\nView image in fullscreen The J Edgar Hoover building, the FBI’s headquarters, in Washington DC. Photograph: Kent Nishimura/Getty Images\n\nThe NLRB has denied that the agency granted Doge access and said it had determined that no breach of agency systems occurred.\n\nBuma was arrested on 17 March 2025, just weeks after Trump’s new director of the FBI, Kash Patel, had been confirmed in his role. Buma said he was at Kennedy airport awaiting a flight to the UK, where he planned to have a meeting with the HarperCollins publisher Arabella Pike, when he was suddenly surrounded by agents. He was released on bail the next day.\n\nThe bail included a restriction that he refrain from excessive use of alcohol. This restriction appears to arise from an October 2023 text message reviewed by the FBI. Buma denies drinking excessively.\n\nHis meeting with Pike was canceled by the publisher after his arrest, according to a screenshot of a text message seen by the Guardian. Pike did not respond to a request for comment.\n\nBuma was arraigned in Los Angeles weeks after his arrest, on 1 May, and charged with a single misdemeanor. US prosecutors have claimed Buma “knowingly published, divulged, disclosed, and made known” the identity and personal identifying information of an individual who was a confidential FBI source.\n\nBuma told the Guardian he believed this was related to the news report that publicly identified Thiel as an FBI source. He denied any involvement in the matter and has pleaded not guilty."
    },
    {
        "title": "What would Russia’s peace deal demands really mean for Ukraine? - visualised",
        "description": "Trump on Monday again failed to persuade Putin to accept a ceasefire in Ukraine as a first step toward a peace deal. But what might a deal even look like, and what would it mean for the Ukrainian people?",
        "content": "One of the few explicit peace proposals is a US outline reportedly seen by Reuters last month. It asks Ukraine to accept de jure recognition of Russia’s annexation of Crimea and de facto recognition of its occupation of large parts of several oblasts... [4829 chars]",
        "url": "https://www.theguardian.com/world/ng-interactive/2025/may/22/what-would-russias-peace-deal-demands-really-mean-for-ukraine-visualised",
        "image": "https://i.guim.co.uk/img/media/d7f10a4e4a357de76cb9c28ca4653ed4def103cb/1_0_4998_4000/master/4998.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c360b7e8c6c5970a21f9f4d105f1681c",
        "publishedAt": "2025-05-22T09:56:07Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "One of the few explicit peace proposals is a US outline reportedly seen by Reuters last month. It asks Ukraine to accept de jure recognition of Russia’s annexation of Crimea and de facto recognition of its occupation of large parts of several oblasts in the country’s east. On Monday, Volodymyr Zelensky confirmed that Russia is demanding Ukrainian troops abandon five oblasts as a precondition not for peace, but for a ceasefire and the opening of negotiations.\n\nBefore the war, those oblasts were home to about 11 million Ukrainians. To put that into context, we visualised some broadly comparable populated areas in three European countries and one US state, in each case starting from the north-east corner. The shaded areas represent populations of about 11 million French, British, Italian and US citizens.\n\nFor many Ukrainians, the proposal means never being able to return home to areas now occupied by Russians, and accepting that the Ukrainians who remain there, friends and family, become permanently subject to a violent and repressive Russian regime.\n\nOrysia Lutsevych, a researcher at Chatham House, said: “There is strong nationwide sentiment that Russia will want to take more of Ukraine’s territory, so any concessions are only feeding the monster. Ukrainians know that life under occupation is horrific. Ukrainians will never agree to legally recognise its occupied land as anything else than illegal brutal annexation.”\n\nThe displaced\n\nIt is not clear how many people remain in the areas now occupied by the Russians. In some cases, whole towns have been reduced to rubble in the course of the war, and many Ukrainians fled to safety either in Ukrainian-held territory or in other countries.\n\nView image in fullscreen An aerial view from 2023 of ruined buildings in Bakhmut, a town in Donetsk oblast that was almost entirely destroyed by the fighting. Photograph: Ukrainian military photographer/Reuters\n\nThe UN says there are 3 million Ukrainians who have been displaced by the conflict inside the country, and a further 6 million abroad.\n\nOblast of origin Donetsk Kharkiv Kherson Zaporizhzhia Luhansk Sumy Dnipro Kyiv (city) Mykolaiv Kyiv Guardian graphic. Source: International Organization for Migration\n\nVladimir Putin says he wants elections in Ukraine (he wants Volodymyr Zelenskyy voted out). Where will those 9 million people vote? As residents of Donetsk, where some of them have not been since 2014? As residents of Kharkiv?\n\nLutsevych said: “Elections will need careful preparations because of the many displaced people inside Ukraine and abroad. Ukraine must protect its reputation as an electoral democracy. If elections are rushed too soon and are not properly prepared, Ukrainians will question their legitimacy. This is exactly what Putin wants – a failed state with disorder that cannot govern itself. There is no demand for early elections now and the pressure from the US and Russia looks like interference in Ukraine’s sovereignty.”\n\nThe price of uncertainty\n\nOne of the most alarming aspects of these proposals for Ukraine is that they create unfinished business, which hampers reconstruction. On the Russian side, a Putin who is neither defeated nor chastened can be expected to try again, or at the very least to go back to meddling in Ukrainian politics, as he did in the years leading up to 2014. Even on the Ukrainian side, a deal that is seen as illegitimate can create instability and a desire to reopen the question.\n\nView image in fullscreen A satellite image of the Kakhovka dam and hydroelectric power station, destroyed in June 2023. Rebuilding will take large capital investment. Photograph: Planet Labs/AP\n\nSecurity guarantees by Europe or the US, meanwhile, need to be backed up with real force to be credible, and they need to be a believably long-term commitment to make a difference.\n\nMujtaba Rahman, the managing director for Europe at the analysts Eurasia Group, said: “The key question for Ukraine is this: will there be a credible security guarantee which will enable private capital to flow back into the country? The only security guarantee that Putin’s hasn’t challenged is [Nato’s] article 5, and that’s why Ukrainians are determined to join Nato. Absent such a guarantee, you don’t get private capital returning and there can be no reconstruction.”\n\nDomestic stability is important, too. Lutsevych said: “Russian territorial occupations fester and obstruct reform and democratic consolidation, which is key for joining both the EU and Nato. The risk of instability scares FDI [foreign direct investment].\n\n“Ukrainians see the EU first of all as an instructional modernisation project and a way to eradicate corruption. Nato is more related to collective security but it does have a strong economic effect. In order to rebuild Ukraine, it is key for Kyiv to succeed in the EU accession process. The fact that the EU has opened accession talks with Ukraine is viewed as one of the victories by the Ukrainian people.”\n\nSources: pre-war populations from State Statistics Service of Ukraine. IDP movements from Institute of Migration."
    },
    {
        "title": "Germany boosts Nato’s eastern flank amid threat from Russia - Europe live",
        "description": "Friedrich Merz visits Lithuania today to mark the official formation of Germany’s first permanent overseas military unit since the second world war",
        "content": "Please turn on JavaScript to use this feature\nPlease turn on JavaScript to use this feature\nBut the court has now unanimously rejected the request , saying in a brief statement that the challenge was unfounded.\n“Just as Călin Georgescu was removed an... [2297 chars]",
        "url": "https://www.theguardian.com/world/live/2025/may/22/europe-news-latest-germany-russia-ukraine-nato",
        "image": "https://i.guim.co.uk/img/media/1d8fc99f96f941a7aa2dbf91a2716fc207bb4502/556_0_6504_5203/master/6504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=46572f84a7fd2dd449a2b6d852a965f4",
        "publishedAt": "2025-05-22T08:01:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "From 23h ago 13.39 BST 'We must do everything to defend ourselves,' Merz says inaugurating new German brigade in Lithuania And let’s go back to Vilnius, Lithuania, for an update on that military ceremony attended by German chancellor Friedrich Merz, hosted by Lithuanian president Gitanas Nausėda (11:31). German Chancellor Friedrich Merz visits Lithuania\n\nLithuanian President Gitanas Nauseda, Lithuanian Defence Minister Dovile Sakaliene, German Chancellor Friedrich Merz and German Defence Minister Boris Pistorius look on during the inauguration of the German 45th Armored Brigade \"Lietuva\" in Vilnius, Lithuania. Photograph: Ints Kalniņš/Reuters Associated Press reported that Merz, the first chancellor to have served in the Bundeswehr himself, declared that “the security of our Baltic allies is also our security” as worries about Russian aggression persist. “We must do everything to defend ourselves – so that we never have to,” Merz said at a ceremony marking the establishment of a German brigade to be deployed there, adding members knew the seriousness of the situation and their responsibilities. German Chancellor Friedrich Merz participates in the inauguration of the German 45th Armored Brigade \"Lietuva\" in Vilnius, Lithuania. Photograph: Ints Kalniņš/Reuters Share\n\n21h ago 15.42 BST Peace talks on Ukraine 'yet to be agreed,' Kremlin says New peace talks with Ukraine had “yet to be agreed”, the Kremlin said, disputing reports the two nations would soon hold negotiations at the Vatican, AFP reported. View image in fullscreen Members of the White Angel unit of Ukrainian police officers who evacuate people from the frontline towns and villages, check an area for residents, amid Russia's attack on Ukraine, in the frontline town of Pokrovsk in Donetsk region, Ukraine. Photograph: Anatolii Stepanov/Reuters The comments come after diplomatic efforts to end the conflict have stepped up a gear in recent weeks, with Russian and Ukrainian officials holding their first face-to-face talks in more than three years last week in Istanbul. The Wall Street Journal reported that follow-up talks between the two sides were expected to take place at the Vatican, starting mid-June, but Kremlin spokesperson Dmitry Peskov denied this. “There have been no agreements on this matter,” Peskov told reporters. AFP said he also denied Finnish president Alexander Stubb’s suggestion that “technical talks” could take place at the Vatican as early as next week. Ukraine war briefing: Drones blast Russian plant for missile and fighter jet chips Read more Share\n\n21h ago 15.29 BST 'Unprecedented' foreign troop deployment shows Germany's commitment to eastern flank Deborah Cole The German chancellor has visited Lithuania to mark Berlin’s first permanent foreign troop deployment since the second world war, as he called on allies to dramatically expand their efforts to bolster European defences against a hostile Russia. View image in fullscreen German Chancellor Friedrich Merz (C) attends the inauguration of the German 45th Armoured Brigade ‘Lithuania’, at the Cathedral Square in Vilnius, Lithuania. Photograph: Toms Kalniņš/EPA As a crowd waved Lithuanian, German and Ukrainian flags, Friedrich Merz and his defence minister, Boris Pistorius, attended a ceremony launching the official formation of an armoured brigade aimed at protecting Nato’s eastern flank. The new heavy combat unit, the 45th tank brigade, will be comprised of 4,800 German soldiers and 200 civilian staff. It was announced in response to Russia’s full-scale invasion of Ukraine in 2022 and is scheduled to reach full operational capacity by 2027. Merz said: “Together with our partners, we are determined to defend the alliance territory against any aggression. The security of our Baltic allies is also our security.” The deployment, unprecedented for the Bundeswehr, is aimed at shoring up the defence of Lithuania and fellow Baltic republics Estonia and Latvia, former Soviet states that have become Nato and EU members and which fear a Russian attack. View image in fullscreen A view from the formal inauguration ceremony of the German 45th Armored Brigade ‘Lithuania’ took place at Cathedral Square in Vilnius, attended by German Federal Chancellor Friedrich Merz, German Minister of Defence Boris Pistorius, Lithuanian President Gitanas Nausda, and Lithuanian Minister of National Defence Dovile Sakaliene in Vilnius, Lithuania. Photograph: Anadolu/Getty Images At a news conference in Vilnius with Lithuania’s president, Gitanas Nausėda, Merz said “Russia’s aggressive revisionism” seeking to redraw the European map created grave security risks for the entire continent, not just Ukraine. Merz, the first chancellor to have himself served in the Bundeswehr, said: “We stand firmly by Ukraine but we also stand together as Europeans as a whole and we play, whenever possible, as a team with the US.” The commitment to Baltic security has posed several challenges for Germany, including finding enough personnel willing to serve there. In January, the Bundestag passed legislation to make the prospect more attractive, including more flexible working hours and increased allowances and overtime pay. Germany bolsters anti-Russian defence on Nato eastern flank Read more Share Updated at 16.09 BST\n\n21h ago 15.25 BST Jakub Krupa Let’s go to our Berlin correspondent Deborah Cole for more on chancellor Merz’s visit in Lithuania… Share\n\n21h ago 14.56 BST Italy's constitutional court rules in favour of same-sex mums Italy’s highest court ruled it was unconstitutional not to legally recognise non-biological mothers on the birth certificates of children born to same-sex couples through IVF, AFP reported. View image in fullscreen Italian prime minister Giorgia Meloni speaking at a press conference earlier this month. Photograph: Riccardo Antimiani/EPA The finding was hailed “historic” by opposition parties in Italy, which is governed by self-declared “Christian mother” Giorgia Meloni. The far-right leader has railed against the “LGBT lobby” and says she defends traditional family values in the Catholic majority country, AFP said. The Constitutional Court in Rome “ruled as discriminatory the failure to recognise both mothers”, a decision which “effectively becomes law”, lawyer Michele Giarratano told the agency. Civil unions became legal in Italy in 2016 but the law on parental rights for same-sex couples has been unclear. AFP explained that in 2023, Meloni’s interior minister ordered town halls to stop transcribing certificates of children born abroad through surrogacy. In response, prosecutors across Italy began contesting birth certificates of children born abroad or in Italy to same-sex parents – whether through surrogacy or not. The Constitutional Court ruled on Thursday that refusing to recognise women who assume parental responsibility for the child their partner carries “does not guarantee the best interests of the minor” and violates several articles in the constitution, the agency reported. Share\n\n23h ago 13.39 BST 'We must do everything to defend ourselves,' Merz says inaugurating new German brigade in Lithuania And let’s go back to Vilnius, Lithuania, for an update on that military ceremony attended by German chancellor Friedrich Merz, hosted by Lithuanian president Gitanas Nausėda (11:31). View image in fullscreen German Chancellor Friedrich Merz visits Lithuania\n\nLithuanian President Gitanas Nauseda, Lithuanian Defence Minister Dovile Sakaliene, German Chancellor Friedrich Merz and German Defence Minister Boris Pistorius look on during the inauguration of the German 45th Armored Brigade \"Lietuva\" in Vilnius, Lithuania. Photograph: Ints Kalniņš/Reuters Associated Press reported that Merz, the first chancellor to have served in the Bundeswehr himself, declared that “the security of our Baltic allies is also our security” as worries about Russian aggression persist. “We must do everything to defend ourselves – so that we never have to,” Merz said at a ceremony marking the establishment of a German brigade to be deployed there, adding members knew the seriousness of the situation and their responsibilities. View image in fullscreen German Chancellor Friedrich Merz participates in the inauguration of the German 45th Armored Brigade \"Lietuva\" in Vilnius, Lithuania. Photograph: Ints Kalniņš/Reuters Share\n\n23h ago 13.34 BST France's Macron tells China's Xi companies 'must enjoy fair competition' President Emmanuel Macron said Thursday he told his Chinese counterpart Xi Jinping that companies from both countries “must enjoy fair competition,” AFP reported. View image in fullscreen French President Emmanuel Macron speaks at the Élysée Palace in Paris, France. Photograph: Christophe Petit-Tesson/Reuters “Chinese investment is welcome in France. But our companies must enjoy fair competition in both countries,” Macron wrote on X following talks with Xi. “We agreed to move forward as quickly as possible on the issue of cognac, which is essential for our producers.” Macron, who spoke to Xi ahead of his trip to Southeast Asia starting on Sunday, said he reaffirmed that Chinese investments were welcome in France but that companies must enjoy equitable conditions in the two countries, AFP reported. “It’s a fundamental point,” Macron wrote. Share Updated at 13.34 BST\n\n23h ago 13.31 BST In the last ten minutes, they got into the weeds of an apartment scandal that rocked Nawrocki’s campaign with questions over the circumstances in which he bought an apartment from an elderly man, and suggestions that he failed to meet his obligations to provide care as part of the transaction. He repeatedly denies all allegations. In his closing statement, Nawrocki says the run off will be “the most important election since 1989,” and I think that will be a sentiment shared by both sides of the campaign. But 90 minutes on, that’s it. Let’s leave it then and check on other news across Europe. Share\n\n23h ago 13.11 BST Jakub Krupa If you’re wondering why we are carrying these comments at length: backed by the populist-right Law and Justice party which ran Poland 2015 to 2023, Nawrocki is almost 50/50 to be Poland’s next president, which would have substantial consequences for the EU and Nato (as per earlier comments on Ukraine). And he has just signed the eight-point manifesto proposed by Mentzen (12:45), as he hopes to win over his supporters and consolidate the right-wing electorate, which accounted for about 52% of votes in the first round. It’s worth keeping an eye on this. They should be wrapping up soon. Share Updated at 13.17 BST\n\n23h ago 13.09 BST Nawrocki criticises EU's federal push as 'threat to sovereignty' Asked about the EU, Nawrocki strongly criticises plans for a more federal EU including any proposals to “build European army,” as he says that this push to “centralise” the EU is “a threat to our sovereignty.” He goes on a longer broadside there directly criticising the European Commission president Ursula von der Leyen for her track record as German defence minister, and even ticks off Belgium for its colonial past with King Leopold II saying the country is not in a position to teach him about “tolerance and openness.” “I can’t imagine that in 20 years we would become EU citizens of Polish origin,” he says, adding “these tendencies are very dangerous for Poland.” He makes claims about German problems with migration, and quips that “instead of migrant integration services, I propose illegal migrant removal centres.” Share\n\n24h ago 12.36 BST Polish presidential hopeful Nawrocki opposes Ukraine's accession to Nato Nawrocki says that any discussion on Ukraine’s fast-tracked and “unconditional” accession to Nato is “pointless” and would put the alliance in direct conflict with Russia. He says he remains opposed to it, even if he wants Ukraine to be “part of the western civilisation,” but caveats that by a long-term perspective of “decades” and “in an ideal world.” Comparing himself to the incumbent conservative president, Andrzej Duda, he says: “I am more critical towards Ukraine.” Share Updated at 12.36 BST\n\n24h ago 12.27 BST To give you a taster of what to expect from Karol Nawrocki, who could be the next Polish president after June 1, the pair begins by agreeing on extended criticism of the EU’s New Green Deal, rejection of any migration from Muslim-majority countries to Poland, and their shared opposition to extended animal rights and Covid closures in 2020 and 2021. Nawrocki also directly commits he would not send any Polish troops to Ukraine. He slightly hesitates when asked if he would resist that even if directly asked to do by US president Donald Trump, but ultimately sticks to the original line. Mentzen clearly wants to push Nawrocki, endorsed by the populist-right Law and Justice party, to criticise the last government of this party – and succeeds, at least to a certain extent. Nawrocki occassionally adds some caveats – for example, saying that it’s much easier to criticise lockdowns with hindsight or when discussing proposals for ad valorem taxation on properties – but goes above and beyond to find similarities with Mentzen as he is determined to court this right-wing electorate. Not surprisingly. Share Updated at 12.28 BST\n\n1d ago 12.07 BST And don’t just take my word for how potentially significant this Mentzen broadcast is for the Polish presidential race: it’s carried live by all major news broadcasters, with more than 200,000 people also watching it live on YouTube. View image in fullscreen Polish libertarian far-right presidential candidate Sławomir Mentzen hosting presidential conservative rival Karol Nawrocki on his YouTube channel ahead of the run-off on 1 June, with the discussion being rebroadcast live by Poland’s national broadcaster TVP. Photograph: TVP Info They are starting their chat now. I will bring you the key updates here. Share Updated at 12.10 BST\n\n1d ago 11.42 BST European Parliament backs prohibitive tariffs on fertilisers from Russia, Belarus The European Parliament voted to impose prohibitive tariffs on fertilisers and certain farm produce from Russia and its ally Belarus to prevent a potential threat to EU food security and limit Russian funds for its war against Ukraine, Reuters reported. View image in fullscreen A general view during the plenary session of the EU Parliament in Brussels, Belgium, 22 May 2025. The European Parliament’s plenary session in Brussels runs from 21 to 22 May 2025. Photograph: Olivier Hoslet/EPA Tariffs for certain nitrogen-based fertilisers will rise over three years from 6.5% to an amount equivalent to about 100%, a level that would effectively halt trade. For the farm produce, an additional 50% duty will apply, Reuters explained. The hikes are expected to take effect on 1 July. The agency noted that more than 70% of EU fertiliser consumption in 2023 was of the nitrogen-based product targeted, and Russia accounted for 25% of EU imports, worth about 1.3 billion euros ($1.5 billion). Share"
    },
    {
        "title": "Vika: The journalist who exposed Russian “black sites”, then ended up in one - podcast",
        "description": "Viktoriia Roshchyna was investigating Russia’s torture sites, then found herself inside one. Juliette Garside and Manisha Ganguly report",
        "content": "Viktoriia Roshchyna, a Ukrainian journalist known as Vika, was determined to report on Russia’s “black sites”.\n“These ‘black sites’, they’re not prisons; there’s no control on behaviour there,” Juliette Garside, an editor at the Guardian, tells Micha... [1542 chars]",
        "url": "https://www.theguardian.com/news/audio/2025/may/22/vika-the-journalist-who-exposed-russian-black-sites-then-ended-up-in-one-podcast",
        "image": "https://i.guim.co.uk/img/media/b4b82fa70961d16e82d9cee4e85f5eae91c1155b/293_0_2927_2342/master/2927.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6f9d7fa45ad2fb8a45889215b1ef12df",
        "publishedAt": "2025-05-22T02:00:45Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Viktoriia Roshchyna, a Ukrainian journalist known as Vika, was determined to report on Russia’s “black sites”.\n\n“These ‘black sites’, they’re not prisons; there’s no control on behaviour there,” Juliette Garside, an editor at the Guardian, tells Michael Safi. “So it’s where we know that some of the worst war crimes, the worst human rights abuses, take place.\n\n“These are sites where largely civilians, anyone captured by the Russians, are held, often tortured. And there are different reasons for the torture. It could just be intimidation, it could be trying to get genuine intelligence from them … and sometimes it’s gathering material for show trials, false confessions.”\n\nIn July 2023, Viktoriia set off on a dangerous reporting trip to Zaporizhzhia, in a Russian-occupied part of Ukraine. She wanted to find these sites, and name the people responsible for the abuses inside.\n\nA few days later, she vanished.\n\nA global collective of journalists, including the Guardian’s investigations correspondent and the open-source lead Manisha Ganguly and Juliette Garside, have worked to piece together what came next.\n\nTheir reporting uncovered what happened to Viktoriia at these sites, including her time in a prison in the Russian coastal town of Taganrog, which was notorious for torture.\n\n“They had an electric chair room, which was specifically constructed for this purpose,” Manisha says. “They had a room with a tub where detainees would be drowned. They also had a room with bars on the walls where detainees would be suspended upside down in a foetal position with their knees strapped to the bar and in handcuffs where they’d be beaten or electrocuted for 10 to 15 minutes.”\n\nYou can read more about the The Viktoriia Project here.\n\nSupport the Guardian today: theguardian.com/todayinfocuspod"
    },
    {
        "title": "Finland expects Russia to build up troops at border after Ukraine war ends",
        "description": "Head of strategy of Finnish defence forces says they are monitoring Moscow’s manoeuvring ‘very closely’",
        "content": "Finland has said it expects Russia to further build up troops along their shared border when the war in Ukraine ends, after reports that Moscow had strengthened its military bases near the Nato frontier.\nMaj Gen Sami Nurmi, the head of strategy of th... [3694 chars]",
        "url": "https://www.theguardian.com/world/2025/may/21/finland-expects-russia-to-build-up-troops-at-border-after-ukraine-war-ends",
        "image": "https://i.guim.co.uk/img/media/1281a7dab2a5d030eaf778c2137fd76a19fe7ac1/844_0_6504_5206/master/6504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aa20d0afa7f72f237fe0f191307e87b9",
        "publishedAt": "2025-05-21T18:00:07Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Finland has said it expects Russia to further build up troops along their shared border when the war in Ukraine ends, after reports that Moscow had strengthened its military bases near the Nato frontier.\n\nMaj Gen Sami Nurmi, the head of strategy of the Finnish defence forces, said the military is following Moscow’s manoeuvring “very closely” and that it was their job, as part of the Nato alliance, to “prepare for the worst”.\n\nThe Finnish border guard announced on Wednesday it had completed the first 35km (22 miles) of a planned 200km fence on its eastern border with Russia, which has been closed for more than a year after Helsinki accused Moscow of directing asylum seekers to Finland in a “hybrid operation”. The fence also uses cameras and sensors to distinguish between people and animals crossing.\n\nSatellite images, published in the New York Times, appear to show an expansion of military infrastructure near the Finnish border, including rows of tents, military vehicles, renovations to fighter jet shelters and construction on a previously unused helicopter base.\n\nNurmi said: “They are changing structures and we are seeing moderate preparations when it comes to building infrastructure close to our borders, meaning that they will, once the war in Ukraine hopefully ends, start to bring back the forces that have been fighting in Ukraine, especially land forces.”\n\nWhile this was not unexpected since Finland joined Nato at record speed in 2023 after Russia’s full-scale invasion of Ukraine, Nurmi said they were following the preparations “very closely”.\n\n“They are doing it in phases. I would say it is still moderate numbers. It’s not big construction, but in certain places building new infrastructure and preparing, bringing new equipment in,” he said.\n\n“You also have to evaluate whether they are preparing to send more troops to Ukraine or preparing to build up their forces close to our border. But I guess they are doing both.”\n\nResponding to Russia’s changing activities, Donald Trump told reporters on Tuesday he was “not worried about it at all”, adding that Finland and Norway were “going to be very safe”.\n\nEchoing the president’s sentiment, Nurmi said there was “no immediate military threat towards Finland or Nato from this direction”.\n\nHe added: “What happened right after the Ukrainian attack was we applied for Nato membership and then when we were accepted Russia announced they would start to change their military posture across the border.”\n\nFinnish citizens have become accustomed to the looming threat from its eastern neighbour but hundreds are still signing up for training courses to prepare for emergency situations.\n\nskip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe Finnish Women’s National Emergency Preparedness Association (known as Nasta) said interest in its training courses was still high since it first soared in 2022, with more than 800 women applying for its spring course and most courses filling up in three to four minutes.\n\nBut Suvi Aksela, Nasta’s communications and organisation manager, said the border buildup was not a big talking point in Helsinki. “It is not very alarming for us,” she said.\n\n“We are used to hearing stuff from Russia, like all these threats, and we knew once we joined Nato they said they were going to build up presence on the border, and they probably will, just because it’s Russia.”"
    },
    {
        "title": "The Guardian view on Russia sanctions: a brittle economy is Putin’s weakness",
        "description": "Editorial: Ukraine’s allies must dial up sanctions to expose the fragility of the Kremlin’s strategy for perpetual war",
        "content": "Donald Trump’s pledge to end the war in Ukraine on the first day of his second term as US president was a sign of his unsuitability as a peace broker. A clearer sign was his apparent sympathy with Vladimir Putin. Mr Trump’s tone regarding the Russian... [3186 chars]",
        "url": "https://www.theguardian.com/commentisfree/2025/may/21/the-guardian-view-on-russia-sanctions-a-brittle-economy-is-putins-weakness",
        "image": "https://i.guim.co.uk/img/media/1f00255fdbeb610cd2eb70c4a6c78caebf2fe076/0_0_4294_3437/master/4294.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=8eff3cbb8a062e4dd013563596e277a9",
        "publishedAt": "2025-05-21T17:30:34Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Donald Trump’s pledge to end the war in Ukraine on the first day of his second term as US president was a sign of his unsuitability as a peace broker. A clearer sign was his apparent sympathy with Vladimir Putin. Mr Trump’s tone regarding the Russian president has cooled somewhat on the discovery that the conflict cannot be frozen by White House diktat. There are hints of recognition that the peace process is failing because the Kremlin is cynically playing for time. Sadly, any such insight hasn’t evolved into outrage at the criminal aggression that started the war in the first place.\n\nAccounts of a telephone call between the two leaders earlier this week indicate no increase in American pressure on Russia. Mr Trump’s impatience with the whole issue seems likelier to result in him walking away. Mr Putin relishes that prospect.\n\nUkraine’s European allies have tried to coax Mr Trump into a more pro-Kyiv stance, while making contingency plans for US disengagement. But even on optimistic projections of increased defence spending, Europe is a long way from achieving capacity to provide for its own security. For now, American help is indispensable.\n\nUkraine’s military has beaten the odds and defied gloomy prognoses before, checked Russian advances and inflicted bruising defeats on their aggressor. But Mr Putin has a grim advantage in numbers. He calculates that time is on his side, that he can keep feeding conscripts into what Russians call the “meat grinder” and, by means of bloody attrition, force Volodymyr Zelenskyy to submit.\n\nRussia’s military resources are finite. And, while Mr Putin has repressed domestic dissent, he cannot indefinitely brush aside the deaths of many tens of thousands of young men. State propaganda celebrations of a war that has achieved none of its declared aims ring hollow.\n\nMr Putin’s greatest weakness is a brittle economy, geared to perpetual war, that is failing to meet the needs of civilians whose living standards have been degraded by inflation. Russia’s budget is dependent on oil revenues, and the price of crude has fallen recently (partly in response to Mr Trump’s trade-suffocating tariffs). Western sanctions already impose a price cap on Russian oil exports and the EU has proposed lowering it further.\n\nBrussels and the UK this week coordinated a further round of sanctions, including efforts to close the “shadow fleet” loophole that sustains Kremlin oil revenues. Ukraine is urging its European friends to go further still, with secondary sanctions targeting countries that buy from Russia or provide it with technological assistance.\n\nAcross the Atlantic, a majority of US senators support the application of firmer economic pressure on Moscow, but Mr Trump prefers emollience and even normalisation of commercial relations.\n\nThe US president’s Kremlin-friendly bias has been a consistent obstacle to the defence of Ukraine, but not an entirely immovable one. He doesn’t want to look weak – an aversion that can be mobilised to dissuade him from total appeasement of Mr Putin.\n\nThe Russian president might also have less time than he thinks. He projects an image of himself as a master strategist, but the evidence of a hubristically launched and badly run war doesn’t support that analysis. The Kremlin can lie about the grim state of the Russian economy, but can’t hide it for ever. That is a vulnerability which Ukraine’s allies must continue to target with maximum force."
    },
    {
        "title": "Russia accused of trying to disrupt aid to Ukraine by hacking border crossings",
        "description": "UK says GRU unit accessed cameras near borders, military installations and rail stations at key European locations",
        "content": "Russia tried to hack into border security cameras to spy on and disrupt the flow of western aid entering Ukraine, the UK’s intelligence services and its allies have claimed.\nA unit of Russia’s military intelligence services is accused of using a host... [3826 chars]",
        "url": "https://www.theguardian.com/world/2025/may/21/russia-accused-trying-disrupt-aid-ukraine-hacking-border-crossings",
        "image": "https://i.guim.co.uk/img/media/dfe6b56529eefe4282b68518513cf835058afe22/152_0_2917_2333/master/2917.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6441f902ce3c42252af176b396188919",
        "publishedAt": "2025-05-21T16:37:42Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Russia tried to hack into border security cameras to spy on and disrupt the flow of western aid entering Ukraine, the UK’s intelligence services and its allies have claimed.\n\nA unit of Russia’s military intelligence services is accused of using a host of methods to target organisations delivering “foreign assistance”, by hacking into cameras at crossings and railway stations and near military installations.\n\nGRU Unit 26165 is also accused of sending phishing emails containing pornography and fake professional information and obtaining stolen account passwords to get into systems.\n\nIt was claimed the unit – also known as APT 28 and Fancy Bear – has conducted the malicious cyber-campaign against public and private organisations in Nato states since 2022.\n\nIn its advisory note, the UK’s National Cyber Security Centre (NCSC) – part of GCHQ – called on private companies involved in the delivery of aid to “take immediate action to protect themselves”.\n\n“In addition to targeting logistics entities, unit 26165 actors likely used access to private cameras at key locations, such as near border crossings, military installations, and rail stations, to track the movement of materials into Ukraine,” the advisory says. “The actors also used legitimate municipal services, such as traffic cams.”\n\nAbout 10,000 cameras were said to have been accessed near “military installations, and rail stations, to track the movement of materials into Ukraine”, of which 80% were in Ukraine and 10% in Romania.\n\nIt is claimed 4% of the cameras targeted were in Poland, 2.8% in Hungary and 1.7% in Slovakia. The locations of the remaining cameras targeted were not provided. The hacking would have provided access to a “snapshot” of the cameras’ images, it is said.\n\nOther attempts were made that were designed to gather sensitive information on shipments, such as train schedules and shipping manifests, it is claimed. “In at least one instance, the actors attempted to use voice phishing to gain access to privileged accounts by impersonating IT staff,” says the advisory from 10 countries including the US, France and Germany.\n\nIt adds: “The subjects of spearphishing emails were diverse and ranged from professional topics to adult themes. Phishing emails were frequently sent via compromised accounts or free webmail accounts. The emails were typically written in the target’s native language and sent to a single targeted recipient.”\n\nPaul Chichester, the NCSC’s director of operations, said: “This malicious campaign by Russia’s military intelligence service presents a serious risk to targeted organisations, including those involved in the delivery of assistance to Ukraine.\n\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“The UK and partners are committed to raising awareness of the tactics being deployed. We strongly encourage organisations to familiarise themselves with the threat and mitigation advice included in the advisory to help defend their networks.”\n\nActions suggested include increasing monitoring, using multi-factor authentication with strong factors – such as passkeys – and ensuring security updates are applied promptly to manage vulnerabilities.\n\nThe advisory was drawn up with agencies from the US, Germany, Czech Republic, Poland, Australia, Canada, Denmark, Estonia, France and the Netherlands.\n\nThe Russian unit has previously been accused of leaking World Anti-Doping Agency data, and played a key role in the 2016 cyber-attack on the Democratic National Committee in the US."
    },
    {
        "title": "Former Ukrainian politician shot dead outside Madrid school",
        "description": "Andriy Portnov, ex-aide to pro-Russia former president, was dropping off children when he was targeted by gunmen",
        "content": "Unidentified gunmen have shot and killed a former Ukrainian politician, Andriy Portnov, outside a school in an upmarket suburb of Madrid.\nThe killing of Portnov, who had worked as a senior aide to Ukraine’s pro-Russia former president, Viktor Yanukov... [3090 chars]",
        "url": "https://www.theguardian.com/world/2025/may/21/former-ukrainian-politician-andriy-portnov-shot-dead-outside-madrid-school",
        "image": "https://i.guim.co.uk/img/media/d71a919ddabb23bd2a0e61cebd6d25368a167840/416_0_4160_3328/master/4160.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6662ba9717209d2cb21e114f898bf604",
        "publishedAt": "2025-05-21T12:49:11Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "A former Ukrainian politician who worked as a senior aide to the former pro-Russian president has been shot and killed outside his children’s school in an upmarket suburb of Madrid.\n\nIn the latest violence to rattle Spain since Russia’s invasion of Ukraine, Andriy Portnov was killed on Wednesday morning outside the American School of Madrid in Pozuelo de Alarcón.\n\nAuthorities said Portnov, who worked closely with Ukraine’s former president, Viktor Yanukovych, had been targeted when he was getting into his car, a black Mercedes-Benz. “Several people shot him in the back and the head and then fled towards a forested area,” said a source at Spain’s interior ministry.\n\nLocal media said Portnov had been dropping off his children at the school, where classes had begun 30 minutes before the shooting. Police sources told El País he had two daughters at the school.\n\nPortnov was found dead when medics arrived. He had been shot at least three times, Madrid’s emergency services told reporters.\n\nPolice cordoned off a car park near the private school, while helicopters and drones circled above, searching for the suspected killers. Police said they believed the shooting had involved two or three assailants and, according to the newspaper El Mundo, were investigating whether the shooting was a settling of scores related to organised crime or a political act.\n\nAlvaro Fernandez Garcia, a 22-year-old student who lives nearby, told AFP the shooting was shocking. “We usually see this on the news, or in other countries.”\n\nWidely seen as a pro-Russia political figure, Portnov, 52, was a Ukrainian lawmaker in the 2000s and became deputy head of the presidential administration under Yanukovych, an ally of Vladimir Putin.\n\nPortnov had been involved in drafting legislation targeting participants of the 2014 revolution in Ukraine before Yanukovych was ousted by a popular uprising.\n\nPortnov fled Ukraine shortly afterwards. In 2015, he was reportedly living in Russia and later relocated to Austria. In recent years, he had been the subject of multiple investigations.\n\nIn 2018, Ukraine’s security service SBU opened an investigation against him on suspicion of state treason, alleging Portnov had been involved in Russia’s illegal annexation of the Crimean peninsula. The criminal case was closed in 2019.\n\nIn 2021, the US Treasury department imposed sanctions upon him, alleging that “Portnov took steps to control the Ukrainian judiciary, influence associated legislation, sought to place loyal officials in senior judiciary positions, and purchase court decisions”.\n\nPortnov, who was also the subject of EU sanctions that were later dropped, appeared to have been living in Madrid since at least April 2024, according to a report by Radio Free Europe/Radio Liberty.\n\nSince Russia launched its full-scale invasion of Ukraine, Spain has been the scene of several high-profile crimes involving Russians and Ukrainians. The southern European country is home to significant populations from both countries.\n\nIn 2022, six letter bombs were sent to targets across the country, including Spain’s prime minister, Pedro Sánchez, the Ukrainian and US embassies, and government offices. A retired Spanish civil servant, whose social media posts suggested that he opposed western support for Ukraine after Russia’s invasion, was later found guilty of terrorism and manufacturing explosives.\n\nIn February 2024, a Russian helicopter pilot who had defected to Ukraine one year earlier in a secret operation was found dead from gunshot wounds in a parking garage near the coastal city of Alicante.\n\nWednesday’s shooting marked the second high-profile political shooting in Madrid in as many years; in 2023, the Spanish rightwing politician and former vice-president of the European parliament, Alejo Vidal-Quadras, survived after being shot in the face by a masked gunman in a wealthy Madrid neighbourhood.\n\nPolice later arrested five people in connection with the shooting, though the suspected gunman – a French national of Tunisian origin with several previous convictions in France – remains at large."
    },
    {
        "title": "UK government announces 100 new sanctions on Russia days after huge aerial bombardment",
        "description": "Russia carried out the biggest drone onslaught of the war so far on Ukraine last weekend",
        "content": "UK government announces 100 new sanctions on Russia days after huge aerial bombardment\nRussia carried out the biggest drone onslaught of the war so far on Ukraine last weekend\nRussian President Vladimir Putin appearing at a press briefing in Sochi, R... [2417 chars]",
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/uk-sanctions-russia-putin-ukraine-31688773",
        "image": "https://i2-prod.manchestereveningnews.co.uk/article31688833.ece/ALTERNATES/s1200/0_Putin.jpg",
        "publishedAt": "2025-05-21T10:05:41Z",
        "source": {
            "name": "Manchester Evening News",
            "url": "https://www.manchestereveningnews.co.uk"
        },
        "full_content": "UK government announces 100 new sanctions on Russia days after huge aerial bombardment\n\nRussia carried out the biggest drone onslaught of the war so far on Ukraine last weekend\n\nRussian President Vladimir Putin appearing at a press briefing in Sochi, Russia earlier this week. (Image: Kremlin Press Service / Handout/Anadolu via Getty Images )\n\nThe UK government has announced a wide range of sanctions on Russia, just days after Vladimir Putin carried out the biggest aerial onslaught of the war on Ukraine.\n\nOn Saturday, Russia fired 273 drones at Ukrainian cities. A strike on a bus in the northeastern city of Sumy alone killed 9 civilians.\n\n‌\n\n\n\nNow, Foreign Secretary David Lammy has made the decision to ramp up pressure on the Russian dictator by implementing 100 sanctions across Russian military, energy, financial sectors and those conducting Putin's information war against Ukraine.\n\n‌\n\n\n\nUK and partners are also working to tighten the Oil Price Cap, further restricting critical oil revenues for Putin.\n\nDespite reportedly agreeing on terms for an unconditional ceasefire during a meeting with US President Donald Trump earlier this week, Russia are showing no signs of softening their attacks on innocent people in Ukraine - let alone bringing a halt to military operations.\n\nAmongst the military boycotts introduced today is a ban on Iksander missiles - a short-range ballistic system that has inflicted untold damage on the Ukrainian people.\n\nArticle continues below\n\nThis is a huge show of support for President Zelenskyy and a move that will save dozens of Ukrainian lives.\n\nThese latest sanctions come as the EU prepares to announce its 17th package of penalties against Russia.\n\nBoth the UK and EU's sanctions are likely to have a big effect on Russia's economy.\n\n‌\n\n\n\nRussian GDP shrank in the first quarter of the year and the non-defence economy has been in recession for some time.\n\nPutin has had to raise taxes and slash social spending just to be able to continue the war.\n\nBritish Foreign Secretary David Lammy speaks to the media ahead of the NATO Foreign Ministers' Informal Meeting held at the NEST Congress Center in Turkey earlier this month. (Image: Muhammed Abdullah Kurtar/Anadolu via Getty Images )\n\nArticle continues below\n\nSpeaking about the latest round of sanctions, David Lammy said: \"Putin’s latest strikes once again show his true colours as a warmonger.\n\n\"We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace,\" he added.\n\n\"We have been clear that delaying peace efforts will only redouble our resolve to help Ukraine to defend itself and use our sanctions to restrict Putin’s war machine.\""
    },
    {
        "title": "Russia-Ukraine war live: Putin visits Kursk region for first time since recapturing from Ukraine",
        "description": "Kremlin said the Russian president visited the region on Tuesday and met with the interim government",
        "content": "03.36 EDT Putin visited Kursk region on Ukraine border, says Kremlin\nRussian president Vladimir Putin visited the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area, the Kremlin said on Wedne... [1526 chars]",
        "url": "https://www.theguardian.com/world/live/2025/may/21/vladimir-putin-kursk-volodymyr-zelenskyy-ukraine-russia-ukraine-war-live",
        "image": "https://i.guim.co.uk/img/media/0d728eeb9fb88fa6b600099a88c718f1b306e86a/0_0_1450_1160/master/1450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=3f554c7ef2085d24b22ce4d2fcc774f6",
        "publishedAt": "2025-05-21T07:55:05Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "From 2d ago 08.36 BST Putin visited Kursk region on Ukraine border, says Kremlin Russian president Vladimir Putin visited the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area, the Kremlin said on Wednesday. “Vladimir Putin made a working visit the previous day to the Kursk region,” where he met the interim governor and others, the Kremlin said in a statement, according to Agence France-Presse (AFP). Ukrainian troops seized control of parts of the Kursk region in August 2024, but were pushed out by Moscow’s forces, with help from North Korean soldiers, by the end of April. Russian president Vladimir Putin visited the border region of Kursk on Tuesday. Photograph: Vyacheslav Prokofyev/SPUTNIK/KREMLIN POOL/EPA AFP report that images aired on the Rossia 24 channel showed a relaxed and smiling Putin sitting around a large table decked with tea and sweets, with people from the region. Putin also visited the local nuclear power plant and met city officials, the Kremlin said. The Russian president previously visited Kursk at the end of March. Meanwhile, Pope Leo XIV confirmed to Giorgia Meloni his willingness to host in the Vatican the next round of negotiations to try to end the war between Russia and Ukraine, the Italian prime minister said on Tuesday. “Finding in the Holy Father confirmation of the readiness to host the next talks between the parties in the Vatican, the prime minister expressed deep gratitude to Pope Leo XIV for his unceasing commitment to peace,” said a statement from Meloni. Pope Leo XIV, elected two weeks ago, said on 14 May that the Vatican could act as a mediator in global conflicts, without specifically mentioning Russia’s war against Ukraine. Here are some other key developments: Separately the Italian prime minister said she had talks with other European leaders and the Ukrainian president, Volodymyr Zelenskyy, over next steps. “It was agreed to maintain close coordination between the partners with a view to a new round of negotiations aimed at a ceasefire and a peace agreement in Ukraine.”\n\nZelenskyy accused Russia of “trying to buy time” to continue the war, a day after the US president, Donald Trump, discussed the war with Putin. Their two-hour phone call failed to deliver any meaningful concessions from Moscow. The German defence minister, Boris Pistorius, also accused Vladimir Putin of “playing for time” and not really being interested in peace in Ukraine.\n\nIn its regular assessment, the Institute for the Study of War (ISW) said on Tuesday: “Russia must explicitly acknowledge the legitimacy of the Ukrainian president, government, and constitution and Ukraine’s sovereignty in order to engage in meaningful, good-faith negotiations.” Putin must also agree to a ceasefire before negotiation of a final peace settlement. The ISW said Russia was trying to expand its list of demands when it should be preparing to make concessions.\n\nAfter the European Union on Tuesday adopted its 17th round of sanctions against Russia centred on the “shadow fleet” of oil tankers, human rights violations and hybrid threats, the European Commission president, Ursula von der Leyen, said a further, 18th package was already being prepared with further “hard-hitting” measures. The UK government has also announced 100 new sanctions on Russia across Russian military, energy, financial sectors and those conducting “Putin’s information war against Ukraine”.\n\nThe US secretary of state, Marco Rubio, said he expected Russia within days to present broad outlines for a ceasefire with Ukraine that would let the US assess whether Moscow is serious. “At some point here fairly soon – maybe in a number of days, maybe this week hopefully – the Russian side is going to present the terms,” Rubio told a Senate hearing.\n\nA Russian strike on a military training site in northeastern Ukraine has killed six soldiers and wounded at least 10 others , the Ukrainian national guard said on Wednesday. Ukraine’s Sumy border region – from where Kyiv’s troops launched last year’s major cross-border offensive into Russia’s Kursk region – has come under intensifying attacks in recent months after Moscow recaptured its territory.\n\nUkraine’s military said it has launched another investigation into the “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders , Agence France-Presse (AFP) reported.\n\nThe Ukrainian foreign minister, Andriy Sybiha, called on the G7 to reduce its price cap on Russian seaborne oil to $30 per barrel. The current cap is $60. Ukraine is attending G7 talks in Canada this week. Share\n\n2d ago 10.59 BST The Kremlin said on Wednesday that no decision had been made on a venue for Russia-Ukraine peace talks, responding to a question about whether they could be hosted by the Vatican, reports Reuters. US president Donald Trump said on Monday “it would be great” for Russia and Ukraine to hold ceasefire talks at the Vatican, saying it would add extra significance to the proceedings. Italian prime minister Giorgia Meloni said on Tuesday that Pope Leo XIV had confirmed to her that he was willing to host the next round of negotiations. Share\n\n2d ago 10.44 BST An unidentified gunman or gunmen is reported to have killed former Ukrainian politician Andriy Portnov on Wednesday morning outside the gates of the American School in Madrid’s affluent neighbourhood of Pozuelo, according to Reuters, citing a source close to the investigation. Police received a call about the shooting of a Ukrainian citizen at 9.15am (07.15am GMT/8.15am BST) local time outside the elite American School of Madrid, located in Pozuelo de Alarcon, Madrid police told Reuters, without identifying the victim. Portnov was a senior aide to Ukraine’s former president, Viktor Yanukovich, who was ousted in the 2014 Euromaidan revolution. Since the Russian invasion of Ukraine in February 2022, there have been several crimes involving high-profile Russian and Ukrainians in Spain, which has significant expatriate populations from both countries. In November and December 2022, six letter bombs were sent to high profile targets around Spain, including to prime minister Pedro Sánchez, the Ukrainian embassy in Madrid, government offices, a European Union satellite company and the US embassy. A 76-year-old retired Spanish civil servant whose social media searches suggested sympathy for Russia was jailed for the offences. In February 2024, a Russian pilot who defected to Ukraine with his helicopter was found dead from multiple gunshot wounds in the parking garage of his apartment block near Alicante. Share Updated at 10.53 BST\n\n2d ago 10.27 BST Dutch and British wholesale gas prices rose to their highest in more than six weeks on Wednesday, supported by lower supply from Norway, competition for liquefied natural gas and worries about Ukraine peace talks and unrest in the Middle East, reports Reuters. Share\n\n2d ago 10.13 BST Peter Beaumont The UK and Europe have announced major sanctions against Russia as it became clear that Monday’s call between Donald Trump and Vladimir Putin had failed to deliver any meaningful concessions from Moscow. The Ukrainian president, Volodymyr Zelenskyy, on Tuesday accused Russia of “trying to buy time in order to continue its war and occupation” as Putin declined to support the US-proposed 30-day unconditional ceasefire already agreed to by Ukraine. The UK said its sanctions would target dozens of entities “supporting Russia’s military machine, energy exports and information war, as well as financial institutions helping to fund Putin’s invasion of Ukraine”. “Putin has so far not put in place the full, unconditional ceasefire that President Trump has called for, and which President Zelenskyy endorsed over two months ago,” the Foreign Office said. Shortly afterwards the EU foreign policy chief, Kaja Kallas, said the EU had approved sanctions targeting Russia’s shadow fleet of about 200 vessels and that more sanctions were in the pipeline. “The longer Russia wages war, the tougher our response,” she said. Western countries imposed an embargo on Russia’s oil industry after the 2022 invasion of Ukraine and banned services for ships transporting Russian crude. In response, Moscow began relying on a so-called shadow fleet – tankers with murky ownership and often without proper insurance – to continue exports Zelenskyy on Tuesday welcomed the EU sanctions. “It is important to severely restrict the Russian tanker fleet, which serves to finance killings, as well as all schemes that Russia uses to build up its military industry,” he wrote on his social media channels. UK and Europe target Russia with major sanctions after Putin-Trump call Read more Share\n\n2d ago 09.51 BST G7 finance ministers meet in Canada to discuss Ukraine-Russia Jakub Krupa Finance ministers of the world’s seven largest economies – G7 – are meeting in Banff, Alberta in Canada to discuss their ideas on Ukraine and concerns about disruptions resulting from Donald Trump’s unorthodox trade policy. Before the meeting, German finance minister Lars Klingbeil warned that trade disputes with the US should be resolved as soon as possible, as he stressed they were a burden on the economy and job security. Instead of this infighting, G7 should make it clear that it “will continue to stand firmly by Ukraine’s side” and oppose “the terrible destruction caused by Russian president Vladimir Putin’s war,” Klingbeil said. Ukraine will be represented there, with the country’s finance minister Sergii Marchenko in attendance. These comments come as Europe scramble to keep pressure on Russia with the latest round of sanctions. UK and Europe target Russia with major sanctions after Putin-Trump call Read more Share\n\n2d ago 09.29 BST Here are a couple of images of the Russian president, Vladimir Putin, visiting the border region of Kursk on Tuesday, several weeks after Russian forces pushed Ukrainian troops out of the area: View image in fullscreen Russian president Vladimir Putin visits the Kursk-II nuclear power plant under construction, in the Kursk region, in this still image taken from video released on Wednesday. Photograph: KREMLIN.RU/Reuters View image in fullscreen Russian president Vladimir Putin visits the Kursk-II nuclear power plant under construction, in the Kursk Region, on Tuesday. Photograph: KREMLIN.RU/Reuters Share\n\n2d ago 09.12 BST Ukraine to ask EU to lead on Russia sanctions as US wavers Ukraine will ask the EU next week to consider big new steps to isolate Moscow, including seizing Russian assets and bringing in sanctions for some buyers of Russian oil, as US president Donald Trump has backed off from tightening sanctions, reports Reuters in an exclusive. A previously unreported Ukrainian white paper to be presented to the EU calls for the 27-member bloc to take a more aggressive and independent position on sanctions as uncertainty hangs over Washington’s future role. According to Reuters, among 40 pages of recommendations were calls to adopt legislation that would speed up the EU’s seizure of assets from sanctioned individuals, and send them to Ukraine. Those under sanctions could then seek compensation from Russia. The EU should consider a range of steps to make its sanctions apply more forcefully beyond its own territory, including targeting foreign companies that use its technology to help Russia, and “the introduction of secondary sanctions on purchasers of Russian oil”. Such secondary sanctions, which could hit big buyers such as India and China, would be a major step that Europe has so far been reluctant to take. Trump had publicly discussed this before taking the decision not to act for now, reports Reuters. The white paper also calls for the EU to consider using more majority-rules decision making over sanctions, to prevent individual member states from blocking measures that otherwise require unanimity. After speaking to Vladimir Putin on Monday, Trump opted not to impose fresh sanctions on Russia, dashing hopes of European leaders and Kyiv who had been lobbying him for weeks to ratchet up pressure on Moscow. Trump spoke to Ukrainian and European leaders after his call with Putin and told them he did not want to impose sanctions now and to give time for talks to take place, a person familiar with conversation told Reuters. The EU and the UK imposed additional sanctions against Russia on Tuesday anyway, saying they still hope Washington will join them. But Europeans are openly discussing ways they can maintain pressure on Moscow if Washington is no longer prepared to participate. Share\n\n2d ago 08.55 BST Iran’s parliament approved a 20-year strategic partnership on Wednesday between Moscow and Tehran, state media reported. The agreement represents a deepening of bilateral ties including closer defence cooperation. Russian president Vladimir Putin and his Iranian counterpart Masoud Pezeshkian signed the strategic partnership document on 17 January. The Russian legislative branch approved the pact in April. While the agreement does not include a mutual defence clause, it says both countries will work together against common military threats, develop their military-technical cooperation, and take part in joint exercises, reports Reuters. Since the start of the war in Ukraine in 2022, Iran and Russia have deepened military ties, with western countries accusing Iran of providing missiles and drones for Russian attacks on Ukraine. Tehran denies providing weapons for Russian use in Ukraine. The strategic pact also includes several clauses aimed at boosting economic partnership, notably by strengthening direct interbank cooperation and promoting their national financial products. A free trade deal between Iran and the Russian-led Eurasian Economic Union went into effect last week, cutting down tariffs to boost trade between the two economies, which are both under heavy western sanctions. Share\n\n2d ago 08.44 BST Russian strike on Ukrainian military training site kills six, says Kyiv A Russian strike on a military training site in north-eastern Ukraine has killed six soldiers and wounded at least 10 others, the Ukrainian national guard said on Wednesday, reports Agence France-Presse (AFP). Ukraine’s Sumy border region – from where Kyiv’s troops launched last year’s major cross-border offensive into Russia’s Kursk region – has come under intensifying attacks in recent months after Moscow recaptured its territory. “Six soldiers were killed and more than 10 wounded as a result of the attack, while they carried out exercises at a military shooting range,” Ukraine’s national guard said in a Facebook post, adding that an investigation has been opened into the incident. Russia’s defence ministry on Tuesday evening said it had launched a ballistic missile attack on the site. “During reconnaissance activities … a training camp” for Ukrainian special forces was “detected,” it said in a social media post. “Based on the received coordinates, an Iskander missile strike was launched,” it added. Russia also published footage showing the hit on what it said was a training camp in a wooded area. AFP report that aerial footage showed one strike, sparking a large fire and sending a plume of thick black smoke billowing into the air. “An internal investigation into the incident is under way. The commander of the military unit has been suspended, and the necessary information has been passed on to law enforcement agencies,” Ukraine’s national guard said. Share Updated at 08.46 BST"
    },
    {
        "title": "Kremlin confident US will no longer 'indulge' Ukraine and EU after Trump's call to Putin",
        "description": "Much of the Russian press coverage portrays the phone call as a battle for Donald Trump's affections, with Russia emerging victorious despite the influence of \"Western hawks\".",
        "content": "The mood in Russia is upbeat, bordering on triumphant, following Monday's phone call between Vladimir Putin and Donald Trump.\n\"The tone of the conversation was excellent,\" crows the headline in the newspaper Argumenty i Fakty, quoting the American pr... [1768 chars]",
        "url": "https://news.sky.com/story/kremlin-confident-us-will-no-longer-indulge-ukraine-and-eu-after-trumps-call-to-putin-13371598",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "publishedAt": "2025-05-20T16:50:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The mood in Russia is upbeat, bordering on triumphant, following Monday's phone call between Vladimir Putin and Donald Trump.\n\n\"The tone of the conversation was excellent,\" crows the headline in the newspaper Argumenty i Fakty, quoting the American president's assessment of the conversation.\n\nTrump has \"accepted the Russian formula\" of \"negotiations first, ceasefire after\", the paper brags.\n\nAnother, Komsomolskaya Pravda, runs with Putin's description of the call as their main headline: \"We are on the right track\".\n\nAccording to the pro-Kremlin paper, Trump's approach shows the United States \"is not going to indulge [Volodymyr] Zelenskyy and Europe\".\n\nMuch of the coverage portrays the call as a battle for Trump's affections, with Russia emerging victorious despite the influence of \"Western hawks\".\n\n\"[Trump] did not heed their requests,\" says Argumenty i Fakty, referring to Europe's calls for tougher sanctions.\n\nImage: Trump and Putin shake hands in Helsinki in July 2018. File pic: Reuters\n\nRead more\n\nRussia bans Amnesty International\n\nWhat happened during Ukraine-Russia peace talks?\n\nAnalysis: Talks revealed a stark reality\n\nIn Kommersant, there's talk of the two leaders sharing a \"common language\".\n\nThe paper talks about how Trump has adopted \"the most favourable position\" for Moscow, which it claims \"came as a complete surprise to the Western allies of the United States, nullifying their expectations\".\n\n\"In Kyiv and the camp of its Western allies, disappointment reigns over the \"betrayal\" of the United States\", it gloats.\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nThere's no talk of the Kremlin stalling negotiations or dragging its feet. On the contrary, Putin's pledge to work with Ukraine on a memorandum for a future peace treaty is characterised as a logical next step.\n\n\"The purpose of the conversation was to advance the peace process in Ukraine\", the daily Vedomosti states soberly.\n\nThere's not a hint of irony, nor criticism. Only glee."
    },
    {
        "title": "Fresh UK and EU sanctions on Russia announced - as Putin procrastinates on ceasefire talks",
        "description": "The sanctions will target Russia's weapons supply chains, Kremlin-funded information operations, financial institutions and its \"shadow fleet\".",
        "content": "The UK and EU have placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.\nThe UK's Foreign Office said a total of 100 further sanctions will target Russia's military, energy and financial sectors.\nT... [4729 chars]",
        "url": "https://news.sky.com/story/fresh-uk-and-eu-sanctions-on-russia-announced-as-putin-procrastinates-on-ceasefire-talks-13371420",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-putin-russia-vladimir_6918507.jpg?20250516164237",
        "publishedAt": "2025-05-20T14:20:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The UK and EU have placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.\n\nThe UK's Foreign Office said a total of 100 further sanctions will target Russia's military, energy and financial sectors.\n\nThe new measures will target the supply chains of Russian weapons systems, including Iskander missiles, Kremlin-funded information operations, financial institutions that help Russia evade sanctions and ships in the Kremlin's \"shadow fleet\" of oil tankers.\n\nUkraine war latest: Trump has 'red line' for peace talks\n\nThe Foreign Office said Vladimir Putin had repeatedly fired Iskander missiles into crowded civilian areas \"with a callous disregard for life\", including on 13 April in Sumy when 34 civilians, including children, were killed as some headed to Palm Sunday services.\n\nSimilarly, European Commission President Ursula von der Leyen said an 18th package of EU sanctions against Russia is already being worked on.\n\n\"It's time to intensify the pressure on Russia to bring about the ceasefire,\" she said on X, after a phone call with Ukrainian President Volodymyr Zelenskyy.\n\nThese new sanctions are being imposed to ratchet up pressure on Mr Putin after Russia fired 273 drones at Ukrainian cities on Saturday, the biggest drone attack since it invaded Ukraine in February 2022.\n\nImage: Firefighters put out a fire after Russia carried out its biggest drone attack in Ukraine. Pic: AP\n\nForeign Secretary David Lammy said: \"Putin's latest strikes once again show his true colours as a warmonger.\n\n\"We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.\n\n\"We have been clear that delaying peace efforts will only redouble our resolve to help Ukraine to defend itself and use our sanctions to restrict Putin's war machine.\"\n\nPutin-Trump call portrayed as battle for the US president's affections Ivor Bennett Moscow correspondent @IvorBennett The mood in Russia is upbeat, bordering on triumphant, following Monday's phone call between Vladimir Putin and Donald Trump. \"The tone of the conversation was excellent,\" crows the headline in the newspaper Argumenty i Fakty, quoting the American president's assessment of the conversation. Trump has \"accepted the Russian formula\" of \"negotiations first, ceasefire after\", the paper brags. Another, Komsomolskaya Pravda, runs with Putin's description of the call as their main headline: \"We are on the right track\". According to the pro-Kremlin paper, Trump's approach shows the United States \"is not going to indulge [Volodymyr] Zelenskyy and Europe\". Much of the coverage portrays the call as a battle for Trump's affections, with Russia emerging victorious despite the influence of \"Western hawks\". \"[Trump] did not heed their requests,\" says Argumenty i Fakty, referring to Europe's calls for tougher sanctions. Read more from Ivor here.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nFollowing Donald Trump's two-hour call with Mr Putin on Monday, the US president said Russia and Ukraine will immediately start negotiations for a ceasefire; however, the Kremlin gave no timeline despite Mr Zelenskyy agreeing to one months ago.\n\nThe call prompted the UK and EU's new sanctions.\n\nRead more:\n\nIs Trump walking away from peace in Ukraine?\n\nRussia bans Amnesty International as an 'undesirable organistion'\n\nPlease use Chrome browser for a more accessible video player 2:17 Analysis: The Trump-Putin call\n\nNew British sanctions have also been placed on 14 more members of the Social Design Agency (SDA), which carries out Kremlin-funded information operations to undermine sovereignty, democracy and the rule of law in Ukraine and across the world.\n\nThe UK had previously sanctioned the SDA and several of its leaders last year, but all levels of the organisation are now being targeted.\n\nImage: Russian servicemen training in Ukraine. Pic: Russian Defense Ministry Press Service\n\nAnother 46 financial institutions that help Russia evade sanctions have also been targeted.\n\nSanctions have also been placed on a further 18 ships, following 110 earlier this month, in Russia's \"shadow fleet\", which carry Russian oil under different flags (often Liberian) to continue shipping oil around the world despite sanctions that have placed a price cap on Russian oil.\n\nSpreaker Spreaker , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies. To view this content you can use the button below to allow Spreaker cookies for this session only. Enable Cookies Allow Cookies Once\n\n👉 Follow Trump100 on your podcast app 👈\n\nJohn Ormerod, a British national who procured ships for Russia's shadow fleet has been sanctioned, and two Russian captains of shadow fleet tankers.\n\nThe UK and Western allies are looking to lower the price cap of Russian crude oil from $60 a barrel to prevent profits from being used to fund the war.\n\nImage: Donald Trump and Vladimir Putin in 2018. File pic: Reuters\n\nGet Sky News on WhatsApp Follow our channel and never miss an update. Tap here to follow\n\nThe Foreign Office said UK and other Western sanctions have severely hit Russia's economy, with its GDP shrinking in the first quarter of the year and the non-defence economy in recession for some time.\n\nIt said security and defence spending now accounts for more than 40% of Russia's federal budget, with Mr Putin raising taxes and cutting social spending to continue the war."
    },
    {
        "title": "Ukraine war latest: UK and EU slap dozens of new sanctions on Russia",
        "description": "The UK and EU have announced extra sanctions on Russia, targeting sectors from the military to Moscow's \"shadow fleet\" of oil tankers. Meanwhile, Volodymyr Zelenskyy has accused Vladimir Putin of \"playing for time\" after calls with Donald Trump ended with no breakthrough.",
        "content": "Russia: It's up to Ukraine if talks continue\nA small update to bring you now from Moscow.\nRussian's foreign ministry spokeswoman has said it's up to Ukraine whether talks continue.\nMaria Zakharova said Kyiv must decide if it will cooperate on forming... [443 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-uk-and-eu-slap-dozens-of-new-sanctions-on-russia-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-vladimir-putin-russia_6916811.jpg?20250515062341",
        "publishedAt": "2025-05-20T11:56:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Fresh UK sanctions on Russia announced - as Putin procrastinates on ceasefire talks",
        "description": "The sanctions will target Russia's weapons supply chains, Kremlin-funded information operations, financial institutions and its \"shadow fleet\".",
        "content": "The UK has placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.\nA total of 100 further sanctions will target Russia's military, energy and financial sectors, the Foreign Office said.\nThe new measu... [4503 chars]",
        "url": "https://news.sky.com/story/fresh-uk-sanctions-on-russia-announced-as-putin-procrastinates-on-ceasefire-talks-13371420",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-putin-russia-vladimir_6918507.jpg?20250516164237",
        "publishedAt": "2025-05-20T11:23:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The UK and EU have placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.\n\nThe UK's Foreign Office said a total of 100 further sanctions will target Russia's military, energy and financial sectors.\n\nThe new measures will target the supply chains of Russian weapons systems, including Iskander missiles, Kremlin-funded information operations, financial institutions that help Russia evade sanctions and ships in the Kremlin's \"shadow fleet\" of oil tankers.\n\nUkraine war latest: Trump has 'red line' for peace talks\n\nThe Foreign Office said Vladimir Putin had repeatedly fired Iskander missiles into crowded civilian areas \"with a callous disregard for life\", including on 13 April in Sumy when 34 civilians, including children, were killed as some headed to Palm Sunday services.\n\nSimilarly, European Commission President Ursula von der Leyen said an 18th package of EU sanctions against Russia is already being worked on.\n\n\"It's time to intensify the pressure on Russia to bring about the ceasefire,\" she said on X, after a phone call with Ukrainian President Volodymyr Zelenskyy.\n\nThese new sanctions are being imposed to ratchet up pressure on Mr Putin after Russia fired 273 drones at Ukrainian cities on Saturday, the biggest drone attack since it invaded Ukraine in February 2022.\n\nImage: Firefighters put out a fire after Russia carried out its biggest drone attack in Ukraine. Pic: AP\n\nForeign Secretary David Lammy said: \"Putin's latest strikes once again show his true colours as a warmonger.\n\n\"We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace.\n\n\"We have been clear that delaying peace efforts will only redouble our resolve to help Ukraine to defend itself and use our sanctions to restrict Putin's war machine.\"\n\nPutin-Trump call portrayed as battle for the US president's affections Ivor Bennett Moscow correspondent @IvorBennett The mood in Russia is upbeat, bordering on triumphant, following Monday's phone call between Vladimir Putin and Donald Trump. \"The tone of the conversation was excellent,\" crows the headline in the newspaper Argumenty i Fakty, quoting the American president's assessment of the conversation. Trump has \"accepted the Russian formula\" of \"negotiations first, ceasefire after\", the paper brags. Another, Komsomolskaya Pravda, runs with Putin's description of the call as their main headline: \"We are on the right track\". According to the pro-Kremlin paper, Trump's approach shows the United States \"is not going to indulge [Volodymyr] Zelenskyy and Europe\". Much of the coverage portrays the call as a battle for Trump's affections, with Russia emerging victorious despite the influence of \"Western hawks\". \"[Trump] did not heed their requests,\" says Argumenty i Fakty, referring to Europe's calls for tougher sanctions. Read more from Ivor here.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nFollowing Donald Trump's two-hour call with Mr Putin on Monday, the US president said Russia and Ukraine will immediately start negotiations for a ceasefire; however, the Kremlin gave no timeline despite Mr Zelenskyy agreeing to one months ago.\n\nThe call prompted the UK and EU's new sanctions.\n\nRead more:\n\nIs Trump walking away from peace in Ukraine?\n\nRussia bans Amnesty International as an 'undesirable organistion'\n\nPlease use Chrome browser for a more accessible video player 2:17 Analysis: The Trump-Putin call\n\nNew British sanctions have also been placed on 14 more members of the Social Design Agency (SDA), which carries out Kremlin-funded information operations to undermine sovereignty, democracy and the rule of law in Ukraine and across the world.\n\nThe UK had previously sanctioned the SDA and several of its leaders last year, but all levels of the organisation are now being targeted.\n\nImage: Russian servicemen training in Ukraine. Pic: Russian Defense Ministry Press Service\n\nAnother 46 financial institutions that help Russia evade sanctions have also been targeted.\n\nSanctions have also been placed on a further 18 ships, following 110 earlier this month, in Russia's \"shadow fleet\", which carry Russian oil under different flags (often Liberian) to continue shipping oil around the world despite sanctions that have placed a price cap on Russian oil.\n\nSpreaker Spreaker , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies. To view this content you can use the button below to allow Spreaker cookies for this session only. Enable Cookies Allow Cookies Once\n\n👉 Follow Trump100 on your podcast app 👈\n\nJohn Ormerod, a British national who procured ships for Russia's shadow fleet has been sanctioned, and two Russian captains of shadow fleet tankers.\n\nThe UK and Western allies are looking to lower the price cap of Russian crude oil from $60 a barrel to prevent profits from being used to fund the war.\n\nImage: Donald Trump and Vladimir Putin in 2018. File pic: Reuters\n\nGet Sky News on WhatsApp Follow our channel and never miss an update. Tap here to follow\n\nThe Foreign Office said UK and other Western sanctions have severely hit Russia's economy, with its GDP shrinking in the first quarter of the year and the non-defence economy in recession for some time.\n\nIt said security and defence spending now accounts for more than 40% of Russia's federal budget, with Mr Putin raising taxes and cutting social spending to continue the war."
    },
    {
        "title": "UK and Europe target Russia with major sanctions after Putin-Trump call",
        "description": "Sanctions are aimed at entities supporting Russia’s military machine after call failed to deliver meaningful concessions",
        "content": "The UK and Europe have announced major sanctions against Russia as it became clear that Monday’s call between Donald Trump and Vladimir Putin had failed to deliver any meaningful concessions from Moscow.\nThe Ukrainian president, Volodymyr Zelenskyy, ... [4445 chars]",
        "url": "https://www.theguardian.com/world/2025/may/20/sanctions-russia-uk-europe-putin-trump-call",
        "image": "https://i.guim.co.uk/img/media/c48ea136f8698ed400e6bc51d81b1e08b9caa9d1/962_0_3855_3085/master/3855.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75b73b2e34f2ba718fae7063d9807caa",
        "publishedAt": "2025-05-20T10:50:03Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The UK and Europe have announced major sanctions against Russia as it became clear that Monday’s call between Donald Trump and Vladimir Putin had failed to deliver any meaningful concessions from Moscow.\n\nThe Ukrainian president, Volodymyr Zelenskyy, on Tuesday accused Russia of “trying to buy time in order to continue its war and occupation” as Putin declined to support the US-proposed 30-day unconditional ceasefire already agreed to by Ukraine.\n\nThe UK said its sanctions would target dozens of entities “supporting Russia’s military machine, energy exports and information war, as well as financial institutions helping to fund Putin’s invasion of Ukraine”.\n\n“Putin has so far not put in place the full, unconditional ceasefire that President Trump has called for, and which President Zelenskyy endorsed over two months ago,” the Foreign Office said.\n\nShortly afterwards the EU foreign policy chief, Kaja Kallas, said the EU had approved sanctions targeting Russia’s shadow fleet of about 200 vessels and that more sanctions were in the pipeline. “The longer Russia wages war, the tougher our response,” she said.\n\nWestern countries imposed an embargo on Russia’s oil industry after the 2022 invasion of Ukraine and banned services for ships transporting Russian crude. In response, Moscow began relying on a so-called shadow fleet - tankers with murky ownership and often without proper insurance - to continue exports\n\nZelenskyy on Tuesday welcomed the EU sanctions. “It is important to severely restrict the Russian tanker fleet, which serves to finance killings, as well as all schemes that Russia uses to build up its military industry,” he wrote on his social media channels.\n\nZelenskyy also said Ukraine had no doubt the war “must end at the negotiating table” but added that there must be clear and realistic proposals on the table and called for more pressure on Russia.\n\n“We are working with partners to put pressure on the Russians to behave differently. Sanctions matter, and I am grateful to everyone who makes them more tangible for the perpetrators of the war,” he said.\n\nTrump had indicated on Monday following his call with Putin that the US was not ready to join European sanctions efforts.\n\nResponding to the new sanctions, Russia’s foreign ministry accused Europe of trying to prevent the resumption of direct dialogue, adding: “Russia never responds to ultimatums.”\n\nThe announcement of the new sanctions underlined the failure of Trump’s attempted mediation in the war, as it became clear in Kyiv and other European capitals that Trump had in effect accepted Putin’s defiance of calls for an immediate ceasefire.\n\nInstead, Trump placed the onus on Kyiv and Moscow to negotiate between themselves, perhaps under the auspices of papal mediation. Trump was at pains on Monday to emphasise the “excellent” call he had with Putin, suggesting that talks between the two sides would begin “immediately”, but it quickly became clear that he had backed away from any demand that Russia declare an immediate ceasefire.\n\nDescribing future talks, Trump said: “The conditions will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of.”\n\nTrump’s comments appeared to reflect a waning enthusiasm for engagement with attempts to end the war in Ukraine, after comments from the White House that he was “weary and frustrated”, and he again threatened that he was “just going to back away” after the call with Putin. Trump appeared to again defer to Moscow by backing Putin’s call for negotiations between Ukraine and Russia.\n\nAccording to a report on the Axios website, European leaders – including the leaders of Germany, France, Italy, Finland and the European Commission – who joined a subsequent call with Zelenskyy were “surprised” by Trump’s depiction of his conversation with Putin. It reported that according to its sources “Trump seemed relatively content with what he heard from Putin, and presented it as a new development, even though the Russian leader did not seem to have changed his position at all.”\n\nRussia has continued to insist both before and after the call that agreements on its long-held and maximalist demands are a precondition for a possible temporary ceasefire.\n\nThat was underlined by the remarks of the Kremlin’s spokesperson, Dmitry Peskov, that there was “no timeline” for preparing a memorandum for future talks. “It’s clear that everyone wants to do this as quickly as possible, but of course the devil is in the details,” he told reporters after the call.\n\nOn Tuesday, Russia appeared to put up yet another hurdle, saying that having suggested working on a memorandum to end the war it was up to Ukraine to cooperate with the peace accord Moscow was proposing.\n\nAt a press briefing on Monday night, Zelenskyy confirmed reports from last week’s inconclusive talks in Istanbul between the two sides that Russia was demanding that Ukraine withdraw its forces from five regions, including territory not occupied by Russia.\n\n“It’s our land, we won’t withdraw our troops from our territory … it means that they don’t want peace … if they demand what they know we won’t agree to,” Zelenskyy said.\n\nThe inconclusive outcome of the call underlined growing concern among senior officials in Kyiv that the US has been consistently out-gamed by Putin with his clear vision of his objectives, not least since Trump took office.\n\nTrump’s failure to put pressure on Putin has confirmed the fears of officials in Kyiv that Trump is more interested in future business deals with Russia than using US influence to secure a quick ceasefire.\n\nWith the US at best semi-detached, Ukraine is focusing its efforts on persuading Europe to match its rhetoric against Moscow with more sanctions and military aid."
    },
    {
        "title": "Ukraine war latest: UK slaps 100 new sanctions on Russia; Trump says he has preferred location for peace talks",
        "description": "Donald Trump has again threatened to walk away from peace negotiations if Vladimir Putin shows no sign of wanting to end the Ukraine war. It comes after the US president had a two-hour phone call with the Russian leader yesterday. Follow the latest below.",
        "content": "UK slaps 100 new sanctions on Russia\nThe UK has slapped Russia with 100 new sanctions, targeting the country's military, energy and financial sectors.\nForeign secretary David Lammy labelled Vladimir Putin a \"warmonger\" as he pointed to Russia's strik... [1454 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-uk-slaps-100-new-sanctions-on-russia-trump-says-he-has-preferred-location-for-peace-talks-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "publishedAt": "2025-05-20T10:38:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Trump has brought Ukraine-Russia peace talks back to square one - just where Putin wants them",
        "description": "The Russian leader is a master manipulator. Until he is forced to face reality, there is no hope of ending the bloodshed, says the University of Toronto’s Olga Chyzh",
        "content": "After more than three years of stalled diplomacy, the past few days have brought a flurry of activity in the Russia-Ukraine peace process – sadly none of it with any meaningful progress. The much-anticipated Russia-Ukraine peace talks in Istanbul – b... [5657 chars]",
        "url": "https://www.theguardian.com/commentisfree/2025/may/20/russia-ukraine-peace-talks-vladimir-putin-volodymyr-zelenskyy-donald-trump",
        "image": "https://i.guim.co.uk/img/media/24afddb6b3b04a9189c72ef96450469e708e1b21/573_0_3854_3085/master/3854.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=7530fb31f486e09be44d33efd2cc66b5",
        "publishedAt": "2025-05-20T09:00:04Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "After more than three years of stalled diplomacy, the past few days have brought a flurry of activity in the Russia-Ukraine peace process – sadly none of it with any meaningful progress. The much-anticipated Russia-Ukraine peace talks in Istanbul – billed as the first serious negotiations since 2022 – came and went with little more than symbolic fanfare. The subsequent two-hour phone call between Donald Trump and Vladimir Putin on Monday concluded with Trump appearing to withdraw from mediating the peace talks altogether. Once again, the Russian president got what he wanted without even showing up to a meeting that he himself requested.\n\nTrump’s statement that “the conditions for [the peace] will be negotiated between the two parties, as it can only be” sounded like the opposite of his boast last year that only he could end this war, and in a single day at that. Even more jarring was Trump’s emphasis on the economic opportunities that Russia offers – tone-deaf, given the scale of Russian atrocities, and a slap in the face to the US’s European allies.\n\nIf Trump is indeed stepping back from his self-appointed role as mediator, as his press release suggested, that would be a welcome shift from his earlier efforts to force Ukraine into a deal on Russia’s terms. Any move away from that is a move in Ukraine’s favour. Ukraine can and should holds its own in negotiations with Russia.\n\nAt the same time, anybody hoping for successful direct Russia-Ukraine negotiations should temper their expectations. Putin has no interest in genuine negotiations, and likely never will. He has repeatedly refused to meet Zelenskyy – not because there’s no agenda, but because acknowledging Ukraine’s leader would mean recognising Ukraine’s sovereignty. In Putin’s imperial worldview, Ukraine isn’t a country and therefore cannot have a legitimate government. This from a man whose own political legitimacy is propped up by ballot stuffing and electoral spectacle rivalling the Bolshoi theatre.\n\nScholars of international conflict often describe war and negotiation as two sides of the same coin. War is, in essence, a costly information-gathering process. It reveals and establishes the ground truth – each side’s capabilities – which helps to identify the range of peace deals that both sides might prefer to continued fighting. The key to getting an upper hand in peace negotiations, therefore, is to use the battlefield to demonstrate your capacity to win, thereby compelling the other side to cut their losses and make concessions at the negotiating table.\n\nBut after three years of war, it is Russia – not Ukraine – that has been confronted by the limits of its power. The so-called “second most powerful army in the world” has failed to achieve its strategic objectives. Since January, Russia’s territorial advances have amounted a handful of fields and abandoned villages, totalling under 1,000 sq km. And its economy is crumbling under the weight of sanctions and mobilisation. After the failure of his original plan of “take Kyiv in three days”, Putin’s plan B appears to amount to speaking with confidence and hoping for luck.\n\nUkraine, by contrast, has proved to be stronger and more resilient than many expected. President Volodymyr Zelenskyy has forged an impressive international coalition. Ukraine successfully withstood Russia’s initial assault, recovered key territory and stabilised much of the frontline. Its performance on the battlefield has shifted perceptions of its strength and bolstered its negotiating position.\n\nYet Russia continues to cling to its maximalist demands of demilitarisation, sweeping territorial concessions and regime change. Putin refuses to revise his war aims in light of battlefield evidence. He continues to demand territories he is unable to take by force, as if he can make them his by simply claiming they are his. So, what is he doing?\n\nTo understand the Russian leader’s logic, we need to first understand the domestic political context in which he operates. Unlike a democratically elected leader, Putin faces no real checks from domestic institutions or the public. His only political constraint is the inner circle of elites who keep him in power – military and conservative figures with an imperialist worldview. To them, Ukraine is not just any territory to be divided in proportion to battlefield success. Rather, it is a coveted prize, central to restoring Russia’s lost greatness. Civilian casualties and economic pain are secondary concerns. Concessions, in this worldview, are not just unnecessary – they are unthinkable. As Russia’s chief negotiator in Istanbul, Vladimir Medinsky, told the Ukrainian delegation: “[Russia] fought with Sweden for 21 years.” The message is that Putin is prepared to wait.\n\nBut he’s hoping he won’t have to wait 21 years. The hope is to get lucky. Putin’s grievances have found fertile ground in Donald Trump and his inner circle. The Russian president is only too happy to lead them along, and they fall for the same trick again and again.\n\nThe media often portrays Putin as a master strategist, but that is not exactly right. His war strategy hasn’t evolved since the failed blitz on Kyiv. He demands the moon, then lashes out when it is not delivered. What he is, however, is a master manipulator. He believes that if he cannot take Ukrainian territory by force, he can secure it through narrative – by convincing sympathetic voices in the west that Russia deserves it anyway.\n\nFrom Crimea to the Minsk agreements, from Syria to Chechnya, Putin has built his legacy on making up facts on the ground and daring the world to challenge them. Why would he stop now?\n\nHe won’t – not until he can no longer afford the lead to make the bullets. But Ukraine has demonstrated that it can hold its own. If the goal is to stop the bloodshed, the only way forward is to force Russia to face reality rather than manufacturing its own."
    },
    {
        "title": "Zelenskyy urges more pressure on Russia after no ceasefire agreed in Trump-Putin call - Ukraine war live",
        "description": "Ukrainian president says ‘pressure on Russia will push it toward real peace’",
        "content": "Good morning and welcome to our blog covering developments in the Ukraine-Russia conflict following yesterday’s call between Donald Trump and Vladimir Putin.\nWhile the US leader described the conversation as “excellent”, the Kremlin refused to agree ... [1021 chars]",
        "url": "https://www.theguardian.com/world/live/2025/may/20/russia-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-war-news-live-updates",
        "image": "https://i.guim.co.uk/img/media/a8c3477fed1531311931770054e44f11d3ba4e6c/363_0_3794_3037/master/3794.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d69dbd9d0059bebe7ba8c7febcc6f11b",
        "publishedAt": "2025-05-20T07:28:06Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "From 3d ago 10.46 BST Zelenskyy says Russia is 'trying to buy time' to 'continue war' President Volodymyr Zelenskyy accused Russia of “trying to buy time” to “continue war”. “It is obvious that Russia is trying to buy time in order to continue its war and occupation,” Zelenskyy said in a post on social media on Tuesday, Agence France-Presse reports. Meanwhile, Reuters reported that Zelenskyy said Ukraine had no doubt the war must end at the negotiating table, but there must be clear and realistic proposals on the table, and called for more international sanctions pressure on Russia. He said he had spoken to Finnish President Alexander Stubb and that he would speak to more allies later on Tuesday. Share\n\n3d ago 15.47 BST Summary This blog is now closing. Here are a few of the day’s developments: President Volodymyr Zelenskyy accused Russia of “trying to buy time” to “continue war”, a day after US President Donald Trump discussed the war with Russian President Vladimir Putin in a two-hour phone call.\n\nThe European Union has adopted new sanctions against Russia over the war in Ukraine , focusing on Moscow’s “shadow fleet” of oil tankers, human rights violations and hybrid threats, the EU’s foreign policy chief Kaja Kallas said.\n\nThe UK government has announced 100 new sanctions on Russia across Russian military, energy, financial sectors and those conducting “Putin’s information war against Ukraine”.\n\nKaja Kallas called for the United States to take “strong action” against Russia if Moscow does not agree to a ceasefire in Ukraine .\n\nEuropean Commission President Ursula von der Leyen said that even though Europe has just adopted its 17th package of sanctions on Russia, an 18th package is being prepared with further “hard-hitting” measures, Reuters reports.\n\nRussian foreign ministry spokeswoman Maria Zakharova said on Tuesday that Ukraine needs to decide whether or not it will cooperate in discussing a memorandum ahead of a future peace accord that Moscow has proposed, Reuters reports.\n\nUkrainian foreign minister Andriy Sybiha has called on the Group of Seven advanced economies to reduce its price cap on Russian seaborne oil to $30 per barrel. The current G7 price cap is $60 per barrel.\n\nGermany is still counting on the US to pile more pressure on Russia for an immediate ceasefire in its war on Ukraine , Berlin said.“We have repeatedly made it clear that we expect one thing from Russia - an immediate ceasefire without preconditions,” German foreign minister Johann Wadephul said.\n\nGerman defence minister Boris Pistorius has accused President Vladimir Putin of not really being interested in peace in Ukraine , saying the Russian leader was only “playing for time” in talks with the United States .\n\nRussia has accused Nato of carrying out what it called aggressive actions in the Baltic Sea that impeded the freedom of shipping after Estonia tried and failed to seize a tanker.\n\nAt least one civilian has been killed and 13 injured in Russian attacks across Ukrainian regions over the past day, regional authorities reported.\n\nRussia has lost 975,800 troops in Ukraine since the beginning of its full-scale invasion on 24 February 2022, the General Staff of Ukraine’s Armed Forces reported on 20 May. This number includes 1,030 Russian casualties over the past day.\n\nUkraine’s military said it has launched another investigation into the “Anne of Kyiv” brigade, trained in France , after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reports.\n\nChina said it backs “direct dialogue” between Russia and Ukraine, after US President Donald Trump announced the two would “immediately” start peace talks after he spoke with Vladimir Putin. Share\n\n3d ago 15.08 BST Volodymyr Zelenskyy has posted on X thanking Ursula von der Leyen and “the entire EU” for the 17th sanctions package, calling it a “step in the right direction”. Zelenskyy added: It is important to impose tough restrictions on Russia’s tanker fleet, which serves to finance killings, as well as on all the schemes Russia uses to build up its military industry. The more pressure there is on Russia, the more incentives Moscow will have to move toward genuine peace. Ursula and I also discussed preparations for the EU’s 18th sanctions package. Russian oil, energy trade infrastructure, banks, and financial schemes — these are the areas that hurt Russia the most, and therefore contribute the most to peace. I thank everyone who advocates for tougher sanctions and makes strong decisions. We also discussed in detail yesterday’s conversation with President Trump and our joint diplomatic work with partners. Europe must be on board, and we are coordinating every step as closely as possible. Share\n\n3d ago 15.05 BST EU's von der Leyen: further 'hard-hitting' sanctions on Russia being prepared European Commission President Ursula von der Leyen said that even though Europe has just adopted its 17th package of sanctions on Russia, an 18th package is being prepared with further “hard-hitting” measures, Reuters reports. After a phone call with President Volodymyr Zelenskyy, she posted on X: It’s time to intensify the pressure on Russia to bring about the ceasefire. Share\n\n3d ago 14.46 BST Ukraine’s military said it has launched another investigation into the scandal-hit “Anne of Kyiv” brigade, trained in France, after a media report alleged financial misconduct among some commanders, Agence France-Presse (AFP) reports. The unit - officially Ukraine’s 155th Mechanised Brigade - was supposed to be a flagship fighting force for Ukraine’s army, announced by French President Emmanuel Macron as a symbol of tight cooperation between Kyiv and Paris. But it has been plagued by scandals, including reports of equipment shortages, low morale and soldiers abandoning the unit en masse while undergoing training in France. A spokesperson for Ukraine’s land forces confirmed on Tuesday to AFP that a fresh investigation had been launched into the unit, but declined to elaborate further. Share\n\n3d ago 14.22 BST Russia accuses Nato of 'aggressive actions' in Baltic Sea after Estonia tries to seize tanker Russia has accused Nato of carrying out what it called aggressive actions in the Baltic Sea that impeded the freedom of shipping after Estonia tried and failed to seize a tanker. Estonia said on Thursday last week that Moscow had briefly sent a fighter jet into Nato airspace over the Baltic Sea during an attempt to stop a Russian-bound oil tanker thought to be part of a “shadow fleet” defying Western sanctions on Moscow. Reuters reports that when asked about the matter at her weekly news briefing, foreign ministry spokeswoman Maria Zakharova said Moscow was closely monitoring events in the Baltic and would react to what she called illegal actions by Nato vessels if they caused risks. Share\n\n3d ago 14.12 BST Kate Connolly Three German-Russian dual citizens have gone on trial in Munich accused of spying on behalf of the Kremlin and planning attacks on critical military infrastructure and industry. The alleged spies are said to have found codewords for military goods and gathered confidential information about an oil refinery in Bavaria and a US military training area near the town of Grafenwöhr in the east of the state. The men are also said to have made plans to carry out bomb attacks on buildings and infrastructure used to support Ukraine. View image in fullscreen The suspected ringleader, Dieter S, is escorted by police at the court in Munich. Photograph: Angelika Warmuth/Reuters The suspected ringleader, identified only as Dieter S in line with German privacy rules, is accused of coordinating a plot with the specific aim of undermining Germany’s support for Ukraine through acts of sabotage. He is on trial alongside Alexander J and Alex D, who are suspected of having supported his actions working at the behest of a foreign intelligence service. The trio were arrested in April 2024 by Bavarian police close to the town of Bayreuth. You can read the full report here: Three men on trial in Germany accused of Russian sabotage plot Read more Share\n\n3d ago 14.05 BST Ukrainian foreign minister Andriy Sybiha has called on the Group of Seven advanced economies to reduce its price cap on Russian seaborne oil to $30 per barrel. The current G7 price cap is $60 per barrel. “The oil price cap, from our point of view, our position, (the) reasonable price cap (is) 30 dollars,” Sybiha, who was speaking in English, told reporters in Brussels, Reuters reports. Share\n\n3d ago 13.53 BST Germany is still counting on the US to pile more pressure on Russia for an immediate ceasefire in its war on Ukraine, Berlin said on Tuesday. “We have repeatedly made it clear that we expect one thing from Russia - an immediate ceasefire without preconditions,” German foreign minister Johann Wadephul said on the sidelines of a meeting with his EU counterparts in Brussels. “It is sobering to see that Russia has not taken this step, and we will have to react. We also expect our US allies not to tolerate this.” He added that there was a lot of readiness both in the European Union and in the United States to consider more sanctions on Moscow, but did not give any details regarding what additional sanctions might look like, Reuters reports. Share\n\n3d ago 13.10 BST Here’s a little more detail from Reuters on Zakharova’s comments. Putin, after a call with President Donald Trump, has previously said Moscow was ready to work with Ukraine on a memorandum about a future peace accord, and that efforts to end the war in Ukraine were on the right track. Putin said discussions would include the principles of a settlement and the timing and definitions of a possible ceasefire – including its timeframe. On Tuesday, Zakharova tells reporters she hopes Ukraine takes what she calls a constructive position in relation to possible talks for the sake of its own “self-preservation”. She adds: Now, accordingly, the ball is in Kyiv’s court. On newly announced European Union sanctions, Zakharova says Russia will never bow to ultimatums from anyone, claiming it’s clear Europe wanted to rearm Ukraine to continue the war. Share\n\n3d ago 12.52 BST Russian foreign ministry spokeswoman Maria Zakharova says Ukraine needs to decide whether or not it will cooperate in discussing a memorandum ahead of a future peace accord Moscow has proposed, Reuters reports. In her weekly briefing, Zakharova claims Ukraine’s European allies have sought, but failed, to prevent the resumption of direct dialogue with Russia. Referring to the latest EU sanctions announcement, Zakharova says Russia “never responds to ultimatums”. Share"
    },
    {
        "title": "Ukraine war briefing: Europe proceeds with Russia sanctions after Trump-Putin talk",
        "description": "Russian president wants ‘memorandum on a possible future peace accord’ with Kyiv; Zelenskyy rejects surrendering land by pulling back troops. What we know on day 1,182",
        "content": "European leaders have agreed to increase pressure on Russia through further sanctions after Donald Trump briefed them on his call with Vladimir Putin, the German chancellor, Friedrich Merz, said late on Monday. “Europe will increase the pressure on M... [2218 chars]",
        "url": "https://www.theguardian.com/world/2025/may/20/ukraine-war-briefing-europe-proceeds-with-russia-sanctions-after-trump-putin-talk",
        "image": "https://i.guim.co.uk/img/media/9428fe40cfa71e3cda710dbc081ac5730b069ee3/0_0_6880_5504/master/6880.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b9944fb2c0c53e599d4a6a6d935c4620",
        "publishedAt": "2025-05-20T00:30:28Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "European leaders have agreed to increase pressure on Russia through further sanctions after Donald Trump briefed them on his call with Vladimir Putin, the German chancellor, Friedrich Merz, said late on Monday. “Europe will increase the pressure on Moscow through sanctions. This is what we agreed upon with [Trump] after his conversation with Putin,” Merz posted on X, saying “Europe and America are very united on this”. After speaking with Putin, Trump held calls with the leaders of the European Union, France, Italy, Germany and Finland.\n\nUkraine’s president, Volodymyr Zelenskyy, said Kyiv and its partners were considering arranging a high-level meeting between Ukraine, Russia, the US, EU countries and Britain. The Ukrainian leader said he hoped the meeting could happen as soon as possible and that it could be hosted by Turkey, the Vatican or Switzerland.\n\nZelensky said US sanctions on Russia had the power to “determine” Moscow’s ability to continue its invasion. “The European package will be there, and it will be strong,” Zelenskyy said. “As for the United States package, that is a different story. Here, we all need to work hard with the United States of America so that at some point, when they are able to, they will impose appropriate sanctions.” Last week, Merz said new sanctions against Russia would be adopted in Brussels on Tuesday 20 May. Trump said on Monday that he would not impose further sanctions on Russia – “I think there’s a chance of getting something done, and if you do that, you could also make it much worse.”\n\nTrump claimed after his Putin call that Russia and Ukraine will immediately start ceasefire negotiations but did not appear to have secured major concessions. The Kremlin said Putin and Trump had not discussed a timeline for a ceasefire but that Trump had stressed his interest in reaching agreements quickly.\n\nPutin said after the call that Russia was ready to work toward ending the fighting, starting with Ukraine and Russia setting out a “memorandum on a possible future peace accord”. The Russian leader said Istanbul talks last week between Moscow and Kyiv put the world on the “right path” towards ending the conflict – which began with Moscow’s full-scale 2022 offensive.\n\nEuropean and US leaders welcomed Pope Leo XIV’s readiness to host Russia-Ukraine talks at the Vatican, said the Italian prime minister, Giorgia Meloni. “Italy is ready to do its part to facilitate contacts and work for peace,” Meloni added."
    },
    {
        "title": "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump",
        "description": "The US president spoke to his Russian and Ukrainian counterparts on Monday as part of a bid to push Moscow and Kyiv towards agreeing a ceasefire.",
        "content": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.\nAfter a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussi... [6329 chars]",
        "url": "https://news.sky.com/story/good-chance-of-russia-ukraine-peace-but-us-has-a-red-line-in-talks-says-donald-trump-13371047",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-trump-donald_6921898.jpg?20250519224130",
        "publishedAt": "2025-05-19T22:39:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.\n\nAfter a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\".\n\nIt is unclear how these will differ from negotiations that already started in Turkey last Friday.\n\nSpeaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is.\n\nThere are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\"\n\nThe US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\"\n\nHe said of the Russian president: \"I do believe he wants to end [the war].\"\n\n\"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added.\n\nThe US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war.\n\nIn a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\".\n\nMr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree.\n\n\"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited.\"\n\nUkraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said.\n\nThe Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added. He signed off his post with: \"Let the process begin!\"\n\nA Russia-Ukraine ceasefire is the one deal Trump can't seem to seal James Matthews US correspondent @jamesmatthewsky For the war that Donald Trump said he'd solve in a day, read the war he couldn't solve at all. By posting on Truth Social that an end to the Russia-Ukraine conflict will be negotiated between the two parties, the US president puts distance between himself and the deal he couldn't seal. The United States appears to be taking a step back from its stewardship of negotiations, as it leaves both sides to it. The broker broken? For Trump, certainly, this has been a most intractable negotiation that he has never looked like closing. He mentions \"ceasefire\" in his social media post only as a discussion for Russia and Ukraine, not as the call he made for an unconditional cessation of hostilities. There's no mention of the frustrations he once threatened at intensive Russian bombing, or of the sanctions he once threatened against Moscow. Far from it, he speaks of \"large-scale trade with the United States when this bloodbath is over\". He adds that Ukraine can be a trade beneficiary from the country's rebuilding. In Kyiv and allied European capitals, they were looking for strong-armed support from Washington. European leaders had called Trump the day before he spoke to Putin to discuss sanctions and to reinforce their need for US support in steering the Russian leader towards serious engagement. They will be making further calls to the White House to clarify where they stand now, for fear they stand alone. Ukraine was never a pet project of Donald Trump. In his ambitions to reshape the world order, restored relations with Russia has always been a prize as he eyes China as adversary-in-chief. In the bigger picture, Ukraine has always been a small feature. It shows.\n\nMr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported.\n\n\"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said.\n\nDiscussions are 'positive,' says Zelenskyy\n\nThe US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders.\n\nAt a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\".\n\nImage: Volodymyr Zelenskyy speaks to reporters after his own call with Mr Trump. Pic: Reuters\n\n\"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued. \"I don't yet have an answer to that question.\"\n\nKyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\".\n\nHe continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland. We are currently considering these three venues, as all three countries - all three venues - are neutral.\"\n\nEuropean leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce. The Russian president has resisted that, insisting that conditions be met first.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nThe Trump-Putin call came as Russia has continued to target Ukraine with attacks.\n\nMoscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA.\n\nRead more:\n\nRussia bans Amnesty International\n\nUkraine-Russia talks revealed stark reality - analysis\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nRussia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region.\n\nRIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.\n\nPlease use Chrome browser for a more accessible video player 4:33 Russia launches war's largest drone attack\n\nUkraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured.\n\nOn Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
    },
    {
        "title": "Ukraine war latest: US will walk away from Ukraine talks if Putin does not want peace - Trump",
        "description": "Volodymyr Zelenskyy says a high-level meeting between Ukraine, Russia, the US and EU countries could be hosted by Turkey, the Vatican or Switzerland. Follow the latest below and catch up with our last Ukraine Q&A.",
        "content": "Trump says he'll pull out of peace talks if Putin doesn't want to end war\nDonald Trump denies the US is taking a step back from peace talks, minutes before threatening to do so.\nAsked if his suggestion that the talks could take place at the Vatican m... [1134 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-us-will-walk-away-from-ukraine-talks-if-putin-does-not-want-peace-trump-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-trump-washington_6921686.jpg?20250519190410",
        "publishedAt": "2025-05-19T22:10:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Ukraine war latest: Zelenskyy pitches 'high-level' meeting between UK, Russia, Ukraine, US and Europe",
        "description": "Volodymyr Zelenskyy says a high-level meeting between Ukraine, Russia, the US and EU countries could be hosted by Turkey, the Vatican or Switzerland. Follow the latest below and catch up with our last Ukraine Q&A.",
        "content": "Europe must step in as US abandons role in stopping war, says former Russian PM\nEuropean leaders need to step in to lead efforts to stop the war as the US appears to abandon its role, says former prime minister of Russia Mikhail Kasyanov.\n\"Trump has ... [892 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-zelenskyy-pitches-high-level-meeting-between-uk-russia-ukraine-us-and-europe-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-zelenskyy-ukraine_6921803.jpg?20250519204716",
        "publishedAt": "2025-05-19T20:40:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Unlimited potential in US-Russia trade, says Trump after two-hour Putin call",
        "description": "Donald Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\". It is unclear how this differs from negotiations that already began in Turkey on Friday.",
        "content": "Donald Trump has said there is \"unlimited\" potential in US-Russia trade after holding a two-hour call with Vladimir Putin.\nThe US president spoke to his Russian counterpart on Monday as part of a bid to push Russia and Ukraine towards agreeing a truc... [2275 chars]",
        "url": "https://news.sky.com/story/unlimited-potential-in-us-russia-trade-says-trump-after-two-hour-putin-call-13371047",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-trump-washington_6921686.jpg?20250519190410",
        "publishedAt": "2025-05-19T19:04:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.\n\nAfter a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\".\n\nIt is unclear how these will differ from negotiations that already started in Turkey last Friday.\n\nSpeaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is.\n\nThere are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\"\n\nThe US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\"\n\nHe said of the Russian president: \"I do believe he wants to end [the war].\"\n\n\"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added.\n\nThe US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war.\n\nIn a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\".\n\nMr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree.\n\n\"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited.\"\n\nUkraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said.\n\nThe Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added. He signed off his post with: \"Let the process begin!\"\n\nA Russia-Ukraine ceasefire is the one deal Trump can't seem to seal James Matthews US correspondent @jamesmatthewsky For the war that Donald Trump said he'd solve in a day, read the war he couldn't solve at all. By posting on Truth Social that an end to the Russia-Ukraine conflict will be negotiated between the two parties, the US president puts distance between himself and the deal he couldn't seal. The United States appears to be taking a step back from its stewardship of negotiations, as it leaves both sides to it. The broker broken? For Trump, certainly, this has been a most intractable negotiation that he has never looked like closing. He mentions \"ceasefire\" in his social media post only as a discussion for Russia and Ukraine, not as the call he made for an unconditional cessation of hostilities. There's no mention of the frustrations he once threatened at intensive Russian bombing, or of the sanctions he once threatened against Moscow. Far from it, he speaks of \"large-scale trade with the United States when this bloodbath is over\". He adds that Ukraine can be a trade beneficiary from the country's rebuilding. In Kyiv and allied European capitals, they were looking for strong-armed support from Washington. European leaders had called Trump the day before he spoke to Putin to discuss sanctions and to reinforce their need for US support in steering the Russian leader towards serious engagement. They will be making further calls to the White House to clarify where they stand now, for fear they stand alone. Ukraine was never a pet project of Donald Trump. In his ambitions to reshape the world order, restored relations with Russia has always been a prize as he eyes China as adversary-in-chief. In the bigger picture, Ukraine has always been a small feature. It shows.\n\nMr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported.\n\n\"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said.\n\nDiscussions are 'positive,' says Zelenskyy\n\nThe US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders.\n\nAt a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\".\n\nImage: Volodymyr Zelenskyy speaks to reporters after his own call with Mr Trump. Pic: Reuters\n\n\"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued. \"I don't yet have an answer to that question.\"\n\nKyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\".\n\nHe continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland. We are currently considering these three venues, as all three countries - all three venues - are neutral.\"\n\nEuropean leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce. The Russian president has resisted that, insisting that conditions be met first.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nThe Trump-Putin call came as Russia has continued to target Ukraine with attacks.\n\nMoscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA.\n\nRead more:\n\nRussia bans Amnesty International\n\nUkraine-Russia talks revealed stark reality - analysis\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nRussia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region.\n\nRIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.\n\nPlease use Chrome browser for a more accessible video player 4:33 Russia launches war's largest drone attack\n\nUkraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured.\n\nOn Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
    },
    {
        "title": "Ukraine war latest: Trump says Ukraine and Russia will start ceasefire talks after two-hour Putin call",
        "description": "Donald Trump and Vladimir Putin spoke for more than two hours in a call that Putin called \"informative, frank and very useful\", RIA Novosti reports. Follow the latest below and catch up with our last Ukraine Q&A.",
        "content": "Analysis: Putin just sitting tight, waiting for Trump to walk away\nIt is difficult to read the outcome of the Putin-Trump call as anything other than failure on Donald Trump's part, says US correspondent James Matthews.\n\"How can this be spun by Donal... [1315 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-trump-says-ukraine-and-russia-will-start-ceasefire-talks-after-two-hour-putin-call-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-putin-trump_6921632.jpg?20250519175843",
        "publishedAt": "2025-05-19T18:53:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Ukraine war latest: Trump says Ukraine and Russia will start ceasefire talks after two-hour Putin call",
        "description": "Donald Trump and Vladimir Putin spoke for more than two hours in a call that Putin called \"informative, frank and very useful\", RIA Novosti reports. Follow the latest below and catch up with our last Ukraine Q&A.",
        "content": "Analysis: Putin just sitting tight, waiting for Trump to walk away\nIt is difficult to read the outcome of the Putin-Trump call as anything other than failure on Donald Trump's part, says US correspondent James Matthews.\n\"How can this be spun by Donal... [1315 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-trump-says-two-hour-call-with-putin-was-excellent-as-he-talks-up-trade-with-russia-after-war-concludes-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-putin-trump_6921632.jpg?20250519175843",
        "publishedAt": "2025-05-19T18:23:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Amnesty International vows to continue its work after Russia ban",
        "description": "Rights group declared ‘undesirable organisation’ amid Kremlin crackdown on critics, journalists and activists",
        "content": "Amnesty International has said it will not halt its work after Russia declared the rights group an “undesirable organisation”, in effect banning its operations in the country and exposing supporters to prosecution.\n“This decision is part of the Russi... [2789 chars]",
        "url": "https://www.theguardian.com/world/2025/may/19/amnesty-international-vows-to-continue-its-work-after-russia-ban",
        "image": "https://i.guim.co.uk/img/media/809d8d2d2b2b49ba0ee17ef5b73b80d868b198fa/843_0_6097_4878/master/6097.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bc152845a013ac6470b7017878b0b3a",
        "publishedAt": "2025-05-19T18:11:45Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Amnesty International has said it will not halt its work after Russia declared the rights group an “undesirable organisation”, in effect banning its operations in the country and exposing supporters to prosecution.\n\n“This decision is part of the Russian government’s broader effort to silence dissent and isolate civil society,” Agnès Callamard, Amnesty International’s secretary general, said. “We will redouble our efforts to expose Russia’s egregious human rights violations both at home and abroad.”\n\nThe decision by the Russian prosecutor general’s office, announced in an online statement on Monday, is the latest act in the unrelenting crackdown on Kremlin critics, journalists and activists that has intensified to unprecedented levels since Russia invaded Ukraine in February 2022.\n\nThe designation means Amnesty must stop any work in Russia. It subjects those who cooperate with the rights group or support it to prosecution, including if anyone shares Amnesty’s reports on social media.\n\nRussia’s list of “undesirable organisations” covers 223 entities, including prominent independent news outlets and rights groups. Among them: Radio Free Europe/Radio Liberty and the independent Russian news outlet Meduza; thinktanks including Chatham House; the anti-corruption group Transparency International; and Open Russia, an opposition group founded by the exiled tycoon and Kremlin critic Mikhail Khodorkovsky.\n\nAmnesty International was launched in 1961, documenting and reporting human rights violations around the world and campaigning for the release of those it deems unjustly imprisoned. It has released reports on Russia’s war in Ukraine, accusing Moscow of crimes against humanity, and has spoken out against the Kremlin’s crackdown on dissent that has swept up thousands of people in recent years.\n\nAmnesty’s recent statements on Russia included decrying a prison sentence handed to the prominent election monitoring activist Grigory Melkonyants as a “brazen and politically motivated clampdown on peaceful activism”. It also spoke out against a series of arrests of publishing professionals in Russia last week over alleged “LGBTQ+ propaganda” in books.\n\nIn its statement, the prosecutor general’s office accused Amnesty International of running “Russophobic projects” and activities aimed at Russia’s “political and economic isolation”.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAgence France-Presse and Associated Press contributed to this report"
    },
    {
        "title": "Ukraine war latest: Why full ceasefire is unlikely after Trump-Putin call - but Russia could give something",
        "description": "Donald Trump will call Vladimir Putin this afternoon. Ivor Bennett, our Moscow correspondent, explains the Kremlin's likely approach. Russia has also banned an international charity. Follow the latest below.",
        "content": "Explained: The Russian law that could now jail citizens just for sharing Amnesty reports\nRussian authorities have outlawed human rights group Amnesty International as an \"undesirable organisation\" (see 11.24).\nThat decision, announced by the Russian ... [1420 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-why-full-ceasefire-is-unlikely-after-trump-putin-call-but-russia-could-give-something-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-call_6921172.jpg?20250519063027",
        "publishedAt": "2025-05-19T12:45:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Romania election: EU breathes sigh of relief after Dan defeats far-right, pro-Russia rival",
        "description": "Nicuşor Dan begins process of forming a government after beating George Simion, an ultranationalist who wants to halt Ukraine support",
        "content": "The centrist mayor of Bucharest, Nicuşor Dan, has begun sounding out Romania’s political parties over forming a new majority government after winning the country’s presidential election in a surprise result greeted with relief across the EU.\nWith all... [5494 chars]",
        "url": "https://www.theguardian.com/world/2025/may/19/romania-election-eu-relief-nicusor-dan-defeats-far-right-pro-russia-rival-george-simion",
        "image": "https://i.guim.co.uk/img/media/309d9b0bdfa8212e86ce50e15d454efb565ab5a1/1131_840_3547_2839/master/3547.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=39173248ff1388a6a2e99303debe3574",
        "publishedAt": "2025-05-19T11:36:22Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The centrist mayor of Bucharest, Nicuşor Dan, has begun sounding out Romania’s political parties over forming a new majority government after winning the country’s presidential election in a surprise result greeted with relief across the EU.\n\nWith all votes counted on Monday morning, Dan, who had described the second round vote as a battle between “a pro-western and an anti-western Romania”, scored 53.6%, official figures showed, against 46.4% for his far-right rival George Simion.\n\nDan, 55, a quietly-spoken mathematician who has been the capital’s independent mayor since 2020, came from behind to win after losing heavily to Simion, a brash, EU-critical Trump admirer who had wanted to halt aid to Ukraine, in the first round.\n\nAt nearly 65%, turnout was the highest in a Romanian election for a quarter of a century, reflecting the importance of a vote with huge consequences for the country’s strategic alignment and economic prospects, as well as for EU unity.\n\nStaunchly pro-EU and pro-Nato, Dan had campaigned on a pledge to fight corruption, maintain support for neighbouring Ukraine – where Romania has played an important logistical role – and keep the country firmly within the western mainstream.\n\n“It’s a victory of thousands and thousands of people who … believe that Romania can change in the right direction,” he told his supporters after the outcome became clear, while calling for “hope and patience” as the country faced “a difficult period ahead”.\n\nView image in fullscreen Presidential candidate George Simion, a brash, EU-critical Trump admirer who had wanted to halt aid to Ukraine. Photograph: Robert Ghement/EPA\n\nSimion, a former soccer ultra and ultranationalist agitator, at first refused to concede, claiming on social media on Sunday: “I am the new president of Romania.” But he later acknowledged Dan “won the election, and this was the will of the Romanian people”.\n\nThe far-right candidate vowed, however, to “continue the fight for freedom and our great values along with other patriots, sovereignists and conservatives all over the world. We may have lost a battle, but we will certainly not lose the war.”\n\nEU leaders congratulated Dan. The European Commission’s president, Ursula von der Leyen, said the result would help “a strong Europe”, while the European Council president, António Costa, called it “a strong signal of Romanians’ attachment to the European project”.\n\nThe French president, Emmanuel Macron, said Romania had “chosen democracy, the rule of law, and the European Union”. Ukraine’s leader, Volodymyr Zelenskyy, also congratulated Dan, saying it was “important to have Romania as a reliable partner”.\n\nThe result deprives Hungary’s illiberal leader, Viktor Orbán, the EU’s disrupter-in-chief, and Slovakia’s Robert Fico – both of whom oppose military aid for Ukraine – of a new ally in key decisions on the war, energy, EU enlargement and the bloc’s budget.\n\nThe election came nearly six months after an initial vote was annulled amid evidence of campaign finance irregularities and a “massive” Russian interference campaign in favour of its far-right winner, Călin Georgescu, who was banned from standing again.\n\nSimion had said that if he won he would nominate the Moscow-friendly Georgescu, who is under investigation on six counts including misreporting campaign spending, illegal use of digital technology and promoting fascist groups, as prime minister.\n\nCristian Preda, a professor of politics at the University of Bucharest, said the result reflected voters’ concern that “for the first time in Romania’s electoral history, we had a potential president who was openly supported by Moscow”.\n\nPreda said a clear majority of about 60% of voters were deeply disillusioned with Romania’s mainstream centre-left Socials Democrats (PSD) and centre-right Liberals (PNL) – but that a similar proportion were also solidly pro-European and anti-Russian.\n\n“Voters were faced with a choice between the positions of the Kremlin, and those of Brussels,” he said. “Dan was pro-western and represented neither of the big parties, in an election in which security was key. For me, the result was never really in doubt.”\n\n2:44 Nicuşor Dan set to win in Romania as Europe votes in ‘Super Sunday’ of elections – video\n\nDan faces a daunting in-tray and a tough challenge finding a prime minister to form a majority in parliament to reduce Romania’s budget deficit – the largest in the EU – as well as to reassure investors and markets spooked by a possible Simion win.\n\nRomanian presidents have a semi-executive role, with considerable powers over foreign policy, national security, defence spending and judicial appointments, and can also dissolve parliament if MPs reject two prime ministerial nominations.\n\nSimion’s victory in the 4 May first round triggered the collapse of Romania’s PSD-PNL ruling coalition. Local media suggested Dan would first seek to form a new majority with the two main parties and a prime minister from his Save Romania Union (USR).\n\nFailing that, he may work towards a minority coalition with the Liberals, with a confidence-and-supply arrangement with the Social Democrats. He has ruled out any cooperation with Simion’s AUR party, the second largest in parliament.\n\nThe voting in Romania took place on the same day as the first round of a Polish election in which a liberal frontrunner, Rafał Trzaskowski, edged ahead of Karol Nawrocki, who was backed by the opposition nationalist Law and Justice (PiS) party.\n\n\n\nTrzaskowski did worse than expected, with final results showing he scored 31.36% to Nawrocki’s 29.54%. Since Polish presidents can veto laws passed by parliament, the 1 June runoff will determine prime minister Donald Tusk’s ability to push through his reformist, pro-EU agenda."
    },
    {
        "title": "Ukraine war latest: Trump to call Putin later; Russia declares charity an 'undesirable organisation'",
        "description": "In his latest attempt to edge towards a ceasefire, Donald Trump will call Vladimir Putin and Volodymyr Zelenskyy today. He's hopeful of a productive day, but there are fears in Kyiv over what the outcome could be. Follow the latest below.",
        "content": "Russia claims two more villages in Ukraine\nRussia has claimed its forces have taken two villages in Ukraine, according to state news agency RIA.\nThe Russian outlet cites the defence ministry, which names the village of Novoolenivka in the eastern Don... [286 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-trump-to-call-putin-later-russia-declares-charity-an-undesirable-organisation-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-donald-trump-call_6921172.jpg?20250519063027",
        "publishedAt": "2025-05-19T10:54:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Trump to speak to Putin and Zelenskyy about Ukraine ceasefire - US politics live",
        "description": "Unclear what US president can achieve after direct talks between Russia and Ukraine ended without conclusion",
        "content": "2m ago 06.25 EDT Michael Sainato Donald Trump’s bid to gut the top US consumer watchdog has left the agency unable to protect consumers amid mounting fears of recession, according to workers. For months the Trump administration has pushed to dismantl... [4353 chars]",
        "url": "https://www.theguardian.com/us-news/live/2025/may/19/donald-trump-vladimir-putin-volodymyr-zelenskyy-ukraine-russia-us-politics-news-live",
        "image": "https://i.guim.co.uk/img/media/53222104208cb23e00d8a7b1dd152244c4998b9b/173_0_2500_2000/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=aafb5ad0eb08d8b48a20af2c025ebcf9",
        "publishedAt": "2025-05-19T10:25:44Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "From 4d ago 23.14 BST At least 50 migrants sent to El Salvador prison entered US legally, report finds At least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank. The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found. “The government calls them all ‘illegal aliens.’ But of the 90 cases where the method of crossing is known, 50 men report that they came legally to the United States, with advanced US government permission, at an official border crossing point,” Cato said in its report. This number aligns with broader trends among Venezuelan migrants, many of whom entered the country either as refugees or through a Biden-era parole program that granted two-year work permits to those with US-based sponsors. “The proportion isn’t what matters the most: the astounding absolute numbers are,” reads the report. “Dozens of legal immigrants were stripped of their status and imprisoned in El Salvador.” Cato’s analysis goes against the Trump administration’s justification for sending the men to El Salvador, saying that only undocumented immigrants were deported. The report says that 21 men were admitted after presenting themselves at a port of entry, 24 were granted parole, four were resettled as refugees, and one entered the US on a tourist visa. Police officers stand guard at the Terrorism Confinement Center prison during a media tour, in Tecoluca, El Salvador. To date, the Trump administration has not released complete records for the more than 200 Venezuelans transferred to El Salvador. Cato’s review includes information for 174 men whose cases have some degree of public documentation. The Trump administration has accused many of the deported Venezuelan men of gang involvement, but in many cases, those claims appear to hinge largely on their tattoos. Many of the tattoos cited as evidence have no connection to gang activity. The markings reflect, in many cases, personal or cultural references. Cato uses the example of Andry José Hernández Romero, a makeup artist, who has crown tattoos on his arms that reference the Three Kings Day celebrations in his Venezuelan hometown. Share Updated at 23.34 BST\n\n3d ago 02.37 BST Closing summary The time has come to end another day chronicling the second Trump administration. The blog will be closing now, but will revive on Tuesday morning. Here are a few of the day’s developments: Donald Trump said he didn’t think Pope Leo XIV’s involvement in Russia-Ukraine peace talks meant the US would play a smaller role. He liked the idea of holding negotiations at the Vatican. “I think it would be great to have it at the Vatican,” Trump said. “Maybe it would have some extra significance … I think it would be maybe helpful. There’s tremendous bitterness, anger, and I think maybe that could help with some of that anger. So having it in the Vatican would be – in Rome – would be a great, I think it’d be great idea.”\n\nAt least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank. The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found.\n\nSenate Democratic leader Chuck Schumer introduced new legislation that would ban the US from using a foreign plane as Air Force One. Schumer is introducing the bill in an effort to prevent Trump from accepting a new $400m plane from Qatar.\n\nTrump signed the Take It Down Act into law, making it a federal crime to “knowingly publish” or threaten to publish intimate images without a person’s consent, including AI-created “deepfakes”. The bipartisan legislation – supported by first lady Melania Trump – passed the Senate in February and cleared the House last month.\n\nVladimir Putin and Donald Trump have held a rare phone call, which the US leader described as “excellent”, but the Kremlin refused to agree to a ceasefire in the war with Ukraine, despite pressure from Washington and European allies. The Russian leader declined to support the US-proposed 30-day unconditional ceasefire, which Ukraine had already agreed to – and which Washington had framed as the call’s primary objective. Putin also suggested his country’s maximalist objectives in the war with Ukraine were unchanged.\n\nA federal judge in Washington ruled that the Trump administration illegally ousted leaders of the US Institute of Peace, calling the effort a “gross usurpation of power”. In her decision, US district judge Beryl Howell said Trump overstepped his power when his administration removed five board members without cause from the non-profit organization, which is funded by the Congress.\n\nThe supreme court allowed the Trump administration to strip about 350,000 Venezuelans living in the US of a temporary protected status given under Joe Biden. The court granted the justice department’s request to lift San Francisco-based US district judge Edward Chen’s order that had halted homeland security secretary Kristi Noem’s decision to terminate the deportation protection conferred to Venezuelans under the temporary protected status, or TPS, program.\n\nWendy McMahon, the president and CEO of CBS News, will step down from her position due to the company and her have differing views on the path forward. McMahon, president and CEO of Paramount Global-owned CBS News and Stations and CBS Media Ventures since 2023, said in a memo: “It’s become clear that the company and I do not agree on the path forward. It’s time for me to move on and for this organization to move forward with new leadership.” Her decision to step down comes during an ongoing legal battle between CBS and Trump after the president filed a lawsuit concerning an interview the show did with Kamala Harris during the presidential campaign.\n\nLawyers for a Guatemalan man who says he was deported to Mexico despite his fears he would be persecuted there have asked a judge to order the Trump administration to immediately facilitate his return after immigration officials acknowledged making a mistake in his case.\n\nJoe Biden made his first public remarks this morning about his cancer diagnosis, an aggressive form of prostate cancer that has spread to his bones. The former president, 82, wrote on social media: “Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places. Thank you for lifting us up with love and support.” Biden and his family are reviewing treatment options. The cancer appears to be hormone sensitive, allowing for effective treatment, according to his office.\n\nJD Vance considered traveling to Israel tomorrow but opted not to due to the expansion of Israel’s military operation in Gaza. While the US vice-president cited “logistical” reasons for canceling the trip, a US official suggested to Axios that he actually canceled so as to avoid any suggestion that the White House endorsed Israel’s expanding ground operations in Gaza at a time when the US is pushing for a ceasefire and hostage deal. Share Updated at 02.40 BST\n\n3d ago 02.25 BST The Senate has confirmed Charles Kushner, the father of Donald Trump’s son-in-law Jared Kushner, to serve as ambassador to France. The real estate developer Charles Kushner was pardoned by Trump in December 2020 after pleading guilty years earlier to tax evasion and making illegal campaign donations. Prosecutors alleged that he hatched a scheme for revenge and intimidation after discovering his brother-in-law was cooperating with federal authorities in an investigation, hiring a prostitute and arranging to have the encounter recorded with a hidden camera and sent to his own sister, the man’s wife. Charles Kushner will head to France as the relationship between the two traditional allies, and between the US and the rest of Europe, has been strained over Trump’s trade policies and the US role in the Ukraine war. At his confirmation hearing earlier this month, Kushner said he would work closely with France to “bring greater balance to our important economic relationship” and also encourage France to “invest more in its defense capabilities, as well as lead the EU to align with the US vision of increased European commitments to security”. Share Updated at 02.28 BST\n\n3d ago 01.21 BST Joseph Gedeon As key Israel allies threaten action over mounting Gaza catastrophe, Washington is largely unmoved. As Israel orders Palestinians to evacuate Khan Younis in advance of what it calls an “unprecedented attack” on Gaza, much of Washington remains largely unmoved, even as Canada and European countries threaten “concrete actions” if Israel does not scale back its offensive. Despite reports of growing pressure from the Trump administration to increase aid into Gaza, where widespread famine looms, the White House continues to publicly back Israel. National security council spokesperson James Hewitt told the Guardian in an email: “Hamas has rejected repeated ceasefire proposals, and therefore bears sole responsibility for this conflict,” maintaining the policy stance inherited from the previous Biden administration despite mounting evidence of humanitarian catastrophe. The Israeli military on Monday instructed residents of southern Gaza’s Khan Younis to “evacuate immediately” as it prepares to “destroy the capabilities of terrorist organizations” – signalling plans for intensified bombardment in a war that has already claimed more than 53,000 Palestinian lives, according to Gaza’s health ministry. Despite Israeli promises to “flatten” Gaza, opposition from Congress – and mainstream Democrats more broadly – has been largely muted. While the besieged territory faces what the World Health Organization (Who) calls “one of the world’s worst hunger crises”, more than three dozen members of Congress from both parties recently appeared in an American Israel Public Affairs Committee (Aipac) video in celebration of Israel’s 77th birthday. In New York, leading mayoral candidate Andrew Cuomo held up an Israeli flag in the city’s annual Israel Day Parade on Sunday. Read the full analysis by the Guardian’s Joseph Gedeon here: As key Israel allies threaten action over Gaza catastrophe, Washington is largely unmoved Read more Share Updated at 01.24 BST\n\n3d ago 01.04 BST Richard Grenell, the Kennedy Center’s interim director appointed by Donald Trump, claimed that the Kennedy Center board found $26mi in phantom revenue through the 2024 and 2025 budgets. “It’s criminal,” Grenell said. “We’re going to refer this to the US attorney’s office here.” Grenell said that attorney general Pam Bondi, who also serves on the board of trustees for the Kennedy Center, already “heard the details”. “This is unacceptable in America, to have a fake revenue of $26m fraud on previous donors,” Grenell said. Share Updated at 01.17 BST\n\n3d ago 00.45 BST Lauren Gambino The former FBI director went for a walk on the beach with his wife when they stumbled on a message in the sand: 8647. According to James Comey, his wife wondered if it was an address. They stood over the seashells, trying to decipher meaning. His wife, according to Comey’s account, recalled her days as a server, and said 86 was the term used to remove an item from the menu. Comey chimed in that when he was a kid, “86” meant “to ditch a place”. “I said: ‘That’s really clever,’” Comey recounted in a Monday interview on MSNBC, describing the events that led him to post a photo of the seashells on Instagram, leading to a firestorm of accusations from Donald Trump allies that he was calling for violence against the 47th president of the United States. “I posted it on my Instagram account and thought nothing more of it, until I heard through her that people were saying it was some sort of a call for assassination, which is crazy. But I took it down. Even if I think it’s crazy, I don’t want to be associated with violence of any kind,” he said. Comey was hoping for a buzz around his forthcoming legal thriller, FDR Drive: A Crime Novel. Instead he got a call from the Secret Service. Comey, who was fired by Trump in his first term, appeared voluntarily at the Washington field office for an interview, after the US president insisted there was no innocent reading of the message. “He knew exactly what that meant. A child knows what that meant,” Trump said. “If you’re the FBI director and you don’t know what that meant, that meant assassination. And it says it loud and clear.” Comey appeared nonplussed by the investigation – “it’s not my first rodeo,” he said, noting his tempestuous relationship with Trump which Comey said deteriorated after he rebuffed Trump’s early attempts to secure a pledge of loyalty from the then-FBI director. The agency is now led by Kash Patel, whose abiding loyalty has raised urgent questions about the FBI’s independence. But Comey warned that the episode pointed to a more worrying trend by this administration: “The use of power to aim at individuals, eroding the rule of law.” His advice to others who may find themselves on the receiving end of Trump’s retribution? “The rule of law is still our saving grace,” Comey said. “We have a judiciary in this country that will support the truth. Take solace in that. Take prudent steps, but don’t freak out. These people are not good enough for you to be freaked out about. Protect yourself, be measured about the effect the threat has on you, and know that you’re going to be OK.” Share Updated at 00.57 BST\n\n4d ago 00.29 BST Donald Trump is delivering a speech at the Kennedy Center board dinner about three months after he seized control of the entity and immediately terminated multiple people from the board of trustees, making himself the chair of a new board. On Monday, he took a moment to criticize the center’s layout. “The importance of the building is phenomenal,” he said. “I always thought they should have built a beautiful performing center, open air, facing out over the Potomac. They didn’t do that. They built these crazy rooms underneath. They built three tiny little stages, very expensive. Someday, maybe somebody will occupy one.” The Kennedy Center is the country’s national cultural center and is run through a public-private partnership. The center is known for hosting music, theater, dance, artwork and performance art, and has hosted acts ranging from Tina Turner to Led Zeppelin. Trump’s move to take control made performers cancel shows, donors question their support and audience members threaten to boycott. The new board is stocked with loyalists, including White House chief of staff Susie Wiles; attorney general Pam Bondi; Usha Vance, the wife of JD Vance; and Lee Greenwood, whose song God Bless the USA,” plays at Trump rallies as well as many official events, including during his trip to the Middle East last week. Share Updated at 00.43 BST\n\n4d ago 00.12 BST The Department of Homeland Security conducted its first charter flight for migrants who opted to “self-deport” to their home countries, flying 64 Colombians and Hondurans home. The department paid them a $1,000 stipend each. “This was a voluntary charter flight, not an ICE enforcement operation,” DHS said in a press release, referring to US Immigration and Customs Enforcement. Earlier this month, the Trump administration announced it would begin offering travel assistance and a stipend for those registering to self-deport through the CBP Home App. That is a version of the app devised in the Biden administration called CBPOne that gave people approaching the US-Mexico border without official arrangements a strictly limited channel to request asylum in the US and enter legally when issued an appointment. Donald Trump shut that down upon inauguration, as vowed, stranding many, and later changed its name and function so that CBP Home is a tool to exit the US, not enter. In Colombia, 26 people arrived to their families and representatives of the Colombian Ministry of Foreign Affairs, and Migration Colombia, according to officials. In Honduras, 38 people were received by government officials and family members. Share Updated at 00.25 BST\n\n4d ago 23.55 BST Columbia University student Mohsen Mahdawi, who was detained by federal immigration authorities last month over his pro-Palestinian activism, crossed the graduation stage on Monday. Several students cheered for Mahdawi as he walked across the stage. He blew a kiss and bowed, one video showed. View image in fullscreen Mohsen Mahdawi poses for a portrait wearing his graduation gown on the Columbia University campus in New York City on Sunday. Mahdawi was arrested by Ice in Colchester, Vermont, while attending a naturalization interview. He was detained and ordered deported by the Trump administration on 14 April despite not being charged with a crime. He is one of several international students who have been detained in recent months for their advocacy on behalf of Palestinians. The Trump administration is attempting to deport them using an obscure statute that gives the secretary of state the right to revoke the legal status of people in the country deemed a threat to foreign policy. Share Updated at 23.56 BST\n\n4d ago 23.41 BST Donald Trump said on Monday that he was surprised the public wasn’t notified sooner about former president Joe Biden’s prostate cancer diagnosis. “I think it’s very sad,” the US president said. “I’m surprised that it wasn’t notified a long time ago. Because to get to stage nine, it’s a long time.” Biden disclosed on Sunday he was diagnosed with prostate cancer with metastasis to the bone, and he and his family are reviewing treatment options. Trump then said he just had his physical and said he was “proud to announce I aced” the cognitive tests, saying: “I got them all right.” “I think, frankly, anybody running for president should, you know, take a cognitive test,” he said. Share Updated at 23.43 BST\n\n4d ago 23.25 BST Trump endorses Ukraine-Russia peace talks taking place at Vatican Donald Trump said he didn’t think Pope Leo XIV’s involvement in Russia-Ukraine peace talks meant the US would play a smaller role. He liked the idea of holding negotiations at the Vatican. “I think it would be great to have it at the Vatican,” Trump said. “Maybe it would have some extra significance … I think it would be maybe helpful. There’s tremendous bitterness, anger, and I think maybe that could help with some of that anger. So having it in the Vatican would be – in Rome – would be a great, I think it’d be great idea.” Trump said he asked Russian president Vladimir Putin to meet with him. “I said: ‘When are we going to end this bloodshed, this bloodbath. It’s a bloodbath.’ And I do believe he wants to end it.” Share Updated at 23.33 BST\n\n4d ago 23.14 BST At least 50 migrants sent to El Salvador prison entered US legally, report finds At least 50 Venezuelan men sent by the Trump administration to a prison in El Salvador had entered the United States legally, according to a review by the Cato Institute, a libertarian thinktank. The report, published today, analyzed available immigration data for only a portion of the men who were deported, and focuses on the cases where records could be found. “The government calls them all ‘illegal aliens.’ But of the 90 cases where the method of crossing is known, 50 men report that they came legally to the United States, with advanced US government permission, at an official border crossing point,” Cato said in its report. This number aligns with broader trends among Venezuelan migrants, many of whom entered the country either as refugees or through a Biden-era parole program that granted two-year work permits to those with US-based sponsors. “The proportion isn’t what matters the most: the astounding absolute numbers are,” reads the report. “Dozens of legal immigrants were stripped of their status and imprisoned in El Salvador.” Cato’s analysis goes against the Trump administration’s justification for sending the men to El Salvador, saying that only undocumented immigrants were deported. The report says that 21 men were admitted after presenting themselves at a port of entry, 24 were granted parole, four were resettled as refugees, and one entered the US on a tourist visa. View image in fullscreen Police officers stand guard at the Terrorism Confinement Center prison during a media tour, in Tecoluca, El Salvador. To date, the Trump administration has not released complete records for the more than 200 Venezuelans transferred to El Salvador. Cato’s review includes information for 174 men whose cases have some degree of public documentation. The Trump administration has accused many of the deported Venezuelan men of gang involvement, but in many cases, those claims appear to hinge largely on their tattoos. Many of the tattoos cited as evidence have no connection to gang activity. The markings reflect, in many cases, personal or cultural references. Cato uses the example of Andry José Hernández Romero, a makeup artist, who has crown tattoos on his arms that reference the Three Kings Day celebrations in his Venezuelan hometown. Share Updated at 23.34 BST\n\n4d ago 22.53 BST The Department of Justice has launched an investigation into a recent security breach at Coinbase Global, the world’s largest cryptocurrency exchange, Bloomberg reports. Coinbase itself is not the subject of the justice department’s investigation, which is focused on the people behind the attack. “We have notified and are working with the DOJ and other US and international law enforcement agencies and welcome law enforcement’s pursuit of criminal charges against these bad actors,” Paul Grewal, chief legal officer at Coinbase, told Reuters. Last week, Coinbase disclosed that on 11 May it received an email from an unidentified threat actor claiming to have information on certain customer accounts and internal documents. The company estimates potential losses from the incident to range between $180m and $400m. While the attackers stole some data including names, addresses and emails, they did not get access to login credentials or passwords. It will, however, reimburse the customers who were tricked into sending funds to the attackers. Here’s more information on the cyber-attack: Largest US crypto exchange says cost of recent cyber-attack could reach $400m Read more Share Updated at 22.57 BST\n\n4d ago 22.38 BST An anonymous source told the AP that President Donald Trump is slated to visit House Republicans during their weekly conference meeting on Tuesday as he looks to build momentum for his tax cut and immigration bill. The legislation Republicans are hoping to pass this summer faces a critical test in the House this week with Speaker Mike Johnson seeking a vote before Memorial Day, even though GOP lawmakers still have some differences on the bill. Johnson is working to hold his narrow House majority together to pass the president’s top domestic priority of extending the tax breaks while pumping in money for border security and deportations. Share\n\n4d ago 22.20 BST Senate Democratic leader introduces bill that would ban Qatar-made Air Force One Senate Democratic Leader Chuck Schumer introduced new legislation that would ban the United States from using a foreign plane as Air Force One.\n\n\n\nSchumer is introducing the bill in an effort to prevent President Donald Trump from accepting a new $400 million plane from Qatar. “Retrofitting the Qatari plane would cost billions and could never even truly eliminate all catastrophic risks,” Schumer said on X.\n\n\n\nWhite House Press secretary Karoline Leavitt said Monday that the aircraft “will be accepted according to all legal and ethical obligations.”\n\n\n\nThe bill would prevent the US from spending taxpayer dollars to retrofit a foreign-owned plane for presidential use.\n\n\n\n“There’s absolutely no amount of modifications that can guarantee it will be secure,” Schumer said. Share Updated at 22.37 BST\n\n4d ago 22.00 BST David Smith Speaking in the White House Rose Garden on Monday, Trump said: “We just spent two and a half hours talking to Vladimir Putin and I think some progress has been made. It’s a terrible situation going on over there. Five thousand young people every single week are being killed so hopefully we did something.\n\n\n\n“We also spoke to the heads of most of the European nations and we’re trying to get that whole thing wrapped up. What a shame that it ever started in the first place.”\n\n\n\nThe president was about to sign a bill that addresses the rise of “revenge porn” and deepfake images and was joined by first lady Melania Trump, who has campaigned on the issue. Trump quipped: “Putin just said, they respect your wife a lot. I said, what about me? They like Melania better. That wasn’t good; I don’t know if that was good. I’m OK with it. I’m OK.” Share"
    },
    {
        "title": "Trump to speak with Putin today on ending Ukraine 'bloodbath' - after Russia carries out largest drone attack since start of war",
        "description": "After a call with Vladimir Putin to discuss ending the war in Ukraine - set for around 3pm - the US president will speak with Volodymyr Zelenskyy and NATO members.",
        "content": "Donald Trump is set to speak with Vladimir Putin about a ceasefire with Ukraine today - after Russia launched its largest drone attack since the start of the war.\nPosting on Truth Social on Sunday, the US president said he would call his Russian coun... [2425 chars]",
        "url": "https://news.sky.com/story/trump-to-speak-with-putin-today-on-ending-ukraine-bloodbath-after-russia-carries-out-largest-drone-attack-since-start-of-war-13370767",
        "image": "https://e3.365dm.com/25/03/1600x900/skynews-trump-putin-us-russia_6849405.jpg?20250307202527",
        "publishedAt": "2025-05-19T04:46:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Donald Trump is set to speak with Vladimir Putin about a ceasefire with Ukraine today - after Russia launched its largest drone attack since the start of the war.\n\nPosting on Truth Social on Sunday, the US president said he would call his Russian counterpart on \"STOPPING THE 'BLOODBATH'\" and talk about trade at around 3pm UK time.\n\nFollow live: Ukraine war latest\n\nHe added he would also speak with Ukrainian President Volodymyr Zelenskyy, and then with NATO members.\n\n\"HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END,\" Mr Trump said.\n\n\"GOD BLESS US ALL!!!\"\n\nBe the first to get Breaking News Install the Sky News app for free\n\nIt comes after the Ukrainian military said a total of 273 exploding drones were reportedly fired across Kyiv and the Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning - the largest attack of its kind since 2022.\n\nIn Kyiv, a 28-year-old woman was killed, and three people, including a four-year-old child, were injured, according to regional governor Mykola Kalashnyk.\n\nPlease use Chrome browser for a more accessible video player 4:33 Russia launches war's largest drone attack\n\nMeanwhile, Mr Zelenskyy met with vice president JD Vance and secretary of state Marco Rubio in Rome for talks on the sidelines of Pope Leo's inauguration.\n\nIn a post on social media, the Ukrainian president said the meeting was \"good\" and \"reaffirmed that Ukraine is ready to be engaged in real diplomacy and underscored the importance of a full and unconditional ceasefire as soon as possible\".\n\nThat followed Ukraine and Russia's first face-to-face talks in Istanbul, Turkey, on Friday, where both sides agreed to exchange 1,000 prisoners but failed to agree to a ceasefire.\n\nPlease use Chrome browser for a more accessible video player 2:06 Did Pope's inauguration help Ukraine?\n\nAlso on Sunday, Sir Keir Starmer spoke to Mr Trump along with the leaders of France, Italy and Germany to discuss the upcoming call with Mr Putin.\n\nA Downing Street spokesperson said the group had \"discussed the need for an unconditional ceasefire and for President Putin to take peace talks seriously\".\n\nThe spokesperson added: \"They also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks.\"\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nRead more:\n\nUkraine-Russia talks symbolically important - but revealed stark reality\n\nWhat happened the last time Putin and Zelenskyy met?\n\nIt was the second time in three days that the prime minister and other European leaders had spoken to Mr Trump to discuss Russia."
    },
    {
        "title": "The USSR occupied eastern Europe, calling it ‘liberation’ - Russia is repeating the crime in Ukraine",
        "description": "In the post-Soviet states, statues can be removed and street names changed. But achieving sovereignty of memory is far harder, says exiled Russian novelist Sergei Lebedev",
        "content": "We often hear that it is Russia’s inability or unwillingness to deal with the crimes of its past that has led to the restoration of tyranny and the military aggression that we see now. Such a narrative usually focuses only on internal Soviet deeds: f... [9514 chars]",
        "url": "https://www.theguardian.com/commentisfree/2025/may/19/russia-illegal-occupation-eastern-europe-ukraine-post-soviet",
        "image": "https://i.guim.co.uk/img/media/9f3b4ef1207903bec46a3000fd4ab8e778b935ad/247_0_3723_2979/master/3723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=4c062ae297052ea6f449c0fda49a4d66",
        "publishedAt": "2025-05-19T04:00:54Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "We often hear that it is Russia’s inability or unwillingness to deal with the crimes of its past that has led to the restoration of tyranny and the military aggression that we see now. Such a narrative usually focuses only on internal Soviet deeds: forced collectivisation, the Great Terror of the 1930s, the Gulag system and so on. Some of these things were nominally recognised as crimes, but no attempt was made to hold the perpetrators to account. Russia’s perestroika democrats were generally opposed to transitional justice.\n\nHowever, the most politically sensitive Soviet crime is nearly always left out of the discussion. And Russia’s failure to address this particular crime is far more dangerous and affects the fate of many nations.\n\nThat crime is the Soviet occupation of central and eastern Europe, which lasted for decades and resulted in many dead and arrested, the destruction of social and cultural life and the denial of freedom. The injustice was immense.\n\nInternal Soviet crimes, which went unpunished, were at least legally acknowledged and their victims commemorated. External aggression and occupation were not. Аnd even Russian dissidents and liberals never risked raising the issue.\n\nThis is why, in relation to central and eastern Europe, there are two concepts of memory and history that normally cannot coexist, that clash with and contradict each other. They are totally opposed; they cannot be reconciled by diplomacy: Soviet liberation versus Soviet occupation.\n\nIt was only when Soviet troops finally withdrew from eastern and central Europe 45 years after the end of the second world war that the true liberation came, when the Soviet Union collapsed and occupied nations found their way to independence. But it was easier to restore or establish statehood and independence than to achieve sovereignty of historical memory.\n\nThe progressive image of the Soviet Union in its final days, the high hopes of the moment, shielded Moscow from serious criticism and accusations related to the occupation of eastern Europe. This restraint was the result of a surfeit of trust or, maybe, just cautionary pragmatism – the desire not to irritate Moscow and undermine its goodwill, not to burden the losers of the cold war too much. But the most important protection Moscow enjoyed was, of course, based on the status of having been victorious over nazism.\n\nRussia, as the self-proclaimed successor state to the USSR, has built its international political profile on the Soviet liberation myth, which provides moral capital and prescribes to the former occupied territories a debt of gratitude for their “liberation” from nazism.\n\nYes, the Soviet losses were real. And yet it is truly tragic that these losses helped to subjugate nations longing for freedom, replacing one dictatorship with another. The Soviet soldier, memorialised in statues that still mark the landscape of Europe from Berlin to Sofia, was not a liberator. He was an enslaver. And no amount of bloodshed by the Soviets to defeat the Nazis can excuse the Soviets’ own role as occupiers.\n\nView image in fullscreen The signing of the German-Soviet non-aggression pact in Moscow, 23 August 1939. Photograph: Universal Images Group/Getty Images\n\nIt is not accidental that the Soviets were reluctant to recognise even the existence of the Molotov-Ribbentrop pact. In modern Russia, to make any equivalence between the roles of the USSR and the Nazis is criminalised. In 1939 and 1940, the Soviet Union occupied Lithuania, Latvia and Estonia, and parts of Poland, Finland and Romania. For 22 months it was a faithful ally of Nazi Germany. This first wave of Soviet occupations can in no way be disguised as a “struggle against nazism”: it revealed the real intention of the Soviets. What then followed, was, in fact, a geographically extended reoccupation. This was a separate aim of the war, not necessarily connected to the one to defeat the Nazis.\n\nUnfortunately, understanding the Soviet occupation as a crime has not become an essential part of modern European history. It is geographically limited to the east, blurred, insufficiently represented; it forms part of the histories of individual nations but it does not form a powerful international narrative shared across the continent. Yet this understanding has a profound bearing on modern European life and is key to European security. Only when you fully grasp the cruelty and consequences of the Soviet occupation can you comprehend the concerns of Russia’s closest neighbours, their historically grounded fears and their need for safety.\n\nEastern regions of Ukraine are now occupied by Russian troops. For the first time since 1989, large areas of the European continent, home to millions of people, are under the control of an invading state. But it seems that too many Europeans have already forgotten what occupation means.\n\nRussian citizenship is being forcibly imposed. In fact, this is a mass expulsion programme, because those who do not agree will be treated as foreigners and forced to leave. Russia is pursuing the same path as the USSR did, for example, in relation to the Baltic states, aiming to Russify the conquered region, rearrange its national composition and make it a part of its state.\n\nProperty is being confiscated and redistributed. “Settlers” are brought in to form the backbone of the occupation regime. The politics of memory are reversed, monuments marking Soviet crimes disappear, streets are given back their Soviet names as a symbol of Russian domination. All this is part of an attack on national identity, an attempt to erase it.\n\nThe Russian state security services use filtration techniques extensively, and anyone deemed politically unreliable can be imprisoned. Severe torture and sexualised violence are widespread. Ukrainian prisoners of war released from captivity report the same torture, abuse and deliberate malnutrition aimed at breaking them physically and mentally.\n\nAnyone who knows the history behind the iron curtain immediately recognises the pattern. All this was a grim reality for Poland and Lithuania, East Germany and Romania and others. Mass deportations, the brutal rule of the secret police, deprivation of property and civil rights … but it never became a real stigma for the USSR or, later, Russia. It never became something of which a nation is ashamed, something that demands justice and punishment, acknowledgment and atonement.\n\nAnd this is where we are now: the occupier is back. And the occupier wages war exactly like the Soviets did.\n\nView image in fullscreen Vladimir Putin at a military parade on Victory Day in Moscow, 9 May 2025. The event is held annually to celebrate the Soviet Union’s defeat of Nazi Germany in 1945. Photograph: Gavriil Grigorov/Reuters\n\nVladimir Putin’s army has a gruesome advantage over western armies, which have invested heavily in keeping their personnel out of harm’s way. It can sustain losses that would be absolutely unacceptable for any western country. But it is also technically advanced enough to counter western military technologies.\n\nWestern science was the first to “dronise” warfare, to minimise the involvement of troops on the ground and use machines for new tasks. Putin’s army, while also using real drones, dronises human beings as well. It has turned soldiers into dispensable, single-use units.\n\nWith Russia’s full-scale invasion we have entered the era of global moral climate change. Just as one earthquake can have repercussions all over the world, or a single volcanic eruption can pollute the skies above several continents, Russia’s aggression changes the political climate worldwide.\n\nThis is another very real, but not yet fully recognised, outcome of the war. It is perhaps the most wide-ranging of all the outcomes. With thousands of troops sent into battle and killed by Ukrainians defending themselves, Putin doesn’t just get some pieces of Ukrainian territory – he erodes the political landscape worldwide, upsets alliances, exhausts the patience of voters in Nato countries and drags us down into the hell of moral relativism.\n\nWhat can be done about it?\n\nWestern and south-western Europe, which never faced the reality of Soviet occupation, must now listen to the voices of those who experienced it first-hand.\n\nIt is hard to say whether Russia will be held accountable for its crimes against Ukraine any time soon. But to build a future at all, a real future, it will be paramount to develop a cultural and historical concept countering Russia’s attempt to divide and rule.\n\nOn the initiative of Václav Havel, Joachim Gauck and other prominent former dissidents, 23 August, the date of the signing of the Molotov-Ribbentrop pact, is the EU’s Day of Remembrance for Victims of Stalinism and Nazism, or Black Ribbon Day. Understanding of the significance of this day could and should be deepened to include a broader perspective on Russian imperialism, which was part of Soviet communist policy but has outlived it.\n\nWe need to make this day the focus of a long-term and coordinated politics of remembrance, to strengthen existing institutions such as ENRS – the European Network Remembrance and Solidarity, which includes mostly eastern European countries. We must also build new ones, across continents, countering both leftwing and rightwing narratives that continue to make excuses for Russia.\n\nThe USSR collapsed because its artificial unity was enforced by violence and oppression. The EU’s endurance depends on the persistence of its voluntary unity. But unity is not a given. It is a product of mutual knowledge and compassion, of many cultural bridges connecting people.\n\nIt is time to start building.\n\nThis article is adapted from the writer’s closing address at the Helsinki Debate on Europe, 18 May 2025. It is published in partnership with Voxeurop.\n\n\n\nSergei Lebedev is an exiled Russian novelist. Since 2018 he has lived in Potsdam, Germany. His latest novel is The Lady of the Mine (2025)"
    },
    {
        "title": "Ukraine war briefing: More Russian drones than ever attack before Trump-Putin call",
        "description": "Kyiv suspects Russia also preparing ballistic missile launch; European leaders press case with Donald Trump before call to Russian ruler. What we know on day 1,181",
        "content": "The leaders of Britain, France, Germany and Italy again pressed the need for sanctions against Russia in a call with Donald Trump before the US president’s telephone summit with Vladimir Putin of Russia, the British prime minister’s office said. Trum... [2905 chars]",
        "url": "https://www.theguardian.com/world/2025/may/19/ukraine-war-briefing-more-russian-drones-than-ever-attack-before-trump-putin-call",
        "image": "https://i.guim.co.uk/img/media/0d297db9496a9a9f253f0a6f5aea28dd84aa5a0d/0_89_4567_3656/master/4567.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a481141c6b89c439a9c06cd0a355465d",
        "publishedAt": "2025-05-19T00:18:32Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The leaders of Britain, France, Germany and Italy again pressed the need for sanctions against Russia in a call with Donald Trump before the US president’s telephone summit with Vladimir Putin of Russia, the British prime minister’s office said. Trump is to speak with Putin on Monday as part of his long-running effort to end the war set off by Russia’s 2022 invasion of Ukraine. “The leaders discussed the need for an unconditional ceasefire and for President Putin to take peace talks seriously,” said a spokesperson for Keir Starmer. They also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks .\n\nThe Ukrainian deputy prime minister, Yulia Svyrydenko, said it was a “record” number of drones. “Russia has a clear goal – to continue killing civilians,” she said. The Russian military said it had intercepted 25 Ukrainian drones overnight into Sunday morning. Moscow also claimed it had captured Bahatyr, another village in eastern Ukraine’s Donetsk region, as it intensifies the war effort despite the Istanbul peace talks.\n\nUkraine on Sunday said Russia attacked with a record number of drones , targeting various regions, including that of the capital, Kyiv, where a woman was killed. A man was killed in the Kherson region, where a railway station and private houses and cars were hit. The Ukrainian air force said Russia launched “273 Shahed attack drones and various types of imitator drones” , of which 88 were destroyed and 128 more went astray “without negative consequences”. Ukraine’s intelligence service said it believed Moscow had intended to fire an intercontinental ballistic missile later on Sunday. There was no immediate response from Moscow to the accusation.\n\nSeparately, Ukraine’s president, Volodymyr Zelenskyy, met the US vice-president, JD Vance, and secretary of state, Marco Rubio, on Sunday as part of preparations for the Trump-Putin call, Peter Beaumont reports. The encounter took place on the sidelines of Pope Leo’s inauguration on Sunday. It came two days after the first direct talks between Ukraine and Russia in over three years in Turkey.\n\nAfter meeting with Vance, Zelenskyy said: “We discussed the talks in Istanbul, where the Russians sent a low-level delegation with no decision-making powers. We also touched on the need for sanctions against Russia, bilateral trade, defence cooperation, the situation on the battlefield and the future exchange of prisoners.” A senior official from Zelenskyy’s office said the Rome encounter went “better” than the Oval Office row three months ago when Vance publicly berated Zelensky as being “disrespectful” and not “thankful” enough.\n\nCalls to step up and coordinate action against the unflagged Russian “shadow fleet” of oil tankers in the Baltic Sea were made at the weekend before the EU foreign ministers’ meeting on Monday, which is expected to impose sanctions on 180 ships, writes Patrick Wintour. On average three loaded shadow tankers a day pass through northern European waters, including the Danish straits and the Channel. The inclusion of more vessels would take the total number of ships under EU sanctions to 350.\n\nThe shadow fleet is estimated to be carrying as much as 85% of Russia’s oil exports and so funding roughly a third of its budget. The battle over the shadow fleet intensified last week when a Russian Sukhoi Su-35 jet breached Estonian airspace in what looked like a reprisal for a tanker named the Jaguar, likely to be carrying Russian oil, being escorted out of Estonian economic waters by the country’s navy after the crew resisted boarding for inspect. The Estonian navy believed the ship might pose a threat to nearby underwater cables."
    },
    {
        "title": "Ukraine war latest: Zelenskyy meets Pope; Russia to 'test launch intercontinental ballistic missile'",
        "description": "Russia plans to conduct a \"training and combat\" launch of an intercontinental ballistic missile to intimidate Ukraine and the West tonight, according to Ukraine. Meanwhile, Volodymyr Zelenskyy has met with the Pope and the US vice president separately. Follow the latest below.",
        "content": "Putin obstructing peace talks to make battlefield advances, say experts\nVladimir Putin is engaging with peace negotiations in bad faith and will only accept \"full Ukrainian capitulation\", according to a leading think tank.\nThe Institute for the Study... [959 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-zelenskyy-meets-pope-russia-to-test-launch-intercontinental-ballistic-missile-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-zelenskyy-pope_6920344.jpg?20250518150352",
        "publishedAt": "2025-05-18T14:32:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "Donald Trump is losing patience with Russia, says Finnish leader",
        "description": "Alexander Stubb says Russian intransigence could pave way for ‘bone-crushing’ sanctions package",
        "content": "Donald Trump is losing patience with Vladimir Putin, Finland’s president has said after a lengthy conversation with his US counterpart.\nAlexander Stubb said Trump and Putin, who are scheduled to speak by telephone on Monday, must not decide the fate ... [5104 chars]",
        "url": "https://www.theguardian.com/world/2025/may/18/donald-trump-is-losing-patience-with-russia-says-finnish-leader",
        "image": "https://i.guim.co.uk/img/media/821e93035ea2cf1758b1a4f198609e08fefd6e17/243_0_2754_2202/master/2754.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d9c1a7b32fa88bbd0e95c47c7fb32e53",
        "publishedAt": "2025-05-18T14:07:59Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Donald Trump is losing patience with Vladimir Putin, Finland’s president has said after a lengthy conversation with his US counterpart.\n\nAlexander Stubb said Trump and Putin, who are scheduled to speak by telephone on Monday, must not decide the fate of Ukraine over the head of its president, Volodymyr Zelenskyy.\n\nStubb also said there was a chance, depending on how the phone call goes, that the US senators Lindsey Graham and Richard Blumenthal would introduce into Congress this week a sanctions package to make Russia’s finances untenable. Stubb has been in near daily contact with Graham, who describes the sanctions package as “bone-crushing”.\n\nAt a security conference in Estonia, Stubb said: “If we were to pull it together, we could say that Zelenskyy is patient and President Trump is starting to be impatient, but in the right direction, that is, towards Russia.”\n\nStubb said threatening sanctions and not implementing them would not cause a credibility problem as long as the west was making Putin react.\n\nIt is widely expected that Graham, who discussed his sanctions package with European foreign ministers last week, will adapt the bill’s provisions so it is aimed at foreign firms that import Russian energy. Graham, a Trump loyalist, is portraying his sanctions as an adjunct to Trump’s tariffs policy and not an alternative.\n\nThe initial package contained plans to impose 500% tariffs on the goods of any country trading in energy with Russia, a blunderbuss style of policy Trump has already reversed in his trade war.\n\nStubb said any European contact with Putin would be through the E3 leadership of Britain, France and Germany. “At the top level we should not go solo,” he said.\n\nStubb, one of the small group of European leaders with the ear of Trump, said he had been using his influence to persuade the president to revise his view of Russia’s economic and military strength.\n\nAt the Lennart Meri security conference in Tallinn he disclosed that in his conversation with Trump on Saturday he had tried to explain that Russia was no longer a great power, “certainly not economically”.\n\nHe added: “It is smaller than Italy, slightly larger than Spain [in terms of its economy]. Militarily it wanted to deny the independent sovereignty and territorial integrity of Ukraine three years ago. It has advanced less than one percentage point this year, and its interest rate is over 20% and its reserves are out.\n\n“So it is not a country which can be seen as a big power any more. These are the kind of messages that you have to convey. It is not an easy game, but you just have to keep on engaging the American administration.\n\n“Trump’s worldview is not far from what we saw in the 19th-century concert of powers – a big power era sometimes of competition and sometimes cooperation. We have to convince the US administration that free trade and common rules are better than transactional deals, and we show we are serious about defence in Europe and that we are security providers and not security consumers.”\n\nMatthew Whitaker, the US ambassador to Nato, told the conference his country was Europe’s friend but warned of a smaller military presence in Europe. “President Trump just said: enough, this is going to happen and it’s going to happen now,” he said.\n\n“This is going to be orderly, but we are not going to have any more patience for foot-dragging in this situation. We just need to work through the practical consequences.”\n\nThe postponement of a US troop withdrawal announcement until after a Nato summit next month will make capability planning more difficult.\n\nRadosław Sikorski, the Polish foreign minister, was one of many European leaders who accepted that the rebalancing of defence spending between Europe and the US was long overdue, adding he was grateful to Trump. He recalled what the Japanese admiral Isoroku Yamamoto said of the Americans after Pearl Harbor – “We have awoken a sleeping giant” – and said: “Putin has also woken the giant. He has yet no idea how costly this is going to be. Since President Trump came to power we [Nato] have already doubled our defence spending. We are at 2% [of GDP].\n\n“At the next Nato summit 3.5 % on hard defence will be the new target and 1.5% for civil and cyber defence. When we have done it, we will dwarf Russia. As Europe, without the US, we are spending two and half times more than Russia on a peace footing than Russia is spending on a war footing. All it takes is to spend the money better, on the basis of learning the lessons from Ukraine and then having the will to gel this into a fighting force. We should be grateful to the US for telling it like it is.”\n\nStubb added that in his conversations with the US administration, no one had mentioned the US leaving Nato and it was in the interest of the US to have allies in the alliance.\n\nAlar Karis, the Estonian president, revealed he sat next to Trump for two hours at the pope’s funeral in Rome and was told: “Don’t worry, you are safe.”\n\nBut diplomats warned the Nato summit could bring sharp disagreements over Russia strategy, with Europeans wanting to be clear that Russia posed a long-term threat, regardless of the settlement in Ukraine. It is not yet clear in what capacity Zelenskyy will attend the summit. His presence is important for leaders who do not want any peace settlement to rule out Ukrainian membership of Nato."
    },
    {
        "title": "Ukraine war latest: Russia to 'test launch intercontinental ballistic missile'; Zelenskyy meets Vance for first time since White House clash",
        "description": "Russia plans to conduct a \"training and combat\" launch of an intercontinental ballistic missile to intimidate Ukraine and the West tonight, according to Ukraine. Meanwhile, Volodymyr Zelenskyy has met the US vice president as they attended the Pope's inauguration. Follow the latest below.",
        "content": "Zelenskyy meets Pope\nVolodymyr Zelenskyy has met with Pope Leo XIV following his inauguration Mass.\nThe Pope has offered the Vatican up as a venue to host peace talks between Ukraine and Russia.\n\"The authority and voice of the Holy See can play an im... [352 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-russia-to-test-launch-intercontinental-ballistic-missile-zelenskyy-meets-vance-for-first-time-since-white-house-clash-12541713",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-vance-zelenskyy_6920300.jpg?20250518144657",
        "publishedAt": "2025-05-18T14:00:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    },
    {
        "title": "EU foreign ministers call for coordinated action on Russian ‘shadow fleet’ in Baltic Sea",
        "description": "Fleet of tankers sailing under flags of convenience estimated to carry up to 85% of Russia’s oil exports",
        "content": "Calls to step up and coordinate the interdiction of the unflagged Russian “shadow fleet” of oil tankers in the Baltic Sea were made this weekend ahead of the EU foreign ministers meeting on Monday that is set to impose sanctions on 180 ships, taking ... [6755 chars]",
        "url": "https://www.theguardian.com/world/2025/may/18/eu-foreign-ministers-call-for-coordinated-action-on-russian-shadow-fleet-in-baltic-sea",
        "image": "https://i.guim.co.uk/img/media/fb0bafd9110d0207f14da0227a05df8a04d10b72/234_217_2542_2033/master/2542.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1484676fc7a4186e09e8fffc03a2739b",
        "publishedAt": "2025-05-18T12:50:41Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Calls to step up and coordinate action against the unflagged Russian “shadow fleet” of oil tankers in the Baltic Sea were made this weekend before the EU foreign ministers’ meeting on Monday, which is expected to impose sanctions on 180 ships.\n\nThe inclusion of those vessels would take the total number of ships under EU sanctions to 350.\n\nEfforts to stop the shadow fleet, which is estimated to be carrying as much as 85% of Russia’s oil exports and so funding roughly a third of its budget, are seen as a critical proof of the EU’s determination to keep the economic pressure on Russia.\n\nThe Ukrainian president, Volodymyr Zelenskyy, spoke on Saturday with the Canadian prime minister, Mark Carney, over the latest steps against the shadow fleet, a group of 500 or so ageing and poorly insured tankers using flags of convenience to export Russian oil to countries such as India, in defiance of sanctions mounted in 2022 by G7 countries including Canada.\n\nBut the Lithuanian foreign minister, Kęstutis Budrys, said current enforcement was ineffective and now faced the threat of Russian military reprisals. Each day, about three loaded shadow tankers pass through northern European waters, including the Danish straits and the Channel.\n\nIn a further sign of tensions, Russian authorities detained a Greek-owned oil tanker on Sunday after it left an Estonian port while sailing on an agreed route in Russia’s territorial waters.\n\nThe Liberian-flagged Green Admire tanker had left the port of Sillamäe in north-east Estonia carrying a cargo of shale oil, destined for Rotterdam, in the Netherlands.\n\nBudrys, speaking at the Lennart Meri conference in Tallinn, highlighted uncertainty about the law on interdiction in international waters, and fear of an all-out military confrontation with Russia. The Estonian defence minister, Hanno Pevkur, called for all ships under sanctions to be debarred from entering EU economic exclusion zone waters, as they are debarred from entering EU ports. The move would severely restrict the Russian fleet but would arguably breach maritime law.\n\nThe battle over the shadow fleet intensified last week when a Russian Sukhoi Su-35 jet flew into Estonia’s airspace in what looked like a reprisal for a tanker named the Jaguar, likely to be carrying Russian oil, being escorted out of Estonian economic waters by the country’s navy. It was not clear whether the ship, already subject to sanctions by the UK, was sailing without any flag registration, the surest legal ground for interdicting a ship.\n\nThe Estonian navy believed the ship might pose a threat to nearby underwater cables, and contacted it to check its status and registration.\n\nFaced by resistance from the Jaguar crew, the Estonians drew back from trying to board the ship to inspect its cargo and instead escorted it into the international waters of the Gulf of Finland on its way to the Russian port of Primorsk. As the ship was being escorted, a Russian jet entered Estonian airspace for a minute without permission.\n\nIt is seen as the first incident in which Russia has shown military force in support of the shadow fleet, and its first entry into Estonian airspace for at least three years.\n\nThe fleet is thought to have expanded, possibly to as many as 700 largely uninsured tankers, to circumvent rules that deny high-quality insurance to ships carrying oil to be sold above $60 (£45) a barrel. The innovative US-designed oil cap policy balances two objectives – limiting Russian revenues for its war machine, while maintaining the supply of oil for the world economy. Ships that operate without insurance can be be placed under sanctions by G7 countries.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBudrys said the paradox was that less than half of the ships under either EU, US or UK sanctions had been embargoed by all three. He said he wanted to see all ships in the fleet under sanctions, and for the level of proof required to sanction a ship to be reduced and standardised.\n\nBaltic states, he said, needed to clarify the unclear national protocols under the UN convention on the law of the sea (Unclos) about the right to inspect an unflagged ship, especially inside a country’s exclusive economic zone. Since last June, the Estonian transport agency has checked the documents of more than 450 ships, but the right to interdict in international waters is strictly limited.\n\nBudrys rejected the fears of some Baltic shipping companies that a more aggressive posture would lead to restrictions on freedom of navigation for western ships in the South China Sea.\n\nHe said lawyers often advised ministers that the current law on interdiction was unclear, but he said there was no point trying to reopen the outdated Unclos itself, since the process would take too long.\n\nHe said: “Last week’s events involving Russian protection of the Jaguar through the use of Russian jets changes the overall assessment and picture. Russia now is showing force, creating an incident and even entering Nato airspace to protect these vessels.”\n\nSince January, Nato’s Baltic Sentry mission has been established to protect the Baltic Sea’s critical infrastructure, principally undersea cables, but it has no direct responsibility over the shadow fleet.\n\nBudrys said: “We need not only to continue Baltic Sentry, but to expand its mission, because the increase in the shadow fleet increases the probability of military incidents in the Baltic Sea. This is serious.”\n\nBut Benjamin Hilgenstock, the head of macroeconomic research at the Kyiv School of Economics, claims the oil price cap has proved unenforceable, partly since no means exists to check that oil has been traded at the declared price.\n\nCritics say that despite the existence of a 14-country shadow fleet expert group, there is no body coordinating enforcement action, or intelligence about the shadow fleet, with different countries adopting different approaches.\n\nJohn Mead, the deputy commander of Allied Joint Force Command Brunssum, stressed Nato’s focus was to protect underwater cables, but in pursuit of this had hailed 1,800 ships to check flag status. It was also launching a fleet of drones to improve monitoring.\n\nHe added “the Russians will exhaust themselves very, very quickly if they want to up their posture by escorting every single shadow fleet vessel through the Baltic Sea.”\n\nAnna Wieslander, the director for northern Europe at the Atlantic Council, said in the middle of last year “we realised that this not in parallel to Russia’s efforts sustain its war economy, the shadow fleet is at the core of its whole system.”\n\nShe said the episode last week showed “the shadow fleet is at the core of their national security. The first step is to realise the magnitude of this for the war economy. We should sanction them all, why not?”"
    },
    {
        "title": "Russia launches 'heaviest drone attack' on Ukraine since start of war",
        "description": "A total of 273 exploding drones were fired across the Kyiv, Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning, the Ukrainian air force says.",
        "content": "Russia has launched its heaviest drone attack on Ukraine since the start of the war in 2022, the Ukrainian military has said.\nA total of 273 exploding drones were reportedly fired across the Kyiv, Dnipropetrovsk and Donetsk regions between Saturday n... [2735 chars]",
        "url": "https://news.sky.com/story/russia-launches-heaviest-drone-attack-on-ukraine-since-start-of-war-13370104",
        "image": "https://e3.365dm.com/25/05/1600x900/skynews-ukraine-kyiv_6920050.jpg?20250518090754",
        "publishedAt": "2025-05-18T10:04:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Russia has launched its heaviest drone attack on Ukraine since the start of the war in 2022, the Ukrainian military has said.\n\nA total of 273 exploding drones were reportedly fired across the Kyiv, Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning.\n\nSome 88 were intercepted and 128 \"lost\", having been electronically jammed, Ukraine's air force said.\n\nIt passes the previous record of 267 drones on the eve of the war's third anniversary earlier this year.\n\nImage: Firefighters at the site of a business premises struck by a drone outside Kyiv. Pic: Reuters\n\nImage: Burnt out cars and buildings in the Kyiv region on Sunday. Pic: AP\n\nIn Kyiv, a 28-year-old woman was killed, and three people, including a four-year-old child were injured, according to regional governor Mykola Kalashnyk.\n\nJust outside the city, firefighters fought to control flames at business premises destroyed by drone attacks. Russia has not commented.\n\nImage: Resident Vadym Tysbenko, 22, outside his drone-struck house near Kyiv. Pic: Reuters\n\nImage: Emergency workers put out flames after drone strikes in Kyiv. Pic: AP\n\nImage: Firefighters at work in the Kyiv region on Sunday. Pic: AP\n\nIt comes ahead of a planned phone call between US President Donald Trump and his Russian counterpart Vladimir Putin.\n\nMr Trump has promised to speak to Mr Putin and then President Volodymyr Zelenskyy on Monday about \"ending the war\" after the first direct talks between their two countries failed to yield a ceasefire this week.\n\nMr Putin snubbed Mr Zelenskyy's offer of face-to-face talks in Turkey.\n\nPlease use Chrome browser for a more accessible video player 1:52 What happened at Russia-Ukraine peace talks?\n\nA source from the Ukrainian negotiation team told Sky News that Russia threatened \"eternal war\" during talks between officials.\n\nKremlin representatives are also reported to have threatened that Ukraine may lose \"more than just loved ones\" while at the negotiating table.\n\nTalks did bring promise of the largest ever prisoner swap between the two nations - involving 1,000 prisoners of war on each side.\n\nUkraine's military intelligence chief said he hoped it would take place over the next week.\n\nRead more from Sky News:\n\nChilling moment in Ukraine-Russia talks\n\nMeet the pro-Trumper that could be Romania's president\n\nEverything you need to know about Poland's elections\n\nPlease use Chrome browser for a more accessible video player 0:41 Nine killed in Sumy bus strike\n\nElsewhere in Sumy, northeastern Ukraine, on Saturday, nine people were killed and seven injured after a bus evacuating civilians was hit by a Russian drone in the town of Bilopillia, according to Ukrainian officials.\n\nOn Sunday, Mr Zelenskyy was in Vatican City attending the inauguration of Pope Leo XIV.\n\nImage: President Volodymyr Zelenskyy at the inauguration of Pope Leo XIV in Vatican City. Pic: Reuters\n\nHe was pictured shaking hands with US Vice President JD Vance after their tense clash at the White House earlier this year."
    },
    {
        "title": "Ukraine reports largest drone attack from Russia since war began",
        "description": "One person was killed in the Kyiv region, in an attack that came after peace talks between the two sides on Friday",
        "content": "The largest known Russian drone attack since full-scale war began in 2022 killed a woman in the Kyiv region and injured at least three people, Ukrainian authorities said early on Sunday, as Moscow stepped up strikes after peace talks on Friday.\nRussi... [2685 chars]",
        "url": "https://www.theguardian.com/world/2025/may/18/ukraine-reports-largest-drone-attack-from-russia-since-war-began",
        "image": "https://i.guim.co.uk/img/media/b063b1bc2f8278f92b97fb2780181a5167e43ae2/774_362_4547_3638/master/4547.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c641f9753d23192be1c7a45d20498372",
        "publishedAt": "2025-05-18T06:45:44Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Ukraine’s president, Volodymyr Zelenskyy, met the US vice-president, JD Vance, and secretary of state, Marco Rubio, to prepare for a planned call on Monday with Donald Trump over a way to end three years of war in Ukraine.\n\nThe encounter took place on the sidelines of Pope Leo’s inauguration on Sunday.\n\nTrump is also scheduled to speak with the Russian president, Vladimir Putin.\n\nHowever, underlining the huge challenges facing efforts to end the war, the meeting came just hours after Russia launched its largest drone strike of the war in Ukraine.\n\nUkrainian intelligence has also warned that Moscow may be imminently planning to test-fire a nuclear-capable intercontinental ballistic missile “to intimidate” Kyiv and its western backers.\n\nUkraine’s military intelligence agency said it believed the test would involve an RS-24 Yars missile with a claimed range of more than 10,000km equipped with a training warhead.\n\nThere was no immediate response from Moscow to the accusation.\n\nThe meeting between Zelenskyy and Vance was the first since the two clashed during talks at the White House in February, and lasted about 40 minutes.\n\nZelenskyy described the meeting as “good” and released pictures of Ukrainian and US officials sitting outside at a round table and smiling.\n\n“I reaffirmed that Ukraine is ready to be engaged in real diplomacy and underscored the importance of a full and unconditional ceasefire as soon as possible,” Zelenskyy added.\n\nA senior Ukrainian official, speaking on condition of anonymity, added that Zelenskyy and Vance discussed “the situation on the front, preparations for [Trump’s phone conversations on Monday], the possibility of sanctions against Russia if there are no results, a ceasefire”.\n\nThe escalating diplomatic efforts come after the first direct talks between Moscow and Kyiv in years – held in Istanbul on Friday – failed to yield a ceasefire, and as European leaders, threatening new sanctions against Moscow, are uniting around efforts to persuade an erratic US president that Putin is not serious about peace.\n\nThe leaders of Britain, France, Germany and Poland planned to speak to Trump before the US and Russian presidents speak on Monday, the German chancellor, Friedrich Merz, said on Sunday.\n\n“I spoke with Marco Rubio, including about the call tomorrow. We agreed that we will speak again with the four state leaders and the US president in preparation for this conversation [with Putin],” Merz told reporters in Rome.\n\nThe EU chief, Ursula von der Leyen, said that next week would be “crucial” for Ukraine’s future, in advance of the phone call between Trump and Putin.\n\n“What is important now is certainly that we push, that things are moving forward, and I think the next week will be crucial on that,” she said.\n\nTrump on Saturday said that he would speak by phone with Putin to end the “bloodbath” in Ukraine, a day after the first direct talks between Moscow and Kyiv in more than three years did not yield a ceasefire.\n\nKeir Starmer on Sunday discussed the war in Ukraine with leaders of the US, Italy, France and Germany, a Downing Street spokesperson said.\n\nLooking ahead to Trump’s call with Putin on Monday, the leaders discussed the need for an unconditional ceasefire and for the Russian president to take peace talks seriously, the spokesperson said.\n\nskip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThey also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks, the spokesperson added.\n\nThe UK foreign minister, David Lammy, on Saturday accused Moscow of obfuscating after talks between Ukraine and Russia on a possible ceasefire ended in less than two hours and Trump said “nothing could happen” until he had met Putin directly.\n\nOn Sunday Macron said he had spoken with Trump, Starmer, Merz and Giorgia Meloni about Ukraine.\n\n“Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe,” he wrote on X.\n\nThe largest known Russian drone attack since full-scale war began in 2022 killed a woman in the Kyiv region and wounded at least three people, Ukrainian authorities said early on Sunday.\n\nThe attack came two days after Ukraine and Russia held their first direct talks since 2022 and a day before the planned phone call between Trump and Putin.\n\nRussia launched the 273 drones before 8am local time, targeting chiefly the Kyiv region and the Dnipropetrovsk and Donetsk regions in the east of the country, Ukraine’s air force said.\n\nThe attack killed a 28-year-old woman in the capital region and wounded at least three people, including a four-year-old child.\n\nData provided by the air force showed this to be Russia’s largest drone attack on Ukraine of the war. On the eve of the third anniversary of Russia’s full-scale invasion of Ukraine on 23 February, Moscow launched a then-record 267 drones.\n\nAccording to the air force, 128 of the drones disappeared from radar during the attack, either crashing from software failures or fuel exhaustion, or because they were decoys without explosives. Another 88 were shot down.\n\nRussia and Ukraine have both made increasing use of decoy drones in swarms to try to overwhelm air defences. Other decoys are designed to appear larger than they are on radar systems.\n\nThe large scale of the attack, despite its relatively low impact, is far more significant in terms of the message it sends before Monday’s planned phone call between Putin and Trump, who has demanded an “end to the bloodshed” in Ukraine."
    },
    {
        "title": "Donald Trump says he has call with Putin planned - as Ukraine condemn Russia over bus attack",
        "description": "Ukrainian officials say nine civilians - including \"a mother, father and daughter\" were killed by a drone strike on a bus, leading to renewed calls for further sanctions on Russia. Donald Trump has said he plans to speak to the Ukrainian and Russian leaders on Monday.",
        "content": "Donald Trump has said he will speak to Vladimir Putin and Volodymyr Zelenskyy separately on Monday in a bid to secure a ceasefire deal between Russia and Ukraine.\nThe US president made the announcement on Truth Social - shortly after the Ukrainian pr... [4154 chars]",
        "url": "https://news.sky.com/story/donald-trump-says-he-has-call-with-putin-planned-as-ukraine-condemn-russia-over-bus-attack-13369644",
        "image": "https://e3.365dm.com/25/04/1600x900/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "publishedAt": "2025-05-17T17:29:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Donald Trump has said he will speak to Vladimir Putin and Volodymyr Zelenskyy separately on Monday in a bid to secure a ceasefire deal between Russia and Ukraine.\n\nThe US president made the announcement on Truth Social - shortly after the Ukrainian president condemned Russia for the \"deliberate killing of civilians\" after a drone hit a bus in northeastern Ukraine.\n\nMr Trump said he will speak to Mr Putin over the phone. He will then talk with Mr Zelenskyy and \"various members of NATO\", he wrote.\n\nIn an all-caps post, he said: \"HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END. GOD BLESS US ALL!!!\"\n\nThe Ukrainian town of Bilopillia has declared a period of mourning lasting until Monday after nine people were killed in a Russian drone attack - which occurred just hours after Kyiv and Moscow held peace talks.\n\nSeven others were injured, Ukrainian authorities said. The bus was evacuating civilians from a frontline area when the drone hit, the country's national police said.\n\nPlease use Chrome browser for a more accessible video player 0:41 Nine killed in Russian strike on bus\n\nA \"father, mother and daughter\" were among the dead, Mr Zelenskyy said, writing on Telegram: \"All the deceased were civilians. And the Russians could not have failed to understand what kind of vehicle they were targeting.\"\n\nThe attack was also condemned by British Foreign Secretary David Lammy, who said he was \"appalled\".\n\n\"If Putin is serious about peace, Russia must agree to a full and immediate ceasefire, as Ukraine has done,\" he wrote on X.\n\nDatawrapper Datawrapper , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Datawrapper cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Datawrapper cookies. To view this content you can use the button below to allow Datawrapper cookies for this session only. Enable Cookies Allow Cookies Once\n\nRepresentatives for Kyiv and Moscow met for direct peace talks in Istanbul, Turkey, just hours before the drone attack.\n\nWhile the discussions - which were not attended by the Mr Putin or Mr Zelenskyy - did not result in a truce, both countries agreed to exchange 1,000 prisoners in their biggest swap yet.\n\nUkraine's intelligence chief, Kyrylo Budanov, said on national television the exchange could happen as early as next week.\n\nPlease use Chrome browser for a more accessible video player 1:52 What happened at Ukraine talks?\n\nRussia 'threatened eternal war' at peace talks\n\nAfter a Ukrainian official on Friday said Russia made \"unacceptable\" demands during the discussions, a source from the Kyiv delegation has now told Sky News that Moscow threatened \"eternal war\".\n\nSeparately, a senior Kyiv official said Russia's proposed ceasefire terms included the full withdrawal of troops from four regions of Ukraine: Donetsk, Zaporizhzhia, Kherson and Luhansk.\n\nMoscow also called for international recognition that those regions and Crimea - annexed in 2014 - are Russian and for Ukraine to become a neutral state, with no allied troops stationed there, they said.\n\nThe Kremlin declined to comment on the matter.\n\nRead more:\n\nWhat happened last time Putin and Zelenskyy met?\n\nUkrainians tortured and killed in Russian jails\n\nAnalysis: the chilling moment in Russia-Ukraine talks\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nUkraine has rallied support from its allies following the talks, and a number have spoken out.\n\nFrench President Emmanuel Macron said: \"Today, what do we have? Nothing. And so I tell you, faced with President Putin's cynicism, I am sure that President Trump, mindful of the credibility of the United States, will react.\"\n\nThe EU is working on a new package of sanctions against Moscow, European Commission President Ursula von der Leyen said."
    },
    {
        "title": "Donald Trump says he has call with Putin planned - as Ukraine condemns Russia over bus attack",
        "description": "Ukrainian officials say nine civilians - including \"a mother, father and daughter\" were killed by a drone strike on a bus, leading to renewed calls for further sanctions on Russia. Donald Trump has said he plans to speak to the Ukrainian and Russian leaders on Monday.",
        "content": "Donald Trump has said he will speak to Vladimir Putin and Volodymyr Zelenskyy separately on Monday in a bid to secure a ceasefire deal between Russia and Ukraine.\nThe US president made the announcement on Truth Social - shortly after the Ukrainian pr... [4154 chars]",
        "url": "https://news.sky.com/story/donald-trump-says-he-has-call-with-putin-planned-as-ukraine-condemns-russia-over-bus-attack-13369644",
        "image": "https://e3.365dm.com/25/04/1600x900/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "publishedAt": "2025-05-17T17:29:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Donald Trump has said he will speak to Vladimir Putin and Volodymyr Zelenskyy separately on Monday in a bid to secure a ceasefire deal between Russia and Ukraine.\n\nThe US president made the announcement on Truth Social - shortly after the Ukrainian president condemned Russia for the \"deliberate killing of civilians\" after a drone hit a bus in northeastern Ukraine.\n\nMr Trump said he will speak to Mr Putin over the phone. He will then talk with Mr Zelenskyy and \"various members of NATO\", he wrote.\n\nIn an all-caps post, he said: \"HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END. GOD BLESS US ALL!!!\"\n\nThe Ukrainian town of Bilopillia has declared a period of mourning lasting until Monday after nine people were killed in a Russian drone attack - which occurred just hours after Kyiv and Moscow held peace talks.\n\nSeven others were injured, Ukrainian authorities said. The bus was evacuating civilians from a frontline area when the drone hit, the country's national police said.\n\nPlease use Chrome browser for a more accessible video player 0:41 Nine killed in Russian strike on bus\n\nA \"father, mother and daughter\" were among the dead, Mr Zelenskyy said, writing on Telegram: \"All the deceased were civilians. And the Russians could not have failed to understand what kind of vehicle they were targeting.\"\n\nThe attack was also condemned by British Foreign Secretary David Lammy, who said he was \"appalled\".\n\n\"If Putin is serious about peace, Russia must agree to a full and immediate ceasefire, as Ukraine has done,\" he wrote on X.\n\nDatawrapper Datawrapper , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Datawrapper cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Datawrapper cookies. To view this content you can use the button below to allow Datawrapper cookies for this session only. Enable Cookies Allow Cookies Once\n\nRepresentatives for Kyiv and Moscow met for direct peace talks in Istanbul, Turkey, just hours before the drone attack.\n\nWhile the discussions - which were not attended by the Mr Putin or Mr Zelenskyy - did not result in a truce, both countries agreed to exchange 1,000 prisoners in their biggest swap yet.\n\nUkraine's intelligence chief, Kyrylo Budanov, said on national television the exchange could happen as early as next week.\n\nPlease use Chrome browser for a more accessible video player 1:52 What happened at Ukraine talks?\n\nRussia 'threatened eternal war' at peace talks\n\nAfter a Ukrainian official on Friday said Russia made \"unacceptable\" demands during the discussions, a source from the Kyiv delegation has now told Sky News that Moscow threatened \"eternal war\".\n\nSeparately, a senior Kyiv official said Russia's proposed ceasefire terms included the full withdrawal of troops from four regions of Ukraine: Donetsk, Zaporizhzhia, Kherson and Luhansk.\n\nMoscow also called for international recognition that those regions and Crimea - annexed in 2014 - are Russian and for Ukraine to become a neutral state, with no allied troops stationed there, they said.\n\nThe Kremlin declined to comment on the matter.\n\nRead more:\n\nWhat happened last time Putin and Zelenskyy met?\n\nUkrainians tortured and killed in Russian jails\n\nAnalysis: the chilling moment in Russia-Ukraine talks\n\nFollow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday Tap to follow\n\nUkraine has rallied support from its allies following the talks, and a number have spoken out.\n\nFrench President Emmanuel Macron said: \"Today, what do we have? Nothing. And so I tell you, faced with President Putin's cynicism, I am sure that President Trump, mindful of the credibility of the United States, will react.\"\n\nThe EU is working on a new package of sanctions against Moscow, European Commission President Ursula von der Leyen said."
    },
    {
        "title": "Ukraine war latest: Trump to speak with Putin and Zelenskyy after Russia demands 'five Ukrainian regions' in talks",
        "description": "Donald Trump has revealed he will hold phone calls with Vladimir Putin and Volodymyr Zelenskyy next week. It comes after Moscow reportedly demanded five Ukrainian territories in the first direct talks with Kyiv since 2022. Follow the latest below.",
        "content": "Top US diplomat holds call with Russian foreign minister\nThe US secretary of state and Russia's foreign minister spoke over the phone today, according to the state department.\nRubio welcomed the prisoner exchange agreement reached during Friday's tal... [371 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-trump-to-speak-with-putin-and-zelenskyy-after-russia-demands-five-ukrainian-regions-in-talks-12541713",
        "image": "https://e3.365dm.com/25/04/1600x900/skynews-trump-putin_6881846.jpg?20250410150732",
        "publishedAt": "2025-05-17T15:32:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Ukraine cannot hope to regain all lost territory, ambassador to UK says\n\nUkraine's ambassador to the UK has said Kyiv cannot hope to regain all the territory it has lost to Russia.\n\nValery Zaluzhnyi, who was head of the Ukrainian armed forces between 2021 and last year, said in a speech his country should not dream of restoring either the borders established after the Soviet Union collapsed in 1991, or those in place before the Russian invasion in February 2022.\n\nVolodymyr Zelenskyy is thought to favour a return to the 1991 borders.\n\nRussia occupied Crimea in 2014 and now controls about a fifth of Ukrainian territory after its full scale 2022 invasion.\n\nSpeaking at a forum in Kyiv, Zaluzhnyi said: \"I hope that there are not people in this room who still hope for some kind of miracle or lucky sign that will bring peace to Ukraine, the borders of 1991 or 2022, and that there will be great happiness afterwards.\"\n\n\"My personal opinion is that the enemy still has resources, forces and means to launch strikes on our territory and attempt specific offensive operations.\"\n\nHis speech was published by the Ukrainska Pravda news outlet."
    }
]