[
    {
        "title": "Russia funnelled money to Kremlin supporter in Ukraine via Ireland to bypass sanctions, records show",
        "description": "Planned transfer of funds linked to woman living in northwest of Ireland",
        "content": "Conor Gallagher reports on Pravfond, set up by Putin, that intelligence agencies say does more than its stated goal of protecting the rights of Russians abroad\nA former senior official in Ukraine‘s ousted pro-Russian government sought to use Ireland ... [2417 chars]",
        "url": "https://www.irishtimes.com/ireland/2025/05/22/russia-funnelled-money-to-kremlin-supporter-in-ukraine-via-ireland-to-bypass-sanctions-records-show/",
        "image": "https://www.irishtimes.com/resizer/v2/YASH4HGIVZLL4HGQWVFYUKUU7M.jpg?smart=true&auth=ab960007c07e2672ee3b131575a2978221af4ee223cbcc633f7780d2b25afc09&width=1200&height=630",
        "publishedAt": "2025-05-22T05:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/ireland/2025/05/22/russia-funnelled-money-to-kremlin-supporter-in-ukraine-via-ireland-to-bypass-sanctions-records-show/"
    },
    {
        "title": "No new direct Russia-Ukraine peace talks scheduled, Kremlin says",
        "description": "The comment comes almost a week after the first face-to-face engagement between the countries’ delegations since 2022.",
        "content": "Russia and Ukraine have scheduled no further direct talks on ending their more than three-year war, a Kremlin spokesman has said.\nThe comment comes almost a week after the first face-to-face engagement between the countries’ delegations since 2022 an... [5273 chars]",
        "url": "https://www.breakingnews.ie/world/no-new-direct-russia-ukraine-peace-talks-scheduled-kremlin-says-1765521.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMjIxNTMxNTlcXFwvZDQ2ODgxNmU1NDA5NGIyNmIxNmFmZGU5NmUxNjM1YjItMS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjQyNDJkNTkyMWQ3ZjRiY2MzNmUyNjk2MzhhOGQ0NzI5YWM3YmUwZGMifQ==/no-new-direct-russia-ukraine-peace-talks-scheduled-kremlin-says.jpg",
        "publishedAt": "2025-05-21T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russia and Ukraine have scheduled no further direct talks on ending their more than three-year war, a Kremlin spokesman has said.\n\nThe comment comes almost a week after the first face-to-face engagement between the countries’ delegations since 2022 and days after US President Donald Trump announced they would start ceasefire negotiations “immediately”.\n\nAdvertisement\n\n“There is no concrete agreement about the next meetings,” Kremlin spokesman Dmitry Peskov told reporters.\n\n\n\nMunicipal workers remove the cover that protected a monument of Kyiv legendary founders from Russian missile attacks (Efrem Lukatsky/AP)\n\n“They are yet to be agreed upon.”\n\nDuring two hours of talks in Istanbul last Friday, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, in what would be their biggest such swap.\n\nApart from that step, the meeting delivered no significant breakthrough.\n\nAdvertisement\n\nSeveral months of intensified US and European pressure on the two sides to accept a ceasefire and negotiate a settlement have yielded little progress.\n\nMeanwhile, Russia is readying a summer offensive to capture more Ukrainian land, Ukrainian government and military analysts say.\n\nRussian President Vladimir Putin said earlier this week that Moscow would “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty”.\n\nMr Putin has effectively rejected a 30-day ceasefire proposal that Ukraine has accepted.\n\nAdvertisement\n\nHe has linked the possibility to a halt in Ukraine’s mobilisation effort and a freeze on Western arms shipments to Kyiv as part of a comprehensive settlement.\n\n\n\nPresident Donald Trump claimed that Russia was not interested in talks because he thinks Russia is winning (Evan Vucci/AP)\n\nEuropean leaders have accused Mr Putin of dragging his feet in peace efforts while he tries to press his bigger army’s battlefield initiative and capture more Ukrainian land.\n\nThe major prisoner swap is a “quite laborious process” that “requires some time”, Mr Peskov said.\n\nBut he added: “The work is continuing at a quick pace, everybody is interested in doing it quickly.”\n\nAdvertisement\n\nUkrainian President Volodymyr Zelensky said on Thursday that preparations are under way for the potential prisoner exchange, which he described as “perhaps the only real result” of the talks in Turkey.\n\nMr Peskov disputed a report on Thursday in the Wall Street Journal that Mr Trump told European leaders after his phone call with Mr Putin on Monday that the Russian leader was not interested in talks because he thinks that Russia is winning.\n\n“We know what Trump told Putin, we don’t know what Trump told the Europeans. We know President Trump’s official statement,” Mr Peskov said.\n\n\n\nUkrainian President Volodymyr Zelensky speaks during a briefing in Kyiv, Ukraine (Efrem Lukatsky/AP)\n\n“What we know contrasts with what was written in the article you mentioned.”\n\nAdvertisement\n\nApart from the continuing war of attrition along the roughly 1,000-kilometre (620-mile) front line, which has killed tens of thousands of troops on both sides, the warring parties have been firing dozens of long-range drones at each other’s territory almost daily.\n\nRussia’s Defence Ministry said that it had shot down 105 Ukrainian drones overnight, including 35 over the Moscow region.\n\nIt was the second straight night that Kyiv’s forces have targeted the Russian capital.\n\nMore than 160 flights were delayed across three of Moscow’s four main airports, the city’s transport prosecutor said, as officials grounded planes citing concerns for passenger safety.\n\nThe attack prompted some regions to turn off mobile internet signals, including the Oryol region southwest of Moscow, which was targeted heavily on Wednesday.\n\nThe Defence Ministry claimed it downed 485 Ukrainian drones over several regions and the Black Sea between Tuesday evening and Thursday morning, including 63 over the Moscow region, in one of the biggest drone attacks.\n\nIt was not possible to verify the numbers.\n\n\n\nFirefighters put out the fire following Russia’s drone attack in the Kyiv region (Ukrainian Emergency Service via AP)\n\nMeanwhile, the Ukrainian air force said Russia launched 128 drones at Ukraine overnight.\n\nAmong the targets were Ukraine’s central Dnipropetrovsk region, damaging an industrial facility, power lines, and several private homes, regional governor Serhii Lysak said on Telegram.\n\nIn Kyiv, debris from a Russian drone fell onto the grounds of a school in the capital’s Darnytskyi district, according to the head of the Kyiv City Military Administration, Tymur Tkachenko.\n\nNo injuries were reported.\n\nUkrainian shelling in Russia’s Kursk region killed a 50-year-old man and injured two others, acting regional Governor Alexander Khinshtein said on Thursday.\n\nMr Putin visited the Kursk region on Tuesday for the first time since Moscow claimed that it drove Ukrainian forces out of the area last month.\n\nKyiv officials denied the claim.\n\n\n\nRussian President Vladimir Putin attends a meeting near Sochi, Russia (Vyacheslav Prokofyev/AP)\n\n“Despite the liberation of our territory, the border region is still subject to enemy attacks,” Mr Khinshtein warned residents on Telegram.\n\n“It is still dangerous to be there.”\n\nMr Putin has said Russian forces have orders to create a “security buffer zone” along the border.\n\nThat would help prevent Ukraine from striking areas inside Russia with artillery, Mr Putin told a government meeting, but he gave no details of where the proposed buffer zone would be or how far it would stretch."
    },
    {
        "title": "EU and UK announce new sanctions against Russia",
        "description": "The EU and Britain have announced new sanctions against Russia, which include a clampdown on its so-called \"shadow fleet\" of oil tankers as well as financial firms that have helped Moscow avoid the impact of other sanctions imposed over the war.",
        "content": "The EU and Britain have announced new sanctions against Russia without waiting for Washington to join them, a day after President Donald Trump's phone call with Vladimir Putin brought about neither a ceasefire in Ukraine nor fresh US sanctions.\nLondo... [5029 chars]",
        "url": "https://www.rte.ie/news/ukraine/2025/0520/1513794-ukraine-russia/",
        "image": "https://www.rte.ie/images/001e5935-1600.jpg",
        "publishedAt": "2025-05-19T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/ukraine/2025/0520/1513794-ukraine-russia/"
    },
    {
        "title": "Russia and Ukraine to start ceasefire talks",
        "description": "President Donald Trump spoke with President Vladimir Putin and said Russia and Ukraine will immediately start negotiations toward a ceasefire, but the Kremlin said reaching an agreement would take time and Mr Trump indicated he was not ready to join Europe with fresh sanctions to pressure Russia.",
        "content": "President Donald Trump spoke with President Vladimir Putin and said Russia and Ukraine will immediately start negotiations toward a ceasefire, but the Kremlin said reaching an agreement would take time and Mr Trump indicated he was not ready to join ... [4660 chars]",
        "url": "https://www.rte.ie/news/ukraine/2025/0520/1513794-russia-trump-ukraine/",
        "image": "https://www.rte.ie/images/00228da7-1600.jpg",
        "publishedAt": "2025-05-19T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/ukraine/2025/0520/1513794-russia-trump-ukraine/"
    },
    {
        "title": "Trump suggests Vatican could host ‘immediate’ Russia and Ukraine peace talks following his two-hour call with Putin",
        "description": "But Russian leader more circumspect on state television about his conversation with US president",
        "content": "Donald Trump and Vladimir Putin are seen during a joint news conference in Helsinki, Finland, in 2018. Photograph: Doug Mills/New York Times\nDonald Trump has expressed the belief following a phone call with Vladimir Putin that Russia will “immediatel... [2926 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/19/trump-suggests-vatican-could-host-immediate-russia-and-ukraine-peace-talks-following-his-two-hour-call-with-putin/",
        "image": "https://www.irishtimes.com/resizer/v2/ZTOLCJJNAVIN5J6DSCAZ2VCCZI.jpg?smart=true&auth=02c1382a58dee84c0e28b291033d1f04115b073295609ade691fc0f82b85dd8f&width=1200&height=630",
        "publishedAt": "2025-05-19T21:14:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/19/trump-suggests-vatican-could-host-immediate-russia-and-ukraine-peace-talks-following-his-two-hour-call-with-putin/"
    },
    {
        "title": "Trump leaves Russia and Ukraine to ceasefire talks",
        "description": "US president says negotiations will begin ‘immediately’ following more guarded statement from Putin",
        "content": "Us president Donald Trump spoke to his Russian counterpart Vladimir Putin on Monday afternoon about peace in Ukraine. Photographs: AP\nDonald Trump said on Monday that Russia and Ukraine would begin negotiations “immediately” on preparations for peace... [3456 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/19/ukraine-ceasefire-talks-to-begin-immediately-trump-says-after-call-with-putin/",
        "image": "https://www.irishtimes.com/resizer/v2/YCFOUQZ5KTVMYE7YDPY46GKETI.jpg?smart=true&auth=d499c92950199c037b9d3723dc481406ccf937f99a94abc3efd47a1f08a60a10&width=1200&height=630",
        "publishedAt": "2025-05-19T20:11:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/19/ukraine-ceasefire-talks-to-begin-immediately-trump-says-after-call-with-putin/"
    },
    {
        "title": "Here's What Happened Today: Sunday",
        "description": "Man arrested on suspicion of the murder of Michael Gaine, Pope Leo XIV is inaugurated, and Russia launches intense attacks on Ukraine.",
        "content": "NEED TO CATCH up? The Journal brings you a round-up of today’s news.\nIRELAND\nViking reenactors take part in the Boyne Valley Viking Experience at Slane Castle, Co Meath, Ireland's largest medieval reenactment festival, which features over 500 Viking ... [1665 chars]",
        "url": "https://www.thejournal.ie/news-fix-18-05-25-6708467-May2025/",
        "image": "https://img2.thejournal.ie/article/6708467/river/?height=400&version=6708482",
        "publishedAt": "2025-05-18T20:00:27Z",
        "source": {
            "name": "TheJournal.ie",
            "url": "https://www.thejournal.ie"
        },
        "full_content": "NEED TO CATCH up? The Journal brings you a round-up of today’s news.\n\nIRELAND\n\nViking reenactors take part in the Boyne Valley Viking Experience at Slane Castle, Co Meath, Ireland's largest medieval reenactment festival, which features over 500 Viking reenactors from across Europe taking part in full-scale battles, longship landings, and a vibrant Viking village. Alamy Stock Photo Alamy Stock Photo\n\nINTERNATIONAL\n\nPresidential candidate Nicusor Dan speaks to media after polls closed for the second round of the country's presidential election redo in Bucharest, Romania. Alamy Stock Photo Alamy Stock Photo\n\n#THE VATICAN: Pope Leo XIV received his papal ring during his inauguration in St Peter’s and also made his popemobile debut this morning before meeting with Ukrainian President Volodymyr Zelenskyy.\n\n#GAZA: Israel signalled today that it was open to striking a deal with Hamas that included “ending the fighting” in Gaza, where rescuers reported dozens killed a day after Israel stepped up its offensive.\n\nAdvertisement\n\n#UKRAINE: Russia overnight into Sunday launched one of its most intense drone attacks on Ukraine since the beginning of its full-scale invasion in 2022.\n\n#ELECTION SEASON: Voters across Poland, Portugal and Romania headed to the polls today to vote in tightly contested elections.\n\nPARTING SHOT\n\nRTÉ RTÉ\n\nBALLYDUFF DRAMA GROUP, directed by Ger Canning, were crowned RTÉ All-Ireland Drama champions.\n\nThe group won for their performance of ‘The Blackwater Lightship’ by Colm Tóibín, adapted for stage by David Horan, at the Gala Awards ceremony in Athlone’s Radisson Blu Hotel yesterday.\n\nBalally Players, directed by Declan Rudden, who performed ‘Ulster American’ by David Ireland, were placed second, and, Bridge Drama, directed by Susan Somers, who performed ‘The Curious Incident of the Dog in the Night-time’ based on the novel by Mark Haddon and adapted by Simon Stephens, were placed third."
    },
    {
        "title": "Trump says he will call Putin on Monday to discuss stopping Ukraine war",
        "description": "Kremlin launches largest drone barrage on Ukraine since the start of Russia’s full-scale invasion",
        "content": "Flags placed at Independence Square, Kyiv, in tribute to Ukraine's war dead. Photograph: EPA\nUS president Donald Trump said he will have a phone call with Russian president Vladimir Putin on Monday morning to discuss how to stop the war in Ukraine.\nH... [2332 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/18/ukraine-russia-war-donald-trump/",
        "image": "https://www.irishtimes.com/resizer/v2/Y5X43SOOFRKOZZTHZI5JIDKSO4.jpg?smart=true&auth=22ff4b240fce2cf29424677aa3e75ce389d9f46b33874e5eee0c960436a8d399&width=1200&height=630",
        "publishedAt": "2025-05-18T07:39:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/18/ukraine-russia-war-donald-trump/"
    },
    {
        "title": "Russia launches one of the biggest drone attacks on Ukraine since war began",
        "description": "The attacks targeted the country’s Kyiv, Dnipropetrovsk and Donetsk regions.",
        "content": "Russia overnight into Sunday launched one of its most intense drone attacks on Ukraine since the beginning of its full-scale invasion in 2022.\nRussia fired a total of 273 exploding drones and decoys overnight, Ukraine’s air force said.\nAdvertisement\n... [1250 chars]",
        "url": "https://www.breakingnews.ie/world/russia-launches-one-of-the-biggest-drone-attacks-on-ukraine-since-war-began-1764049.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTgwODM2NDFcXFwvYWZhZGRlNTljMWFkNDE5YTk1N2I1ZTcxNzZiMDQzMDQuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJmZmUzYjNjM2VkZTMwYjRlMGNhYmEwMWExZGRiNjdhZjUyYTI3ZDFjIn0=/russia-launches-one-of-the-biggest-drone-attacks-on-ukraine-since-war-began.jpg",
        "publishedAt": "2025-05-17T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russia overnight into Sunday launched one of its most intense drone attacks on Ukraine since the beginning of its full-scale invasion in 2022.\n\nRussia fired a total of 273 exploding drones and decoys overnight, Ukraine’s air force said.\n\nAdvertisement\n\nOf those, 88 were intercepted and a further 128 lost, likely having been electronically jammed.\n\nThe attacks targeted the country’s Kyiv, Dnipropetrovsk and Donetsk regions.\n\n\n\nFirefighters put out a blaze after Russia’s drone attack (Ukrainian Emergency Service/AP)\n\nYuriy Ihnat, head of the communications department of the Ukrainian air force, told The Associated Press that the barrage was the biggest drone attack since the start of the full-scale invasion.\n\nAccording to Kyiv regional governor Mykola Kalashnyk, a 28-year-old woman was killed in a drone attack on the region and three other people, including a four-year-old child, were wounded.\n\nAdvertisement\n\nThe number of drones fired exceeds Russia’s previous largest known single drone attack of the war, when Russia pounded Ukraine with 267 drones on the eve of the war’s third anniversary.\n\nThe barrage came after the first direct talks between Moscow and Kyiv in years on Friday failed to yield a ceasefire.\n\nRussian President Vladimir Putin spurned Ukrainian President Volodymyr Zelensky’s offer to meet face-to-face in Turkey after he himself proposed direct negotiations, although not at the presidential level, as an alternative to a 30-day ceasefire urged by Ukraine and its western allies, including the US.\n\nUS President Donald Trump said he plans to speak by phone on Monday to Mr Putin, followed by Mr Zelensky and leaders of various Nato countries, about ending the war in Ukraine."
    },
    {
        "title": "Ukraine and Russia are due to meet for talks - but expectations are low",
        "description": "The negotiations were initially expected to take place yesterday.",
        "content": "DELEGATIONS FROM UKRAINE and Russia will be in Istanbul today for what could be their first direct meeting on the conflict in Ukraine since 2022, but the absence of Russian President Vladimir Putin leaves little hope for progress in ending the war.\nU... [3459 chars]",
        "url": "https://www.thejournal.ie/ukraine-and-russia-are-due-to-meet-for-talks-but-expectations-are-low-6706492-May2025/",
        "image": "https://img2.thejournal.ie/article/6706492/river/?height=400&version=6706498",
        "publishedAt": "2025-05-16T07:19:17Z",
        "source": {
            "name": "TheJournal.ie",
            "url": "https://www.thejournal.ie"
        },
        "full_content": "We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it."
    },
    {
        "title": "Watch dramatic Nato vs Russia sea clash erupt as warplanes buzz Putin’s ‘shadow fleet’ vessel as it’s ordered ‘stop NOW’",
        "description": "THIS is the dramatic moment Nato and Russia scrambled warplanes to a clash above the Baltic Sea - after a tense standoff over an undercover Russian ta",
        "content": "THIS is the dramatic moment Nato and Russia scrambled warplanes to a clash above the Baltic Sea - after a tense standoff over an undercover Russian tanker.\nEstonian sea and air forces stalked and tried to board an oil tanker thought to be part of Rus... [4595 chars]",
        "url": "https://www.thesun.ie/news/15211469/watch-dramatic-nato-russia-sea-clash/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/f798d75a-6586-4cfd-8f79-b018c9389ab8.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-15T10:19:54Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "THIS is the dramatic moment Nato and Russian warplanes clashed above the Baltic Sea - after a tense standoff over an undercover Russian tanker.\n\nEstonian sea and air forces stalked and tried to board an oil tanker thought to be part of Russia's shadow fleet - but it fought back.\n\n10 A Russian Su-35 fighter jet, followed by a Polish Air Force MiG-29 Credit: East2West\n\n10 Left to right: an Estonian AgustaWestland AW139 helicopter, M28 Skytruck aircraft and a Russian Su-35 fighter jet pictured over the Jaguar oil tanker during the standoff Credit: East2West\n\n10 Nato issued a stern warning to the tanker crew Credit: east2west\n\n10\n\nThe tanker called Jaguar was draped in the Gabon flag, but Britain sanctioned it on Friday - accusing it of being a Russian pawn.\n\nNato aircraft - including Polish MiG-29s - were scrambled when the vessel refused to cooperate.\n\nIn response, Russia scrambled a Su-35S fighter jet which is said to have violated Estonian airspace as it stormed in to cover for the fleeing Jaguar.\n\nThe spectacular clash came ahead of crunch direct talks between Russia and Ukraine - where Vladimir Putin snubbed Zelenksy's challenge to meet him in-person.\n\nIn dramatic footage, the Polish Nato plane can be seen tailing the Russian Su-35 in a dogfight over the Gulf of Finland - part of the Baltic Sea.\n\nA Russian voice on the bridge of the tanker goaded the Estonians, calling them “clowns” as they tried and failed to board.\n\nThe tanker ultimately anchored near Gogland Island - controlled by Russia - in the eastern Baltic Sea.\n\nFootage shows the high drama in one of the most tense regions in the world amid disputes between Russia and Nato over Ukraine.\n\n“This is how we're greeted with helicopters,” said a voice -apparently Russian - on the tanker. \"They're demanding we anchor.”\n\nA message is heard saying: “This is Estonian warship Papa 6732.\n\nSatellite pics show Putin on the march as Russia masses troops 35 miles from Nato border with 2k soldiers & helicopters\n\n“Your request will be denied.\n\n“Follow my instructions. Immediately change course to 105. Over.”\n\nA voice from the tanker in Hindi says: “That looks like our drone in front….”\n\nA Russian voice demands: “Go on, hit it running….”\n\nReferring to the Estonians, he says: “What a bunch of clowns!”\n\nThe Estonian vessel comes close to the tanker seeking to swerve it to the right.\n\nAn Estonian A139 helicopter and an M-28 Skytruck plane of the Estonian defence forces were seen circling the vessel.\n\n10 The Jaguar oil tanker flying a Gabon flag, thought to be part of Russia's shadow fleet Credit: East2West\n\n10 The Russian boat wasn't happy at the sight of Nato choppers Credit: East2West\n\n10 The Russian tanker crew goaded the Estonian helicopter forces Credit: East2West\n\n10 An Estonian war ship tried to divert the Jaguar tanker Credit: East2West\n\nBoasting a success against the West, pro-Kremlin news outlet Izvestia reported: “Despite this show of force, the Estonian authorities were unable to stop the vessel.\n\n“The Jaguar ultimately reached Gogland Island, a Russian-controlled territory in the Gulf [of Finland], and resumed its route to Primorsk”.\n\nRussian outlet News-Pravda reported, “Sailors from the Baltic Republic [Estonia] twice tried to land troops from a helicopter.”\n\nAfter the extraordinary clash, Nato state Estonia summoned the Russian Chargé d'Affaires in Tallinn, Lenar Salimullin, who was handed a note of protest, accusing the Putin warplane of violating the republic's airspace.\n\nEstonian Foreign Minister Margus Tsahkna said: \"From Estonia's point of view, this is a very serious and regrettable incident that is in no way unacceptable.\"\n\nLatest on the peace talks DIRECT peace talks between Russia and Ukraine are due on Thursday - for the first time since March 2022, a month into the invasion. The talks were suggested by Putin himself in response to demands for him to agree to a 30-day ceasefire from world leaders. Zelensky challenged Putin to meet him in person in Istanbul on Thursday - and Donald Trump even suggested he could join. But, at the eleventh hour, Russia announced Putin would snub the meeting. A short time later, the US said that Trump would stay away as well. On Thursday, Zelensky arrived in the Turkish capital Ankra to meet President Erdoğan. Meanwhile, Nato officials gathered in Istanbul ahead of the talks. In a twist, Trump suggested that he might fly to Turkey on Friday - and join the talks if they were still rumbling on. Putin's absence will fuel the belief that he is not actually interested in ending the war - as Zelensky has said many times. The Ukrainian leader wasted no time in slamming Putin's decision.\n\nHe demanded that Russia \"must face tougher, faster sanctions\" .\n\nThe tanker had been near Naissaar Island, off Tallinn, when the Estonian Navy communicated with it by radio at 15:30 GMT on Tuesday, said Commander Ivo Vark.\n\nHe added that it was was sailing \"without a nationality” and Estonia \"had an obligation to verify the vessel's documents and legal status\".\n\n\"The vessel denied cooperation and continued its journey toward Russia [...] given the vessel's lack of nationality, the use of force, including boarding the vessel, was deemed unnecessary.”\n\n10 Russia continues to send devastating missiles into Ukraine Credit: AP\n\n10 The aftermath of a Russian firestorm on the Sumy region of Ukraine this week Credit: AP\n\nEstonia escorted it until the vessel reached Russian waters.\n\nEstonian Defence Minister Hanno Pevkur said the ship was sent from Estonian to Russian territorial waters to prevent a threat to his country’s critical infrastructure.\n\nHe said: \"The issue was the ship's flag state, and our most important goal was to ensure the security of critical infrastructure. This was achieved.\"\n\nThe 800-ft long Jaguar is a crude oil tanker reportedly sailing under the flag of Gabon.\n\nThe Equasis database suggested the ship changed its name and flag state at the beginning of February.\n\nAccording to this data its name is now Argent and its flag state is Guinea-Bissau.\n\nPutin uses a vast network of non-Russian tankers - called a shadow fleet - to avoid oil sanctions."
    },
    {
        "title": "Is the secret CIA songwriting group behind one of the great cold war conspiracy theories Ireland’s secret Eurovision weapon?",
        "description": "Voters can give two Eurovision fingers to Putin by voting for Ireland's Russia space dog song",
        "content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\nVladimir Putin is not much of a music aficionado by all accounts.\nOther than once singing Blueberry Hill at... [3721 chars]",
        "url": "https://www.irishmirror.ie/news/news-opinion/ireland-eurovision-entry-emmy-cia-35228686",
        "image": "https://i2-prod.irishmirror.ie/incoming/article35222769.ece/ALTERNATES/s1200/1_GettyImages-464441975-1.jpg",
        "publishedAt": "2025-05-15T09:43:33Z",
        "source": {
            "name": "Irish Mirror",
            "url": "https://www.irishmirror.ie"
        },
        "full_content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\n\n\n\nVladimir Putin is not much of a music aficionado by all accounts.\n\nOther than once singing Blueberry Hill at a charity event and declaring he likes “Russian music”, there is little on record about him having much interest.\n\nIt does make me wonder, does his hostility stem from losing the Cold War?\n\nPutin has declared the collapse of the old Soviet Union after the fall of the Berlin Wall to be the great tragedy of the 20th Century.\n\nHe has been very busy trying to reverse that tragedy by any means necessary since coming to power, most notably by rolling his tanks into Ukraine.\n\nWhat’s that got to do with rock 'n' roll you ask? Well only perhaps the greatest spy conspiracy ever told.\n\nIn the late 1980s, German rockers Scorpion had a monster hit with their ‘haunting ballad’, Winds of Change.\n\nIt became the anthem of a generation across the old Soviet and eastern European bloc just as real winds of change were beginning to shake the Berlin Wall and blow open the Iron Curtain.\n\nBut in 2020, a podcast revealed the mind-blowing conspiracy that the tune was allegedly penned by a secret song-writing unit embedded deep in the CIA, as a soundtrack to encourage revolution.\n\nScorpions’ frontman Klaus Meine has always denied his greatest smash hit was written by anyone other than himself and the band. Well he would, wouldn’t he?\n\nBut if there was a secret rock’n’roll wing to the CIA that helped bring down the old Soviet Union, wouldn’t now be as good a time as any to get the band back together?\n\nStrangely, into this moment in history – just as Putin’s nostalgia for the old days is peaking - steps Ireland’s Eurovision entry, Emmy.\n\n(Image: Andres Poveda PHOTOGRAPHY LTD)\n\nWith a song challenging the myths about Soviet prowess and invincibility, could Laika Party be the Winds of Change for a new generation?\n\nThe song is all about a Moscow street mongrel named Laika that was sent on a one-way ticket to space oblivion aboard the USSR’s Sputnik II rocket in 1957.\n\nThe western press dubbed the mission at the time “Muttnik”, proving it was the golden age of puns as well as space exploration.\n\nIn what would become a forerunner of Vlad’s disinformation campaigns, it took 45 years for the Russians to admit the truth of Laika’s demise - that she died of overheating in a malfunctioning Sputnik capsule.\n\nSo rather than being the first hero of the space race, Laika was actually sacrificed as cannon fodder on the altar of bungling Soviet hubris and imperialism.\n\nThat makes Ireland’s Eurovision entry - which reimagines a defiant Laika having survived and giving two paws to her old Soviet masters as she continues to orbit the earth - as subversive in its own way as that Scorpion’s Cold War anthem.\n\nEurovision has always been part of the great geopolitical power struggle anyway.\n\nRussia remains banned. Israel is facing calls for a boycott. Neighbours have settled trade wars and border disputes with the awarding of their ‘Douze Points’.\n\n(Image: GETTY)\n\nOn the frontlines in Ukraine, Laika Party can remind Russian conscripts how their masters really treat the rank and file.\n\nAnd across Europe, the song can be a rallying call of defiance to Vlad’s dream of rebuilding the Soviet empire.\n\nWhich does make you wonder about whether those old CIA hitmakers have come back for an encore to help Ireland’s Eurovision bid.\n\nThey would certainly know that their new commander in chief in the White House loves a good bit of canine propaganda (“they’re eating the dogs!”)\n\nAnd if the youth of Europe adopt Laika as their Eurovision winner, they can still save her from the sad fate of being boiled alive in that sputnik space capsule.\n\nThey can ensure she keeps orbiting the earth, partying on in cyberspace to viral infinity and beyond!\n\nSubscribe to our newsletter for the latest news from the Irish Mirror direct to your inbox: Sign up here."
    },
    {
        "title": "Sanctions threat hikes up pressure in game of Ukraine ceasefire tennis",
        "description": "Europe letter: Crippling economic sanctions on Russia a key bargaining chip for Kyiv in any truce talks",
        "content": "Ask most European leaders and they will tell you the same thing: the ball is in Russia‘s court.\nRussian leader Vladimir Putin and Ukrainian president Volodymyr Zelenskiy have been locked in a game of metaphorical ceasefire tennis for weeks as each tr... [4557 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/15/sanctions-threat-hikes-up-pressure-in-game-of-ukraine-ceasefire-tennis/",
        "image": "https://www.irishtimes.com/resizer/v2/NX5WDUCGCNEJVOOX6M7BUQDUV4.jpg?smart=true&auth=5c25015c8f722623d6e8ae9abadad062d59e0b76811b005aad867c464b12dc51&width=1200&height=630",
        "publishedAt": "2025-05-15T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/15/sanctions-threat-hikes-up-pressure-in-game-of-ukraine-ceasefire-tennis/"
    },
    {
        "title": "Ukraine-Russia peace talks in Turkey: What we know",
        "description": "Ukraine and Russia are close to reviving direct peace talks for the first time since the last face-to-face discussions ended three years ago.",
        "content": "Ukraine and Russia are set to go into their first direct talks in more than three years this morning.\nUkraine's President Volodymyr Zelensky had challenged Russian President Vladimir Putin to meet him in person in Istanbul, but the Russian delegation... [3732 chars]",
        "url": "https://www.rte.ie/news/ukraine/2025/0515/1512964-ukraine-russia-peace-talks-in-turkey-what-we-know/",
        "image": "https://www.rte.ie/images/002284e9-1600.jpg",
        "publishedAt": "2025-05-14T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/ukraine/2025/0515/1512964-ukraine-russia-peace-talks-in-turkey-what-we-know/"
    },
    {
        "title": "Putin spurns Zelensky meeting but lower-level Ukraine-Russia talks are still on",
        "description": "Ukrainian President Volodymyr Zelensky said the Russian delegation does not include ‘anyone who actually makes decisions’.",
        "content": "Russia and Ukraine are set to hold their first direct peace talks in three years, both countries said, but hopes for a breakthrough remained dim after Russian President Vladimir Putin spurned an offer by Ukrainian President Volodymyr Zelensky to meet... [8574 chars]",
        "url": "https://www.breakingnews.ie/world/putin-spurns-zelensky-meeting-but-lower-level-ukraine-russia-talks-are-still-on-1763253.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTUxNjE4NTlcXFwvZTQ3NTM2NjEyZjFiNDBhYzhhMDAxZmQ3ZGYxZjA2MzYtNi5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjE3MTU2MTM2OGIyMWU5ODMyODhmZTQwODcxODcwODc2ZTM3NWM1ZmYifQ==/putin-spurns-zelensky-meeting-but-lower-level-ukraine-russia-talks-are-still-on.jpg",
        "publishedAt": "2025-05-14T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russia and Ukraine are set to hold their first direct peace talks in three years, both countries said, but hopes for a breakthrough remained dim after Russian President Vladimir Putin spurned an offer by Ukrainian President Volodymyr Zelensky to meet face-to-face in Turkey.\n\nMr Zelensky said he is sending a team headed by his defence minister from the Turkish capital Ankara to Istanbul to meet a Russian delegation, even though Moscow’s side does not include “anyone who actually makes decisions”.\n\nAdvertisement\n\nFew had expected Mr Putin to show up in Turkey, and his absence punctured any hope of significant progress in efforts to end the three-year-old war that was given a push in recent months by the Trump administration and Western European leaders.\n\n\n\nUkrainian President Volodymyr Zelensky talks to journalists as he arrives at Esenboga airport in Ankara, Turkey (Evgeniy Maloletka/AP)\n\nIt also raised the prospect of intensified international sanctions on Russia that have been threatened by the West.\n\nMr Zelensky, speaking to reporters in Ankara where he flew on Thursday after challenging Mr Putin to sit down with him, accused Moscow of not taking efforts to end the war seriously by sending a low-level negotiating team that he described as “a theatre prop”.\n\nHis proposal to Mr Putin came after a flurry of manoeuvring last weekend as each side sought a diplomatic advantage.\n\nAdvertisement\n\nThe head of the Russian delegation, presidential aide Vladimir Medinsky, said in Istanbul the representatives were ready to meet Ukrainian officials.\n\n“The task of these direct negotiations with Ukraine is to establish long-term peace sooner or later by eliminating the root causes of this conflict,” he said in a brief statement.\n\nIt was not clear when they would meet.\n\nMr Medinsky said late on Thursday that the Russian delegation would be waiting for Ukrainian officials at 10am on Friday.\n\nAdvertisement\n\n\n\nTurkish President Recep Tayyip Erdogan, right, shakes hands with his Ukrainian counterpart Volodymyr Zelensky during their meeting at the presidential palace in Ankara (Turkish Presidency via AP)\n\nUS secretary of state Marco Rubio said he would confer on Friday in Istanbul with Turkish foreign minister Hakan Fidan and the Ukrainian delegation, adding that the Russian delegation would be meeting with other members of the US team and that he hoped all sides could get together.\n\n“We don’t have high expectations of what will happen tomorrow. And frankly, at this point, I think it’s abundantly clear that the only way we’re going to have a breakthrough here is between President Trump and President Putin,” Mr Rubio told reporters in Antalya, Turkey, where he was attending a Nato foreign ministers meeting.\n\nMr Zelensky, who is heading on Friday to a gathering of European officials in Albania, said he had decided to send the delegation to Istanbul to demonstrate to US President Donald Trump that Ukraine wants to end the fighting.\n\nHe said the Ukrainian side would be headed by defence minister Rustem Umerov and its aim is “to attempt at least the first steps toward de-escalation, the first steps toward ending the war – namely, a ceasefire”.\n\nAdvertisement\n\nTurkish President Recep Tayyip Erdogan earlier welcomed Mr Zelensky with an honour guard at the presidential palace in Ankara before the two held talks.\n\nThe war has killed tens of thousands of soldiers on both sides and more than 12,000 Ukrainian civilians, according to the UN, and continues along the roughly 1,000-kilometre (620-mile) front line.\n\nRussian forces are preparing a fresh military offensive, Ukrainian government and Western military analysts say.\n\nAt least five civilians were killed and 29 injured in the past day, according to authorities in five eastern regions of Ukraine where Russia’s army is trying to advance.\n\nAdvertisement\n\n\n\nUkrainian President Volodymyr Zelensky, centre left, is welcomed by Turkish officials upon his arrival at Esenboga airport in Ankara, Turkey (Evgeniy Maloletka/AP)\n\nThe diplomatic manoeuvring began on Saturday when European leaders met Mr Zelensky in Kyiv and urged the Kremlin to agree to a full, unconditional 30-day ceasefire as a first step towards peace.\n\nMr Putin responded early on Sunday by proposing direct talks with Ukraine in Istanbul.\n\nThen came Mr Zelensky’s challenge to Mr Putin for face-to-face talks.\n\nAfter days of silence, Kremlin spokesman Dmitry Peskov finally said on Thursday that Mr Putin had no plans to travel to Istanbul in the next few days.\n\nMr Trump said he was not surprised that Mr Putin was a no-show.\n\nThe US president had pressed for Mr Putin and Mr Zelensky to meet but brushed off Mr Putin’s apparent decision not to attend.\n\n“I didn’t think it was possible for Putin to go if I’m not there,” Mr Trump told reporters at a meeting with business executives in Doha, Qatar, on the third day of his visit to the Middle East.\n\nMr Trump said a meeting between him and Mr Putin was crucial to break the deadlock.\n\n\n\nPresident Donald Trump smiles backdropped by an MQ-9 Reaper drone before addressing military personnel at the Al Udeid Air Base in Doha, Qatar (Alex Brandon/AP)\n\n“I don’t believe anything’s going to happen whether you like it or not, until (Putin) and I get together,” he said on Air Force One while travelling from Doha to Abu Dhabi, the capital of the United Arab Emirates.\n\n“But we’re going to have to get it solved because too many people are dying.”\n\nMr Peskov said Mr Putin has no plans to meet with Mr Trump in the coming days.\n\nMr Medinsky is leading the Russian team that also includes three other senior officials, the Kremlin said.\n\nMr Putin also appointed four lower-level officials as “experts” for the talks in Istanbul.\n\nAlso absent from the talks were Russian foreign minister Sergey Lavrov and Mr Putin’s foreign policy adviser Yuri Ushakov, both of whom represented Russia at the talks with the US in Saudi Arabia in March.\n\n\n\nRussian President Vladimir Putin at the Kremlin in Moscow, Russia (Alexander Kryazhev, Sputnik, Kremlin Pool Photo via AP)\n\nThe top-level Ukrainian delegation included Mr Umerov, foreign minister Andrii Sybiha and the head of the Ukrainian presidential office Andriy Yermak, a Ukrainian official said.\n\nMr Zelensky will sit at the negotiating table only with Mr Putin, said presidential adviser Mykhailo Podolyak.\n\nMr Putin met on Wednesday evening with senior government officials and members of the delegation in preparation for the talks, Mr Peskov said.\n\nDefence minister Andrei Belousov, General Staff chief Valery Gerasimov and National Security Council secretary Sergei Shoigu also attended.\n\nThe Kremlin billed Thursday’s talks as a “restart” of peace negotiations that were held in Istanbul in 2022 but quickly fell apart.\n\nMoscow accused Ukraine and the West of wanting to continue fighting, while Kyiv said Russia’s demands amounted to an ultimatum rather than something both sides could agree on.\n\n\n\n\n\nRussia’s delegation then was also headed by Mr Medinsky.\n\nMr Putin’s proposal came after more than three months of diplomacy kickstarted by Mr Trump, who promised during his campaign to end the devastating war swiftly – though it has been hard to pull off.\n\nThe Trump administration in recent weeks indicated that it might walk away from the peace effort if there was no tangible progress soon.\n\nMr Sybiha met with US state secretary Marco Rubio and Senator Lindsey Graham on Wednesday night in the Turkish city of Antalya, which is hosting Nato foreign ministers to discuss new defence investment goals as the US shifts its focus to security challenges away from Europe.\n\nMr Sybiha reaffirmed Ukraine’s support for Mr Trump’s mediation efforts and thanked the US for its continued involvement, urging Moscow to “reciprocate Ukraine’s constructive steps” towards peace.\n\n“So far, it has not,” Mr Sybiha said.\n\n\n\n\n\nOn Thursday morning, Mr Sybiha also met with other European foreign ministers, including his French counterpart Jean-Noel Barrot, who in a post on X reiterated the call for a ceasefire and the threat of “massive sanctions” if Russia does not comply.\n\n“We’re in a very difficult spot right now, and we hope that we can find the steps forward that provide for the end of this war in a negotiated way and the prevention of any war in the future,” Mr Rubio said on Thursday.\n\nBritish Prime Minister Sir Keir Starmer accused Mr Putin of “standing in the way of peace”.\n\n“There was only one country that started this conflict – that was Russia. That was Putin. There’s only one country now standing in the way of peace – that is Russia, that is Putin,” he said in a visit to Tirana, Albania.\n\nMr Barrot echoed that sentiment, saying: “In front of Ukrainians there is an empty chair, one that should have been occupied by Vladimir Putin.\n\n“Vladimir Putin is dragging his feet and in all evidence does not want to enter into these peace discussions.”"
    },
    {
        "title": "Rubio and other Nato diplomats to meet ahead of possible Ukraine-Russia talks",
        "description": "Ukrainian President Volodymyr Zelensky remains keen on Ukraine joining Nato.",
        "content": "US secretary of state Marco Rubio and his Nato counterparts meet in Turkey on Thursday to prepare a pivotal summit of alliance leaders next month that will set the course for future European security as America focuses on challenges elsewhere.\nThe me... [5435 chars]",
        "url": "https://www.breakingnews.ie/world/rubio-and-other-nato-diplomats-to-meet-ahead-of-possible-ukraine-russia-talks-1763061.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTUwNDU0MjhcXFwvMzE0MWI5ZGIzMzhlNDI0YTgwY2I2ZjUxMWVkNzY0ZTMuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiIwMzJhYTMyYTI1OGRlODNlMjkwOTRkYjIxZTY4NTQzY2E5Mjk1NTgyIn0=/rubio-and-other-nato-diplomats-to-meet-ahead-of-possible-ukraine-russia-talks.jpg",
        "publishedAt": "2025-05-14T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "US secretary of state Marco Rubio and his Nato counterparts meet in Turkey on Thursday to prepare a pivotal summit of alliance leaders next month that will set the course for future European security as America focuses on challenges elsewhere.\n\nThe meeting in the Mediterranean coastal city of Antalya comes amid a flurry of negotiations aimed at producing a ceasefire agreement between Russia and Ukraine, including talks in Istanbul that Mr Rubio and president Donald Trump’s special envoy Steve Witkoff plan to attend on Friday.\n\nAdvertisement\n\nMr Rubio and Mr Witkoff are coming to Turkey after accompanying Mr Trump on portions of his trip to Gulf Arab countries.\n\nOn the sidelines of the Nato meeting, Ukrainian foreign minister Andrii Sybiha met on Wednesday with Mr Rubio, who also is having separate talks with new German foreign minister Johann Wadephul and foreign minister Hakan Fidan of Turkey, whose country is trying to help broker a deal that might end the more than three-year-old war.\n\nMr Sybiha and Mr Fidan on Wednesday discussed efforts to establish a ceasefire and steps toward securing a lasting peace with Russia, according to the Turkish foreign ministry.\n\nThe same day that Nato foreign ministers gather, Ukrainian President Volodymyr Zelensky is set to meet with Turkish President Recep Tayyip Erdogan in Ankara. It is an open question whether Mr Trump or Russian President Vladimir Putin will participate on Thursday.\n\nAdvertisement\n\n\n\nUkrainian President Volodymyr Zelensky (Evgeniy Maloletka/AP)\n\nMr Trump teased a possible visit to Istanbul while flying from Saudi Arabia to Qatar on Wednesday, but there was no immediate indication that his travel plans would change.\n\n“He’d like me to be there, and that’s a possibility,” Mr Trump said, referring to Mr Putin. “I don’t know that he would be there if I’m not there. We’re going to find out.”\n\nMr Zelensky has been pushing for direct talks with Russia but only if Mr Putin attends. Mr Putin, who has rebuffed previous such calls, has been coy and has not committed to a meeting.\n\nThe Kremlin on Wednesday said Mr Putin’s aide, Vladimir Medinsky, will head the Russian delegation, which also will include deputy defence minister Alexander Fomin, deputy foreign minister Mikhail Galuzin and Igor Kostyukov, chief of the General Staff’s main directorate. The list did not include Mr Putin himself.\n\nAdvertisement\n\nMr Zelensky also remains keen on Ukraine joining Nato, which Russia has adamantly rejected and Mr Trump appears to have agreed with. So even with a Ukrainian presence in Antalya, it appeared unlikely there would be any decisions made about Ukraine’s future, or lack thereof, in the military alliance.\n\nOf greater concern to the US is money, with the Trump administration saying it wants to hear how European members of Nato and Canada plan to boost their national defence investments to 5% of gross domestic product.\n\nIn 2023, as Russia’s full-scale war on Ukraine entered its second year, Nato leaders agreed to spend at least 2% of GDP on national defence budgets. So far, 22 of the 32 member countries have done so.\n\nThe leaders will set a new goal at a summit in The Hague on June 25. Mr Trump insists that US allies should commit to spending at least 5% to be ready to defend themselves, but that would require investment at an unprecedented scale.\n\nAdvertisement\n\nMr Trump has cast doubt over whether the US would defend allies that spend too little. The US was projected to have spent 3.38% last year, Nato figures show, the only ally whose spending has dropped over the last decade.\n\nAsked last month whether the US would match the 5% target, Mr Rubio said: “Sure. We’re heading there now.”\n\n\n\nIt is an open question whether Donald Trump will participate in ceasefire talks on Thursday (Alex Brandon/AP)\n\n“Make no mistake, this ministerial is going to be different,” US envoy to Nato Matthew Whitaker said this week, adding: “5% is not just a number, it is a necessity for our security. The alliance is facing significant threats.”\n\nHe did not outline those threats. Nato leaders insisted at their summit last year that “Russia remains the most significant and direct threat to Allies’ security”, but some countries are uneasy about Mr Trump re-engaging with Mr Putin.\n\nAdvertisement\n\nMr Fidan, the Turkish foreign minister who is hosting the meeting, is expected to express Turkey’s commitment to strengthening Nato and call for the inclusion of Nato allies that are not European Union members — such as Turkey — into European security and defence initiatives, according to Turkish officials.\n\nMr Fidan also would advocate a comprehensive, “360-degree security” approach focusing not only on ending the Russia-Ukraine war but also on stability in the Middle East and regions adjacent to Nato members, the officials said.\n\nMeanwhile, the defence spending plan under consideration appears to be for all allies to aim for 3.5% of GDP on “hard military spending by 2032”, and an extra “1.5% related spending (on) infrastructure, cybersecurity and things like that. Also achievable by 2032,” according to the Dutch government.\n\nWhile the two figures add up to 5%, factoring in infrastructure and cybersecurity would change the basis on which Nato traditionally calculates defence spending. The seven-year time frame is also short by the alliance’s usual standards.\n\nMr Whitaker, the US Nato ambassador, appeared this week to confirm the plan, saying it “also includes things like mobility, necessary infrastructure, cybersecurity”.\n\n“It is definitely more than just missiles, tanks and howitzers,” he said.\n\nIt is difficult to see how many allies might reach even 3.5% of GDP. The meeting in Turkey may provide more clarity."
    },
    {
        "title": "Cannibal serial killer who ate his victims pardoned and freed from jail",
        "description": "Denis Gorin, 45, from the town of Aniva in the Sakhalin region of Russia, was sentenced in 2018 to 22 years in a penal colony for the murder and cannibalism of a man in 2012",
        "content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\nA serial killer, who turned cannibal and was injured while fighting for Russia in the Ukraine war, has been... [7711 chars]",
        "url": "https://www.irishmirror.ie/news/world-news/cannibal-serial-killer-who-ate-35213278",
        "image": "https://i2-prod.irishmirror.ie/news/world-news/article35213276.ece/ALTERNATES/s1200/0_Denis-Gorin-4-East2west-News.jpg",
        "publishedAt": "2025-05-14T06:00:00Z",
        "source": {
            "name": "Irish Mirror",
            "url": "https://www.irishmirror.ie"
        },
        "full_content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\n\nA serial killer, who turned cannibal and was injured while fighting for Russia in the Ukraine war, has been granted a presidential pardon in exchange for his military service. However, it's believed he'll be looking over his shoulder for the rest of his life as the families of his victims now have an opportunity for revenge.\n\nDenis Gorin, 45, hailing from the town of Aniva in Russia's Sakhalin region, was sentenced to 22 years in a penal colony in 2018. This sentence was handed down after Gorin stabbed a man to death and then consumed some of his victim's flesh.\n\nIn early 2023, while still in the penal colony, Gorin signed up with a private military company (PMC) and was deployed to Ukraine to participate in Russia's invasion of the country.\n\nGorin served in the ranks of Storm-Z and was injured during a battle. Following this, President Putin pardoned him, allowing Gorin to return as a free man to his hometown.\n\nThis move sparked widespread outrage across Russia and ignited a heated debate about the morality of authorities pardoning criminals for their participation in the war, reports the Mirror US.\n\nBy all accounts, Gorin started his life on the right track and was well-regarded by locals who knew him growing up. He wasn't known to engage in any criminal activities or aggressive behaviour and appeared to be a trusted member of the community.\n\nHowever, after finishing high school, he got married and had two children, which he found difficult to provide for. Financial difficulties began to plague the family due to Gorin's lack of further education.\n\nIn the early 2000s, Gorin turned to alcohol and ended up living on the streets.\n\n(Image: Denis Gorin/ east2west news)\n\nIn late 2002, at the age of 23, he committed his first known murder. The victim was someone he knew, and Gorin was arrested shortly afterwards and charged with murder and desecration of a corpse.\n\nDuring his trial, Gorin revealed that after killing the victim, he removed and consumed the soft tissues from the body, claiming he did so under threat from his brother Yevgeny. As reported by the New York Post, Yevgeny, who was an accomplice, allegedly threatened to kill him if he didn't eat part of the victim.\n\nOn March 6, 2003, Gorin was handed a sentence of nine years and 11 months in a strict regime colony, serving his time at an undisclosed location in the Irkutsk Oblast. After seven years, he was released on parole on April 19, 2010, and returned to Aniva, where he continued his life on the streets for the next few years.\n\nDuring this time, Gorin was jobless, making money through odd jobs and theft, spending most of his time among other homeless people and alcoholics. It is reported that Denis then acted with the help of his brother Yevgeny, committing several more murders in his hometown.\n\nIn June 2011, the Gorin brothers were incensed upon discovering that their nephew had been mistreated by an acquaintance. They stormed the apartment to confront the man, who was absent.\n\nInstead, they brutally assaulted a young man, unconnected to their nephew's incident, until he lost consciousness. Seizing the opportunity, Denis slit the victim's throat.\n\nThe brothers then transported the body to the Lyutoga River bank, where it was buried in a shallow grave. The victim's remains stayed concealed until they were unearthed in spring 2012.\n\nThe brothers' next act of murder occurred on the night of 14–15 January 2012. During a visit to a local store, they clashed with an acquaintance, whom Denis proceeded to stab approximately 30 times with a knife.\n\nThe man later succumbed to his injuries.\n\nOn the same day, the murderer was apprehended by the police and promptly confessed. On 27 February 2013, he was found guilty of both murders and sentenced to 20 years and 10 months in prison.\n\nHis brother Evgeniy didn't live to witness the trial; he died under mysterious circumstances while detained at a temporary detention centre in Aniva in mid-2012.\n\n(Image: AP)\n\nFollowing his trial, Gorin was moved to a penal colony. However, in June 2017, he reached out to the Sakhalin Oblast Prosecutor's Office and confessed to an unsolved murder, leading to his return to Aniva for testimony.\n\nAccording to Gorin, this additional killing took place on 21 November 2010, with the victim being another acquaintance named Alexander. This confession brought Gorin's murder count to four, solidifying his status as a serial killer.\n\nDenis, Alexander's brother, had been held at a temporary detention centre from 25 February to 6 March 2003, a period during which Gorin was also present. While sharing drinks, Gorin recounted a story that amused him about a time when he and Denis were both in the detention centre.\n\nAlexander, who was drunk, had attempted to deliver a parcel to his brother but was arrested for disorderly conduct due to his visible intoxication. The story seemed to irritate Alexander, leading to a heated argument and subsequent separation.\n\nLater that same night, after attending his ex-wife's birthday party, a drunken Gorin decided to visit Alexander's house to settle their earlier disagreement. Instead of resolving their issues, they continued to argue, culminating in Gorin grabbing a knife and stabbing Alexander twice in the chest.\n\nAfter Alexander's death, Gorin gruesomely cut off pieces of the man's biceps, calves, and thighs, which he chillingly proceeded to eat. He then dragged the lifeless body to the old familiar Lyutoga River, where he undressed it, picked it up, and hauled it into the water.\n\nGorin pulled the body a significant distance from the shore before discarding it. He then returned to his ex-wife's birthday party, as if nothing had happened.\n\nDespite leaving for approximately 35–40 minutes, apparently nobody had noticed Gorin's absence during this time.\n\nWhen quizzed about why he ate parts of his victim's remains, Gorin simply explained that he had developed a taste for human flesh after committing his first murder back in 2002. In the months following, however, he recanted his testimony and claimed that the police had tortured him into confessing.\n\nDespite his claims, the overwhelming amount of evidence proved that he had indeed committed the murder, and on June 27, 2018, Gorin was handed a 22-year prison sentence. He managed to avoid receiving life imprisonment due to his initial confession and cooperation with law enforcement, before he was even given time served by the district court.\n\nWith these factors taken into account, he was scheduled for release in 2032.\n\nThe actual number of victims a cannibal has claimed remains hotly contested, with some neighbours buzzing that he boasted about killing upwards of 13 people. The man's wartime exploits add further murkiness to the tally.\n\n\"Dmitri,\" a neighbour, chillingly recounted how, upon his 2012 arrest, cops flung open a fridge to discover stacks of human flesh, prepped for consumption.\n\n\"Dmitri\" spilled more beans: the two brothers once tried offing another local in boozy violence, and Denis had hauled him to a hole purportedly crammed with 12 corpses' remnants. The neighbour reckoned this pit held a clutch of skeletons including what looked like a little girl's.\n\nThe bobbies have kept mum, leaving everyone guessing if they dug deeper into these sinister tales. Hence, Gorin's kill count might be vastly underrated.\n\n\"The other murders could not be proved in court,\" Dmitri weighed in. \"They considered only those killings to which Gorin and his brother had confessed themselves.\"\n\nBut Dmitri ominously forecasted a grizzly fate for Gorin.\n\n\"The victims have many relatives in Aniva and in South-Sakhalinsk. Something tells me that Gorin won't be walking free for long,\" a neighbour remarked. \"If the authorities cannot guarantee a punishment, family members will take matters into their own hands. What else is there to do?\"."
    },
    {
        "title": "Military axis of Russia, China and North Korea will test what the West stands for",
        "description": "Issue of migration – especially economic migration disguised as asylum-seeking – is a growing issue for the political viability of the EU",
        "content": "Chinese president Xi Jinping with Russia's Vladimir Putin at a parade in Moscow earlier this month marking the 80th anniversary of the end of the second World War. Photograph: RIA Novosti via AP\n“Up Periscope”. We are all familiar with these words fr... [5185 chars]",
        "url": "https://www.irishtimes.com/opinion/2025/05/14/military-axis-of-russia-china-and-north-korea-will-test-what-the-west-stands-for/",
        "image": "https://www.irishtimes.com/resizer/v2/MUB5TGDW2ZHTHEVZFEJABN6VEU.jpg?smart=true&auth=f7e60e1795254820f258963c0d6421428e1897f1f89715322f0fd47396a7a5e7&width=1200&height=630",
        "publishedAt": "2025-05-14T05:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/opinion/2025/05/14/military-axis-of-russia-china-and-north-korea-will-test-what-the-west-stands-for/"
    },
    {
        "title": "Trump not attending talks as Putin not among delegation",
        "description": "US President Donald Trump is not going to Turkey tomorrow to join talks between Russia and Ukraine aimed ending the war, a US official has said.",
        "content": "US President Donald Trump is not going to Turkey tomorrow to join talks between Russia and Ukraine aimed ending the war, a US official has said.\nThe official spoke after Russian President Vladimir Putin announced the Russian delegation for the talks,... [5163 chars]",
        "url": "https://www.rte.ie/news/ukraine/2025/0514/1512779-ukraine-russia-talks/",
        "image": "https://www.rte.ie/images/002215a6-1600.jpg",
        "publishedAt": "2025-05-13T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/ukraine/2025/0514/1512779-ukraine-russia-talks/"
    },
    {
        "title": "Will Putin chicken out? Ukraine piles on pressure on Vlad to meet Zelensky as Russia stays deathly silent on showdown",
        "description": "UKRAINE is now piling the pressure on Russia as Vladimir Putin stays silent on his own offer to meet for peace talks on Thursday.Moscow's bungle has s",
        "content": "UKRAINE is now piling the pressure on Russia as Vladimir Putin stays silent on his own offer to meet for peace talks on Thursday.\nMoscow's bungle has seen Volodymyr Zelenksy take up Vlad's offer to for a face-to-face meet in Istanbul for long-awaited... [5639 chars]",
        "url": "https://www.thesun.ie/news/15198964/vladimir-putin-zelensky-talks-istanbul-russia/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/crop-14223653.jpg?1747131633&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-13T09:18:10Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "UKRAINE is now piling the pressure on Russia as Vladimir Putin stays silent on his own offer to meet for peace talks on Thursday.\n\nMoscow's bungle has seen Volodymyr Zelenksy take up Vlad's offer to for a face-to-face meet in Istanbul for long-awaited negotiations between the two leaders.\n\n9 An armoured vehicle carrying drones marches during the WW2 Victory Day parade in Moscow Credit: Alamy\n\n9 Firefighters work at the site of a Russian drone strike in Kyiv Credit: Reuters\n\n9\n\nBut the Kremlin has gone deathly silent as Putin weighs rejecting the offer he sent to the Ukrainians.\n\nZelensky has filled the dead air and now said he will definitely go to Istanbul - but will only meet with his counterpart Putin and not any other members of a Russian delegation.\n\nThe Ukrainian is pressing his diplomatic advantage and says Putin is being “very strangely silent” about his own offer.\n\nZelensky said: \"Russian shelling and assaults continue. Moscow remained silent all day regarding the proposal for a direct meeting. A very strange silence.\n\n\"One way or another, Russia will have to end this war – and the sooner, the better.\"\n\nSome in Russia have responded to the possible talks.\n\nThe deputy speaker of Russia's upper house said Zelensky's proposal to meet Putin was “comedy and spectacle”.\n\nKonstantin Kosachev said Zelensky should \"be afraid\" of meeting Putin.\n\nHe said: “High-level meetings, especially under such difficult circumstances, are absolutely not arranged this way.\"\n\nAnother Putin crony denied there had been an invite in the first place and backtracked over the offer.\n\nPutin unleashes 100 drones on Ukraine after Zelensky calls his bluff\n\nVladimir Dzhabarov, deputy chair of the Federation Council’s foreign affairs committee, said the invite did simply not exist.\n\nHe said: \"Who invited him to Istanbul?\n\n\"Does he really think our president would meet personally with someone who has blood on his hands, who betrayed the memory of the great heroism of both Ukrainians and the entire Soviet people — the heroism of his own grandfather?\n\n\"Who is he, that we should sit down with him at the negotiating table?”\n\n9 Vladimir Putin meets with President of Burkina Faso Ibrahim Traor during VE celebrations Credit: Getty\n\n9 Emmanuel Macron, Keir Starmer, and Voloydmyr Zelensky walk the streets of Kyiv on Saturday Credit: Shutterstock Editorial\n\nTrump has suggested he could join Zelensky and Putin in Istanbul for the talks.\n\nThe US President said on Monday he was considering flying to Istanbul and he had a good feeling about the talks.\n\nThe two leaders are jockeying for favour with Donald Trump - as they try to get the American on their side.\n\nUkraine wants America to keep supporting it in its valiant war, while Moscow wants Washington to cut support and acquiesce to Putin conquering his neighbour.\n\n9 A volunteer soldier with Ukraine's Hercules Territorial Defense Credit: Getty\n\n9 Soldiers parade in Red Square Credit: Pacific Coast News\n\nZelensky said: \"Ukraine would appreciate it if President Trump could be there with us at this meeting in Turkey. This is the right idea. We can change a lot.\"\n\nHe added: \"I will be in Turkey. I hope that the Russians will not evade the meeting.\"\n\nAny meeting would come in the wake of an stern, unified warning to Putin from the leaders of France, Germany, Poland and the UK to sign a 30-day ceasefire agreement or face crippling sanctions.\n\nPutin has said he wants peace, but is continuing to attack Ukraine and launch brutal drone attacks.\n\nWhat is Zelensky’s offer? On Sunday, Volodymyr Zelensky called Putin's bluff and said he would travel to Istanbul for a face-to-face peace talks. Vladimir Putin has always been open to talks - but has not changed his strategic goals away from dismembering Ukraine and replacing its government with a puppet. Putin is yet to reveal whether he will travel or meet directly with his arch rival. That's because Ukraine, the US, and European nations are demanding Russia agree to a 30-day ceasefire as a first step toward peace. Donald Trump has long demanded a quick peace to end the war. But Ukraine and Russia both want to keep fighting and are deftly trying to position themselves to win the favour of Trump. Putin wants to peel America away from supporting Ukraine, while Zelensky needs American weapons and finance to keep fighting Russia. Zelensky wants an immediate pause in fighting saying “we expect a ceasefire from [Monday] – complete and lasting, to provide the necessary basis for diplomacy. \"There is no point in prolonging the killings.\" Trump has put pressure on Zelensky to meet with Putin - even though the Russian leader refused to agree to a ceasefire. He said: “President Putin of Russia doesn’t want to have a Cease Fire Agreement with Ukraine, but rather wants to meet on Thursday, in Turkey, to negotiate a possible end to the BLOODBATH. “Ukraine should agree to this, IMMEDIATELY. “At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the U.S., will know where everything stands, and can proceed accordingly! “I’m starting to doubt that Ukraine will make a deal with Putin, who’s too busy celebrating the Victory of World War ll, which could not have been won (not even close!) without the United States of America. \"HAVE THE MEETING, NOW!!!”\n\nHundreds of suicide bomber drones were launched by Russia at Ukraine over the weekend striking in civilian areas.\n\nSunday's attack came just after a 1am Moscow press conference where Putin dramatically rejected a month-long ceasefire but insisted Russia was ready to resume direct peace talks in Istanbul on Thursday.\n\nZelensky wants an immediate pause in fighting saying “we expect a ceasefire from [Monday] – complete and lasting, to provide the necessary basis for diplomacy.\n\n\"There is no point in prolonging the killings.\"\n\n9 Zelensky has said he will only meet with Putin Credit: Getty"
    },
    {
        "title": "Russia downed Malaysian passenger aircraft in 2014, UN aviation body rules",
        "description": "The shooting down of Malaysia Airlines flight MH17 killed all 298 passengers and crew",
        "content": "Wreckage from Malaysia Airlines flight MH17, which was shot down in 2014 by a missile fired from territory in eastern Ukraine. Photograph: Antonio Bronic\nThe UN’s aviation council ruled on Monday that Russia was responsible for the 2014 downing of Ma... [2792 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/13/russia-downed-malaysian-passenger-aircraft-in-2014-un-aviation-body-rules/",
        "image": "https://www.irishtimes.com/resizer/v2/P364KOLX6LE7QOQYJNN5F3RKL4.jpg?smart=true&auth=1829ac007399ecf2d781634d5603196c5aff9a7fa4eb33343eaa6e47a20e3590&width=1200&height=630",
        "publishedAt": "2025-05-13T05:45:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/13/russia-downed-malaysian-passenger-aircraft-in-2014-un-aviation-body-rules/"
    },
    {
        "title": "Trump offers to join potential Russia-Ukraine talks on Thursday in Istanbul",
        "description": "US president’s surprise offer comes after Zelenskiy says he will travel to meet Putin in Turkey",
        "content": "US president Donald Trump offered on Monday to join prospective Ukraine-Russia talks later this week, sparking a flurry of calls among US and European diplomats.\nMr Trump’s surprise offer to join the talks on Thursday in Istanbul came a day after Ukr... [2875 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/13/russia-ukraine-war-talks-donald-trump/",
        "image": "https://www.irishtimes.com/resizer/v2/A2SIDIQGUIEMTY6AEETUMFKNTI.jpg?smart=true&auth=8d060371cf120c9b3243d26a77cade4ba8dbf723f24fe1936ee626d859172a06&width=1200&height=630",
        "publishedAt": "2025-05-13T05:30:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/13/russia-ukraine-war-talks-donald-trump/"
    },
    {
        "title": "Russia responsible for downing MH17 over Ukraine, global aviation agency finds",
        "description": "The flight, known as MH17, was shot down over Ukraine in 2014 with the loss of 298 lives.",
        "content": "The Council of the International Civil Aviation Organisation says Russia was responsible for shooting down Malaysia Airlines Flight 17 more than a decade ago, in a ruling that raises the prospect of victims’ families being paid compensation.\nThe flig... [2254 chars]",
        "url": "https://www.breakingnews.ie/world/russia-responsible-for-downing-mh17-over-ukraine-global-aviation-agency-finds-1762364.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTMxNTQ5MTBcXFwvNDU2ODE4OTA5YmFhNGU0ZTk1NTZkOTE1MWI4Y2E4NDUtMS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjViMTEwYmFkNTVjOTcwMjNhYmMyZGI0ZWYxNDUzZjg0NWZlMDQwMjgifQ==/russia-responsible-for-downing-mh17-over-ukraine-global-aviation-agency-finds.jpg",
        "publishedAt": "2025-05-12T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "The Council of the International Civil Aviation Organisation says Russia was responsible for shooting down Malaysia Airlines Flight 17 more than a decade ago, in a ruling that raises the prospect of victims’ families being paid compensation.\n\nThe flight, known as MH17, was shot down over Ukraine in 2014 with the loss of 298 lives.\n\nAdvertisement\n\nA Dutch-led international investigation concluded in 2016 that the Amsterdam-to-Kuala Lumpur airliner was shot down on July 17 2014, from Ukrainian territory held by separatist rebels using a Buk missile system delivered from Russia.\n\nMoscow denies any involvement in the MH17 tragedy.\n\nThe Dutch and Australian governments brought the case against Moscow before the Montreal-based global aviation agency in 2022, and on Tuesday welcomed the verdict.\n\n\n\nPresiding judge Hendrik Steenhuis, other trial judges and lawyers view the reconstructed wreckage of Malaysia Airlines Flight MH17 (Peter Dejong/AP, Pool, File)\n\nThe council found that Russia had violated the Convention on International Civil Aviation, known as the Chicago Convention, which requires that states “refrain from resorting to the use of weapons against civil aircraft in flight”.\n\nAdvertisement\n\nIt is the first time that the council, which represents 193 member states, has decided on a dispute between governments.\n\nDutch foreign minister Caspar Veldkamp said that the council would consider the question of reparations within weeks.\n\n“In that context, the Netherlands and Australia are requesting that the ICAO council order the Russian Federation to enter into negotiations with the Netherlands and Australia, and that the Council facilitate this process,” Mr Veldkamp said in a statement.\n\n“The latter is important in order to ensure that the negotiations are conducted in good faith and according to specific timelines, and that they will yield actual results,” he added.\n\nAdvertisement\n\nAustralian foreign minister Penny Wong urged the council to move swiftly to “determine remedies”.\n\n“We call on Russia to finally face up to its responsibility for its horrific act of violence and make reparations for its egregious conduct, as required under international law,” Ms Wong said in a statement.\n\nKremlin spokesman Dmitry Peskov said: “Russia did not take part in the investigation of this incident and therefore we will not accept these biased conclusions.”"
    },
    {
        "title": "Russia responsible for downing MH17",
        "description": "The United Nations aviation agency has blamed Russia for the downing of a Malaysian jetliner over Ukraine in 2014, leading to the deaths of 298 people.",
        "content": "The United Nations aviation agency has blamed Russia for the downing of a Malaysian jetliner over Ukraine in 2014, leading to the deaths of 298 people.\nAustralia and the Netherlands, the countries with most fatalities in the tragedy, quickly called f... [3941 chars]",
        "url": "https://www.rte.ie/news/world/2025/0513/1512531-mh17-un-report/",
        "image": "https://www.rte.ie/images/00228028-1600.jpg",
        "publishedAt": "2025-05-12T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/world/2025/0513/1512531-mh17-un-report/"
    },
    {
        "title": "The Irish Times view on Ukraine-Russia peace talks: keep the pressure on Putin",
        "description": "Talks notwithstanding, European leaders must follow up on their promise to escalate sanctions",
        "content": "(2L/R): Britain's Prime Minister Keir Starmer, Ukraine's President Volodymyr Zelensky, France's President Emmanuel Macron, Germany's Chancellor Friedrich Merz and Poland's Prime Minister Donald Tusk speak as they walk at The Presidential Palace in Ky... [2250 chars]",
        "url": "https://www.irishtimes.com/opinion/editorials/2025/05/12/the-irish-times-view-on-ukraine-russia-peace-talks-keep-the-pressure-on-putin/",
        "image": "https://www.irishtimes.com/resizer/v2/Q7D36BHQEXJGA3WGHK2IB3MMXU.jpg?smart=true&auth=3ac2046beaf3a11ce158c516649c6adf55749a95a5ee592c3396500f6ef6a725&width=1200&height=630",
        "publishedAt": "2025-05-12T19:30:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/opinion/editorials/2025/05/12/the-irish-times-view-on-ukraine-russia-peace-talks-keep-the-pressure-on-putin/"
    },
    {
        "title": "Here's What Happened Today: Sunday",
        "description": "Garda Kevin Flatley killed in road incident in north Dublin, vigil held for two teenagers who died after getting into difficulty while swimming, and calls for a ceasefire between Russia and Ukraine continue.",
        "content": "NEED TO CATCH up? The Journal brings you a round-up of today’s news.\nIRELAND\nIreland's Eurovision act Emmy waves to the fans during the opening ceremony of the 69th Eurovision Song Contest, in Basel, Switzerland. Alamy Stock Photo Alamy Stock Photo\nI... [873 chars]",
        "url": "https://www.thejournal.ie/news-fix-11-05-25-6702208-May2025/",
        "image": "https://img2.thejournal.ie/article/6702208/river/?height=400&version=6702236",
        "publishedAt": "2025-05-11T20:01:06Z",
        "source": {
            "name": "TheJournal.ie",
            "url": "https://www.thejournal.ie"
        },
        "full_content": "NEED TO CATCH up? The Journal brings you a round-up of today’s news.\n\nIRELAND\n\nIreland's Eurovision act Emmy waves to the fans during the opening ceremony of the 69th Eurovision Song Contest, in Basel, Switzerland. Alamy Stock Photo Alamy Stock Photo\n\nINTERNATIONAL\n\nAdvertisement\n\nKashmiri people shop in a market following the ceasefire agreement between India and Pakistan. Alamy Stock Photo Alamy Stock Photo\n\n#CEASEFIRE: US President Donald Trump has called for immediate talks between Ukraine and Russia to negotiate a potential ceasefire agreement as Zelenskyy and Putin agree to restart talks in Turkey.\n\n#CATHOLIC CHURCH: Pope Leo XIV appeared at the central balcony of St Peter’s Basilica this afternoon for his first Sunday blessing and said he is “deeply pained by what is happening” in Gaza.\n\n#KASHMIR: A ceasefire to end the conflict between India and Pakistan was shaken by overnight fighting in the disputed Kashmir region.\n\nPARTING SHOT\n\nIT’S A DAY of rest, and you may be in the mood for a quiet corner and a comfy chair.\n\nIn today’s Sitdown Sunday, we’ve hand-picked some of the week’s best reads for you to savour."
    },
    {
        "title": "Russia-Ukraine ceasefire 'hours away' as Zelensky makes 'personal' Putin vow",
        "description": "Ukrainian President Volodymyr Zelensky will be waiting 'personally' for his Russian counterpart Vladimir Putin after the latter called for the resumption of direct talks",
        "content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\nUkrainian President Volodymyr Zelensky says he \"will be waiting\" for his Russian counterpart Vladimir Putin... [2518 chars]",
        "url": "https://www.irishmirror.ie/news/world-news/russia-ukraine-ceasefire-hours-away-35207971",
        "image": "https://i2-prod.irishmirror.ie/news/article35207967.ece/ALTERNATES/s1200/0_PUTIN-MAIN.jpg",
        "publishedAt": "2025-05-11T17:59:42Z",
        "source": {
            "name": "Irish Mirror",
            "url": "https://www.irishmirror.ie"
        },
        "full_content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\n\nUkrainian President Volodymyr Zelensky says he \"will be waiting\" for his Russian counterpart Vladimir Putin in Turkey this week. It comes after Putin effectively rejected a ceasefire proposal, but instead called for the resumption of direct talks with Ukraine in Istanbul on May 15, \"without preconditions\".\n\nIn a social media post, Zelensky said Ukraine awaits a \"full and lasting ceasefire\" and called for it to be implemented tomorrow \"to provide the necessary basis for diplomacy\". He said: \"There is no point in prolonging the killings. And I will be waiting for Putin in Türkiye on Thursday. Personally. I hope that this time the Russians will not look for excuses.\"\n\nZelensky earlier said it was a \"positive sign\" that Russia has \"finally begun to consider ending the war\" after Putin proposed direct talks. Putin's calls were made the day after Sir Keir Starmer and other European leaders travelled to Kyiv and called for the Russian president to accept the demands for a 30-day ceasefire, with a threat of increased sanctions.\n\n(Image: POOL/AFP via Getty Images)\n\nStarmer, French President Emmanuel Macron, Polish Prime Minister Donald Tusk and German Chancellor Friederich Merz said their proposal for a ceasefire to start on Monday was supported by US President Donald Trump, whom they had briefed over the phone earlier in the day. Putin has said the Kremlin needs a truce that would lead to a \"lasting peace\" instead of one that would allow Ukraine to rearm and mobilise more men into its armed forces.\n\n(Image: AFP via Getty Images)\n\nKremlin spokesman Dmitry Peskov has said in comments aired by Russian state TV that Putin's proposal is \"very serious\" and \"confirms a real intention to find a peaceful solution\". He added: \"The goals of the talks are clear: to eliminate the root causes of the conflict. And also to ensure the interests of the Russian Federation.\"\n\nMeanwhile, Russia resumed mass drone attacks in Ukraine early on Sunday, after its self-declared three-day pause expired. Russia launched 108 attack drones and simulator drones from six different directions, Ukraine's Air Force said on Sunday. It said 60 drones were shot down and another 41 simulator drones failed to reach targets due to Ukrainian counter-measures.\n\nThe Russian defence ministry accused Ukraine of \"violating\" Moscow's three-day ceasefire more than 14,000 times. Ukraine, which did not agree to the May 8-10 ceasefire, has also accused Russia of violating its own truce, with the Ukrainian foreign minister calling it a farce.\n\nSubscribe to our newsletter for the latest news from the Irish Mirror direct to your inbox: Sign up here."
    },
    {
        "title": "Donald Trump calls for immediate talks between Ukraine and Russia",
        "description": "The Coalition of the Willing met in Kyiv yesterday to call upon Russian President Vladimir Putin to agree to a 30-day ceasefire.",
        "content": "US PRESIDENT DONALD Trump has called for immediate talks between Ukraine and Russia to negotiate a potential ceasefire agreement.\nIn a post to Truth Social, Trump wrote, “President Putin of Russia doesn’t want to have a Cease Fire Agreement with Ukra... [2085 chars]",
        "url": "https://www.thejournal.ie/trump-calls-for-talks-between-ukraine-and-russia-6702174-May2025/",
        "image": "https://img2.thejournal.ie/article/6702174/river/?height=400&version=6702180",
        "publishedAt": "2025-05-11T17:55:42Z",
        "source": {
            "name": "TheJournal.ie",
            "url": "https://www.thejournal.ie"
        },
        "full_content": "US PRESIDENT DONALD Trump has called for immediate talks between Ukraine and Russia to negotiate a potential ceasefire agreement.\n\nIn a post to Truth Social, Trump wrote, “President Putin of Russia doesn’t want to have a Cease Fire Agreement with Ukraine, but rather wants to meet on Thursday, in Turkey, to negotiate a possible end to the BLOODBATH.”\n\nHe said that Ukraine should agree to this meeting “immediately”.\n\n“At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the U.S., will know where everything stands, and can proceed accordingly!”\n\nTrump said that he is “starting to doubt” that Ukraine will make a deal with Russia, adding that Putin is “too busy celebrating the Victory of World War ll”, which, he said, could not have been won without the US’ involvement.\n\nOn Friday, Russia held extravagant celebrations on its annual Victory Day marking the anniversary of defeating Nazi Germany in World War Two, where it hosted several foreign leaders – including the head of Slovakia, an EU member state.\n\nAdvertisement\n\n“HAVE THE MEETING, NOW!!!” Trump concluded.\n\nPutin this morning proposed restarting direct talks with Ukraine in Istanbul on 15 May, “without preconditions”, a move Ukrainian President Volodymyr Zelenskyy has welcomed while demanding a ceasefire take effect before negotiations begin.\n\nSpeaking to reporters in the Kremlin in the early hours of this morning, Putin proposed to “restart” peace talks Russia and Ukraine held in 2022.\n\n“We are committed to serious negotiations with Ukraine,” Putin said, adding that he does not rule out agreeing to a ceasefire later, in the course of direct talks with Ukraine.\n\nYesterday, a number of EU leaders – including UK prime minister Keir Starmer – met in Kyiv and called upon Russian president Vladimir Putin to agree to a 30-day ceasefire beginning tomorrow.\n\nThe leaders of France, the UK, Germany, and Poland all spoke to Trump over the phone yesterday where they discussed peace talks.\n\nZelenskyy urged Russia to accept a 30-day truce proposed by Kyiv’s allies, adding he expected Putin to attend peace talks in Turkey.\n\n“We await a full and lasting ceasefire, starting from tomorrow, to provide the necessary basis for diplomacy,” Zelensky said on X, adding he “will be waiting for Putin” in Turkey on Thursday."
    },
    {
        "title": "Zelensky ready to meet Putin in Turkey on Thursday",
        "description": "Ukrainian President Volodymyr Zelensky said he would be ready to meet Vladimir Putin for talks in Istanbul on Thursday after US President Donald Trump told him to agree to an offer of talks with Russia immediately.",
        "content": "Ukrainian President Volodymyr Zelensky said he would be ready to meet Vladimir Putin for talks in Istanbul on Thursday after US President Donald Trump told him to agree to an offer of talks with Russia immediately.\nMr Zelensky, in a post on X, former... [6133 chars]",
        "url": "https://www.rte.ie/news/world/2025/0511/1512211-russia-ukraine/",
        "image": "https://www.rte.ie/images/00227dc4-1600.jpg",
        "publishedAt": "2025-05-10T23:00:00Z",
        "source": {
            "name": "RTE.ie",
            "url": "https://www.rte.ie"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.rte.ie', port=443): Read timed out. (read timeout=7) on URL https://www.rte.ie/news/world/2025/0511/1512211-russia-ukraine/"
    },
    {
        "title": "Zelensky hopes for ceasefire with Russia and says ‘he’ll be waiting for Putin’",
        "description": "Ukraine, along with European allies, had demanded Russia accept an unconditional 30-day ceasefire starting on Monday before holding talks.",
        "content": "Ukrainian president Volodymyr Zelensky said he is hoping for a full and lasting ceasefire with Russia starting on Monday, adding he would be in Turkey to negotiate with Russian president Vladimir Putin “personally”.\nHis comments came after US preside... [366 chars]",
        "url": "https://www.breakingnews.ie/world/zelensky-hopes-for-ceasefire-with-russia-and-says-hell-be-waiting-for-putin-1761826.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTExODQ2NDJcXFwvMi43OTUyODQzNC5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6Ijc0ODI5MGNiODBmZTRlZWQwNTM0ODY2YzVmZTFjMzNlMzM3ZWEzNjQifQ==/zelensky-hopes-for-ceasefire-with-russia-and-says-he-ll-be-waiting-for-putin.jpg",
        "publishedAt": "2025-05-10T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Ukrainian president Volodymyr Zelenskiy said he is hoping for a full and lasting ceasefire with Russia starting on Monday, adding he would be in Turkey to negotiate with Russian president Vladimir Putin “personally”.\n\nHis comments came after US president Donald Trump insisted Ukraine accept Russia’s latest offer of holding direct talks in Turkey on Thursday.\n\nAdvertisement\n\nUkraine, along with European allies, had demanded Russia accept an unconditional 30-day ceasefire starting on Monday before holding talks, but Moscow effectively rejected the proposal and called for direct negotiations instead.\n\nIt was not clear if Mr Zelenskiy was conditioning his presence in Turkey on the Monday ceasefire holding.\n\n“We await a full and lasting ceasefire, starting from tomorrow, to provide the necessary basis for diplomacy. There is no point in prolonging the killings. And I will be waiting for Putin in Turkiye on Thursday. Personally. I hope that this time the Russians will not look for excuses,” he wrote on X.\n\nMr Trump said in a social media post on Sunday that Ukraine should agree to Mr Putin’s peace talks proposal “IMMEDIATELY.”\n\nAdvertisement\n\n“At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the US, will know where everything stands, and can proceed accordingly!” Trump wrote, adding: “HAVE THE MEETING, NOW!!!”\n\nVolodymyr Zelenskiy, Keir Starmer and Emmanuel Macron. Photo: Stefan Rousseau/PA\n\nMr c and said that “the entire world has been waiting for this for a very long time”.\n\nHe added, however, that “the very first step in truly ending any war is a ceasefire,” in a reference to his proposal to start a 30-day unconditional truce on Monday.\n\nMr Putin in remarks to the media overnight effectively rejected that ceasefire offer and proposed restarting direct talks with Ukraine in Istanbul on Thursday instead “without preconditions”.\n\nAdvertisement\n\nHe said a ceasefire might be agreed on during the negotiations — but stressed that the Kremlin needs a truce that would lead to a “lasting peace” instead of one that would allow Ukraine to rearm and mobilise more men into its armed forces.\n\nMr Putin’s counter-offer came after leaders from four major European countries threatened to ratchet up pressure on Moscow if it does not accept an unconditional 30-day ceasefire in Ukraine.\n\nFrench president Emmanuel Macron, British prime minister Keir Starmer, German chancellor Friedrich Merz and Polish prime minister Donald Tusk met with Mr Zelenskiy in Kyiv on Saturday and issued a co-ordinated call for the truce starting Monday.\n\nThe plan has received backing from both the European Union and Mr Trump.\n\nAdvertisement\n\nThe leaders pledged tougher sanctions on Russia if Mr Putin did not accept the proposal.\n\nMr Zelenskiy, in his Sunday remarks, reiterated that call.\n\n“There is no point in continuing the killing even for a single day. We expect Russia to confirm a ceasefire — full, lasting, and reliable — starting tomorrow, May 12th, and Ukraine is ready to meet,” the Ukrainian leader said on X.\n\nMr Macron said on Sunday that Mr Putin’s offer of direct negotiations with Ukraine is “a first step, but not enough,” signalling continued Western scepticism toward Moscow’s intentions.\n\nAdvertisement\n\nWorld Putin proposes direct talks with Ukraine ‘without... Read More\n\n“An unconditional ceasefire is not preceded by negotiations,” Mr Macron told reporters at the Polish-Ukrainian border, according to French media.\n\nMr Macron also warned that Mr Putin is “looking for a way out, but he still wants to buy time”.\n\nKremlin spokesman Dmitry Peskov, in comments aired by Russian state TV on Sunday, called Mr Putin’s proposal “very serious,” aimed at eliminating “the root causes of the conflict,” and said it “confirms a real intention to find a peaceful solution”."
    },
    {
        "title": "Desperate locals in Kharkiv urge Russia to sign up to 30-day ceasefire plan after thousands killed",
        "description": "DESPERATE locals in one of Ukraine’s hardest hit cities yesterday urged Russia to sign up to the 30-day ceasefire plan.As President Volodymyr Zelens",
        "content": "DESPERATE locals in one of Ukraine’s hardest hit cities yesterday urged Russia to sign up to the 30-day ceasefire plan.\nAs President Volodymyr Zelensky was hosting European leaders in Kyiv, war weary residents in Kharkiv were praying for peace.\n4 Res... [3181 chars]",
        "url": "https://www.thesun.ie/news/15187582/kharkiv-locals-putin-ceasefire-plea/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/newspress-collage-e6ftsqcx6-1746901685097.jpg?1746912493&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-10T20:24:11Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "DESPERATE locals in one of Ukraine’s hardest hit cities yesterday urged Russia to sign up to the 30-day ceasefire plan.\n\nAs President Volodymyr Zelensky was hosting European leaders in Kyiv, war weary residents in Kharkiv were praying for peace.\n\n4 Residents of Kharkiv are urging Vladimir Putin to agree to a ceasefire and stop relentlessly bombarding the city Credit: EPA\n\nThe eastern city of 1.3million people is just a few miles from the front line and has suffered a non-stop bombardment since the war began.\n\nAround a quarter of the city has been destroyed, thousands have been killed and 700,000 people have fled.\n\nThose who remain yesterday told The Sun they were tired of war and want Vladimir Putin to agree to the ceasefire proposed by Ukraine, America and Europe.\n\nBut they are so used to an almost daily bombardment they struggle to believe the crazed tyrant will agree to lay down his arms.\n\nSeamstress Valentina Hoydenko, 65, is one of those whose family has paid the ultimate price.\n\nShe said: “My son joined the army last year and was killed a few months later.\n\n“We have lost too much and we are tired and we want peace.\n\n“I really hope it will happen and I hope Putin agrees to this deal but I find it hard to believe he will.\n\n“The shelling never stops. Two days ago I heard a missile go over which hit a market.\n\n“My own house has been damaged and is now being repaired.\n\nUkrainian hospital blown up in Russian drone attack hours after Trump and Zelensky's explosive Oval Office spat\n\n“People are so used to it that they hardly turn their heads when a drone or a missile goes over.\n\n“We want peace and we hope Putin agrees to a ceasefire as a first step but it is hard to find the faith that he will.”\n\nThe city is just 18 miles from the border and is so close to enemy troops that Russian missiles can reach it in less than a minute.\n\nBut it is hoped that a 30-day ceasefire would lead to a more permanent peace and an end to the non-stop blitz.\n\n4 Vadim Medvediuk, 25, says he wants the war to end and welcomes a possible 30-day ceasefire Credit: Chris Eades\n\nAfter three years of war admin assistant Vadim Medvediuk, 25, told how he has given up going to the shelter when the siren sounds unless he fears a direct hit on his apartment block.\n\nHe said: “Everyone is so used to attacks that they treat it as an ordinary daily event.\n\n“I don’t even bother going to the air raid shelter now when the siren sounds.\n\n“I only go if I can actually hear the drone. I live on the 9th floor of a residential block which has 16 floors so if there is any chance of it hitting my block I will hopefully hear it and then I will go to the shelter.\n\n“We are really tired of the war and want it to end. This 30-day plan would be a good first step in getting there.\n\n“But would Russia stick to it? There was supposed to be a ceasefire over the last few days but the attacks continued.”\n\nThose attacks included one in Sumy which killed an 85-year-old woman, injured three others and destroyed 19 homes, all when Russia was supposed to be observing a three-day ceasefire to mark Friday’s Victory Parade.\n\nAnother strike hit the eastern Donetsk region injuring one person setting two apartment blocks on fire.\n\nRescuers who raced to the scene were then targeted in a “double tap” strike.\n\nAnd in Kherson a 58-year-old was injured in a drone attack.\n\n4 Valentina Hoydenko, 65, says her son was killed shortly after joining the Ukraine army Credit: Chris Eades"
    },
    {
        "title": "The Folly of Realism: How the West Deceived Itself about Russia and Betrayed Ukraine by Alexander Vindman – An unsparing critique of US ‘crisis management’ policy",
        "description": "The writer’s theme is one of lost opportunities that could have prevented today’s war",
        "content": "The Folly of Realism. How the West Deceived Itself about Russia and Betrayed Ukraine Author : Alexander Vindman ISBN-13 : 978-1541705043 Publisher : PublicAffairs Guideline Price : £25\nIn 2014, when he was an attaché at the US embassy in Moscow, Alex... [5129 chars]",
        "url": "https://www.irishtimes.com/culture/books/review/2025/05/10/the-folly-of-realism-how-the-west-deceived-itself-about-russia-and-betrayed-ukraine-by-alexander-vindman-an-unsparing-critique-of-us-crisis-management-policy/",
        "image": "https://www.irishtimes.com/resizer/v2/OANQDS3ETVQGAAUKT6HWXCYJZY.jpg?smart=true&auth=3559853226016dfa9f889ddd4b1d38abb50d8b53233ce2fdc37a3b256ec49a0a&width=1200&height=630",
        "publishedAt": "2025-05-10T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/culture/books/review/2025/05/10/the-folly-of-realism-how-the-west-deceived-itself-about-russia-and-betrayed-ukraine-by-alexander-vindman-an-unsparing-critique-of-us-crisis-management-policy/"
    },
    {
        "title": "Former MEP Clare Daly alleges defamation in article published weeks before 2024 European elections",
        "description": "Sunday Times article referred to alleged links with Lithuanian diplomat convicted of spying for Russia",
        "content": "Former MEP and TD Clare Daly has initiated legal proceedings alleging she was defamed in a newspaper article published in the weeks before last year’s European Parliament elections.\nMs Daly is suing over a Sunday Times story regarding her alleged lin... [2210 chars]",
        "url": "https://www.irishtimes.com/crime-law/courts/2025/05/09/former-mep-clare-daly-alleges-defamation-in-article-published-weeks-before-2024-european-elections/",
        "image": "https://www.irishtimes.com/resizer/v2/UX35XZKR4F7U6PWLDVECKVXRNE.JPG?smart=true&auth=c2be7639a45bb7469b9b968e55ec8679b607f9beba87f8a40d726d2ab1e56449&width=1200&height=630",
        "publishedAt": "2025-05-09T05:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/crime-law/courts/2025/05/09/former-mep-clare-daly-alleges-defamation-in-article-published-weeks-before-2024-european-elections/"
    },
    {
        "title": "Joe Biden accuses Donald Trump of ‘modern-day appeasement’ towards Russia",
        "description": "Former president claims successor risks causing a breakdown of US-Europe relations",
        "content": "Former US president Joe Biden and his wife Jill arrive for the funeral of Pope Francis last month. Photograph: Gregorio Borgia/AP\nJoe Biden has accused Donald Trump of “modern-day appeasement” in his approach to Russia and expressed fears that Europe... [2440 chars]",
        "url": "https://www.irishtimes.com/world/us/2025/05/07/biden-accuses-trump-of-modern-day-appeasement-towards-russia/",
        "image": "https://www.irishtimes.com/resizer/v2/DSUFTIIFAJ2TY2HMAPZGZO5YLQ.jpg?smart=true&auth=024525d9cc30f882314d33a1e07340984795098e5313283da3d2ba2054dece20&width=1200&height=630",
        "publishedAt": "2025-05-07T06:08:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/us/2025/05/07/biden-accuses-trump-of-modern-day-appeasement-towards-russia/"
    },
    {
        "title": "Vance says Russia was ‘asking for too much’ in its initial Ukraine peace offer",
        "description": "The US vice president was speaking at a Washington meeting hosted by the Munich Security Conference.",
        "content": "US Vice President JD Vance has said Russia was “asking for too much” in its initial peace offer as the United States looks to bring about an end to the war in Ukraine.\nThe vice president, speaking at a Washington meeting hosted by the Munich Security... [3085 chars]",
        "url": "https://www.breakingnews.ie/world/vance-says-russia-was-asking-for-too-much-in-its-initial-ukraine-peace-offer-1760311.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMDcxODI1MTdcXFwvOWY1YjBjMWNmODU4NDQxNmI0MDc4NGYxYzM2ODNhMTktMS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjYwMDYwMmFmNTZhZGU3YWFkZGRkYmJkZDY1Y2I0ODMxMGY0NjA4MWYifQ==/vance-says-russia-was-asking-for-too-much-in-its-initial-ukraine-peace-offer.jpg",
        "publishedAt": "2025-05-06T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "US Vice President JD Vance has said Russia was “asking for too much” in its initial peace offer as the United States looks to bring about an end to the war in Ukraine.\n\nThe vice president, speaking at a Washington meeting hosted by the Munich Security Conference, did not elaborate on Moscow’s terms, but said he was not pessimistic about the possibility of a peace deal.\n\nAdvertisement\n\nThat is a more sanguine assessment than President Donald Trump’s recent scepticism that Russian President Vladimir Putin wants to end the war that begin in February 2022 when Russia invaded Ukraine.\n\n\n\n\n\n“I wouldn’t say that the Russians are uninterested in bringing this thing to a resolution,” Mr Vance said.\n\n“What I would say is right now the Russians are asking for a certain set of requirements, a certain set of concessions in order to end the conflict. We think they’re asking for too much.”\n\nMr Trump, when asked later on Wednesday about the vice president’s comments, told reporters at the White House: “Well, it’s possible that’s right.”\n\nAdvertisement\n\nHe seemed to imply that Mr Vance had details that he did not have because he was preoccupied with other matters.\n\n“We are getting to a point where some decisions are going to have to be made. I’m not happy about it,” Mr Trump said of the peace effort.\n\nMr Vance did not repeat any of the criticisms of Volodymyr Zelensky that he had aired during an Oval Office row in February with the Ukrainian leader, and he made a point of saying the US appreciated Ukraine’s willingness to have a 30-day ceasefire.\n\nBut the Republican vice president, citing Russia’s unwillingness on that point, said the US would like to move past that and have the Russian and Ukrainian leaders sit down directly to negotiate a long-term settlement that would end the fighting.\n\nAdvertisement\n\n“What the Russians have said is, ‘A 30-day ceasefire is not in our strategic interests’. So we’ve tried to move beyond the obsession with the 30-day ceasefire and more on the, what would a long-term settlement look like,” Mr Vance said.\n\nMr Vance’s speech at the conference event followed his appearance at the organisation’s February summit in Germany, where he ruffled feathers for his comments that free speech is “in retreat” across Europe.\n\nMr Vance addressed that on Wednesday and said his comments applied to the US under Democratic president Joe Biden’s administration, just as they did to Europe.\n\n“It’s not ‘Europe bad, America good’. It’s that I think that both Europe and the United States, we got a little bit off track, and I encourage us all to get back on track together,” he said.\n\nAdvertisement\n\nOn the Middle East, Mr Vance did not shed light on the timing of planned talks between the US and Iran over Iran’s nuclear programme.\n\nHe said the Trump administration felt the inspection and enforcement provisions in the 2015 Iran nuclear deal negotiated under Democratic president Barack Obama were “incredibly weak” and “allowed Iran to sort of stay on this glide path toward a nuclear weapon if they flip the switch and press go”.\n\n“We think that there is a deal here that would reintegrate Iran into the global economy, that would be really good for the Iranian people, but would result in the complete cessation of any chance that they can get a nuclear weapon. And that’s what we’re negotiating toward,” Mr Vance said."
    },
    {
        "title": "Kim Jong Un calls for increased artillery shell production",
        "description": "The North Korean leader’s call comes as the country continues to supply arms and troops to support Russia’s war on Ukraine.",
        "content": "North Korean leader Kim Jong Un has called for his munitions industry to boost the production of artillery shells, state media said on Wednesday.\nNorth Korea’s official Korean Central News Agency (KCNA) said Mr Kim, during recent visits to unspecifie... [2867 chars]",
        "url": "https://www.breakingnews.ie/world/kim-jong-un-calls-for-increased-artillery-shell-production-1759952.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMDcwNjE4MjdcXFwvYjMxODNmODAyMWQ2NDhiMWJiNTM4ZjI4NGEzOWQ3M2IuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI2YjBhZTRiNjRmMjgxNTU0NmEwZGNhYWIzMzY4ZTk5YzAyYmQ1MmEzIn0=/kim-jong-un-calls-for-increased-artillery-shell-production.jpg",
        "publishedAt": "2025-05-06T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "North Korean leader Kim Jong Un has called for his munitions industry to boost the production of artillery shells, state media said on Wednesday.\n\nNorth Korea’s official Korean Central News Agency (KCNA) said Mr Kim, during recent visits to unspecified munitions and machinery factories, praised modernisation efforts that the agency claimed enabled the facilities to double their annual shell production capacity.\n\nAdvertisement\n\nMr Kim urged workers to further accelerate artillery shell production, calling it crucial to “strengthening the fighting efficiency” of his armed forces, and also called for the development of more advanced machinery to boost munitions output.\n\nThe call comes as the country continues to supply arms and troops to support Russia’s war on Ukraine.\n\n\n\nNorth Korean leader Kim Jong Un visits a munitions factory (Korean Central News Agency/Korea News Service/AP)\n\nKCNA did not mention any comments from Mr Kim regarding his support for Russian President Vladimir Putin’s invasion of Ukraine.\n\nRecent South Korean intelligence assessments suggest North Korea has sent about 15,000 soldiers to Russia, and that nearly 5,000 of them have been killed or injured while fighting against Ukrainian forces.\n\nAdvertisement\n\nWashington and Seoul have also accused North Korea of supplying Russia with various types of military equipment, including artillery systems and shells and ballistic missiles.\n\nAfter denying its war involvement for months, North Korea last month confirmed for the first time that it had sent combat troops to help Russia in recapturing parts of the Kursk region, which had fallen to a surprise Ukrainian incursion last year.\n\nMoscow also acknowledged the North Korean involvement, with Mr Putin issuing a statement thanking the North for sending troops to support his forces and promising not to forget their sacrifices.\n\nAnalysts say North Korea’s official acknowledgement of its military support for Russia is likely aimed at cementing a deeper, long-term partnership with Moscow and securing greater compensation, potentially including advanced military technology that could enhance the threat posed by Mr Kim’s nuclear-armed forces.\n\nAdvertisement\n\nBy formalising its role as a participant in the war, North Korea may also be positioning itself to seek compensation in future negotiations to end the conflict in Ukraine, according to a recent report by the Institute for National Security Strategy, a think tank affiliated with South Korea’s intelligence agency.\n\nIn a closed-door briefing to lawmakers last month, South Korea’s National Intelligence Service also said it believes North Korea has sent about 15,000 workers to Russia under bilateral industrial cooperation programmes.\n\nWhile the value of North Korean artillery and missiles supplied to Russia likely amounts to billions of dollars, there are no immediate signs that Russia has provided direct cash payments in return, the agency said.\n\nInstead, Russia has likely compensated North Korea with air defence missiles, electronic warfare equipment, drones and technology for spy satellite launches, according to the assessment."
    },
    {
        "title": "Nuclear strikes, secret bunkers for Royals, & massive cyber attacks… how Britain is secretly bracing for war with Russia",
        "description": "BRITAIN is bracing for a devastating Russian offensive that could involve nuclear strikes and crippling cyber attacks amid fears the country is not fo",
        "content": "BRITAIN is bracing for a devastating Russian offensive that could involve nuclear strikes and crippling cyber attacks amid fears the country is not for ready for war.\nGovernment officials are racing to update decades-old contingency plans to protect ... [9715 chars]",
        "url": "https://www.thesun.ie/news/15163280/nuclear-strikes-secret-bunkers-cyber-attacks-britain-russia/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/DD-06-05-war-games-v2_COMP.png?strip=all&quality=100&w=1500&h=1000&crop=1",
        "publishedAt": "2025-05-06T11:59:15Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "BRITAIN is bracing for a devastating Russian offensive that could involve nuclear strikes and crippling cyber attacks amid fears the country is not for ready for war.\n\nGovernment officials are racing to update decades-old contingency plans to protect the country and prepare for any potential combat.\n\n16 British soldiers before the start of Steadfast Dart 2025 exercise - involving some 10,000 troops in three different countries Credit: AP\n\n16 British soldiers practice an assault on February 17, 2025 in Smardan, Romania Credit: Getty\n\n16 British troops load a 105MM Howitzer in Norway during war drills Credit: PA\n\n16 Royal Marine Commandos take up position on a beach in Harvstad, Norway after swimming ashore during a training exercise Credit: PA\n\n16\n\nThe classified \"home defence plan\" would lay out how Downing Street will respond if Vladimir Putin declares war on the UK, including moving the Royal Family into bunkers.\n\nMinisters worry Britain could be outfought by Russia on the battlefield, but also poorly defended at home as things stand.\n\nExperts have warned that the country's national infrastructure is vulnerable ahead of the release of Labour's Strategic Defence Review - an examination of the Armed Forces.\n\nAs military warfare has evolved in the past two decades, fears are that Putin could launch a combination of attacks, including conventional ballistic missile strikes, sabotage and the latest tactic in the Russian playbook - cyber warfare.\n\nBut Britain - which is just beginning to review and revise its security and contingency plans for the first time in more than 20 years - is feared to not be fully prepared to go to war against the Russians.\n\nFormer Nato commander Colonel Hamish De Bretton-Gordon told The Sun: \"Britain is very much in the sights of Putin's derision, and we are the ones likely to be attacked first.\n\n\"Britain really has got to dust off its contingency plans. Over 20 years of neglect, and we understand that's exactly what this report is about at the moment.\"\n\nRetired military officer Colonel Richard Kemp, who was working in the Cabinet Office when the contingency plans were last updated, told The Sun: \"Contingency plans like this should be updated frequently. Twenty years is far too long, especially given the radically changed threat picture.\n\n\"Putin has said Britain is in his crosshairs since the invasion of Ukraine in 2022.\n\n\"Even before then, he proved he was willing to attack this country, including with a nerve agent attack in Salisbury in 2018. We should take him seriously.\"\n\nThe classified plan by the Cabinet Office's Resilience Directorate - which was last updated in 2005 - would set out war strategies in the event of a catastrophic attack by the Russians, which could well involve tactical and strategic nuclear weapons.\n\nThe plan is based on the War Book, a Cold War dossier of instructions for government response to nuclear attacks.\n\n‘UK must consider conscription NOW’…Calls for Labour to follow Europe’s frontline & ramp up readiness for war with Putin\n\nUnder such plans, Britain could be divided into 12 zones, each governed by Cabinet ministers, and food rationed.\n\nThe plans will include scenarios like widespread sabotage and crippling cyber warfare, which were seen as a limited threat back when the document was last updated.\n\nIt will also direct the PM on how to run a wartime government, as well as strategies for travel networks, courts and the postal system, reports the Daily Telegraph.\n\nAlthough the highly-classified document is expected to never be revealed in the public domain, military experts suggest what could be changed to prepare us for a potential war against the Russians.\n\nColonel Bretton-Gordon said that cyber attacks will be given a major chunk of attention in the latest round of updates.\n\nHe believes the Government Communications Headquarters (GCHQ) would be given additional funding to improve the existing measures against cyber attackers.\n\nThere is particular concern for the country's five active nuclear power stations, which if damaged by strikes, could release radioactive material across the country, resulting in long-term impact.\n\nIn the event of an all-out war against Putin, members of the Royal family and key government officials will be sent to secret hideout bunkers to protect them.\n\n16 Servicemen run to a position during the Steadfast Dart 2025 exercise, involving some 10,000 troops in three different countries from nine nations Credit: AP\n\n16 Britain’s F-35B Lightning II new supersonic ‘stealth’ strike fighter flies over the North Sea Credit: Getty\n\n16 Sir Keir Starmer's government is said to be updating contingency plans Credit: Getty\n\n16 The Royal family will be sent to secret bunkers in the event of a war Credit: Alamy\n\nFood circulation and modern logistics systems will be made more robust to ensure essential items can reach people whenever there is a need.\n\nAnd the public will be made more aware of their wartime duties.\n\nBretton-Gordon added: \"Plans will be to make sure our critical infrastructure is as secure as it can be.\n\n\"There will be contingency plans. If one nuclear power station goes down, then othe ther power infrastructure can take up the slack.\n\n\"During the Cold War, the people probably had a lot of training and expertise to deal with contaminated nuclear casualties, but the situation has probably changed now.\n\n\"These are the sort of things that just need to be reviewed, so that in the event this happens, it's not a complete shock.\"\n\n\"We are up against an autocratic tyrant who has absolutely no concern for collateral damage or civilian casualties.\n\n\"I'm sure Putin wouldn't think twice about firing a missile, nuclear or conventional, at London cities and the UK's critical national infrastructure.\"\n\n16 Russian President Vladimir Putin Credit: AP\n\n16 Russian troops march towards the Red Square last week Credit: Getty\n\n16 It passed a test launch in April of 2022 Credit: East2West\n\nRussia, on many occasions, has threatened to wipe out UK off the world map.\n\nAnd with Prime Minister Sir Keir Starmer leading the European defence plan alongside the French to support Ukraine, Putin and his deputies in the Kremlin could see the UK as a possible target.\n\nBretton-Gordon said: \"What has changed recently is the threats coming out of Moscow that actually Britain, which is leading the coalition of the willing with the French.\n\n\"There are a number of scenarios that could lead us into conflict with the Russians, and the prospect of that then leads to the prospect of nuclear attack.\"\n\nMeanwhile, Colonel Kemp warned that Russia could attack Britain in several ways that could wreak havoc on the nation - and our armed forces are simply not prepared enough to fight Putin's troops.\n\nHe added: \"We could be the target of large-scale ballistic missile, cruise missile, drone, cyber, chemical and even nuclear strikes as well as sabotage.\n\n\"I would hope that what has recently been happening in Ukraine and the Middle East has galvanised our leaders so that we are prepared. But we have a huge amount of ground to make up.\n\n\"The best way to avoid such things happening to us is deterring an attack. That means we need to substantially increase our own offensive as well as defensive capabilities.\"\n\n16\n\nNOT GOOD ENOUGH\n\nThe Cabinet Office ran a risk assessment in January in which it modelled a scenario in which a hostile foreign state launched various types of attack on the UK's infrastructure.\n\nIt found that any such successful strike could be devastating.\n\nA senior RAF official said last month if Russia had attacked the UK in the same way as it had Ukraine more than three years ago - within hours missiles would have broken through defences and destroyed key targets.\n\nMilitary experts agree that Britain's air defence systems are not adequate to thwart a large-scale missile attack.\n\nColonel Kemp said: \"One of our major weaknesses is air defence, both for our forces and homeland defence.\n\n\"Putin has significant long-range missile and attack drone capability, which could be used against us.\n\n\"The other day, a Houthi ballistic missile from Yemen penetrated Israel’s air defences and struck their international airport.\n\n\"Israel has the most comprehensive and advanced air and missile defence systems in the world.\n\n\"That shows how vulnerable any country can be to attack, and we have nothing even approaching Israel’s capabilities.\"\n\nBretton-Gordon added: \"I expect, as part of the Strategic Defence Review, a lot of focus will be on air defence.\n\n\"But it's not just missiles and fighter jets, the Ukraine war shows how effective drone warfare could be.\"\n\nFIX BLACKHOLES NOW\n\nColonel Kemp previously told The Sun that there is an \"extremely wide gap\" in the capabilities of the current forces and that he government certainly needs to have plans for conscription \"if the situation deteriorates\".\n\nSpeaking to The Sun, he said: \"The capability gap is extremely wide. The PM talks about deploying British forces to Ukraine, but the reality is we couldn’t field a significant military force.\n\n\"The British armed forces need to be dramatically expanded both in manpower and fighting equipment such as ships, tanks and planes.\n\n\"We could no longer deploy troops on the scale of the Falklands War, Afghanistan or Iraq.\n\n\"We don’t have adequate numbers of infantrymen, armoured vehicles, artillery, engineers, air defences or munitions to keep them fighting.\n\n\"I’m sure we’re up to strength in diversity officers but they don’t win wars.\"\n\nLt Col Stuart Crawford, author of Defence Review, said the armed forces have “failed to recruit enough people for the last 10 years”, so we must first sort out the regulars.\n\nHe said: “The forces are seen as declining organizations - which they are - and have been for at least the last 25 years, because of a lack of resources and funding.”\n\nAt the moment, there’s “nowhere to train these people”, “nothing to equip these people with”, and “not enough people to instruct them.”\n\n16\n\n16 A British Storm Shadow missile Credit: AP"
    },
    {
        "title": "EU to propose ban on Russian gas imports by end of 2027",
        "description": "Ukraine says its forces still fighting in Russia’s Kursk region",
        "content": "The European Union will publish plans on Tuesday to ban new Russian gas deals by the end of the year, and phase out existing contracts with Moscow by end-2027, three EU officials have said.\nThe European Commission will on Tuesday publish a “roadmap” ... [951 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/06/ukraine-russia-european-union-gas-imports/",
        "image": "https://www.irishtimes.com/resizer/v2/7U3KV2K6KNG6NPUQMV6567LBY4.jpg?smart=true&auth=dea00ea6933e5775d088e2634687b0b12443079713f40f5c20a63073373f20ef&width=1200&height=630",
        "publishedAt": "2025-05-06T06:45:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/06/ukraine-russia-european-union-gas-imports/"
    },
    {
        "title": "Drone attacks by Ukraine halt traffic at airports across Russia",
        "description": "In Ukraine, a Russian drone strike killed one person in the Odesa region.",
        "content": "MORE THAN A dozen Russian airports had to restrict their traffic due to drone attacks overnight, Russian authorities reported, including in Moscow days before a planned military parade.\nA total of 19 drones were downed around the Russian capital, whe... [1672 chars]",
        "url": "https://www.thejournal.ie/drone-attacks-by-ukraine-halt-traffic-at-airports-across-russia-6696506-May2025/",
        "image": "https://img2.thejournal.ie/article/6696506/river/?height=400&version=6696507",
        "publishedAt": "2025-05-06T06:43:24Z",
        "source": {
            "name": "TheJournal.ie",
            "url": "https://www.thejournal.ie"
        },
        "full_content": "MORE THAN A dozen Russian airports had to restrict their traffic due to drone attacks overnight, Russian authorities reported, including in Moscow days before a planned military parade.\n\nA total of 19 drones were downed around the Russian capital, where several world leaders are expected to attend a parade and address by President Vladimir Putin on 9 May as part of World War II anniversary celebrations, authorities said.\n\nFlight restrictions were introduced at four airports in Moscow, Russian news agencies reported, citing the Federal Air Transport Agency – though traffic at the city’s main Sheremetyevo airport remained largely unaffected.\n\nAirports were also affected in other cities including Volgograd and Nizhny Novgorod.\n\nIn a post on Telegram, Moscow Mayor Sergei Sobyanin said debris had fallen on a major avenue in southern Moscow but there was “no damage or casualties” in the city.\n\nRussian media broadcast images of a cracked supermarket window and a blackened residential building facade.\n\nAdvertisement\n\nThe governors of Voronezh and Penza reported that 18 and 10 Ukrainian drones had been intercepted in their regions respectively, without causing any casualties.\n\nIn the Kursk region, acting governor Alexander Khinshtein said an attack was carried out on an electrical substation in the city of Rylsk late Monday, injuring two teenagers.\n\n“As a result of the attack on the city, two transformers were damaged, and the power was completely cut off,” he said on Telegram.\n\nRussian authorities earlier on Monday said defence forces had repelled four drones heading towards Moscow, where the conflict in Ukraine often feels distant.\n\nIn Ukraine, a Russian drone strike killed one person in the Odesa region, governor Oleg Kiper said Monday night.\n\nWant to know more about what’s happening in Ukraine and why? Check out our FactCheck Knowledge Bank for essential reads and guides to finding good information online."
    },
    {
        "title": "Huge Ukrainian drone strike on Russia causes Putin to SHUT all four major Moscow airports",
        "description": "A HUGE Ukrainian drone strike has forced Russia to shut all four of its major airports in a dramatic show of force against Moscow.In the second consec",
        "content": "A HUGE Ukrainian drone strike has forced Russia to shut all four of its major airports in a dramatic show of force against Moscow.\nIn the second consecutive night of aerial assaults on the capital, Russia’s aviation watchdog Rosaviatsia confirmed the... [6142 chars]",
        "url": "https://www.thesun.ie/news/15161389/ukrainian-drone-strike-russia-putin-shut-moscow-airports/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/newspress-collage-pq1bt8ak7-1746510900719.jpg?1746514668&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-06T05:16:45Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "A HUGE Ukrainian drone strike has forced Russia to shut all four of its major airports in a dramatic show of force against Moscow.\n\nIn the second consecutive night of aerial assaults on the capital, Russia’s aviation watchdog Rosaviatsia confirmed the airports were closed “to ensure safety” and only reopened hours later.\n\n9 Vladimir Putin had to shut all four major Moscow airports after a huge Ukrainian drone blitz Credit: AP\n\n9 Several strikes hit different parts of the Russian capital overnight Credit: East2West\n\n9 At least three people were killed and five wounded as a result of a reported explosion in a Moscow highrise Credit: East2West\n\n9 Passengers on a tourist flight from Hurghada to Moscow were diverted to St Petersburg due to the mass drone attack on the Russian capital Credit: East2West\n\nUkrainian strikes overnight reached within just six miles of the Kremlin and Red Square, ahead of the vast 80th anniversary commemoration of the defeat of Hitler.\n\nAll four major Moscow airports - Vnukovo, Sheremetyevo, Domodedovo and Zhukovsky - were closed as the drones targeted the capital, with multiple diversions of incoming aircraft.\n\nAt least nine other airports were also disrupted.\n\nRussian tourists complained about being trapped in a Nesma Airlines plane from Egyptian resort Hurghada to Moscow for ten hours after it was diverted to St Petersburg due to the drone strikes amid air chaos.\n\nMoscow’s mayor Sergei Sobyanin said at least 19 Ukrainian drones were destroyed before reaching the city “from different directions.”\n\nHe added: “Some of the debris had landed on one of the key highways into the city,” but claimed there were no casualties.\n\nThe attack sent shockwaves through the city as unverified reports by Russian military bloggers claimed apartment windows in southern Moscow had been shattered by blasts.\n\nUkraine has not commented on the strikes, but the mayor of Kharkiv said Russia had simultaneously carried out its own drone attacks in his city and near Kyiv.\n\nA clean-up was underway on Moscow’s Kashirskoye Highway, as Kyiv refuses to accept Putin’s unilateral three day ceasefire starting tomorrow night - demanding instead a month-long truce as a prelude to ending the war.\n\nRussia was forced to stage a massive air defence operation, claiming 105 Ukrainian drones were shot down overnight, mostly aimed at Moscow from multiple directions.\n\nUS will ‘no longer act as mediator’ between Ukraine & Russia after Putin refused to sign up to full ceasefire\n\nIf the drone strikes continue, they threaten to disrupt Putin’s military extravaganza on Thursday when foreign guests will be led by Chinese president Xi Jinping.\n\nIn Odesa, one person was killed in a Russian drone strike overnight, according to regional governor Oleh Kiper.\n\n“As a result of the Russian strike on the Odesa region, a number of civilian infrastructure facilities were damaged, including private residential buildings,” said a statement.\n\n“Fires broke out in some places, which were quickly extinguished by our rescuers.\n\n“The body of a dead person was found in one of the houses.”\n\nThe drone war is intensifying.\n\nOn Monday night alone, Russia said it shot down 26 Ukrainian drones, while this latest wave has now hit multiple Russian regions, including Penza and Voronezh.\n\nMeanwhile, fierce clashes erupted in Russia’s Kursk region, where Kyiv claimed it struck a drone command unit near Tyotkino.\n\n9 It was Kyiv's second consecutive night of aerial assaults on Moscow Credit: East2West\n\n9 Apartments were shattered by the blasts Credit: East2West\n\n9 All major Moscow airports were temporarily closed as the Russian capital was hit by Ukrainian drones, including Vnukovo airport (pictured) Credit: East2West\n\nUkraine claimed to have killed 20 Russian troops at a control post for drone pilots at Tetkino, in Kursk region.\n\nUkraine’s general staff said: “Nine months after the start of the Kursk operation, Ukraine’s Defence Forces maintain a military presence on the territory of Russia’s Kursk region.”\n\nRussian officials reported a major power outage in the town of Rylsk after an electrical substation was hit in another attack.\n\n“Two transformers were damaged,” said acting governor Alexander Khinshtein, adding that “two teenagers had been injured by shrapnel from the blast.”\n\nMilitary bloggers described dramatic scenes of Ukrainian forces “blowing up bridges with rockets” and storming the border in armoured vehicles.\n\n“There is a heavy battle going on at the border,” wrote one under the handle RVvoenkor.\n\nUkrainian forces originally pushed into Kursk in August 2024 in a surprise incursion aimed at creating a buffer zone to protect the northeastern city of Sumy, just 12km from Tyotkino.\n\nEarlier, Russian strikes on Ukraine’s Sumy region killed three, and injured seven, amid intense border battles.\n\nAt least 18 Ukrainian drones shot down over Russia's Voronezh region, said officials.\n\nOne - seen on video - hit a children's playground, catching fire.\n\nCivilians in Sumy are now also being told to evacuate two settlements.\n\nRussia also set fire to Barabashovo market, one of the largest in Europe, in a series of strikes.\n\nFootage showed the market ablaze with at least four civilians wounded.\n\n9 Firefighters work at the site of a market in Kharkiv hit by a Russian drone strike Credit: Reuters\n\n9 A firefighter works at the site of the Barabashovo market Credit: Reuters\n\nPutin’s attack drones hit four separate districts of Kharkiv, Ukraine’s second city in two hours of hellish attacks from drones.\n\nKharkiv mayor Ihor Terekhov said: “For two hours, Kharkiv was under a massive attack by enemy combat drones.\n\n“During this time, 17 hits on the city were recorded.\n\n“Four districts of Kharkiv were under attack - Shevchenkivskyi, Kievskyi, Kholodnogorskyi and Industrialny”\n\nIt comes after Vladimir Putin unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.\n\nRussia's latest barbaric attack on the Ukrainian capital has left at least 11 injured - including two children.\n\nThe strikes from Moscow came just hours after Volodymyr Zelensky warned Kyiv won't be \"playing games\" with peace.\n\nPutin has imposed his own three-day ceasefire to coincide with Russia's Victory Day parade next week.\n\nUkraine has rejected the offer and described it as typical Kremlin theatrics.\n\nInstead, they called for a 30-day truce with Russia which Putin and his cronies have dully ignored."
    },
    {
        "title": "Vladimir Putin ‘hopes nuclear weapons will not be required’ in Ukraine",
        "description": "Russia and Ukraine are at odds over competing ceasefire proposals",
        "content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\nRussian President Vladimir Putin has said the need to use nuclear weapons in Ukraine has not arisen and he ... [2285 chars]",
        "url": "https://www.irishmirror.ie/news/world-news/vladimir-putin-hopes-nuclear-weapons-35167920",
        "image": "https://i2-prod.mirror.co.uk/incoming/article35144364.ece/ALTERNATES/s1200/3_Russia-Belarus-25119571208571.jpg",
        "publishedAt": "2025-05-04T12:38:16Z",
        "source": {
            "name": "Irish Mirror",
            "url": "https://www.irishmirror.ie"
        },
        "full_content": "Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time. More info\n\nRussian President Vladimir Putin has said the need to use nuclear weapons in Ukraine has not arisen and he hopes it will not.\n\nIn a preview of an interview with Russian state television, published on Telegram, Mr Putin said Moscow has the strength and the means to bring the conflict in Ukraine to a “logical conclusion”.\n\nResponding to a question about Ukrainian strikes on Russian territory, he said: “There has been no need to use those (nuclear) weapons … and I hope they will not be required.”\n\n“We have enough strength and means to bring what was started in 2022 to a logical conclusion with the outcome Russia requires,” he said.\n\nMr Putin signed a revamped version of Russia’s nuclear doctrine in November, spelling out the circumstances that would allow him to use the world’s largest atomic arsenal.\n\nThe document gave that option in response even to a conventional attack backed by a nuclear power.\n\nRussia and Ukraine are at odds over competing ceasefire proposals.\n\nUkrainian President Volodymyr Zelensky said on Friday, in comments made public on Saturday, that Moscow’s announcement of a 72-hour ceasefire next week in Ukraine to mark Victory Day in the Second World War is an attempt to create a “soft atmosphere” ahead of Russia’s annual celebrations.\n\nMr Zelensky instead renewed calls for a 30-day pause in hostilities, as the US had proposed. He said the proposed ceasefire could start any time as a meaningful step toward ending the war.\n\nMr Putin on Monday declared the unilateral 72-hour ceasefire as the US presses for a deal to end the three-year war.\n\nThe Kremlin said the truce, ordered on “humanitarian grounds”, will run from the start of May 8 and run until the end of May 10 to mark Moscow’s defeat of Nazi Germany in 1945 — Russia’s biggest secular holiday.\n\nMeanwhile, 11 people were wounded in a Russian drone attack overnight on the Ukrainian capital Kyiv, Ukraine’s State Emergency Service said on Sunday. Two children were among the wounded.\n\nRussia fired a total of 165 exploding drones and decoys overnight, Ukraine’s air force said. Of those, 69 were intercepted and 80 were lost, having probably been electronically jammed. Russia also launched two ballistic missiles.\n\nRussia’s Defence Ministry said its air defences shot down 13 Ukrainian drones overnight.\n\nSubscribe to our newsletter for the latest news from the Irish Mirror direct to your inbox: Sign up here."
    },
    {
        "title": "Putin ‘hopes’ nuclear weapons will not be needed as he targets ‘logical conclusion’ to war in Ukraine",
        "description": "Ukrainian forces partly destroy factory in Russia’s Bryansk region, says local governor",
        "content": "A local woman takes pictures on Sunday of a crater from a Russian drone explosion near the Dream Town shopping mall in the Obolonskyi district in Kyiv, Ukraine. Photograph: Vitalii Nosach/Global Images Ukraine via Getty Images\nRussian president Vladi... [2842 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/04/putin-says-he-hopes-nuclear-weapons-will-not-be-needed-as-he-targets-logical-conclusion-to-war-in-ukraine/",
        "image": "https://www.irishtimes.com/resizer/v2/6FR5OZXDMFDXPGH2BIWS6NE6KM.jpg?smart=true&auth=734e78af749efd2af682993b0a83cce0845f74e82d28a7f8adb28b83e411e8a3&width=1200&height=630",
        "publishedAt": "2025-05-04T09:33:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/04/putin-says-he-hopes-nuclear-weapons-will-not-be-needed-as-he-targets-logical-conclusion-to-war-in-ukraine/"
    },
    {
        "title": "Russia blitzes Kyiv with massive drone strike as Putin snubs 30-day ceasefire and Zelensky warns 'I will not play games'",
        "description": "VLADIMIR Putin has unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.Russia's latest barbaric attack on the",
        "content": "VLADIMIR Putin has unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.\nRussia's latest barbaric attack on the Ukrainian capital has left at least 11 injured - including two children.\n8 Firefighters work at th... [3990 chars]",
        "url": "https://www.thesun.ie/news/15153499/putin-ukraine-ceasefire-zelensky-kyiv/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/newspress-collage-ijz9ef47s-1746348386681.jpg?1746352579&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-04T08:53:39Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "VLADIMIR Putin has unleashed a terrifying swarm of drones on Kyiv after the despot rejected a 30-day truce deal.\n\nRussia's latest barbaric attack on the Ukrainian capital has left at least 11 injured - including two children.\n\n8 Firefighters work at the site of a Russian drone strike in Kyiv overnight Credit: Reuters\n\n8 Dozens of buildings were left severely damaged in the overnight strikes Credit: Getty\n\n8 Workers clean up debris in Kyiv in front of burnt out cars and shell-shocked residents Credit: AP\n\nThe strikes from Moscow come just hours after Volodymyr Zelensky warned Kyiv won't be \"playing games\" with peace.\n\nPutin has imposed his own three-day ceasefire to coincide with Russia's Victory Day parade next week.\n\nUkraine has rejected the offer and described it as typical Kremlin theatrics.\n\nInstead, they called for a 30-day truce with Russia which Putin and his cronies have dully ignored.\n\nAlongside their attempts to stifle genuine peace talks, Moscow has also continued to carry out attacks on Ukraine.\n\nPutin's military deployed a number of drones which hit civilians in Kyiv overnight.\n\nTwo children - aged 14 and `17 - were among the 11 left injured in the city alongside dozens of badly damaged buildings.\n\nA 12-floor residential tower block and a kindergarten were both left crumbling under Putin's attacks.\n\nTerrifying footage showed firefighters in the capital desperately battling the flames after the drone strikes.\n\nSeveral cars were left burnt out as residents were evacuated from their decimated homes.\n\nZelensky threatens Ukraine will strike Putin’s beloved May 9 Victory Day parade… despite Vlad declaring 3 day ceasefire\n\nMany civilians were asleep at the time of the attacks and were awoken by the sound of smashed glass and screaming neighbours.\n\nImages taken in the morning after showed huge craters in the ground from the drone blasts.\n\nEmergency officials spent hours cleaning up debris and helping those forced out of their homes return safely.\n\nElsewhere, Shahed drone strikes hit Cherkasy and Izyum, Kharkiv region.\n\nUkraine valiantly hit back with strikes of their own on Saturday night.\n\nThey reportedly hit the military-linked Strela electrical components plant at Suzemka.\n\nImages showed how it was left up in smoke after an attack.\n\nKyiv’s forces also hit a Russian command post in the Bakhmut direction which Ukrainian officials labelled a “devastating blow”.\n\n8 A huge crater which was left behind after the drone swarm Credit: Getty\n\n8 Putin also staged a bloody strike on Cherkasy Credit: East2West\n\n8 Residents were left without a home in the strikes Credit: Getty\n\nA day earlier, Zelensky's men made history as they destroyed one of Putin's prized fighter jets using a new missile-armed sea drone.\n\nUkraine's GUR military intelligence agency celebrated the remarkable strike - hailing it as the first time in history that a warplane was destroyed by a sea drone.\n\nThese latest tit-for-tat strikes came after Zelensky again demanded that a month-long ceasefire came into effect immediately.\n\nHe said: “We are ready to move toward a ceasefire as soon as possible – even starting today – if Russia is ready to take reciprocal steps – to establish complete silence, a lasting ceasefire of at least 30 days.\n\n“Russia must stop the war and halt its assaults and shelling.”\n\nBut Putin’s mouthpiece Dmitry Peskov said Moscow will only accept a three days of peace.\n\nPeskov claimed it was a test to judge \"Kyiv’s readiness\" to find a suitable solution to end the gruelling conflict.\n\nThese disagreements over a temporary halt to the war has only helped to increase anger over in Washington.\n\nUS President Donald Trump announced earlier this week that the US will no longer act as the mediator between Russia and Ukraine.\n\nThey said the decision has been made after Putin refused to accept a full ceasefire and instead offered a short three-day truce.\n\nAmerica said the country is changing “the methodology of how we contribute” to the talks and will no longer “fly around the world at the drop of a hat” for meetings.\n\nThe shift comes just two days after the US and Ukraine signed a historic minerals deal - in what appeared to be final push by Washington to broker a peace plan.\n\n8 Cars were left up in flames in Kyiv Credit: Reuters"
    },
    {
        "title": "Ukraine says no to Russian call for three-day ceasefire to cover Moscow’s commemoration of end of second World War",
        "description": "Zelenskiy says Russia’s proposal is ‘theatrical show’ that does not help peace talks",
        "content": "Ukrainian emergency workers clear rubble and search for victims at the site of a Russian missile strike in Kyiv on April 24. Photograph: Brendan Hoffman/The New York Times\nVolodymyr Zelenskiy on Saturday said Ukraine would not adhere to a three-day c... [5093 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/03/ukraine-no-to-russian-call-for-three-day-ceasefire-to-cover-moscows-commemoration-of-end-of-second-world-war/",
        "image": "https://www.irishtimes.com/resizer/v2/MSK3QKBHPFJ4PPVAOQOEEMWVFE.jpg?smart=true&auth=7c48d9137ffaa6cb970b5056b75af55f1657d08550415fe961958d6e3afd0754&width=1200&height=630",
        "publishedAt": "2025-05-03T20:49:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/03/ukraine-no-to-russian-call-for-three-day-ceasefire-to-cover-moscows-commemoration-of-end-of-second-world-war/"
    },
    {
        "title": "Dozens injured in Kharkiv, five in Novorossiysk as Ukraine and Russia trade drone attacks",
        "description": "Latest wave of attacks comes after US and Ukraine signed agreement granting American access to Ukraine’s mineral resources",
        "content": "Ukrainian rescuers extinguish a fire at a house after a drone strike on Kharkiv early on Saturday, amid Russia's ongoing invasion of Ukraine. Photograph: Sergey Bobok/AFP/Getty\nA strike by Russian drones on Ukraine‘s second-largest city has wounded 4... [2094 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/03/dozens-injured-in-kharkiv-five-in-novorossiysk-as-ukraine-and-russia-trade-drone-attacks/",
        "image": "https://www.irishtimes.com/resizer/v2/RQQC5PKSXL72D522DV2M2JKFQM.jpg?smart=true&auth=5d657faa2f93d37846e9bdda281a02366a3555d9bbe1ba36dd52da7227b84a52&width=1200&height=630",
        "publishedAt": "2025-05-03T08:48:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/03/dozens-injured-in-kharkiv-five-in-novorossiysk-as-ukraine-and-russia-trade-drone-attacks/"
    },
    {
        "title": "Russia 'fooling Ukrainian children into becoming suicide bombers for money' as desperate Putin turns to sick tactic",
        "description": "VLADIMIR Putin has been accused of recruiting Ukrainian children and brainwashing them into becoming suicide bombers.The desperate Russian despot has",
        "content": "VLADIMIR Putin has been accused of recruiting Ukrainian children and brainwashing them into becoming suicide bombers.\nThe desperate Russian despot has been offering teenagers and vulnerable civilians cash in exchange for their lives, according to Ukr... [6651 chars]",
        "url": "https://www.thesun.ie/news/15143126/russia-ukrainian-children-suicide-bombers/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/newspress-collage-9j60yceiz-1746139744383.jpg?1746143566&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-05-01T22:50:42Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "VLADIMIR Putin has been accused of recruiting Ukrainian children and brainwashing them into becoming suicide bombers.\n\nThe desperate Russian despot has been offering teenagers and vulnerable civilians cash in exchange for their lives, according to Ukrainian security services.\n\n7 A crumbling apartment building hit by a Russian drone strike in Zaporizhzhia Credit: Reuters\n\n7 The site of a Russian missile attack in Sumy this month as firefighters battle with the flames Credit: AFP\n\n7 Vladimir Putin has been accused of recruiting Ukrainian children and brainwashing them into becoming suicide bombers Credit: Reuters\n\nBack in March, a 15-year-old and a 17-year-old were recruited by Putin's henchmen and given orders to construct and carry a bag of explosives through a Ukrainian city, reports New Lines Magazine.\n\nThe teens were walking through the city of Ivano-Frankivsk when the improvised explosives they were carrying suddenly exploded.\n\nThe 17-year-old was instantly killed in the blast.\n\nHis younger friend was left hospitalised with life changing injuries.\n\nUkrainian officials later claimed the device they had been carrying - given to them by Russian handlers - had been remotely detonated.\n\nBoth had been offered \"easy money\", Ukraine said.\n\nA similar tragedy saw a group of Ukrainian soldiers targeted by a hired mum-of-one.\n\nIn February, an innocent looking woman walked up to a group of men who were outside a cafe in Mykolaiv.\n\nShe placed her bag next to the crowd and within seconds it exploded.\n\nIt was remotely detonated and killed the 42-year-old and three of the soldiers who were all members of Ukraine’s demining corps, Kyiv announced.\n\nZelensky threatens Ukraine will strike Putin’s beloved May 9 Victory Day parade… despite Vlad declaring 3 day ceasefire\n\nRussian media tried to claim the mum had acted out of vengeance after her young son was killed in the horrors of war.\n\nBut she had actually been allegedly recruited by Russia through Telegram.\n\nA Russian intelligence agent had given her the bag and said it contained a large amount of money which needed to be delivered to the men, the magazine reports says.\n\nThe woman had no idea she was set up to be a suicide bomber, it added.\n\nThere are no limits to what the Russians will do now Ed Bogan\n\nThe bomb had reportedly even been prepared by a group of teenagers aged between 14 and 17 from Poltava Oblast.\n\nA Ukrainian intelligence officer told New Lines that he believes Moscow deliberately entices in young people as they are easier to brainwash.\n\nThey said: “Teenagers and young people are easier to recruit for such actions, when you characterise what they’re being asked to do as some sort of game.\n\n“The Russian intelligence services consider such people ‘one-time’ assets and have never been worried about them.”\n\n7 Russian soldiers ride a truck during a rehearsal for the Victory Day military parade Credit: AP\n\n7 Russian drones engulfed the Ukrainian city of Odesa in flames just after the deal was signed Credit: Reuters\n\nThese attacks are just the latest in a slew of examples showing how Russia has become increasingly more desperate in their gruelling war.\n\nEd Bogan, a former CIA officer, blasted Putin's new warfare ploys and even compared them to other prolific terror groups.\n\nHe said: \"It’s al Qaeda and ISIS-level tactics.\n\n\"There are no limits to what the Russians will do now.\"\n\nRussian hybrid warfare expert Liubov Tsybulska labelled it an \"incredibly sinister and insidious tactic.\"\n\nHe also agreed with Mr Bogan.\n\n“It’s similar to tactics used by al Qaeda or Islamic State, except the people Russia recruits don’t know they’re going to blow themselves up,\" Tsybulska said.\n\n\"And they are happy to use the most vulnerable people - women or children - in such attacks. They really don’t care.”\n\nA nationwide campaign has even been launched by the Security Service of Ukraine to warn school children of the lurking threat of Russian recruitment online.\n\nThe kids are being urged to report any suspicious activity on social media straight away to the authorities so they can investigate properly.\n\nAnother one of Russia's deadly tactics is their incessant use of air attacks on innocent Ukrainians.\n\nTwo people were killed and at least 15 more were injured in overnight strikes by Putin.\n\nThey are happy to use the most vulnerable people - women or children - in such attacks. They really don’t care Liubov Tsybulska\n\nUkraine's air force said that mad Vlad launched at least five ballistic missiles and 170 drones.\n\nOne of the most devastating was a drone strike on Odesa - just hours after the US and Ukraine signed a landmark mineral deal.\n\nThe long-awaited deal comes two months after a historic bust-up between Don and his Ukrainian counterpart which shocked the world.\n\nFor Kyiv, the deal is central to binding it to Washington's might and preventing any more Russian invasions after a peace deal.\n\nTrump has vowed he wants peace in Ukraine, but has said that the US must be repaid for all the military support it has given the country.\n\nThe deal will provide Washington privileged access to new investment projects to develop Ukraine's natural resources, including aluminium, graphite, oil and natural gas.\n\nIt also means America will continue to back Ukraine in the war.\n\nUS-Ukraine minerals deal explained By Sayan Bose, Foreign News Reporter The minerals deal sets out the creation of a joint US-Ukrainian fund for reconstruction, which will receive 50 per cent of profits and royalties accruing to the Ukrainian state from new natural resources permits in Ukraine. The deal does not spell out how the joint fund's revenues will be spent, who benefits or who controls decisions about the spending. Now that the deal has been closed, the two sides will agree on two further technical and supplementary documents outlining issues such as how the funds are accumulated. Ukraine would retain control of all its resources in the deal, while the fund will invest in the development of Ukraine for 10 years, according to the country's prime minister Denys Shmyhal. The US could use its future military assistance to Ukraine as its contribution to the fund, Shmyhal said, with no previous military aid to the country reflected in the deal. \"Ukraine will only make a contribution from new licenses, from new royalties on mineral resources. This will be our contribution, 50% of which will be given to this fund,\" he added. A draft of the main minerals agreement showed that Ukraine had secured the removal of any requirement for it to pay back the US for past military assistance, something Ukraine had staunchly opposed. Washington has been Ukraine's single largest military donor since Russia's 2022 invasion, with aid of more than 64 billion euros ($72 billion), according to the Kiel Institute in Germany.\n\n7 US Treasury Secretary Scott Bessent and Ukrainian First Deputy Prime Minister Yulia Svyrydenko sign the minerals deal Credit: Reuters"
    },
    {
        "title": "Russia accuses Ukraine of killing civilians in drone strike on busy market, Kyiv denies",
        "description": "Ukraine says only military personnel were killed in attack",
        "content": "Local residents look out of broken windows in a damaged residential building following a drone attack in Odesa on Thursday, amid the Russian invasion of Ukraine. A Russian drone strike overnight killed at least two people and wounded 15 others in a r... [3709 chars]",
        "url": "https://www.irishtimes.com/world/europe/2025/05/01/russia-accuses-ukraine-of-killing-civilians-in-drone-strike-on-busy-market-kyiv-denies/",
        "image": "https://www.irishtimes.com/resizer/v2/QUONVAK3ZXUCT2RVG6ICNQBIQI.jpg?smart=true&auth=e8f59bc9aaa8f79de494b68f74854bff83092690b164221e79a49e499cc164b3&width=1200&height=630",
        "publishedAt": "2025-05-01T20:57:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2025/05/01/russia-accuses-ukraine-of-killing-civilians-in-drone-strike-on-busy-market-kyiv-denies/"
    },
    {
        "title": "Russia launches massive drone strike on Odesa hours after US & Ukraine sign key mineral deal as Vlad risks Trump’s rage",
        "description": "RUSSIA has launched a devastating drone strike on Odesa - just hours after the US and Ukraine signed a landmark mineral deal.Two people were killed an",
        "content": "RUSSIA has launched a devastating drone strike on Odesa - just hours after the US and Ukraine signed a landmark mineral deal.\nTwo people were killed and at least 15 more were by Vladimir Putin's blitz - marking a clear rebuke of the new agreement.\n9 ... [9836 chars]",
        "url": "https://www.thesun.ie/news/15137762/russia-ukraine-drone-strike-odesa-vlad/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/05/crop-34737832.jpg?strip=all&quality=100&w=854&h=568&crop=1",
        "publishedAt": "2025-05-01T07:18:55Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "RUSSIA has launched a devastating drone strike on Odesa - just hours after the US and Ukraine signed a landmark mineral deal.\n\nTwo people were killed and at least 15 more were by Vladimir Putin's blitz - marking a clear rebuke of the new agreement.\n\n9 A medical worker evacuates residents from an apartment building damaged during a Russian drone strike, amid Russia’s attack Credit: Reuters\n\n9 Firefighters work at the site of a Russian drone strike, amid Russia’s attack on Ukraine, in Odesa, Ukraine, in this handout picture released May 1 Credit: Reuters\n\n9 A view shows the site of the Russian drone strike, which killed two people Credit: Reuters\n\n9 Putin has long attempted to snub any deal between the US and Ukraine Credit: AFP\n\nRaging fires were sparked and various buildings were damaged, according to emergency services.\n\nRegional governor Oleh Kiper said: \"The enemy attack damaged residential high-rises, private houses, a supermarket, a school, and cars.\"\n\nHe confirmed that rescue workers were extinguishing flames following the horrific attack.\n\nUkraine's state-owned railway Ukrzaliznytsia said the overnight attack damaged its tracks and various trains.\n\nThey said: \"Railway employees are carrying out rapid repair work to ensure that freight trains run to ports without interruption.\n\n\"They are currently following an alternative route.\"\n\nThe company added that one of the people killed in the strikes was a railway worker.\n\nUkraine's air force said that mad Vlad launched five ballistic missiles and 170 drones during the overnight blitz.\n\n74 drones were shot down while another 68 did not reach their targets, according to the force.\n\nImages showed vile Vlad's damage - with fiery infernos blazing up in apartments and civilians fleeing from their homes.\n\nUS & Ukraine finally sign critical mineral deal months after horror White House row\n\nIt comes mere hours after the Russian tyrant was dealt a massive blow due to Trump and Volodymyr Zelensky's agreement to a critical minerals deal.\n\nThe long-awaited deal comes two months after a historic bust-up between The Don and his Ukrainian counterpart which shocked the world.\n\nFor Kyiv, the deal is central to binding it to Washington's might and preventing any more Russian invasions after a peace deal.\n\nTrump has vowed he wants peace in Ukraine, but has said that the US must be repaid for all the military support it has given the country.\n\nThe deal will provide Washington privileged access to new investment projects to develop Ukraine's natural resources, including aluminium, graphite, oil and natural gas.\n\nIt also means America will continue to back Ukraine in the war.\n\nZelensky did not go to Washington to sign the deal - instead it was inked by Ukraine's First Deputy Prime Minister Yulia Svyrydenko.\n\nShe said after: \"Together with the United States, we are creating the Fund that will attract global investment into our country.\"\n\nTrump initially was due to close the deal when Zelensky visited the White House back in February.\n\nBut plans were derailed after their historic White House row, which saw the infamous shouting match erupt and Trump asking Zelensky to leave.\n\n9 The strike damaged buildings and sparked fires Credit: Reuters\n\n9 At least 15 people were injured and two were killed Credit: Reuters\n\n9 The deal comes after US President Donald Trump and Ukraine’s President Volodymyr Zelensky clashed in the Oval Office of the White House in February Credit: AFP\n\n9 Trump and Zelensky meeting inside St Pater's Basilica Credit: Ukraine Presidential Office\n\nAfter rounds of back-and-forth diplomatic negotiations, both Washington and Kyiv agreed to sign the deal Wednesday.\n\nAnnouncing the signing of the deal in Washington, Treasury Secretary Scott Bessent said it showed \"both sides' commitment to lasting peace and prosperity in Ukraine.\"\n\nHe added: \"This agreement signals clearly to Russia that the Trump administration is committed to a peace process centred on a free, sovereign and prosperous Ukraine over the long term.\n\n\"And to be clear, no state or person who financed or supplied the Russian war machine will be allowed to benefit from the reconstruction of Ukraine.\"\n\nUNCLE SAM'S SECURITY\n\nUkrainian officials hope that signing the deal proposed by Trump will firm up American support for Kyiv in the more than three-year-old war.\n\nA former Trump advisor told LBC the developing US-Ukraine minerals deal will be a \"trip wire\" that Russia will not cross.\n\nHe said: \"It would engage the American military. It puts the Americans squarely in the middle of the Ukrainian state. It is a trip wire that Putin would dare not to cross.\"\n\nTrump had originally sought $500 billion in mineral wealth -- around four times what the United States has contributed to Ukraine since the war.\n\nHe has previously baulked at offering security guarantees to Ukraine and has rejected its aspiration to join Nato.\n\nUS-Ukraine minerals deal explained By Sayan Bose, Foreign News Reporter The minerals deal sets out the creation of a joint US-Ukrainian fund for reconstruction, which will receive 50 per cent of profits and royalties accruing to the Ukrainian state from new natural resources permits in Ukraine. The deal does not spell out how the joint fund's revenues will be spent, who benefits or who controls decisions about the spending. Now that the deal has been closed, the two sides will agree on two further technical and supplementary documents outlining issues such as how the funds are accumulated. Ukraine would retain control of all its resources in the deal, while the fund will invest in the development of Ukraine for 10 years, according to the country's prime minister Denys Shmyhal. The US could use its future military assistance to Ukraine as its contribution to the fund, Shmyhal said, with no previous military aid to the country reflected in the deal. \"Ukraine will only make a contribution from new licenses, from new royalties on mineral resources. This will be our contribution, 50% of which will be given to this fund,\" he added. A draft of the main minerals agreement showed that Ukraine had secured the removal of any requirement for it to pay back the US for past military assistance, something Ukraine had staunchly opposed. Washington has been Ukraine's single largest military donor since Russia's 2022 invasion, with aid of more than 64 billion euros ($72 billion), according to the Kiel Institute in Germany. The rare earth minerals Washington will have access to Rare earth elements are a set of 17 elements that are essential in many kinds of consumer technology, including cellphones, hard drives and electric and hybrid vehicles. It is unclear if Trump is seeking specific elements that Ukraine has. The country also has other in-demand minerals to offer including lithium, titanium, and uranium. The country's reserves of titanium, a key component for the aerospace, medical and automotive industries, are believed to be among Europe's largest. Ukraine also holds some of Europes largest known reserves of lithium, which is required to produce batteries, ceramics and glass. China, Trumps chief geopolitical adversary, is the worlds largest producer of rare earth elements. Both the US and Europe have sought to reduce their dependence on Beijing. For Ukraine, such a deal would ensure that its biggest and most consequential ally does not freeze military support, which would be devastating for the country that will soon enter its fourth year of war against Russia's full-scale invasion. The idea also comes at a time when reliable and uninterrupted access to critical minerals is increasingly hard to come by globally. Ukraines rare earth elements are largely untapped because of the war, regulation, and information about what exactly is underground. An estimated 40 per cent of Ukraine's metallic mineral resources are inaccessible because of Russian occupation, according to data from We Build Ukraine, a Kyiv-based think tank. Ukraine has argued that it is in Trumps interest to develop the remainder before Russian advances capture more. The European Commission identified Ukraine as a potential supplier for over 20 critical raw materials and concluded that the countrys accession to the EU could strengthen the European economy. In 2021, the Ukrainian mineral industry accounted for 6.1% of the countrys gross domestic product and 30% of exports.\n\nBut Trump said on Wednesday that a US presence on the ground would benefit Ukraine.\n\n\"The American presence will, I think, keep a lot of bad actors out of the country or certainly out of the area where we're doing the digging,\" Trump said at the cabinet meeting.\n\nHe reiterated that the US should get something for its prior aid to Kyiv, thus the effort to secure a deal for Ukraine's plentiful deposits of rare earth minerals.\n\n\"I assume they're going to honour the deal. We haven't really seen the fruits of that deal yet. I suspect we will,\" Trump said after a cabinet meeting on Wednesday.\n\nUkraine holds some five per cent of the world's mineral resources and rare earths, according to various estimates.\n\nBut work has not yet started on tapping many of the resources, and many sites are in territory now controlled by Russian forces.\n\nNotably, Ukraine has around 20 per cent of the world's graphite, an essential material for electric batteries, according to France's Bureau of Geological and Mining Research.\n\nUkraine is also a major producer of manganese and titanium, and says it possesses the largest lithium deposits in Europe.\n\nRussia controls about 20 per cent of Ukraine's territory after more than three years of brutal fighting that has killed tens of thousand,s including civilians.\n\n9 Zelensky's Ukraine will hope that the deal will ensure that its most consequential ally does not freeze military support Credit: Rex\n\nMore to follow... For the latest news on this story keep checking back at The Sun Online\n\nThesun.co.uk is your go-to destination for the best celebrity news, real-life stories, jaw-dropping pictures and must-see video.\n\nLike us on Facebook at www.facebook.com/thesun and follow us from our main Twitter account at @TheSun."
    },
    {
        "title": "North Korea and Russia begin work on first road link",
        "description": "Relations and exchange programmes between the two countries have been flourishing in recent years.",
        "content": "North Korea and Russia have begun building their first road link with the construction of a bridge over a border river hailed as a major development which will further expand their ties.\nRussia’s Tass news agency reported on Wednesday that the bridge... [2383 chars]",
        "url": "https://www.breakingnews.ie/world/north-korea-and-russia-begin-work-on-first-road-link-1758267.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMDEwNzIxNDFcXFwvYTBmM2U0MmNiNTM4NGMwM2JmODAzMTQ2MTA0OTRhMzUuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJkNTUxZTlmYjNkNGRlZjhjOTczMTJjNmI4NTY2OWMxNTA5ODZlMDA3In0=/north-korea-and-russia-begin-work-on-first-road-link.jpg",
        "publishedAt": "2025-04-30T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "North Korea and Russia have begun building their first road link with the construction of a bridge over a border river hailed as a major development which will further expand their ties.\n\nRussia’s Tass news agency reported on Wednesday that the bridge would be one kilometre long and its construction is expected to take one-and-a-half years, and North Korea’s Korean Central News Agency (KCNA) said the bridge would expand cross-border travel of people, tourism and circulation of commodities.\n\nAdvertisement\n\nRelations and exchange programmes between the two countries have been flourishing in recent years with North Korea supplying ammunition and troops to support Russia’s war against Ukraine.\n\n\n\nOfficials from North Korea and Russia stand in front of a monument to mark a ground-breaking ceremony for the construction of a bridge between the two countries, in Rason Municipality, North Korea (Korean Central News Agency/Korea News Service via AP)\n\nOne railway bridge and air service already connect North Korea and Russia and in June 2024, the two countries agreed to construct a bridge for road vehicles over the Tumen River, which runs along North Korea’s borders with Russia and China.\n\nOn Thursday, North Korea and Russia simultaneously held a ground-breaking ceremony for the bridge’s construction in their respective border cities, according to the two countries’ state media agencies.\n\nThe agencies said North Korean premier Pak Thae Song and Russian prime minister Mikhail Mishustin attended the ceremony via video links.\n\nAdvertisement\n\nMr Pak said the bridge’s construction would be remembered as “a historic monument” in bilateral ties, KCNA reported on Thursday.\n\n“This is a big milestone for Russian-Korean relation,” Mr Mishustin said, according to Tass. “We are creating a reliable basis for closer cooperation between our two countries, a road for an open and fruitful dialogue.”\n\nOn Monday, North Korea confirmed for the first time that it had sent combat troops to Russia to help it reclaim parts of the Kursk region which Ukraine forces seized last year.\n\nRussian President Vladimir Putin thanked North Korea and promised not to forget the sacrifices of North Korean soldiers for Russia.\n\nAdvertisement\n\nAccording to a South Korean government intelligence assessment shared with lawmakers on Wednesday, North Korea has sent about 15,000 soldiers to Russia and 4,700 of them have been killed or wounded.\n\nIn return for North Korea’s supply of conventional arms, Russia has given it air defence missiles, electronic warfare equipment, drones and technology for spy satellite launches, according to the South Korean assessment."
    },
    {
        "title": "What Trump and Zelensky 'said to each other at Pope funeral revealed' as pressure mounts on Putin to make a deal",
        "description": "VOLODYMYR Zelensky is said to have urged Donald Trump to take a tougher stance against Russia when the leaders met during Pope Francis' funeral.Top US",
        "content": "VOLODYMYR Zelensky is said to have urged Donald Trump to take a tougher stance against Russia when the leaders met during Pope Francis' funeral.\nTop US officials revealed that the Ukrainian leader was able to influence Trump, who appeared to be cosyi... [7960 chars]",
        "url": "https://www.thesun.ie/news/15136361/trump-zelensky-pope-funeral-putin/",
        "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2025/04/newspress-collage-l3gu1f7gw-1746041496681.jpg?1746045411&strip=all&quality=100&w=1920&h=1080&crop=1",
        "publishedAt": "2025-04-30T19:35:05Z",
        "source": {
            "name": "The Irish Sun",
            "url": "https://www.thesun.ie"
        },
        "full_content": "VOLODYMYR Zelensky is said to have urged Donald Trump to take a tougher stance against Russia when the leaders met during Pope Francis' funeral.\n\nTop US officials revealed that the Ukrainian leader was able to influence Trump, who appeared to be cosying up with Vladimir Putin since returning to the White House.\n\n8 Trump and Zelensky meeting inside St Pater's Basilica Credit: Ukraine Presidential Office\n\n8 The pair met ahead of the Pope's funeral Credit: Ukraine Presidential Office\n\n8 Ukrainian service members of the 25th Sicheslav Airborne Brigade fire a BM-21 Grad multiple rocket launch system towards Russian troops Credit: Reuters\n\nThe whole world's eyes were on Zelensky and Trump at the Vatican City, where both leaders pulled chairs to the side to have a tête-à-tête.\n\nIt was the first time they were pictured meeting together since their historic - and disastrous - White House row, which saw a shouting match between them.\n\nHowever, both presidents agreed to hold a quick, 15-minute one-on-one meeting on the sidelines of Pope Francis's funeral.\n\nThe chat took place inside the holy St Peter's Basilica with both leaders discussing the dragging Russia-Ukraine war, and America's efforts to put an end to it.\n\nTwo senior sources familiar with the contents of the meeting told Axios that Zelensky had urged President Trump to take a tougher stance on Putin,\n\nThe Ukrainian leader is also said to have retreated his demands for an unconditional ceasefire, which was proposed by the US weeks ago but rejected by the Kremlin.\n\nIt is understood that Zelensky told Trump he was ready to make concessions in a bid to bring peace to his war-torn nation, but demanded strong security guarantees in return.\n\nZelensky said it was a \"good\" 15-minute meeting.\n\nHe added: \"We discussed a lot one-on-one. Hoping for results on everything we covered. Protecting the lives of our people.\n\n\"Full and unconditional ceasefire. Reliable and lasting peace that will prevent another war from breaking out.\"\n\nHow scheming Putin has undermined Trump’s 100 day peace plan for finally end bloody war in Ukraine\n\nSources told Axios that Trump seemed to agree to what Zelensky was asking. The White House didn't confirm or deny it.\n\nHe is said to have replied by saying he might have changed his approach to dealing with Putin, which was visible shortly after their chat.\n\nJust hours after the meeting, Trump slammed Putin for \"tapping him along\" during his efforts for peace.\n\nHe said: \"There was no reason for Putin to be shooting missiles into civilian areas, cities and towns over the last few days.\n\n8 US President Donald Trump and Ukraine’s President Volodymyr Zelensky meet in the Oval Office of the White House in February Credit: AFP\n\n8 Macron and Starmer have were also pictured with the pair\n\n8 Rescuers work at the site of a drone strike in Kharkiv, Ukraine Credit: EPA\n\n8 Experts beloved Trump is being played by Putin Credit: AFP\n\n\"It makes me think that maybe he doesn’t want to stop the war, he’s just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\"\n\nTrump also ordered Putin to \"sit down and sign a deal\", as he said Ukraine's battlefields are covered in body parts.\n\nThe US and Ukrainian leaders have vowed to hold further talks in the coming days.\n\nTrump said on Sunday he was both \"surprised and disappointed, very disappointed\" that mad Vlad continued to bomb Ukraine, despite the dictator engaging in crunch talks with US peace envoy Steve Witkoff.\n\nIt came after Putin's barbaric missile strikes on Kyiv earlier this week that left at least 12 dead.\n\nRussia announced a token ceasefire to coincide with VE Day after President Trump accused Putin of stringing him along on peace talks.\n\nThe Kremlin said troops will stop fighting for 96 hours midnight on 7 May.\n\nThe pause will coincide with events to mark the 80th anniversary of the end of WW2 in Europe.\n\nBut Moscow dashed hopes of a peace deal by repeating demands that Ukraine must surrender and disarm.\n\nTrump is said to be growing \"increasingly frustrated\" with both Putin and Zelensky in his attempts to bring the Ukraine war to a close.\n\nWhite House press secretary Karoline Leavitt said Trump has \"made it clear\" he wants a permanent ceasefire, rather than the temporary pause offered by the scheming Russian tyrant.\n\nBut experts say this was Putin's plan all along, and he's played Trump like a fiddle.\n\nART OF THE DEAL\n\nOne of the topics that Trump brought up during the 15-minute chat is understood to be the re-negotiated US-Ukraine minerals deal, which fell apart after the historic Oval Office spat.\n\nTrump is said to have pressed Zelensky to agree to the deal as soon as possible, the sources told Axios.\n\nUkraine and the US officials said today they were ready to sign a minerals deal imminently after months of sometimes fraught negotiations.\n\nHowever, an eleventh-hour snag injected uncertainty into the timing.\n\nUS Treasury Secretary Scott Bessent told reporters at the White House: \"Our side is ready to sign. The Ukrainians decided last night to make some last-minute changes.\n\n\"We're sure that they will reconsider that, and we are ready, if they are.\"\n\nUS-Ukraine minerals deal explained By Sayan Bose, Foreign News Reporter The minerals draft sets out the creation of a joint US-Ukrainian fund for reconstruction, which will receive 50 per cent of profits and royalties accruing to the Ukrainian state from new natural resources permits in Ukraine. The draft does not spell out how the joint fund's revenues will be spent, who benefits or who controls decisions about the spending. Once the main agreement was signed, the two sides would agree on two further technical and supplementary documents outlining issues such as how the funds are accumulated. Ukraine would retain control of all its resources in the deal, while the fund will invest in the development of Ukraine for 10 years, according to the country's prime minister Denys Shmyhal. The U.S could use its future military assistance to Ukraine as its contribution to the fund, Shmyhal said, with no previous military aid to the country reflected in the deal. \"Ukraine will only make a contribution from new licenses, from new royalties on mineral resources. This will be our contribution, 50% of which will be given to this fund,\" he added. A draft of the main minerals agreement showed that Ukraine had secured the removal of any requirement for it to pay back the US for past military assistance, something Ukraine had staunchly opposed. Washington has been Ukraine's single largest military donor since Russia's 2022 invasion, with aid of more than 64 billion euros ($72 billion), according to the Kiel Institute in Germany.\n\nA Ukrainian official was on the way to Washington for the signing.\n\nBut a source said the US was pushing Ukraine to sign two additional documents and that Kyiv felt it was premature.\n\nBessent denied the US made any attempt to change the accord the two sides agreed to over the weekend.\n\nThe agreement, which would give the United States access to Ukraine's mineral deposits, is central to Kyiv's efforts to mend ties with Trump\n\nFor the White House, it is a bid to secure a peace settlement in Russia's war in Ukraine.\n\nTwo sources said it could happen later on Wednesday.\n\nUkraine's First Deputy Prime Minister Yulia Svyrydenko was flying to the United States to sign the deal, the country's prime minister said earlier.\n\nTrump repeated on Wednesday that the U.S. should get something for its prior aid to Kyiv, thus the effort to secure a deal for Ukraine's plentiful deposits of rare earth minerals.\n\n\"I assume they're going to honour the deal. ... We haven't really seen the fruits of that deal yet. I suspect we will,\" Trump said after a cabinet meeting on Wednesday.\n\nUkrainian officials hope that signing the deal promoted by Trump will firm up American support for Kyiv in the more than three-year-old war.\n\nA former Trump advisor told LBC the developing US-Ukraine minerals deal will be a \"trip wire\" that Russia will not cross.\n\nHe said: \"It would engage the American military. It puts the Americans squarely in the middle of the Ukrainian state. It is a trip wire that Putin would dare not to cross.\""
    }
]