[
    {
        "title": "Former Ukrainian Politician Linked to Russia Is Shot Dead",
        "description": "A former high-ranking Ukrainian politician was shot dead on Wednesday, just after dropping off his children at school in Spain. Andriy Portnov, 51, had departed the American School...",
        "content": "A former high-ranking Ukrainian politician was shot dead on Wednesday, just after dropping off his children at school in Spain. Andriy Portnov, 51, had departed the American School of Madrid in the city's Pozuelo de Alarcon district around 9:15am loc... [509 chars]",
        "url": "https://www.newser.com/story/369045/former-ukrainian-politician-linked-to-russia-is-shot-dead.html",
        "image": "https://img2-azrcdn.newser.com/image/1611881-12-20250521112117.jpeg",
        "publishedAt": "2025-05-21T21:05:00Z",
        "source": {
            "name": "Newser",
            "url": "https://www.newser.com"
        },
        "full_content": "A former high-ranking Ukrainian politician was shot dead on Wednesday, just after dropping off his children at school in Spain. Andriy Portnov, 51, had departed the American School of Madrid in the city's Pozuelo de Alarcon district around 9:15am local time when at least one gunman repeatedly fired at him. Portnov, shot at least three times in the head and back as he was getting into his vehicle, died at the scene, per the BBC and AP. One alleged gunman, whom witnesses described as thin and wearing a blue tracksuit, fled into the woods of a nearby public park, per the BBC. Local media reports suggest he may have had an accomplice on a motorbike. The school noted that police were on campus interviewing parents who witnessed the shooting, per Reuters."
    },
    {
        "title": "To end the war in Ukraine, make Beijing's bankrolling of Russia's war machine hurt",
        "description": "If President Trump wants a true end to the war in Ukraine, he needs to unleash secondary sanctions on those who are keeping Russia's war machine chugging.",
        "content": "If President Donald Trump wants lasting peace in Ukraine, he needs to unleash secondary sanctions on the countries keeping Vladimir Putin’s bloody war going.\nTrump left Monday’s call with Putin in an optimistic mood, posting that the chat “went very ... [2126 chars]",
        "url": "https://nypost.com/2025/05/19/opinion/to-end-the-war-in-ukraine-make-beijings-bankrolling-of-russias-war-machine-hurt/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/AP_APTOPIX_Russia_Victory_Day_39533-68ec0-0-e1747694393546.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2025-05-19T23:48:43Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "If President Donald Trump wants lasting peace in Ukraine, he needs to unleash secondary sanctions on the countries keeping Vladimir Putin’s bloody war going.\n\nTrump left Monday’s call with Putin in an optimistic mood, posting that the chat “went very well” and that “Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.”\n\nThing is, Putin’s readout of the call still signaled that he’ll accept nothing less than domination of Ukraine: That’s what he means when he declares the overriding need “to eliminate the root causes of this crisis.”\n\nIn Vlad’s mind, the “root cause” of the war is Ukraine’s sovereignty, so “Russia is ready to work with Kyiv” toward peace only via Kyiv’s surrender.\n\nTrump’s going to need to a big stick to get Putin to meaningfully bend.\n\nRussia illegally invaded under the guise of “de-Nazifying” the country and saving Russian-speaking Ukrainians from “oppression” — grievances impossible to address because they’re baseless.\n\nIn all negotiations so far, Putin has insisted on conditions that would leave Kyiv neutered and vulnerable: demilitarization, NATO membership off the table, letting Russia keep all the territory it’s occupying and then some.\n\nVlad won’t back off those demands unless he has no other option.\n\nSen. Lindsey Graham (R-SC) has a solution primed and ready: A bill he introduced with Sen. Richard Blumenthal (D-Conn.) to impose a crippling a 500% tariff on imported goods from countries that buy Russian oil, gas, uranium etc.\n\nThat would slam China, which has kept Putin’s war machine chugging with those energy purchases and exporting hundreds of billions in products to Moscow, staving off catastrophic inflation and shortages.\n\nWithout that lifeline, Russia’s already limping economy would go kaput.\n\nPresident Xi Jinping sees Putin as an ally in his war on the West, but will only suffer so much economic pain on behalf of Moscow.\n\nA call from him could force Vlad to face reality at the negotiating table.\n\nGraham has said that the secondary sanctions bill has enough bipartisan support to pass “if Russia does not embrace an honorable, just and enduring peace.”\n\nPutin is making it ever more clear he has no intention to do so.\n\nTrump should give the go-ahead to start making China’s bankrolling of Moscow’s bloodlust hurt.\n\nThe road to peace in Ukraine goes through Beijing."
    },
    {
        "title": "Trump administration live updates: Trump says Russia-Ukraine ceasefire talks to begin 'immediately'",
        "description": "President Donald Trump said he spoke to Ukrainian President Volodymyr Zelenskyy and various European leaders after his call with Russian President Vladimir Putin.",
        "content": "The Justice Department’s Civil Rights Division said in a letter on social media today that it was opening up an investigation into the city of Chicago after Mayor Brandon Johnson made comments yesterday highlighting prominent Black officials in his a... [578 chars]",
        "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-putin-zelenskyy-biden-tariffs-doge-live-updates-rcna207451",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250517-trump-ch-1312-9102f4.jpg",
        "publishedAt": "2025-05-19T23:34:48Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "full_content": "For years, Kash Patel and Dan Bongino have said the Biden administration and corrupt “deep state” actors “weaponized” the FBI against Trump.\n\nThey accused the bureau of covering up what it knew about pipe bombs placed before the Jan. 6 attack. They suggested that FBI operatives helped ignite the Capitol riot. They said FBI agents committed crimes and tried to “overthrow” Trump.\n\nWhen Patel and Bongino did that, they weren’t just saying they disagreed with FBI investigative or prosecution decisions. They were accusing people of federal crimes. It would be illegal to investigate and prosecute someone because you didn’t like their political beliefs, which is what they are saying happened. And there is no evidence to support that.\n\nNow that the two men lead the FBI, Director Patel and Deputy Director Bongino find themselves in an awkward position. Large numbers of Trump supporters still believe all those things, and some are publicly asking: Why haven’t Bongino and Patel exposed the “truth” about the “deep state” they promised? Why isn’t the Trump administration arresting and prosecuting the people Patel labeled “government gangsters”?\n\nRead the full story here."
    },
    {
        "title": "Trump backs off meeting with Putin, calls for direct Ukraine-Russia talks",
        "description": "President Donald Trump is set to speak Monday with Vladimir Putin, in what the U.S. president said is an attempt to stop the “bloodbath” of the war in Ukraine.",
        "content": "President Donald Trump spoke with both Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy and other leaders in separate calls Monday, in an attempt to stop the “bloodbath” of the war in Ukraine.\nBut the president’s outreach ... [6521 chars]",
        "url": "https://www.nbcnews.com/world/russia/trump-set-implore-putin-end-bloodbath-ukraine-high-stakes-phone-call-rcna207612",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-Kyiv-RS-77b58f.jpg",
        "publishedAt": "2025-05-19T23:18:59Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "full_content": "President Donald Trump spoke with both Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy and other leaders in separate calls Monday, in an attempt to stop the “bloodbath” of the war in Ukraine.\n\nBut the president’s outreach was inconclusive, and there was little sign of a breakthrough. Russia and Ukraine would hold direct talks on a ceasefire “immediately,” Trump said afterward in a post on his social network Truth Social, but it was unclear what form those talks would take or when they would happen. The Vatican, Trump said, has expressed interest in hosting the negotiations.\n\n“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” he said.\n\nTrump’s call with Putin lasted more than two hours and “was very informative and very open,” Putin told Russian state media.\n\nSpeaking to reporters in the Oval Office Monday afternoon, Trump said he had asked Putin to meet with him, but did not say whether Putin had agreed.\n\nTrump said little about his conversation with Zelenskyy, with whom he spoke first, other than to say that he had informed Zelenskyy and the leaders of other NATO countries of the negotiations. White House officials declined to offer any further details.\n\nTrump spoke with Zelenskyy twice on Monday, according to Zelenskyy, once one-on-one, before Trump’s call with Putin, and again during a conference call with the Ukrainian and NATO leaders.\n\n“I reaffirmed to President Trump that Ukraine is ready for a full and unconditional ceasefire,” Zelenskyy tweeted. “If the Russians are not ready to stop the killings, there must be stronger sanctions,” he wrote. “Pressure on Russia will push it toward real peace — this is obvious to everyone around the world.”\n\nIn a Monday interview with NBC News in Rome, where he was received by Pope Leo XIV, Vice President JD Vance said, “We talked about a couple of what I would call the president’s major peace initiatives with the pope. We talked a lot about what’s going on in Israel and Gaza. We talked a lot about the Russia-Ukraine situation. It’s hard to predict the future, but I do think that, not just the pope, but the entire Vatican, has expressed a desire to be, you know, really helpful, and to work together on facilitating, hopefully, a peace deal coming together. Can’t predict the future, but that was very meaningful, and I think will hopefully bear fruit for the country.”\n\nMeanwhile, Putin’s spokesperson Dmitry Peskov said before the call that Russia “highly values” and is “grateful to the American side.” In a briefing with journalists, he said that if the U.S. can “help to achieve our goals through peaceful means, then this is indeed preferable.”\n\nPeskov was also asked about the chance of Trump and Putin meeting in person, a possibility the American president floated on Friday.\n\n“It will largely depend on what they themselves decide,” Peskov said. The meeting “needs to be worked out” by the two leaders in terms of dates and other details, he added.\n\nAhead of the much anticipated Trump-Putin call, leaders from Britain, France, Germany and Italy said they spoke Sunday with Trump. The British government said in a statement that it was urging “Putin to take peace talks seriously.”\n\nThose leaders “also discussed the use of sanctions if Russia failed to engage seriously in a ceasefire and peace talks,” the statement said — something Trump has previously threatened.\n\nA house heavily damaged by a Russian drone strike, outside Kyiv on Sunday. Valentyn Ogirenko / Reuters\n\n“Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe,” French President Emmanuel Macron said on X.\n\nTrump has been widely criticized for appearing to offer concessions to Russia while demanding sacrifices from Ukraine. Those voices were joined last week by former U.S. Ambassador to Ukraine Bridget Brink, who gave details of why she stepped down last month.\n\n“The policy since the beginning of the Trump administration has been to put pressure on the victim, Ukraine, rather than on the aggressor, Russia,” she wrote in an opinion piece Friday for the Detroit Free Press.\n\n“Peace at any price is not peace at all ― it is appeasement,” she said, adding that “we must show leadership in the face of aggression, not weakness or complicity.”\n\nWhile the diplomatic activity carries on, the violence in Ukraine continues. Russia has continued its near-nightly drone and missile attacks on Ukrainian civilians, more than three years after it launched a full-scale invasion and tried to seize Kyiv.\n\nOn Sunday, Russia shelled residential neighborhoods of the eastern Ukrainian city of Kherson, killing a 75-year-old woman and injuring two other people, the city council posted on the Telegram messaging site.\n\nAs well as being widely blamed for launching an unprovoked war, Russia is condemned across the West for the highly repressive and authoritarian state fashioned by Putin's Kremlin.\n\nOn Monday, the Russian Prosecutor General’s Office labeled one of those critics, Amnesty International, as an \"undesirable organization\" and effectively banned it. The authority accused the London-based human rights watchdog of being \"Russophobic,\" trying to prolong the war, wanting to \"justify the crimes of Ukrainian neo-Nazis\" and its staffers of supporting \"extremist organizations.\"\n\nTrump, who has often spoken warmly of Putin, rarely if ever mentions these human rights concerns.\n\nTrump said in a Truth Social post on Saturday that he would be speaking with Putin at 10 a.m. Monday with the purpose of “stopping the ‘bloodbath’ that is killing, on average, more than 5,000 Russian and Ukrainian soldiers a week.” NBC News has not independently verified the numbers that Trump cited.\n\nTrump and Putin shake hands before a meeting in Helsinki in 2018. Brendan Smialowski / AFP via Getty Images file\n\nApparently referring both to his planned call with Putin and his slated talks with Zelenskyy and other European leaders, Trump added that “hopefully it will be a productive day, a ceasefire will take place, and this very violent war, a war that should have never happened, will end.”\n\nDespite promising on multiple occasions to end the war in 24 hours of taking office, Trump has since found the reality much different since beginning his second term.\n\nU.S.-brokered negotiations saw Russia and Ukrainian delegations meet in person in Istanbul last week for the first time since the early days of the war.\n\nHowever, the demands of the two sides remain far apart, with Russia saying it will only agree to a truce if Ukraine effectively surrenders. Ukraine has said these demands are unacceptable."
    },
    {
        "title": "Ukraine drones destroy Russian radar, supply depots in the Black Sea",
        "description": "The strike followed Russia's mass drone attack Ukrainian territory on Saturday, which Kyiv said was the largest recorded so far in the bloody 3-plus-year war.",
        "content": "A pair of drones destroyed a Russian radar system and military warehouse facilities at a gas production platform in the Black Sea on Monday, according to the Security Service of Ukraine (SBU).\nThe strike followed Russia’s mass drone attack on Ukraini... [1764 chars]",
        "url": "https://nypost.com/2025/05/19/world-news/ukraine-drones-destroy-russian-radar-supply-depots-in-the-black-sea/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/ukraine-drones-destroy-russian-radar-104888559.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2025-05-19T18:44:34Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "A pair of drones destroyed a Russian radar system and military warehouse facilities at a gas production platform in the Black Sea on Monday, according to the Security Service of Ukraine (SBU).\n\nThe strike followed Russia’s mass drone attack on Ukrainian territory on Saturday, which Kyiv said was the largest recorded so far in the bloody 3-plus-year war.\n\nFootage from the SBU shows the first drone soaring across the Black Sea and crashing into the tower of the gas production site, reportedly taking out a Russian Neva radar used to monitor aerial attacks.\n\nA second drone flew underneath the plant for a follow-up strike, which was aimed at destroying military supply depots that Ukraine said were being held at the facility.\n\n3 Ukrainian drones blew up a Russian radar and military depot allegedly stationed on a gas production platform in the Black Sea. Security Service of Ukraine\n\n3 The first drone targeted the bases’ tower to destroy a Russian Neva radar, according to Ukrainian intelligence. Security Service of Ukraine\n\n“We once again reminded the enemy that no Russian junk has a place in the Black Sea,” the SBU said in a statement.\n\n“The Security Service of Ukraine continues to develop and implement unique special operations to clear the Black Sea from Russian invaders, their military equipment and other equipment,” the agency added.\n\nThe SBU’s claims could not be independently verified.\n\nThe Black Sea has remained a key conflict site in the Ukraine war after Moscow undermined a US-backed maritime truce deal in March.\n\n3 Russian President Vladimir Putin was accused of failing to uphold a maritime truce in the Black Sea brokered by the US in March. AP\n\nSince then, Kyiv has found success with its drone strikes against Russia’s military sites, including one that took out a Su-30 fighter jet earlier this month.\n\nKyiv touted the successful strike against the fighter jet, noting that it followed another first when its naval drones were used to take out two Russian helicopters on the last day of 2024."
    },
    {
        "title": "Trump says Russia and Ukraine to reengage in ceasefire negotiations",
        "description": "Trump described \"the tone and spirit of the conversation\" as \"excellent,\" adding Russia wants to do \"large-scale TRADE with the United States.\"",
        "content": "President Donald Trump conveyed confidence that Russia and Ukraine would reengage in negotiations for a ceasefire and an end to the war between the two countries after a two-hour-long phone call with Russian President Vladimir Putin.\n“Russia and Ukra... [5038 chars]",
        "url": "https://www.washingtonexaminer.com/news/white-house/3415689/trump-russia-ukraine-reengage-ceasefire-negotiation-putin-call/",
        "image": "https://www.washingtonexaminer.com/wp-content/uploads/2025/05/trump-phone-call-scaled.webp",
        "publishedAt": "2025-05-19T17:59:57Z",
        "source": {
            "name": "Washington Examiner",
            "url": "https://www.washingtonexaminer.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.washingtonexaminer.com/news/white-house/3415689/trump-russia-ukraine-reengage-ceasefire-negotiation-putin-call/ on URL https://www.washingtonexaminer.com/news/white-house/3415689/trump-russia-ukraine-reengage-ceasefire-negotiation-putin-call/"
    },
    {
        "title": "Trump wraps up call with Russia's Putin, says cease-fire talks to start 'immediately'",
        "description": "Putin described the conversation in a statement as \"frank and meaningful,\" adding that he was thankful for Trump's initiative to have direct talks with both belligerent leaders.",
        "content": "WASHINGTON — Russian President Vladimir Putin doubled down Monday on not accepting a cease-fire in his 39-month-old war on Ukraine following a two-hour call with President Trump — saying that Moscow was not ready for peace until the “root cause” of t... [8000 chars]",
        "url": "https://nypost.com/2025/05/19/us-news/trump-wraps-up-call-with-russias-putin-who-says-moscow-ready-to-work-with-kyiv/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/COMP-RC2ZIEAX34SP-828301228-3-1.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2025-05-19T17:38:46Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "WASHINGTON — Russian President Vladimir Putin doubled down Monday on not accepting a cease-fire in his 39-month-old war on Ukraine following a two-hour call with President Trump — saying that Moscow was not ready for peace until the “root cause” of the “crisis” is addressed.\n\n“Russia is ready to work with Kyiv on a memorandum on a future peace treaty which could include issues of a cease-fire and principles for resolving the conflict,” Putin said following the call, his first contact with Trump since Russian and Ukrainian negotiators agreed Friday to trade proposals to halt Europe’s bloodiest conflict since the Second World War.\n\nHowever, the 72-year-old added, there is a “need to work out the most effective paths toward peace” that would be suitable to “all sides.”\n\nThe eventual peace agreement, Putin said, could “include a possible cease-fire for a certain period of time if appropriate agreements are reached.”\n\nTrump, 78, put a happy spin on the call, announcing on announcing on Truth Social that “[t]he tone and spirit of the conversation were excellent” and that “Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.”\n\n6 President Trump announced that Russia and Ukraine will “immediately” start cease-fire negotiations following a call with Russian President Vladimir Putin. Sputnik/Pavel Byrkin/Pool via REUTERS\n\nThe president’s statement notably stressed that Russia wants to resume major economic activity with the US — and made no mention of secondary sanctions, which Trump has previously mused about slapping on the Kremlin.\n\nSen. Lindsey Graham (R-SC) is intending to introduce a widely-supported Senate bill that would put secondary sanctions on any country buying Russian oil, gas or natural gas, among other products.\n\n“Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree,” Trump said.\n\nThe 78-year-old added that he had relayed details of his talk with Putin to Ukrainian President Volodymyr Zelensky, along with “Ursula von der Leyen, President of the European Commission, President Emmanuel Macron, of France, Prime Minister Giorgia Meloni, of Italy, Chancellor Friedrich Merz, of Germany, and President Alexander Stubb, of Finland.”\n\n“The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations,” Trump concluded. “Let the process begin!”\n\nTrump later told reporters in the Oval Office that talks at the seat of the Roman Catholic Church “could help” some of the “anger” that exists between Russia and Ukraine.\n\nZelensky, 47, stressed that Ukraine is ready for a “full and unconditional cease-fire” immediately, and that the world should pressure Russia to do the same.\n\nThe Ukrainian leader revealed that Trump spoke to him first, then called Putin, and then had a shared call with the European leaders.\n\n6 Trump and Putin spoke for nearly two hours. AFP via Getty Images\n\n“I reaffirmed to President Trump that Ukraine is ready for a full and unconditional ceasefire, as has spoken about, particularly the United States,” Zelensky wrote on X. “It is important not to dilute this proposal. If the Russians are not ready to stop the killings, there must be stronger sanctions. Pressure on Russia will push it toward real peace – this is obvious to everyone around the world.”\n\nZelensky added that he would be ready to meet Putin in Turkey, Switzerland, the Vatican, or any other location, he said.\n\n“If Russia refuses to stop the killings, refuses to release prisoners of war and hostages, if Putin puts forward unrealistic demands, this will mean that Russia continues to drag out the war, and deserves that Europe, America, and the world act accordingly, including with further sanctions,” he argued. “Russia must end the war it started, and it can begin doing so any day. Ukraine has always been ready for peace.”\n\n6 Trump spoke with Ukranian President Volodymyr Zelensky and other European leaders after the call with Putin. UKRAINIAN PRESIDENTIAL PRESS SERVICE/AFP via Getty Images\n\nUkraine has said previously it would agree to a cease-fire immediately, while Putin has insisted that there are considerations that need to be discussed first — like halting more US aid to the war-torn country.\n\n“Putin is continuing to conflate the negotiations needed to reach a cease-fire agreement with those needed to reach a peace settlement in order to drive confusion in the West and falsely paint Ukraine as intransigent,” Kateryna Stepanenko, Russia analyst at the Institute for the Study of War, told The Post.\n\n“By rejecting the full cease-fire that Ukraine and the US proposed, the Kremlin is laying the groundwork to make even more demands of Ukraine and the United States,”Stepanenko added. “A prolonged peace negotiation process without a cease-fire will allow Russia to continue its war effort in Ukraine, and the Kremlin may try to leverage the peace talks as a way to extract additional concessions beyond its original war aims.”\n\nPutin described the conversation with Trump as “frank and meaningful,” adding that he was thankful for the US president’s initiative to have direct talks with both belligerent leaders.\n\n6 Trump noted that Pope Leo XIV has expressed interest in the Vatican hosting the negotiations between Russia and Ukraine. ABACA/Shutterstock\n\nRussia’s “position on the whole is known,” Putin added, a reference to his baseless claims in 2022 that Moscow was invading Ukraine to “de-Nazify” the country and save Russian-speaking residents of Ukraine from oppression by Kyiv.\n\nUkrainian and Russian officials met face-to-face on Friday in Turkey for the first time in more than three years, opting to hold talks despite Putin declining to attend.\n\nThe two sides agreed to exchange 1,000 prisoners of war from each side and pledged to return to the negotiating table with cease-fire ideas.\n\n6 Trump and Ukrainian President Volodymyr Zelensky speaking at the Vatican on April 26, 2025. PRESIDENTIAL PRESS SERVICE HANDOUT HANDOUT/EPA-EFE/Shutterstock\n\nEarlier Monday, Vice President JD Vance told reporters on Air Force Two that the Trump administration wanted to see if Putin was “serious about negotiating peace” — and was “more than open to walking away” if he wasn’t.\n\n“The president has been very clear,” Vance said. “There’s a bit of an impasse here, and I think the president’s going to say to President Putin, ‘Look, are you serious, are you real about this?'”\n\nWithout serious movement, the veep said, the Trump administration will describe the conflict as “Joe Biden’s war” — and will stop trying to mediate.\n\n6 Destroyed residential buildings in the abandoned town of Marinka in Ukraine’s Donetsk region seen on May 15, 2025. REUTERS\n\n“It’s not our war,” Vance said. “We’re going to try to end it, but if we can’t end it, we are eventually going to say, ‘That was worth a try, but we’re not doing it anymore.'”\n\nIn the Oval Office Monday evening, Trump reiterated to reporters that “it’s not our war” and insisted that “I’ll just back away” if nothing happens.\n\nTrump added that he thought Putin wanted to end his invasion, saying: “I think he’s had enough.”\n\n“If I thought Putin did not want to get this over with, I wouldn’t even be talking about it, because I’d just pull out,” he added.\n\nTrump also said he has a red line in his head that would cause him to walk away, but wouldn’t reveal what it was.\n\nGoing into Monday’s phone call, the Kremlin indicated that Putin also had a hard line from which he would negotiate.\n\n“The conversation is important, taking into account the negotiations held [Friday] in Istanbul,” Kremlin spokesperson Dmitry Peskov told reporters ahead of the conversation, per the Russian news agency TASS.\n\n“As for the talks, we have already said everything we could, we underscored the basic points.”\n\nRussian Foreign Ministry Spokeswoman Maria Zakharova specifically said Putin was committed to the plan he proposed on June 14, 2024,.\n\nThose conditions included Ukraine withdrawing all troops from the eastern Donbas region, committing to never joining NATO, and remaining non-aligned and non-nuclear while allowing the Russian language to be taught in schools — as well as the lifting of all Western sanctions on Moscow."
    },
    {
        "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
        "description": "President Donald Trump saif Russia and Ukraine will \"immediately\" begin ceasefire negotiations after an \"excellent\" phone call with Putin.",
        "content": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\nTrump also spoke with with... [7611 chars]",
        "url": "https://abc7.com/post/trump-putin-phone-call-leaders-us-russia-speak-more-2-hours-amid-hopes-ceasefire-progress-ukraine/16471078/",
        "image": "https://cdn.abcotvs.com/dip/images/16471079_TRUMP-PUTIN-AP-IMG.jpg?w=1600",
        "publishedAt": "2025-05-19T17:23:00Z",
        "source": {
            "name": "KABC-TV",
            "url": "https://abc7.com"
        },
        "full_content": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin\n\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\n\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\n\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\n\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\n\nWASHINGTON -- President Donald Trump said Monday that Russia and Ukraine will \"immediately\" begin ceasefire negotiations after what he described as an \"excellent\" call with Russian President Vladimir Putin that lasted more than two hours.\n\nTrump also spoke with with Ukrainian leader Volodymyr Zelenskyy and European leaders in hopes of making progress toward a ceasefire.\n\n\"The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,\" Trump said in a social media post. The conversations came after the White House said the U.S. leader has grown \"frustrated\" with both leaders over the continuing war in Ukraine.\n\nAfter the call, Putin said Russia was ready to continue discussing an end to the fighting, but he indicated there was no major breakthrough in what he termed a \"very informative and very frank\" conversation with Trump. Putin said the warring countries should \"find compromises that would suit all parties.\"\n\n\"At the same time, I would like to note that, in general, Russia's position is clear. The main thing for us is to eliminate the root causes of this crisis,\" the Russian president said.\n\nTrump has struggled to end a war that began with Russia's invasion in February 2022. That makes these conversations a serious test of his reputation as a deal maker after having claimed he would quickly settle the conflict once he was back in the White House, if not even before he took office.\n\nTrump expressed his hopes for a \"productive day\" Monday - and a ceasefire - in a social media post over the weekend. His effort will also include calls to NATO leaders. But ahead of the call, Vice President JD Vance said Trump is \"more than open\" to walking away from trying to end the war if he feels Putin isn't serious about negotiation.\n\n\"He's grown weary and frustrated with both sides of the conflict,\" White House press secretary Karoline Leavitt told reporters Monday ahead of the call. \"He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.\"\n\nThe Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.\n\n\"I'd say we're more than open to walking away,\" Vance told reporters before leaving Rome after meeting with Pope Leo XIV. Vance said Trump has been clear that the U.S. \"is not going to spin its wheels here. We want to see outcomes.\"\n\nTrump's \"sensibilities are that he's got to get on the phone with President Putin, and that is going to clear up some of the logjam and get us to the place that we need to get to,\" said Trump's envoy, Steve Witkoff. \"I think it's going to be a very successful call.\"\n\nTrump's frustration builds over failure to end war\n\nStill, there are fears that Trump has an affinity for Putin that could put Ukraine at a disadvantage with any agreements engineered by the U.S. government.\n\nBridget Brink said she resigned last month as the U.S. ambassador to Ukraine \"because the policy since the beginning of the administration was to put pressure on the victim Ukraine, rather than on the aggressor, Russia.\"\n\nBrink said the sign that she needed to depart was an Oval Office meeting in February where Trump and his team openly berated Zelenskyy for not being sufficiently deferential to them.\n\n\"I believe that peace at any price is not peace at all,\" Brink said. \"It's appeasement, and as we know from history, appeasement only leads to more war.\"\n\nTrump's frustration about the war had been building before his post Saturday on Truth Social about the coming calls.\n\nTrump said his discussion with Putin would focus on stopping the \"bloodbath\" of the war. It also will cover trade, a sign that Trump might be seeking to use financial incentives to broker some kind of agreement after Russia's invasion led to severe sanctions by the United States and\n\nits allies that have steadily eroded Moscow's ability to grow.\n\nTrump's hope, according to the post, is that \"a war that should have never happened will end.\"\n\nVance said Trump would press Putin on whether he was serious about negotiating an end to the conflict, saying Trump doesn't believe he is and that Trump may wash his hands of trying to end the war.\n\n\"It takes two to tango,\" Vance said, adding that \"if Russia is not willing to do that, then we're eventually just going to have to say, this is not our war. It's Joe Biden's war, it's Vladimir Putin's war.\"\n\nHis treasury secretary, Scott Bessent, said Sunday on NBC's \"Meet the Press\" that Trump had made it clear that a failure by Putin to negotiate \"in good faith\" could lead to additional sanctions against Russia.\n\nBessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia's oil revenues, due to concerns that doing so would increase U.S. prices. The United States sought to cap Russia's oil revenues while preserving the country's petroleum exports to limit the damage from the inflation that the war produced.\n\nNo ceasefire but an exchange of prisoners\n\nPutin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington. Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.\n\nThose talks ended Friday after less than two hours, without a ceasefire in place. Still, both countries committed to exchange 1,000 prisoners of war each, with Ukraine's intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.\n\nWhile wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn't there.\n\n\"He and I will meet, and I think we'll solve it or maybe not,\" Trump told reporters after boarding Air Force One. \"At least we'll know. And if we don't solve it, it'll be very interesting.\"\n\nZelenskyy met with Vance and Secretary of State Marco Rubio in Rome on Sunday, as well as European leaders, intensifying his efforts before the Monday calls.\n\nThe Ukrainian president said on the social media site X that during his talks with the American officials, they discussed the negotiations in Turkey and that \"the Russians sent a low level delegation of non-decision-makers.\" He also said he stressed that Ukraine is engaged in \"real diplomacy\" to have a ceasefire.\n\n\"We have also touched upon the need for sanctions against Russia, bilateral trade, defense cooperation, battlefield situation and upcoming prisoners exchange,\" Zelenskyy said. \"Pressure is needed against Russia until they are eager to stop the war.\"\n\nThe German government said Chancellor Friedrich Merz and French, British and Italian leaders spoke with Trump late Sunday about the situation in Ukraine and his upcoming call with Putin. A brief statement gave no details of the conversation, but said the plan is for the exchange to be continued directly after the Trump-Putin call.\n\nWitkoff spoke Sunday on ABC's \"This Week\" and Brink appeared on CBS' \"Face the Nation.\""
    },
    {
        "title": "Russia adds Amnesty International to 'undesirable' list",
        "description": "The Russian government announced Monday that the nonprofit Amnesty International is no longer welcome within its borders.",
        "content": "A demonstrator holds a \"I am a Human Rights Defender\" sign from the Amnesty International organization in Washington in February 2017. File Photo by Mike Theiler/UPI | License Photo\nMay 19 (UPI) -- The Russian government announced Monday that the non... [2288 chars]",
        "url": "https://www.upi.com/Top_News/World-News/2025/05/19/Amnesty-International-ban-undesirable/3051747670073/",
        "image": "https://cdnph.upi.com/sv/ph/og/upi/3051747670073/2025/1/3f2aa01bb6e50c35a3743e1655b55685/v1.5/Russia-adds-Amnesty-International-to-undesirable-list.jpg",
        "publishedAt": "2025-05-19T16:20:00Z",
        "source": {
            "name": "UPI News",
            "url": "https://www.upi.com"
        },
        "full_content": "A demonstrator holds a \"I am a Human Rights Defender\" sign from the Amnesty International organization in Washington in February 2017. File Photo by Mike Theiler/UPI | License Photo\n\nMay 19 (UPI) -- The Russian government announced Monday that the nonprofit Amnesty International is no longer welcome within its borders.\n\nThe Prosecutor General's Office of the Russian Federation put out a statement that it \"has made a decision to recognize the activities of the international non-governmental organization Amnesty International Limited, registered in London, as undesirable on the territory of the Russian Federation.\"\n\nThe agency then claimed that while \"the organization positions itself as an active conductor of human rights protection in the world,\" it alleges that \"the London headquarters of AIL is the center of preparation of global 'Russophobic' projects, paid for by accomplices of the Kyiv regime.\"\n\nIt then further purported that Amenesty International has not only worked to \"intensify the military confrontation in the region,\" but has also justified \"the crimes of Ukrainian neo-Nazis,\" and has sought an increase for funding of Ukraine as it insists \"on the political and economic isolation of [Russia].\"\n\n\"The organization's members support extremist organizations and finance the activities of foreign agents,\" the agency said.\n\nThe Amnesty Eastern Europe and Central Asia regional office responded Monday with a warning that the Russian declaration means \"any participation in our activities, including donations and reposts, is punishable in the Russian Federation.\"\n\n\"If you read us from Russia, or are planning to be there, please refrain from sharing our online and offline materials,\" it said. \"We will continue to protect human rights in Russia and in the world, and we will keep you informed,\" before a final wish for readers to take care.\n\nAccording to AIL, its Moscow office has been shut down since April of 2022 by Russian authorities after the Russian Ministry of Justice delisted it from the register of the representative offices of foreign nongovernmental organizations and international organizations. This allegedly came after Russia's media regulator blocked access to Amnesty International's Russian-language website.\n\nRussia has a list of over 200 \"undesirable organizations,\" which includes the Clooney Foundation for Justice, Radio Free Europe/Radio Liberty and Greenpeace. Russian citizens can receive as many as five years in prison for funding or working with any of the groups that have been banned."
    },
    {
        "title": "Trump, Putin Set High-Stakes Phone Call",
        "description": "Monday has the potential to be a big day with regard to the Russia-Ukraine war: President Trump speaks with Vladimir Putin by phone on Monday morning, followed by a call later...",
        "content": "Monday has the potential to be a big day with regard to the Russia-Ukraine war: President Trump speaks with Vladimir Putin by phone on Monday morning, followed by a call later to Ukraine's Volodymyr Zelensky. \"Hopefully it will be a productive day, a... [1087 chars]",
        "url": "https://www.newser.com/story/368900/trump-putin-to-have-high-stakes-phone-call.html",
        "image": "https://img2-azrcdn.newser.com/image/1611391-12-20250519064102.jpeg",
        "publishedAt": "2025-05-19T16:11:00Z",
        "source": {
            "name": "Newser",
            "url": "https://www.newser.com"
        },
        "full_content": "Monday has the potential to be a big day with regard to the Russia-Ukraine war: President Trump speaks with Vladimir Putin by phone on Monday morning, followed by a call later to Ukraine's Volodymyr Zelensky. \"Hopefully it will be a productive day, a ceasefire will take place, and this very violent war, a war that should have never happened, will end,\" Trump wrote on Truth Social over the weekend, per the New York Times . On Sunday night, Trump also spoke with the leaders of Britain, France, Germany, and Italy, reports NBC News .\n\n\"Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe,\" French President Emmanuel Macron tweeted afterward. The Kremlin is paying deference to Trump—\"if the political services of the US—which we highly value and are grateful to the American side—if they actually help us reach our goals with peaceful means, that would indeed be preferable\" to war, said spokesman Dmitri Peskov on Monday.\n\nHowever, Russia also unleashed one of its largest drone attacks of the war on Sunday night, reports Reuters. Moscow launched more than 270 drones on the Kyiv, Dnipropetrovsk, and Donetsk regions. The move comes after Trump implored Putin to stop such attacks last month. (More Russia-Ukraine war stories.)"
    },
    {
        "title": "Russia Seeks to Ban Game Of Thrones, Harry Potter Over 'Childfree Ideology'",
        "description": "It comes after Russia passed a bill banning the \"public propaganda of the ideas of voluntarily choosing not to have children.\"",
        "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\nRussia is going after TV ... [4585 chars]",
        "url": "https://www.newsweek.com/russia-ban-harry-potter-childfree-ideology-2074120",
        "image": "https://d.newsweek.com/en/full/2553061/hermione-granger-harry-potter-ron-weasley.jpg",
        "publishedAt": "2025-05-19T15:01:34Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /russia-ban-harry-potter-childfree-ideology-2074120 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/russia-ban-harry-potter-childfree-ideology-2074120"
    },
    {
        "title": "JD Vance meets Pope Leo XIV at the Vatican, gives him a Chicago Bears jersey",
        "description": "Vice President JD Vance gifted Pope Leo XIV a Chicago Bears jersey as they met at the Vatican, amid a push by the White House for a Russia-Ukraine ceasefire.",
        "content": "Rome — Pope Leo XIV and Vice President JD Vance met at the Vatican on Monday ahead of a flurry of U.S.-led diplomatic efforts aimed at making progress on a ceasefire in Russia's war in Ukraine. Vance, a Catholic convert, had led the U.S. delegation t... [3422 chars]",
        "url": "https://www.cbsnews.com/news/vance-pope-leo-meet-vatican-bears-jersey-gift-trump-pushes-russia-ukraine-deal/",
        "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/19/afb4051e-1d51-41fd-b9d8-5f3bed488a1a/thumbnail/1200x630g2/236aae7e33f8368efa840c847181f60d/vance-pope-2215850546.jpg?v=f20aa8902dce18e45d5824503b07db36",
        "publishedAt": "2025-05-19T12:43:00Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "Rome — Pope Leo XIV and Vice President JD Vance met at the Vatican on Monday ahead of a flurry of U.S.-led diplomatic efforts aimed at making progress on a ceasefire in Russia's war in Ukraine. Vance, a Catholic convert, had led the U.S. delegation to the formal Mass opening the pontificate of the first American pope. Joining him at the meeting on Monday was Secretary of State Marco Rubio, who is also Catholic, Vance spokesperson Luke Schroeder said.\n\n\"There was an exchange of views on some current international issues, calling for respect for humanitarian law and international law in areas of conflict and for a negotiated solution between the parties involved,\" according to a Vatican statement after their meeting.\n\nThere was also a customary exchange of gifts, with Vance presenting the Chicago-born pontiff a Bears jersey bearing the name \"Pope Leo\" and number \"XIV.\" The pope is also a White Sox fan, his brother confirmed earlier this month.\n\nPope Leo XIV exchanges gifts with U.S. Vice President JD Vance and his wife Usha Vance during a private audience at the Apostolic Palace, May 19, 2025, in Vatican City. Vatican Media/­Simone Risoluti/via Getty Images\n\nVance's office said he also gave the pope two books by St. Augustine, \"The City of God\" and \"On \"Christian Doctrine.\" The vice president's office noted that Vance chose St. Augustine as his patron saint when he converted to Catholicism and was baptized in 2019. Pope Leo had previously been head of the Augustinian order worldwide.\n\nPope Leo XIV poses for a picture with Vice President JD Vance, second lady Usha Vance, U.S. Secretary of State Marco Rubio and his wife Jeanette Dousdebes Rubio, at the Vatican, May 19, 2025. Vatican Media/­Simone Risoluti/via REUTERS\n\nThe Vatican listed Vance's delegation as the first of several private audiences Leo was having Monday with people who had come to Rome for his inaugural Mass, including other Christian leaders and a group of faithful from his old diocese in Chiclayo, Peru.\n\nThe Vatican, which was largely sidelined during the first three years of Russia's invasion of Ukraine, has offered to host any peace talks while continuing humanitarian efforts to facilitate prisoner swaps and reunite Ukrainian children taken by Russia.\n\nAfter greeting Leo briefly at the end of Sunday's Mass, Vance spent the rest of the day in separate meetings, including with Ukrainian President Volodymyr Zelenskyy. He also met with European Union Commission President Ursula von der Leyen and Italy's Premier Giorgia Meloni, who said she hoped the trialateral meeting could be a \"new beginning.\"\n\nIn the evening, Meloni spoke by phone with President Trump and several other European leaders ahead of Mr. Trump's expected call with Russia's President Vladimir Putin on Monday, according to a statement from Meloni's office.\n\nLeo, the former Cardinal Robert Prevost, is a Chicago-born Augustinian missionary who spent the bulk of his ministry in Chiclayo, a commercial city of around 800,000 on Peru's northern Pacific coast.\n\nIn the days since his May 8 election, Leo has vowed \"every effort\" to help bring peace to Ukraine. He also has emphasized his continuity with Pope Francis, who made caring for migrants and the poor a priority of his pontificate.\n\nBefore his election, Prevost shared news articles on X that were critical of the Trump administration's plans for mass deportations of migrants.\n\nVance was one of the last foreign officials to meet with Francis before the Argentine pope's April 21 death. The two had tangled over migration, with Francis publicly rebuking the Trump administration's deportation plan and correcting Vance's theological justification for it."
    },
    {
        "title": "Trump phone calls with Putin, Zelensky hope to make progress in Russia-Ukraine war",
        "description": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelensky will make progress toward a ceasefire in the war in Ukraine.",
        "content": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelensky will make progress toward a ceasefire in the war in Ukraine.\nTrump expressed his hopes for a “productive day” M... [6102 chars]",
        "url": "https://nypost.com/2025/05/19/us-news/trump-phone-calls-with-putin-zelensky-hope-to-make-progress-in-russia-ukraine-war/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/104864796.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2025-05-19T10:17:13Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelensky will make progress toward a ceasefire in the war in Ukraine.\n\nTrump expressed his hopes for a “productive day” Monday — and a ceasefire — in a social media post over the weekend. His effort will also include calls to NATO leaders.\n\nTrump has struggled to end a war that began with Russia’s invasion in February 2022, and that makes these conversations a serious test of his reputation as a dealmaker after having claimed he would quickly settle the conflict once he was back in the White House, if not even before he took office.\n\n6 Russian President Vladimir Putin sits in on a meeting at the Kremlin in Moscow on May 15, 2025. POOL/AFP via Getty Images\n\nThe Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting.\n\n“His sensibilities are that he’s got to get on the phone with President Putin, and that is going to clear up some of the logjam and get us to the place that we need to get to,” said Trump’s envoy, Steve Witkoff. “I think it’s going to be a very successful call.”\n\nStill, there are fears that Trump has an affinity for Putin that could put Ukraine at a disadvantage with any agreements engineered by the US government.\n\nBridget Brink said she resigned last month as the US ambassador to Ukraine “because the policy since the beginning of the administration was to put pressure on the victim Ukraine, rather than on the aggressor, Russia.”\n\nBrink said the sign that she needed to depart was an Oval Office meeting in February where Trump and his team openly berated Zelensky for not being sufficiently deferential to them.\n\n“I believe that peace at any price is not peace at all,” Brink said. “It’s appeasement and as we know from history, appeasement only leads to more war.”\n\n6 Ukrainian President Volodymyr Zelensky speaks on the phone before a meeting at the European Political Community Summit on May 16, 2025. Leon Neal/PA Images/INSTARimages\n\n6 Trump will be speaking to both Putin and Zelensky on Monday, May 19, 2025. REUTERS\n\nTrump’s frustration about the war had been building before his post Saturday on Truth Social about the coming calls, which he said would begin first with Putin at 10 a.m. Monday.\n\nTrump said his discussion with Putin would focus on stopping the “bloodbath” of the war. It also will cover trade, a sign that Trump might be seeking to use financial incentives to broker some kind of agreement after Russia’s invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow’s ability to grow.\n\nTrump’s hope, according to the post, is that “a war that should have never happened will end.”\n\n6 Zelensky meets with Pope Leo XIV at the Vatican on May 18, 2025. APAImages/Shutterstock\n\nHis treasury secretary, Scott Bessent, said Sunday on NBC’s “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.\n\nBessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia’s oil revenues, due to concerns that doing so would increase US prices.\n\nThe United States sought to cap Russia’s oil revenues while preserving the country’s petroleum exports to limit the damage from the inflation that the war produced.\n\nPutin recently rejected an offer by Zelensky to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington.\n\nThose talks ended on Friday after less than two hours, without a ceasefire in place. Still, both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.\n\nWhile wrapping up his four-day trip to the Middle East, Trump said on Friday that Putin had not gone to Turkey because Trump himself wasn’t there.\n\n“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One. “At least we’ll know. And if we don’t solve it, it’ll be very interesting.”\n\nZelensky met with Trump’s vice president, JD Vance, and top diplomat, Secretary of State Marco Rubio, in Rome on Sunday, as well as European leaders, intensifying his efforts before the Monday calls.\n\n6 President Donald Trump and Ukrainian President Volodomyr Zelensky meet inside St. Peter’s Basilica during Pope Francis’ funeral on April 26, 2025. PRESIDENTIAL PRESS SERVICE HANDOUT HANDOUT/EPA-EFE/Shutterstock\n\nThe Ukrainian president said on the social media site X that during his talks with the American officials, they discussed the negotiations in Turkey and that “the Russians sent a low level delegation of non-decision-makers.” He also said he stressed that Ukraine is engaged in ”real diplomacy” to have a ceasefire.\n\n“We have also touched upon the need for sanctions against Russia, bilateral trade, defense cooperation, battlefield situation and upcoming prisoners exchange,” Zelensky said. “Pressure is needed against Russia until they are eager to stop the war.”\n\nThe German government said Chancellor Friedrich Merz and French, British and Italian leaders spoke with Trump late Sunday about the situation in Ukraine and his upcoming call with Putin. A brief statement gave no details of the conversation, but said the plan is for the exchange to be continued directly after the Trump-Putin call.\n\nIn a post on X about the conversation, French President Emmanuel Macron said that Putin on Monday “must show he wants peace by accepting the 30-day unconditional ceasefire proposed by President Trump and backed by Ukraine and Europe.”\n\n6 President Donald Trump and Russian President Vladimir Putin meet at the G-20 Summit on July 7, 2017. AP\n\nThe push came as the Kremlin launched its largest drone barrage against Ukraine since the start of the full-scale invasion in 2022, firing a total of 273 exploding drones and decoys, Ukraine’s air force said Sunday. The attacks targeted the country’s Kyiv, Dnipropetrovsk and Donetsk regions.\n\nWitkoff spoke Sunday on ABC’s “This Week” and Brink appeared on CBS’ “Face the Nation.”"
    },
    {
        "title": "Trump, Putin agree to immediate talks for end of war between Ukraine, Russia",
        "description": "After a two-hour phone call with Russian President Vladimir Putin, U.S. President Donald Trump said Monday cease-fire negotiations to end the war in Ukraine will start immediately.",
        "content": "President Donald J. Trump participates in a bilateral meeting with the President of the Russian Federation Vladimir Putin during the G20 Japan Summit on June 28, 2019, in Osaka, Japan. Trump and Putin spoke on the phone Monday about ending the war in... [7182 chars]",
        "url": "https://www.upi.com/Top_News/US/2025/05/19/Trump-Putin-call/8541747641430/",
        "image": "https://cdnph.upi.com/sv/ph/og/upi/8541747641430/2025/1/f5ed143ce5eed1517e5880871e32c144/v1.5/Trump-Putin-agree-to-immediate-talks-for-end-of-war-between-Ukraine-Russia.jpg",
        "publishedAt": "2025-05-19T09:02:35Z",
        "source": {
            "name": "UPI News",
            "url": "https://www.upi.com"
        },
        "full_content": "President Donald J. Trump participates in a bilateral meeting with the President of the Russian Federation Vladimir Putin during the G20 Japan Summit on June 28, 2019, in Osaka, Japan. Trump and Putin spoke on the phone Monday about ending the war in Ukraine. White House File Photo by Shealah Craighead/UPI | License Photo\n\nMay 19 (UPI) -- After a two-hour phone call with Russian President Vladimir Putin, U.S. President Donald Trump said Monday cease-fire negotiations to end the war in Ukraine will start immediately.\n\nTrump posted on Truth Social that he believed the call went \"very well.\"\n\nAfter the conversation, Trump said, he also spoke with Ukrainian President Volodymyr Zelensky, as well as European Union President Ursula von der Leyen, France's President Emmanuel Macron, Germany's Chancellor Friedrich Merz, and Finland's President Alexander Stubb.\n\nU.S. Secretary of State Marco Rubio joined in on the call with Trump and Putin while flying back from Rome, where he attended Pope Leo XIV's inauguration.\n\n\"Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War,\" the president wrote. \"The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of.\"\n\nTrump also said the \"Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!\"\n\nZelensky, however, suggested Turkey or Switzerland as possible sites.\n\nNeither Putin nor Trump discussed a timeframe for a possible ceasefire, Kremlin presidential aide Yury Ushakov said.\n\n\"No, they didn't discuss that, although Trump naturally emphasized his interest in reaching some agreement as soon as possible,\" Ushakov said.\n\nAt the Rose Garden, Trump told reporters and others: \"I said, 'When are we going to end this bloodshed, this blood bath?' It's a blood bath, and I do believe he wants to end it.\"\n\nZelensky also is calling for further sanctions on the Russian banking and energy sectors.\n\nTrump said later Monday that he will not increase sanctions on Russia because \"there's a chance of getting something done.\"\n\nPutin said that he is willing to work on a \"memorandum on a possible future peace agreement\" with Ukraine. Speaking to journalists in Sochi, he did not elaborate on what that would look like.\n\n\"The U.S. president expressed his position on the cessation of hostilities, cease-fire, and from my end, I have emphasized that Russia stands for peaceful resolution of the Ukrainian crisis,\" according to a report by Russian state-run TASS. \"We just need to outline the most effective routes of moving towards peace.\n\n\"Russia's position is clear: The main thing for us is to eliminate the root causes of this crisis.\"\n\nTrump said he believes Putin wants peace.\n\n\"It's a terrible situation going on over there -- 5,000 young people every single week are being killed, so hopefully we did something,\" Trump said. \"We also spoke to the heads of most of the European nations, and we're trying to get that whole thing wrapped up. What a shame that it ever started in the first place.\"\n\nRussia invaded Ukraine in February 2023, and so far $66.5 billion in U.S. military aid has gone to the European nation. Other nations have also assisted. North Korea has sent troops to assist Russia.\n\nWhile campaigning for president the second time, Trump said he would end the war 24 hours after entering office.\n\nTrump had considered going to negotiations between Russia and Ukraine in Istanbul, Turkey, after his trip to the Middle East.\n\nPutin and Zelensky were initially supposed to negotiate directly but the Russian president didn't show up. Instead, lower-level officials met. It would have been the first high-level meeting since spring 2022 in Turkey after the war began.\n\nA prisoner exchange agreement was reached during the Istanbul meeting.\n\nRussian presidential aide Vladimir Medinsky, who led the Russian delegation at the talks, said he was satisfied with the negotiations' outcome.\n\nRussia said it will only sign a truce if Ukraine effectively surrenders, NBC reported. Ukraine said that is unacceptable.\n\nUkrainian Foreign Minister Andrii Sybiha said the Istanbul meeting highlighted a \"stark difference\" between Moscow and Kyiv. \"Ukraine is forward-looking, focused on the full and immediate ceasefire to kickstart the real peace process,\" he posted on X on Monday.\n\n\"To the contrary, Russia is completely focused on the past, rejecting the cease-fire and instead talking constantly about the 2022 Istanbul meetings, attempting to make the same absurd demands as three years ago.\"\n\nState Department spokesperson Tammy Bruce said Rubio welcomed a prisoner exchange agreement reached during the Istanbul meeting and emphasized Trump's call for an immediate cease-fire.\n\nTrump told reporters of the peace effort last week: \"Nothing's going to happen until Putin and I get together, okay?\"\n\nU.S. Vice President JD Vance said Monday the United States is \"more than open to walking away\" from negotiations.\n\n\"We realize there's a bit of an impasse here,\" Vance told reporters , \"and I think the president's going to say to President Putin, 'Look, are you serious? Are you real about this? Because the proposal from the United States has always been, look, there are a lot of economic benefits to thawing relations between Russia and the rest of the world, but you're not going to get those benefits you keep on killing a lot of it is lot of innocent people.'\"\n\nThe Trump administration has said Ukraine will have to forgo NATO membership and concede territory occupied by Russia.\n\nZelensky said Ukraine won't withdraw troops from its own territories.\n\n\"If Russia sets conditions for the withdrawal of our troops from our land, it means that they do not want a ceasefire and they do not want the war to end,\" Zelensky told reporters.\n\nUkraine wants security from the United States and other nations after the war ends. The U.S. has signed a deal to acquire rare mineral rights in Ukraine.\n\nKyiv and its European backers are still pushing for a full 30-day ceasefire.\n\nEuropean leaders spoke on Sunday ahead of the Putin-Trump call.\n\nA statement from Prime Minister Keir Starmer said he, along with the leaders of Italy, France and Germany, \"discussed the need for an unconditional cease-fire and for President Putin to take peace talks seriously.\"\n\n\"They also discussed the use of sanctions if Russia failed to engage seriously in a cease-fire and peace talks,\" 10 Downing Street said.\n\nFrench President Emmanuel Macron confirmed the quad-nation talks.\n\n\"Tomorrow, President Putin must show he wants peace by accepting the 30-day unconditional cease-fire proposed by President Trump and backed by Ukraine and Europe,\" the French president said on X.\n\nItalian Prime Minister Giorgia Meloni said they all support Trump's efforts for \"a just and lasting peace in Ukraine.\"\n\nOvernight Sunday, Russia launched dozens of drones at several Ukrainian cities.\n\nThe Armed Forces of Ukraine said in a statement it \"neutralized\" 76 of the Iran-made Shahed-type drones, shooting down 41 of them. The other 35 were lost due to electronic warfare.\n\nFrom Saturday night into Sunday, Russia launched 273 drones at Ukraine, of which 88 were shot down and 128 lost, it said.\n\nThe Washington-based Institute for the Study of War said the attack marked \"the largest single drone strike of the war.\""
    },
    {
        "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
        "description": "President Donald Trump says Russia and Ukraine will “immediately” begin ceasefire negotiations. Trump spoke Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war.",
        "content": "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war. The conversation... [9432 chars]",
        "url": "https://apnews.com/article/trump-putin-zelenskyy-russia-ukraine-war-ceasefire-3ec4144fecac5d77c8bb33cc4d7018ce",
        "image": "https://dims.apnews.com/dims4/default/2d5afd3/2147483647/strip/true/crop/3504x1971+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F53%2F0eb6ecc579768630cba6bfaebac3%2F87974a27e99b493c89d48ab2277f4afd",
        "publishedAt": "2025-05-19T08:01:42Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "full_content": "WASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war. The conversations did not appear to yield a major breakthrough.\n\nIt was not clear when or where any talks might take place or who would participate. Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022. Those negotiations Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.\n\nAhead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war. Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict. Trump later told reporters that he believed Putin was serious about wanting peace.\n\nUkraine’s President Volodymr Zelenskyy, left, and Vice President JD Vance greet each other as Secretary of State Marco Rubio, center, looks on ahead of Pope Leo XIV’s formal inauguration of his pontificate with a Mass in St. Peter’s Square attended by heads of state, royalty and ordinary faithful, Sunday, May 18, 2025. (AP Photo/Gregorio Borgia) Ukraine’s President Volodymr Zelenskyy, left, and Vice President JD Vance greet each other as Secretary of State Marco Rubio, center, looks on ahead of Pope Leo XIV’s formal inauguration of his pontificate with a Mass in St. Peter’s Square attended by heads of state, royalty and ordinary faithful, Sunday, May 18, 2025. (AP Photo/Gregorio Borgia) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\n“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.\n\nTrump said the call with Putin was “excellent,” adding, “If it wasn’t, I would say so now, rather than later.”\n\nLater, speaking to reporters in the Oval Office, he noted the process has “got very big egos involved, I tell you.”\n\n“Big egos involved. But I think something’s going to happen and, if it doesn’t I’d just back away and they have to keep going,” Trump said. “This was a European situation. It should have remained a European situation.”\n\nTrump also said he told Putin, “We’ve got to get going.”\n\nTrump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.\n\n‘Weary and frustrated’\n\nWhite House press secretary Karoline Leavitt speaks during a briefing at the White House, Monday, May 19, 2025, in Washington. (AP Photo/Evan Vucci) White House press secretary Karoline Leavitt speaks during a briefing at the White House, Monday, May 19, 2025, in Washington. (AP Photo/Evan Vucci) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\n“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls.\n\nThe Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting. He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.\n\nAfter the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump. Putin said the warring countries should “find compromises that would suit all parties.”\n\nMoscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.”\n\nBut indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear. The main thing for us is to eliminate the root causes of this crisis.”\n\nUkrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire. He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.\n\n“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions. What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.\n\nRussian President Vladimir Putin speaks to journalists after his phone talks with U.S. President Donald Trump at the Sirius Park of Science and Art outside Sochi, Russia, on Monday, May 19, 2025. (Vyacheslav Prokofyev, Sputnik, Kremlin Pool Photo via AP) Russian President Vladimir Putin speaks to journalists after his phone talks with U.S. President Donald Trump at the Sirius Park of Science and Art outside Sochi, Russia, on Monday, May 19, 2025. (Vyacheslav Prokofyev, Sputnik, Kremlin Pool Photo via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTrump and Putin addressed each other by first names\n\nRussian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.\n\n“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.\n\nUshakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.\n\nPutin and Trump also talked about a Russia-U.S. prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each. Ushakov did not offer any other details.\n\nSpeaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.\n\n“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV. Vance said Trump has been clear that the U.S. “is not going to spin its wheels here. We want to see outcomes.”\n\nZelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv. He also said that he discussed the potential for “serious sanctions” on Russia.\n\nTrump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.\n\nTrump tries the carrot — and stick — with Putin\n\nTrump sought to use financial incentives to broker some kind of agreement after Russia’s invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow’s ability to grow.\n\n“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post. “There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is UNLIMITED.”\n\nTrump’s treasury secretary, Scott Bessent, said Sunday on NBC’s “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.\n\nBessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia’s oil revenues, due to concerns that doing so would increase U.S. prices. The United States sought to cap Russia’s oil revenues while preserving the country’s petroleum exports to limit the damage from the inflation that the war produced.\n\nTrump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.\n\nIn this handout photo released by Turkish Foreign Ministry, Turkish Foreign Minister Hakan Fidan, center, chairs a meeting between delegations from Russia, right, and Ukraine, left, at Dolmabahce palace in Istanbul, Turkey, Friday, May 16, 2025. (Murat Gok/Turkish Foreign Ministry via AP) In this handout photo released by Turkish Foreign Ministry, Turkish Foreign Minister Hakan Fidan, center, chairs a meeting between delegations from Russia, right, and Ukraine, left, at Dolmabahce palace in Istanbul, Turkey, Friday, May 16, 2025. (Murat Gok/Turkish Foreign Ministry via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nPutin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington. Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.\n\nThose talks ended Friday after less than two hours, without a ceasefire in place. But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.\n\n___\n\nDavies reported from Manchester, England. Associated Press writers Michelle L. Price and Will Weissert in Washington; Dasha Litvinova in Tallinn, Estonia; and Hanna Arhirova and Volodymyr Yurchuk in Kyiv, Ukraine, contributed to this report."
    },
    {
        "title": "Trump says Russia will ‘immediately’ work toward a ceasefire with Ukraine after phone call. But Putin seems unmoved",
        "description": "For President Donald Trump, Monday’s phone call with Russian leader Vladimir Putin amounted to a major occasion — meant to ascertain his counterpart’s willingness to bring the conflict in Ukraine to an end.",
        "content": "CNN —\nFor President Donald Trump, Monday’s phone call with Russian leader Vladimir Putin amounted to a major occasion — meant to ascertain his counterpart’s willingness to bring the conflict in Ukraine to an end.\n“I said when are we going to end this... [5785 chars]",
        "url": "https://edition.cnn.com/2025/05/19/politics/trump-putin-call-ukraine-russia",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-2025-05-19t193050z-325039488-rc27leasdb4a-rtrmadp-3-usa-trump.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-19T04:00:00Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nFor President Donald Trump, Monday’s phone call with Russian leader Vladimir Putin amounted to a major occasion — meant to ascertain his counterpart’s willingness to bring the conflict in Ukraine to an end.\n\n“I said when are we going to end this, Vladimir?” Trump recounted later to reporters. “I said when are we going to end this bloodshed, this bloodbath?”\n\nFor Putin, it seemed to be a much less momentous event. Unlike Trump, who conducted the two-hour conversation from the Oval Office and previewed the call ahead of time in all capital letters on social media, Putin did not clear his schedule. He phoned in from a school for gifted children in the Black Sea resort of Sochi, squeezing in Trump amid a tour of the facilities.\n\nAfterward, it was evident each man viewed the call with differing levels of consequence.\n\n“If I thought that President Putin did not want to get this over with, I wouldn’t even be talking about it. I’d just pull out,” Trump said. “I think he’s had enough.”\n\nWhile Trump proclaimed in an optimistic social media post that the call “went very well” and that Russia and Ukraine had agreed to “immediately start negotiations toward a Ceasefire,” Putin made clear in his own comments he wasn’t budging from his maximalist demands to end the violence.\n\nWithout any major progress toward an immediate ceasefire, Trump sought to emphasize what he described as an excellent “tone and spirit” shared with the Kremlin leader. Putin, meanwhile, described the call as “meaningful and frank.”\n\nThe divergent assessments of the leaders’ third phone conversation this year seemed to underscore the struggles Trump is facing in bringing about an end to the three-year war, which he described this week as a “bloodbath.” Even as Ukraine has agreed to an immediate 30-day ceasefire, Putin has refused, leading to questions among Trump’s aides about whether Moscow is simply stringing Trump along — something the president himself has previously suggested.\n\nBut Trump didn’t appear to hold that view after the call, telling reporters Monday afternoon that he believes Putin is interested in peace.\n\n“I do,” Trump said at an unrelated White House event, without expanding further. Yet later in the day, he suggested he would step away if Putin didn’t make good on his pledge to end the war.\n\n“Very big egos involved. I tell you, big egos involved, but I think something’s going to happen,” Trump said. “And if it doesn’t, I just back away and they’re going to have to keep going.”\n\nYet Putin has only ramped up drone and missile attacks on Ukraine, including this weekend on its capital, Kyiv. Trump has previously criticized those assaults as counterproductive but made no mention of the latest attack as he recounted his call with Putin.\n\nAlthough Trump seemed confident after Monday’s conversation that the two countries would reach a resolution, there was little to indicate anything had changed in Putin’s approach.\n\nTrump told reporters ahead of the call that he and Putin must meet soon to discuss a resolution to the conflict, but there was no mention in either side’s readout of a forthcoming summit. And despite Trump’s repeated assertions that only he could end the war, he said Monday that negotiating the conditions for a ceasefire would be left to Ukraine and Russia, apparently backing away from any direct mediating role.\n\n“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump wrote on Truth Social.\n\nMembers of a mobile air defense volunteer unit stand next to their machine gun amid Russia's attack on Kyiv, Ukraine, on May 18. Stanislav Kozliuk/Reuters\n\nAhead of Monday’s call, Trump spoke with European leaders Sunday evening about ways to pressure Moscow into agreeing to a ceasefire. That included applying new sanctions “if Russia failed to engage seriously,” according to British Prime Minister Keir Starmer.\n\nTrump did not mention new sanctions after the call, however, and instead pointed to potential economic incentives if the war concludes.\n\n“Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree. There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is UNLIMITED,” Trump wrote. He also said that Ukraine “can be a great beneficiary on Trade.”\n\nTrump said he informed various leaders about the contents of the call, including Ukrainian President Volodymyr Zelensky, President of the European Commission Ursula von der Leyen, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz and Finnish President Alexander Stubb.\n\n“The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!” Trump added.\n\nZelensky spoke to Trump twice Monday, once shortly before the US leader spoke with Putin, and once after, the Ukrainian president told reporters at a press briefing Monday evening.\n\nIn the phone call after Trump spoke with Putin, European leaders discussed the need for more sanctions on Moscow. Zelensky said the US still needs to be “pressured” to agree to implement further sanctions.\n\nThe Ukrainian leader said discussions would take place about the future location of a next round of talks — which would be aimed first at achieving a ceasefire. Turkey, Switzerland and the Vatican were among the possible locations, he said.\n\nBefore the call, Trump had expressed increasing frustration with the Russian president’s refusal to strike a peace deal with Ukraine. White House press secretary Karoline Leavitt said shortly ahead of the conversation on Monday that Trump has “grown weary and frustrated with both sides of the conflict,” adding that his goal “is to see a ceasefire and to see this conflict come to an end.”\n\nThis headline and story have been updated with additional developments.\n\nCNN’s Kit Maher and Donald Judd contributed to this report."
    },
    {
        "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately",
        "description": "President Trump also spoke with with Ukrainian leader Volodymyr Zelensky and European leaders in hopes of making progress toward a cease-fire.",
        "content": "It was not clear when or where any talks might take place or who would participate. Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022. Those negotiations on Friday in Turkey brought ... [7515 chars]",
        "url": "https://www.bostonglobe.com/2025/05/19/nation/trump-russia-ukraine-war-putin-zelensky-phone-calls/",
        "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/3PFXKDMMYKGHMFHGMHFHTQOY2Q.jpg?auth=a878fcbb0f3d0cb153c1425b81d27f6931b14ac9b91bb1370697a9c257db2510&width=1440",
        "publishedAt": "2025-05-19T04:00:00Z",
        "source": {
            "name": "The Boston Globe",
            "url": "https://www.bostonglobe.com"
        },
        "full_content": "It was not clear when or where any talks might take place or who would participate. Trump’s announcement came days after the first direct engagement between Russian and Ukrainian delegations since 2022. Those negotiations on Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.\n\nWASHINGTON (AP) — Russia and Ukraine will “immediately” begin ceasefire negotiations, President Donald Trump said Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war. The conversations did not appear to yield a major breakthrough.\n\nAhead of the calls, the White House said Trump had grown “frustrated” with both leaders over the continuing war. Vice President JD Vance said Trump would press Russian President Vladimir Putin to see if he was truly interested in stopping the fighting, and if not, that the U.S. could disengage from trying to stop the conflict. Trump later told reporters that he believed Putin was serious about wanting peace.\n\nGet Starting Point A guide through the most important stories of the morning, delivered Monday through Friday. Enter Email Sign Up\n\n“The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of,” Trump said in a social media post.\n\nAdvertisement\n\nTrump said the call with Putin was “excellent,” adding, “If it wasn’t, I would say so now, rather than later.”\n\nLater speaking to reporters in the Oval Office, he noted the process has “got very big egos involved, I tell you.”\n\n“Big egos involved. But I think something’s going to happen and, if it doesn’t I’d just back away and they have to keep going,” Trump said. “This was a European situation. It should have remained a European situation.”\n\nAdvertisement\n\nTrump also said he told Putin, “We’ve got to get going.”\n\nTrump has struggled to end a war that began with Russia’s invasion in February 2022, a setback for his promises to quickly settle the conflict once he was back in the White House, if not before he took office.\n\n“He’s grown weary and frustrated with both sides of the conflict,” White House press secretary Karoline Leavitt told reporters Monday before the calls. “He has made it clear to both sides that he wants to see a peaceful resolution and ceasefire as soon as possible.”\n\nThe Republican president is banking on the idea that his force of personality and personal history with Putin will be enough to break any impasse over a pause in the fighting. He dangled the prospect of reduced sanctions and increased trade with Russia should the war end.\n\nAfter the call, Putin said Russia was ready to continue discussing an end to the fighting after a “very informative and very frank” conversation with Trump. Putin said the warring countries should “find compromises that would suit all parties.”\n\nMoscow, he said, will “propose and is ready to work with” Ukraine on a “memorandum” outlining the framework for “a possible future peace treaty.”\n\nBut indicating that little had fundamentally changed about his demands, Putin said: “At the same time, I would like to note that, in general, Russia’s position is clear. The main thing for us is to eliminate the root causes of this crisis.”\n\nUkrainian President Volodymyr Zelenskyy said Monday that he reaffirmed to Trump that Ukraine is ready for a full and unconditional ceasefire. He urged the international community to maintain pressure on Moscow if it refuses to halt its invasion.\n\nAdvertisement\n\n“Ukraine doesn’t need to be persuaded — our representatives are ready to make real decisions. What’s needed is mirrored readiness from Russia for such result-oriented negotiations.” Zelenskyy said.\n\nTrump and Putin addressed each other by first names\n\nRussian presidential adviser Yuri Ushakov, who previously served as Russian ambassador to the U.S., described the conversation as friendly, with Trump and Putin addressing each other by their first names.\n\n“Trump said, ‘Vladimir, you can pick up the phone at any time, and I will be happy to answer and speak with you,’” he said.\n\nUshakov also said Trump and Putin could meet face-to-face at some point, but no timeline was set.\n\nPutin and Trump also talked about a Russia-US prisoner exchange, which Ushakov said was “in the works” and envisioned Moscow and Washington releasing nine people each. Ushakov did not offer any other details.\n\nSpeaking before the call, Vance said Trump could walk away from trying to end the war if he feels Putin isn’t serious about negotiation.\n\n“I’d say we’re more than open to walking away,” Vance told reporters before leaving Rome after meeting with Pope Leo XIV. Vance said Trump has been clear that the U.S. “is not going to spin its wheels here. We want to see outcomes.”\n\nZelenskyy, who spoke to Trump one-on-one before the Putin call and then jointly with European leaders after, told reporters that he emphasized to Trump that no decisions should be made about Ukraine without involving Kyiv. He also said that he discussed the potential for “serious sanctions” on Russia.\n\nAdvertisement\n\nTrump said the Vatican expressed interest in hosting the negotiations, but there was no immediate confirmation that any talks had been scheduled.\n\nTrump tries the carrot — and stick — with Putin\n\nTrump sought to use financial incentives to broker some kind of agreement after Russia’s invasion led to severe sanctions by the United States and its allies that have steadily eroded Moscow’s ability to grow.\n\n“Russia wants to do largescale TRADE with the United States when this catastrophic “bloodbath” is over, and I agree,” he said in a social media post. “There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is UNLIMITED.”\n\nTrump’s treasury secretary, Scott Bessent, said Sunday on NBC’s “Meet the Press” that Trump had made it clear that a failure by Putin to negotiate “in good faith” could lead to additional sanctions against Russia.\n\nBessent suggested the sanctions that began during the administration of Democratic President Joe Biden were inadequate because they did not stop Russia’s oil revenues, due to concerns that doing so would increase U.S. prices. The United States sought to cap Russia’s oil revenues while preserving the country’s petroleum exports to limit the damage from the inflation that the war produced.\n\nTrump and Zelenskyy spoke with leaders from France, Italy and Finland, as well as European Commission President Ursula von der Leyen, who have threatened tougher sanctions on Russia in a bid to force Putin into negotiations.\n\nNo ceasefire but an exchange of prisoners\n\nPutin recently rejected an offer by Zelenskyy to meet in-person in Turkey as an alternative to a 30-day ceasefire urged by Ukraine and its Western allies, including Washington. Instead, Russian and Ukrainian officials met in Istanbul for talks, the first such direct negotiations since March 2022.\n\nAdvertisement\n\nThose talks ended Friday after less than two hours, without a ceasefire in place. But both countries committed to exchange 1,000 prisoners of war each, with Ukraine’s intelligence chief, Kyrylo Budanov, saying on Ukrainian television Saturday that the exchanges could happen as early as this week.\n\nWhile wrapping up his four-day trip to the Middle East, Trump said Friday that Putin had not gone to Turkey because Trump himself wasn’t there.\n\n“He and I will meet, and I think we’ll solve it or maybe not,” Trump told reporters after boarding Air Force One. “At least we’ll know. And if we don’t solve it, it’ll be very interesting.”\n\nDavies reported from Manchester, England. Associated Press writers Michelle L. Price in Washington and Dasha Litvinova in Tallinn, Estonia, contributed to this report."
    },
    {
        "title": "Trump and Putin discuss Ukraine war in high-stakes call",
        "description": "President Vladimir Putin revealed no breakthroughs after a two-hour call with President Trump on Monday, telling reporters he was ready to negotiate a peace deal with Ukraine but repeating his demand for broad concessions before Russia stops fighting.",
        "content": "But the Russian president made it clear that he was not budging from his basic resistance to an immediate cease-fire if it is not accompanied by concessions to Russia. At the end of his three-minute statement, Putin repeated his mantra that a peace d... [5197 chars]",
        "url": "https://www.bostonglobe.com/2025/05/19/world/trump-putin-discuss-ukraine-war-high-stakes-call/",
        "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/3HWUU3PYJJNSTLYMFY4KGXZORY.jpg?auth=b1fc52177c76dd1b1d296be591ec8e72a8a5bb1e9cb064a6cb710351f660ee14&width=1440",
        "publishedAt": "2025-05-19T04:00:00Z",
        "source": {
            "name": "The Boston Globe",
            "url": "https://www.bostonglobe.com"
        },
        "full_content": "But the Russian president made it clear that he was not budging from his basic resistance to an immediate cease-fire if it is not accompanied by concessions to Russia. At the end of his three-minute statement, Putin repeated his mantra that a peace deal needs to “remove the root causes of this crisis,” a reference to Russia’s demand for wide-ranging influence over Ukraine.\n\nPutin said he had told Trump that Russia was “ready to work with the Ukrainian side on a memorandum on a possible future peace agreement.” Putin said the conversation, the third known call between the presidents since Trump returned to the White House in January, was “very meaningful and quite frank.”\n\nBERLIN — President Vladimir Putin revealed no breakthroughs after a two-hour call with President Trump on Monday, telling reporters he was ready to negotiate a peace deal with Ukraine but repeating his demand for broad concessions before Russia stops fighting.\n\n“Russia is also in favor of a peaceful resolution to the Ukraine crisis,” Putin said in his brief statement to reporters in Sochi, Russia. “We just need to identify the most effective ways of moving toward peace.”\n\nAdvertisement\n\nShortly after Putin’s statement, Trump offered a more optimistic take on the call in a social media post, saying it “went very well,” and that Russia and Ukraine would “immediately start negotiations toward a Ceasefire and, more importantly, an END to the War.”\n\nPutin said his aides might disclose more details of the call later in the day. He spoke to reporters at a center for gifted children that he was visiting Monday and where he held the call with Trump.\n\nAdvertisement\n\nThe call was highly anticipated, coming amid growing impatience in the Trump administration with Putin’s refusal to agree to an immediate cease-fire, despite Ukraine’s readiness to do so.\n\nTrump took office in January promising to bring a swift end to fighting in Ukraine, but soon encountered the deep and seemingly irreconcilable differences between the warring countries. Trump has turned to a combination of threats and inducements — most of them unfulfilled — to get Russia and Ukraine stop fighting. But both sides believe time is on their side.\n\nIn his dealings with Trump, Putin has tried to appease the US president by appearing to negotiate peace, but without offering any meaningful concessions to Ukraine. Given his repeated claims that Russia has the means to obtain all its goals in the war, making concessions might risk making Putin look weak.\n\nOn Monday, Vice President JD Vance questioned Putin’s position.\n\n“I’m not sure that Vladimir Putin has a strategy himself for how to unwind the war,” Vance told reporters on Air Force Two. “He’s got a million men under arms; he’s reengineered his entire economy. What used to be manufacturing facilities making products for people to use in their civilian life, they’re now making tank shells and artillery shells and drones.”\n\nThe inherent contradictions of Putin’s strategy were on display over the weekend. In an apparent show of strength, Russia unleashed deadly drone strikes on civilian targets in Ukraine on Saturday and Sunday, even though Trump has criticized such attacks as counterproductive.\n\nOn Saturday, Russian attacks killed at least 14 Ukrainian civilians. On Sunday, at least one civilian died after Russia targeted Kyiv, Ukraine, with one of the largest drone attacks of the war.\n\nAdvertisement\n\nTrump has not commented on the latest attacks. In late April, however, he issued a rare rebuke of Putin for launching a similar attack.\n\n“I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing,” Trump wrote. “Vladimir, STOP!”\n\nTrump said in his post on Truth Social that after speaking to Putin on Monday he subsequently spoke to President Volodymyr Zelensky of Ukraine and his European allies.\n\nPrime Minister Keir Starmer of Britain said in a statement that he spoke with leaders of the United States, Italy, France, and Germany on Sunday night to discuss forcing Russia to accept an unconditional cease-fire, and the use of new sanctions “if Russia failed to engage seriously.”\n\nUkraine and its European allies have been demanding that Russia accept an unconditional 30-day cease-fire before beginning peace negotiations. Putin has demanded the opposite, saying that negotiations over what he calls the “root causes” of the war must take place before his forces, who are on the offensive in Ukraine, lay down arms.\n\nTrump in effect had sided with Putin. Last week he publicly told Zelensky to start talks with Russia, precipitating a series of events that led to the meeting in Istanbul.\n\nThe Kremlin doubled down on its insistence for negotiations before any cease-fire, hours before the call Monday, tempering expectations of a breakthrough.\n\n“There’s meticulous and perhaps, in some areas, prolonged work ahead,” Peskov told reporters, referring to a diplomatic solution to the war.\n\nVance suggested that Trump on Monday may offer Putin economic incentives to accept some concessions on Ukraine, and move the peace talks forward.\n\nAdvertisement\n\nTrump also focused on trade after the call. “Russia wants to do largescale TRADE with the United States when this catastrophic ‘bloodbath’ is over, and I agree,” he wrote on Truth Social. “There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is UNLIMITED.”\n\nThis article originally appeared in The New York Times."
    },
    {
        "title": "Russia Unleashes One of Its Largest Drone Barrages of the Ukraine War",
        "description": "The bombardment, which Ukrainian officials said mostly targeted Kyiv, came just a day before President Trump was expected to talk with President Vladimir V. Putin of Russia.",
        "content": "Russia targeted Ukraine on Sunday with one of its largest drone bombardments of the war, an apparent show of force only a day before President Trump is expected to talk with President Vladimir V. Putin as Mr. Trump pushes Russia to accept a cease-fir... [809 chars]",
        "url": "https://www.nytimes.com/2025/05/18/world/europe/russia-ukraine-drones.html",
        "image": "https://static01.nyt.com/images/2025/05/18/multimedia/18int-ukraine-drones-photo-pmtb/18int-ukraine-drones-photo-pmtb-facebookJumbo.jpg",
        "publishedAt": "2025-05-18T20:58:33Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "full_content": "Russia targeted Ukraine on Sunday with one of its largest drone bombardments of the war, an apparent show of force only a day before President Trump is expected to talk with President Vladimir V. Putin as Mr. Trump pushes Russia to accept a cease-fire deal.\n\nThe drone barrage, in which an estimated 273 exploding drones and decoys were recorded in the skies across Ukraine, killed a woman and injured several other people.\n\nIt came hours after Mr. Trump said on Saturday that he would talk with Mr. Putin and President Volodymyr Zelensky of Ukraine, who has agreed to an unconditional and immediate cease-fire, as well as the leaders of the NATO alliance. Mr. Putin has dragged his feet on agreeing to any temporary truce, adding preconditions that he knows Ukraine will not accept.\n\nOn Sunday, Mr. Zelensky met in Rome with Vice President JD Vance in their first encounter since a contentious White House meeting in February. The Sunday sit-down, which also included Secretary of State Marco Rubio, took place after they attended Pope Leo XIV’s inaugural Mass."
    },
    {
        "title": "Marco Rubio Addresses if Russia Is 'Tapping Us Along' in Ukraine Talks",
        "description": "The secretary of state stressed on Sunday that President Donald Trump must speak with his Russian counterpart to secure a deal.",
        "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nSecretary of State Marco Rubio said on Sunday that the Trump administration expects to figure out \"pretty soon\" if Russia is ... [6827 chars]",
        "url": "https://www.newsweek.com/marco-rubio-addresses-russia-tapping-us-ukraine-talks-2073831",
        "image": "https://d.newsweek.com/en/full/2646882/secretary-state-marco-rubio.jpg",
        "publishedAt": "2025-05-18T18:59:36Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /marco-rubio-addresses-russia-tapping-us-ukraine-talks-2073831 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/marco-rubio-addresses-russia-tapping-us-ukraine-talks-2073831"
    },
    {
        "title": "New Russiagate information will provide 'accountability': Patel",
        "description": "FBI Director Kash Patel hinted that information on allegations of ties between Trump’s 2016 campaign and Russia will come in \"a week or two.\"",
        "content": "FBI Director Kash Patel says he has discovered new information related to the agency’s “Crossfire Hurricane” investigation regarding allegations of ties between President Donald Trump’s 2016 presidential campaign and Russia.\nWhile appearing alongside... [2586 chars]",
        "url": "https://www.washingtonexaminer.com/news/justice/3415223/kash-patel-new-russiagate-information-accountability/",
        "image": "https://www.washingtonexaminer.com/wp-content/uploads/2025/05/Kash-Patel-FBI-Russiagate-scaled.webp",
        "publishedAt": "2025-05-18T17:34:09Z",
        "source": {
            "name": "Washington Examiner",
            "url": "https://www.washingtonexaminer.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.washingtonexaminer.com/news/justice/3415223/kash-patel-new-russiagate-information-accountability/ on URL https://www.washingtonexaminer.com/news/justice/3415223/kash-patel-new-russiagate-information-accountability/"
    },
    {
        "title": "Russia launches largest drone attack against Ukraine since beginning of war, Ukrainian military says",
        "description": "By Caitlin Danaher and Kosta Gak, CNN (CNN) — Russia has battered Ukraine overnight with its largest drone attack since the war began, Ukraine’s",
        "content": "By Caitlin Danaher and Kosta Gak, CNN\n(CNN) — Russia has battered Ukraine overnight with its largest drone attack since the war began, Ukraine’s military said Sunday, as Moscow intensified its military assault despite holding direct peace talks with ... [3673 chars]",
        "url": "https://krdo.com/news/2025/05/18/russia-launches-largest-drone-attack-against-ukraine-since-beginning-of-war-ukrainian-military-says/",
        "image": "https://krdo.b-cdn.net/2025/05/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbWF0ZnZ3ZHgwMDAzM2I2bWQ5ZzIwNHFl-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtYXRmMTEwdDAwNm4yN252YzJiaGR2azI-scaled.jpg",
        "publishedAt": "2025-05-18T15:03:15Z",
        "source": {
            "name": "KRDO",
            "url": "https://krdo.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 404 Client Error: Not Found for url: https://krdo.com/news/2025/05/18/russia-launches-largest-drone-attack-against-ukraine-since-beginning-of-war-ukrainian-military-says/ on URL https://krdo.com/news/2025/05/18/russia-launches-largest-drone-attack-against-ukraine-since-beginning-of-war-ukrainian-military-says/"
    },
    {
        "title": "Zelensky Meets With Pope Leo After Inaugural Mass",
        "description": "Ukraine’s president was among the dignitaries and world leaders in St. Peter’s Square. After the meeting, he thanked the Vatican for its willingness to serve as a venue for peace talks between Ukraine and Russia.",
        "content": "President Volodymyr Zelensky of Ukraine attended Pope Leo XIV’s inaugural Mass on Sunday and met later with the new pontiff in private, days after Leo expressed a personal desire to help end the war with Russia.\nThe meeting took place after the newly... [560 chars]",
        "url": "https://www.nytimes.com/2025/05/18/world/europe/zelensky-pope-mass-vance-rubio.html",
        "image": "https://static01.nyt.com/images/2025/05/18/multimedia/18pope-news-zelensky-ukraine-kjfg/18pope-news-zelensky-ukraine-kjfg-facebookJumbo.jpg",
        "publishedAt": "2025-05-18T14:39:04Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "full_content": "It was the second time Mr. Zelensky visited the Holy See in recent weeks. When he attended the funeral of Pope Francis on April 26, Mr. Zelensky met privately with President Trump, which yielded a striking image of the two men facing each other on metal chairs in an ornate hall. It was the first time they had met since the February sit-down in the Oval Office in February, in which Mr. Trump castigated the Ukrainian leader.\n\nIt was unclear whether any informal meetings on Ukraine would take place after the Mass.\n\nFriedrich Merz, Germany’s new chancellor, told reporters in Rome on Sunday that he had spoken with Mr. Rubio about Mr. Trump’s upcoming phone call with Mr. Putin. Speaking with reporters after the service had concluded, Mr. Merz said that he and the leaders of France and the United Kingdom were planning to try to speak to Mr. Trump before that phone call.\n\n“My strong impression is that both Europeans and Americans are determined to work together, but now also in a focused manner, to ensure that this terrible war ends soon,” Mr. Merz said.\n\nOn Saturday, Mr. Zelensky said that he had met with Prime Minister Mark Carney of Canada and President Karin Keller-Sutter of Switzerland separately in Rome to discuss how to increase pressure on Russia to end the war.\n\nThe search for peace in Ukraine has gathered pace in recent weeks. Delegations from the two sides held their first direct talks in Turkey on Friday and later agreed on a prisoner exchange.\n\nPope Francis, who died on April 21, regularly called for peace in Ukraine.\n\nSince his election, Leo has signaled a deep interest in ending the war. Last week, he used his first Sunday address to call for an “authentic, just and lasting peace” in Ukraine and for all prisoners of war to be freed. He added that children should be returned to their families. Although he did not specify which children, many Ukrainian children have been taken to Russia against the wishes of their families since the war began.\n\nChristopher F. Schuetze contributed reporting from Berlin."
    },
    {
        "title": "Pentagon Redeploys Spy Drone to Black Sea After Russia Peace Talks Setback",
        "description": "It marks the drone's first known appearance in the Black Sea area since June 2024, and the first time since Trump resumed office.",
        "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\nThe U.S. Department of De... [3730 chars]",
        "url": "https://www.newsweek.com/pentagon-redeploys-spy-drone-black-sea-after-russia-peace-talks-setback-2073751",
        "image": "https://d.newsweek.com/en/full/2646782/global-hawk.jpg",
        "publishedAt": "2025-05-18T10:46:21Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /pentagon-redeploys-spy-drone-black-sea-after-russia-peace-talks-setback-2073751 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/pentagon-redeploys-spy-drone-black-sea-after-russia-peace-talks-setback-2073751"
    },
    {
        "title": "Rookie Robert Shwartzman claims Indianapolis 500 pole",
        "description": "The 25-year-old with dual nationality in Israel and Russia made an impassioned plea for peace in the Middle East and Eastern Europe following qualifying.",
        "content": "The last rookie to qualify on the Indy 500 pole was Teo Fabi. Coincidentally, he was an Italian — just like Prema, which also was founded in ’83. Prema is established in Europe and races in the Formula 2 series. It made its IndyCar debut this season.... [4274 chars]",
        "url": "https://www.bostonglobe.com/2025/05/18/sports/robert-shwartzman-indianapolis-500-pole/",
        "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/S7Y4XL2HYBGF3EGV5MOXXVCFP4.jpg?auth=18d65e1649d71ffaac65df55119320dfe7ec0b28aaaf88abd90fa1c8b2478d4a&width=1440",
        "publishedAt": "2025-05-18T04:00:00Z",
        "source": {
            "name": "The Boston Globe",
            "url": "https://www.bostonglobe.com"
        },
        "full_content": "The last rookie to qualify on the Indy 500 pole was Teo Fabi. Coincidentally, he was an Italian — just like Prema, which also was founded in ’83. Prema is established in Europe and races in the Formula 2 series. It made its IndyCar debut this season.\n\nRobert Shwartzman, a 25-year-old with dual nationality in Israel and Russia, became the first Indy 500 rookie to qualify on the pole since 1983 when he did it for Prema Racing with a four-lap average of 232.790 miles per hour.\n\nINDIANAPOLIS — A rookie driver for a brand new team won the pole for the Indianapolis 500 on a strange day at Indianapolis Motor Speedway, where Team Penske was disqualified before the final two rounds of qualifying.\n\nShwartzman was born in Tel Aviv, Israel, and raised in Saint Petersburg, Russia. He began racing go-karts when he was 4 years old, and eventually, his budding career in motorsports took him to Italy and elsewhere in Europe. He initially raced under the Russian flag until the start of the war with Ukraine, when he changed to the Israeli, making him the first driver from Israel to make “The Greatest Spectacle in Racing.”\n\nHe made an impassioned plea for peace in the Middle East, where Israel has been at war with Hamas-led Palestinian groups since 2023, and Eastern Europe, where Ukrainian President Volodymyr Zelenskyy met with top US officials Sunday ahead of a phone call Monday between President Donald Trump and Russian President Vladimir Putin aimed at ending their war.\n\nAdvertisement\n\n“I just want peace in the world,” Shwartzman said. “I want people to be good, and I don’t want the separation of countries, saying, ‘This is bad country. This is good country.’ There is no bad or good. We’re all human beings, and we just have to support each other. We need to find ways to, let’s say, negotiate things. Find ways to agree on things, you know? Because from my experience, there is always, you know, a gold medal, I’m calling it — like, there’s always the right path.”\n\nAdvertisement\n\nPrema is the first team making its debut in the Indy 500 to land on the pole since Mayer Motor Racing put Tom Sneva there in 1984.\n\nShwartzman, who has never before raced on an oval, was mobbed by a sea of red-clad team members as soon as his pole-winning run became official.\n\n“Honestly it feels like I’m dreaming. I just had it in my dreams when I was going how would it feel to do such a good job in quali,” he said. “It’s the Indy 500. It’s the main race of the year. Honestly it feels unbelievable.”\n\nShwartzman had been pursuing a career in Formula 1 and was part of the Ferrari development program, as well as its reserve driver from 2021 until the end of last season — when Prema nabbed him for its two-car team.\n\nHe was the fourth of six drivers to make their qualifying attempt and took the pole from Takuma Sato of Rahal Letterman Lanigan. He still had to wait for Pato O’Ward of McLaren and Felix Rosenqvist of Meyer Shank Racing to make their runs, and he nervously watched from pit lane.\n\nO’Ward went first and landed in the third spot. Rosenqvist dropped to fifth, sandwiched in the second row between Chip Ganassi Racing teammates Scott Dixon and Alex Palou. It was a strange finishing order as the Ganassi cars were expected to battle each other for the top starting spot in next Sunday’s race.\n\nAdvertisement\n\n“Rookie on pole with Shwartzman — how wild does that get? New team. I didn’t see that coming at all,” said 2008 winner Dixon.\n\nThe pole was wide open for the taking first when Team Penske was disqualified from qualifying for an illegal modification on the cars of two-time defending Indy 500 winner Josef Newgarden and Will Power, and Scott McLaughlin destroyed his car in a Sunday morning crash during practice.\n\nThe three Penske drivers all started on the front row last year, but will be 10th, 11th, and 12th in the fourth row together next weekend. That put the odds in Ganassi’s favor, but they had a surprising drop in speed from Saturday to Sunday.\n\nSo then Sato, in his first race in nearly a year, sat atop the scoring pylon until Shwartzman’s shocking run.\n\n“I don’t even know what to say. The car felt amazing,” he said, ”Coming here for my first oval race, I couldn’t even expect to be in this position. Big thanks to everyone. Big thanks to the fans cheering for me. It’s unbelievable.”\n\nShwartzman’s engineer is Eric Leichtle, who spent a season with Team Penske as the engineer for Newgarden in 2022. Leichtle left motorsports and spent the past two years working for SpaceX as a senior structures engineer."
    },
    {
        "title": "Russia launches largest drone attack against Ukraine since beginning of war, Ukrainian military says",
        "description": "Russia has battered Ukraine overnight with its largest drone attack since the war began, Ukraine’s military said Sunday, as Moscow intensified its military assault despite holding direct peace talks with Kyiv Friday.",
        "content": "CNN —\nRussia has battered Ukraine overnight with its largest drone attack since the war began, Ukraine’s military said Sunday, as Moscow intensified its military assault despite holding direct peace talks with Kyiv Friday.\nRussia launched 273 Shahed ... [3629 chars]",
        "url": "https://edition.cnn.com/2025/05/18/europe/russia-largest-drone-attack-ukraine-war-intl",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-18t064029z-728247904-rc24kea05u9n-rtrmadp-3-ukraine-crisis-attack-kyiv.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-18T04:00:00Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nRussia battered Ukraine over the weekend with its largest drone attack since the war began, Ukraine’s military said Sunday, ahea﻿d of an expected phone call between US President Donald Trump and Russian President Vladimir Putin on ending hostilities.\n\nRussia launched 273 Shahed drones in one night, the Ukrainian Air Force said Sunday, predominantly targeting the central Kyiv region, where they killed a 28-year-old woman and wounded three others, including a 4-year-old child, according to the region’s governor.\n\nMore strikes hit overnight, killing at least two people and injuring 13 others, local authorities said Monday. The Ukrainian Air Force said Russia launched a further 112 drones in the early hours of Monday, attacking the regions of Kharkiv, Sumy, Donetsk, Cherkasy and Kirovohrad.\n\nThe barrages came as Trump said he would speak to Putin by phone on Monday, which the Kremlin has confirmed.\n\nThe Russian leader has previously ignored a proposal from Washington and Kyiv for a 30-day ceasefire and last week snubbed Ukrainian President Volodymyr Zelensky’s call to meet face-to-face for talks in Istanbul.\n\nTrump has said he doesn’t think there will be a significant breakthrough on peace talks until he speaks with Putin.\n\nKremlin spokesperson Dmitry Peskov said Monday that Russia is “grateful to the American side” for its mediation efforts, adding, “if they really help us achieve our goals by peaceful means, then this is indeed preferable.”\n\nThe US president is growing frustrated with Putin, Finland’s President Alexander Stubb told local media on Sunday, after he spoke with Trump by phone the day before. “Zelensky is patient, but Trump is starting to grow impatient” toward Putin, Stubb told a press conference in Estonia.\n\nMeanwhile, Russian forces downed 75 Ukrainian drones over the weekend, state-run news agency TASS reported Sunday, citing Moscow’s defense ministry.\n\nA firefighter works at the site of a Russian drone strike outside of Kyiv. Valentyn Ogirenko/Reuters\n\nDays of back-and-forth\n\nThese latest Russian aerial assaults come after a drone attack on a bus in Ukraine’s northeastern region of Sumy killed at least nine people and injured seven Saturday, just hours after the two countries met for the first direct peace talks since the early weeks of Russia’s 2022 invasion.\n\nThe negotiations in Turkey failed to produce a major breakthrough. The two countries discussed a possible meeting between their presidents, a ceasefire and agreed a prisoner swap.\n\nThe talks capped days of back-and-forth: Putin called for the face-to-face meeting but did not attend, instead sending a junior delegation after rejecting Ukraine’s proposal of a 30-day ceasefire.\n\nDuring the talks, Russia demanded Ukraine cede land that was still under Kyiv’s control, a source familiar with Friday’s negotiations told CNN, a position Ukraine has long dismissed. The leaders of the United Kingdom, France, Germany and Poland called Russia’s stance in the talks “unacceptable.”\n\nIn a TV interview with a Russian state media journalist released Sunday, Putin said he wanted to “eliminate” the causes of the conflict. The footage had a date banner reading March 27, but its release Sunday perhaps signals Moscow’s unchanged stance ahead of any future talks.\n\nZelensky, for his part, said he had had a “good meeting” Sunday with US Vice President JD Vance and Secretary of State Marco Rubio in Italy, where the trio discussed Friday’s peace talks.\n\nThey also “touched on” Russian sanctions, the battlefield situation and future prisoner swaps, the Ukrainian president added in a post on social media.\n\nSunday marked the first meeting between Zelensky and Vance since their spat in the Oval Office in February, where the vice president castigated the Ukrainian leader for purportedly not demonstrating enough gratitude for American support.\n\nCNN’s Victoria Butenko, Nick Paton Walsh, Olesya Dmitracova, Andrew Carey, Anna Chernova and Lauren Kent contributed reporting."
    },
    {
        "title": "Rubio says U.S. will find out if Russia is \"tapping us along\" soon amid push for ceasefire in Ukraine",
        "description": "Secretary of State Marco Rubio told \"Face the Nation\" he believes talks to end the war in Ukraine will only progress if President Trump and Russian President Vladimir Putin meet in person.",
        "content": "Secretary Rubio says Trump wants summit with Russia's Putin \"as soon as feasible\"\nSecretary of State Marco Rubio spoke on the phone Saturday with his Russian counterpart, Sergey Lavrov, to get a readout on the latest talks, as the U.S. tries to deter... [2652 chars]",
        "url": "https://www.cbsnews.com/news/rubio-says-u-s-will-find-out-if-russia-is-tapping-us-along-soon-amid-push-for-ceasefire-ukraine/",
        "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/17/f675412d-1786-4fe5-8e86-85431d11f16e/thumbnail/1200x630/4214f79cdd63d68c8a779f99cae86ee6/marco-rubio-ftn.png?v=6df9366690ed146f169dd0670c453f91",
        "publishedAt": "2025-05-17T21:54:16Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "Secretary Rubio says Trump wants summit with Russia's Putin \"as soon as feasible\"\n\nSecretary of State Marco Rubio spoke on the phone Saturday with his Russian counterpart, Sergey Lavrov, to get a readout on the latest talks, as the U.S. tries to determine whether Russia is \"tapping us along\" in efforts to end the war in Ukraine.\n\n\"We talked about a variety of things,\" Rubio told \"Face the Nation with Margaret Brennan\" in an interview airing Sunday. \"I wanted to get his readout on his view of how the talks went yesterday. They were not a complete waste of time.\"\n\nThe phone call between the countries' top diplomats occurred a day after Moscow and Kyiv held the first direct talks in three years. Russian President Vladimir Putin spurned Ukrainian President Volodymyr Zelenskyy's offer to meet face-to-face in Turkey after he proposed direct negotiations and instead sent a lower-level delegation.\n\nThe talks in Istanbul Friday broke up after fewer than two hours without a ceasefire, although both sides agreed on exchanging 1,000 prisoners of war each.\n\nThe United States — along with its European allies — have been pushing Russia and Ukraine for an end to the three-year war. President Trump, who has expressed frustration with the stalled talks and threatened to stiffen American sanctions unless progress is made toward a peace deal, said Saturday he will be speaking with Putin by phone Monday. That call will be followed by one with Zelenskyy, Mr. Trump said.\n\n\"Are they tapping us along? Well, that's what we're trying to find out,\" Rubio told Brennan when asked if Russia and Ukraine are seeking to talk to \"buy time.\" \"We'll find out pretty soon.\"\n\nHe added, \"On the one hand, we're trying to achieve peace and end a very bloody, costly and destructive war. So, there's some element of patience that is required. On the other hand, we don't have time to waste. There are a lot of other things happening in the world that we also need to be paying attention to.\"\n\nThe secretary of state said he believes the only way that these talks will move forward is if Mr. Trump and Putin meet in person. He said Mr. Trump has publicly offered to meet one-on-one.\n\n\"The mechanics of setting that kind of meeting up would require a little bit of work, so I can't say that's being planned as we speak in terms of picking a site and a date,\" Rubio said. \"But the president wants to do it. He wants to do it as soon as feasible.\"\n\nThe Vatican has made a \"very generous offer\" to host any peace talks. Rubio, who is in Rome to attend the Mass for the inauguration of Pope Leo XIV Sunday, said the Vatican would be a place that \"all parties would feel comfortable.\"\n\nLeo, who was elected as the first U.S.-born pope on May 8, took up Pope Francis' call for peace in Ukraine in his first Sunday noon blessing as pope. He appealed for all sides to do whatever possible to reach \"an authentic, just and lasting peace.\""
    },
    {
        "title": "Trump and Putin to discuss ending Russia-Ukraine 'bloodbath'",
        "description": "President Donald Trump announced the phone call Saturday morning, also saying he would speak with Ukrainian President Volodymyr Zelensky and members of NATO.",
        "content": "President Donald Trump announced he will speak to Russian President Vladimir Putin over the phone Monday to discuss the war in Ukraine.\nAfter neither Trump nor Putin went to Turkey earlier this week for peace talks to end the war between Russia and U... [1967 chars]",
        "url": "https://www.washingtonexaminer.com/news/white-house/3415006/trump-putin-discuss-ending-russia-ukraine-bloodbath-over-phone/",
        "image": "https://www.washingtonexaminer.com/wp-content/uploads/2025/05/trump-zelensky-putin-phone-call-may-2025.webp",
        "publishedAt": "2025-05-17T15:35:35Z",
        "source": {
            "name": "Washington Examiner",
            "url": "https://www.washingtonexaminer.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.washingtonexaminer.com/news/white-house/3415006/trump-putin-discuss-ending-russia-ukraine-bloodbath-over-phone/ on URL https://www.washingtonexaminer.com/news/white-house/3415006/trump-putin-discuss-ending-russia-ukraine-bloodbath-over-phone/"
    },
    {
        "title": "Russia sentences Australian man to 13 years in prison for fighting for Ukraine",
        "description": "Russia has sentenced an Australian man to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in the Russian-controlled parts of eastern Ukraine said Friday.",
        "content": "CNN —\nRussia has sentenced an Australian man to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in the Russian-controlled parts of eastern Ukraine said Friday.\nOscar Jenkins, 33, was found guilty by a ... [2518 chars]",
        "url": "https://edition.cnn.com/2025/05/17/europe/russia-jails-australian-oscar-jenkins-ukraine-intl-hnk",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/photo-2025-05-16-16-41-11.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-17T04:00:00Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nRussia has sentenced an Australian man to 13 years in a maximum-security prison for fighting alongside Ukrainian forces, state prosecutors in the Russian-controlled parts of eastern Ukraine said Friday.\n\nOscar Jenkins, 33, was found guilty by a court in Luhansk of participating in an armed conflict as a mercenary, prosecutors said in a statement, after it ruled he had fought for Ukraine against Russia between March and December last year.\n\nAustralian Foreign Minister Penny Wong said on Saturday that her government was “appalled” by the sentencing, calling it a “sham trial” and urged Russia to treat Jenkins in accordance with international humanitarian law.\n\nAustralia has repeatedly called for the release of Jenkins, who is originally from Melbourne, since he was captured by Russian forces in December.\n\n“We continue to hold serious concerns for Mr Jenkins. We are working with Ukraine and other partners, including the International Committee of the Red Cross, to advocate for his welfare and release,” Wong said in a statement.\n\nRussian prosecutors accused Jenkins of being paid ﻿between $7,400 and $10,000 a month to fight in Ukraine as a mercenary. The Kremlin maintains that mercenaries are subject to criminal prosecution and not entitled to prisoner-of-war protections under international law.\n\nIn a photo shared by the Russian-controlled court in Luhansk, Jenkins was seen standing in a glass cage with his hands behind his back.\n\nThe court ordered Jenkins to serve his sentence in a maximum-security penal colony, the prosecutor’s office said.\n\nJenkins is thought to have joined an international brigade among the Ukrainian ranks, according to Reuters. His arrest came to light late last year when a video surfaced on Russian Telegram accounts purportedly showing Jenkins being taken as a prisoner of war.\n\nIn the footage, which CNN has been unable to geolocate, Jenkins’ hands are tightly bound, and he appears to struggle to understand questions posed to him in Russian. A man strikes him twice across the head.\n\nSpeaking in a mix of English, Ukrainian and Russian, he identifies himself as “a soldier” and says he is a teacher in China and a student in Australia.\n\nEarlier this year, media reports suggesting he might have been killed prompted Canberra to summon the Russian ambassador, with Prime Minister Anthony Albanese vowing the “strongest action” over any harm caused to the man.\n\nAlbanese said last month his government would continue to make representations to the “reprehensible regime” of Russian President Vladimir Putin on behalf of Jenkins.\n\nAustralia has repeatedly condemned Russia’s invasion of Ukraine and has given Kyiv close to $1 billion in assistance since 2022, while its military has provided training for Ukraine’s armed forces."
    },
    {
        "title": "GOP congressman confirms Hegseth ordered pause in cyber operations against Russia, despite Pentagon denial",
        "description": "CBS News reported in March that the defense secretary ordered a pause in cyber operations against Russia. Rep. Don Bacon disclosed its duration during a hearing.",
        "content": "What we know about the U.S. pause on cyber operations against Russia\nWashington — Republican Rep. Don Bacon of Nebraska said the U.S. government halted cyber operations against Russia for one day in February as President Trump was trying to negotiate... [4015 chars]",
        "url": "https://www.cbsnews.com/news/gop-congressman-don-bacon-hegseth-ordered-pause-cyber-operations-against-russia/",
        "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=6df9366690ed146f169dd0670c453f91",
        "publishedAt": "2025-05-16T20:56:03Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "What we know about the U.S. pause on cyber operations against Russia\n\nWashington — Republican Rep. Don Bacon of Nebraska said the U.S. government halted cyber operations against Russia for one day in February as President Trump was trying to negotiate an end to the Russia-Ukraine war, confirming CBS News reporting at the time and undercutting statements of denial from the Defense Department.\n\n\"I actually dug into this whole matter. I just want to address it: It was a one-day pause, which is typical for negotiations,\" said Bacon, chair of the House Armed Services cyber subcommittee, during a hearing on Capitol Hill on Friday. \"That's just about as much as I can say. It was a one-day pause.\"\n\nIn March, multiple U.S. officials told CBS News that Defense Secretary Pete Hegseth had issued a directive to U.S. Cyber Command to pause cyber operations against Russia, including those that were the most provocative. At the time, the duration of the pause was unknown.\n\nIn response to reports about the pause, the Pentagon's rapid response team posted on March 4 on X that Hegseth \"has neither canceled nor delayed any cyber operations directed against malicious Russian targets and there has been no stand-down order whatsoever from that priority.\"\n\nTwo sources familiar with Hegseth's order said the pause directive lacked specificity. It's not clear how the order about planning was interpreted. Multiple officials also told CBS News in March that strategizing for future operations was never paused and that U.S. cyber policy on Russia \"is very much intact\" and remains at the same level, one of the officials said.\n\nBacon's remarks are the first on-the-record acknowledgment of the directive's existence, which was first reported in February by The Record, a cybersecurity news publication.\n\nIt's not uncommon for certain military operations to be paused during sensitive negotiations between countries. Both Democratic and Republican administrations have halted operations to prevent U.S. intentions from being misconstrued and to keep diplomacy on track.\n\nIn addition to the Pentagon's statement on X, the Trump administration stonewalled inquiries on the matter and continued to deny any pause was ordered.\n\nA senior U.S. defense official at the Defense Department declined to answer questions from CBS News at the time when asked about the reported pause.\n\nIn Friday's House hearing, the statement from DOD Rapid Response was called out by Army veteran and Democratic Rep. Eugene Vindman, who accused the Pentagon of lying about the pause directive.\n\n\"What I would like to do is basically point out that that statement by DOD Rapid Response was an outright lie,\" said the Virginia congressman. \"It was at least misleading. And that is not what the American people deserve, and that will be something that I intend to follow up with the secretary when he actually shows up.\"\n\nThe Pentagon created the DOD Rapid Response account in February, and it is overseen by conservative podcaster and Army veteran Graham Allen, who is now the Pentagon's digital media director.\n\nThe account commonly attacks news publications and posts comments criticizing reporting about Hegseth and the Defense Department. The X account has omitted context from its statements, touting an increase in U.S. military recruiting numbers between February 2024 through February 2025, even though much of the period showing improved recruitment numbers occurred during the Biden administration, as CBS News' Confirmed team found.\n\nTrump administration officials have promised to run \"the most transparent Defense Department in history,\" but to date, the Pentagon has held just one formal briefing. Instead of regular press engagements, the Pentagon's modus operandi for official Defense Department communications is often to bypass legacy news media outlets and attack their reporting. Questions to the Pentagon were referred to U.S. Cyber Command, which told CBS News Friday that \"due to operational security concerns, we do not comment nor discuss cyber intelligence, plans, or operations.\"\n\nJames LaPorta James LaPorta is a national security coordinating producer in CBS News' Washington bureau. He is a former U.S. Marine infantryman and veteran of the Afghanistan war.\n\ncontributed to this report."
    },
    {
        "title": "Trump says he'll meet with Putin on Ukraine war \"as soon as we can,\" amid low hopes for Ukraine-Russia talks",
        "description": "As Russia and Ukraine hold their first direct talks in years, Trump says there won't be a real breakthrough to end the war until he sits down with Putin.",
        "content": "Trump applauds Middle East trip, says Ukraine talks won't progress until he, Putin \"get together\"\nAbu Dhabi, United Arab Emirates — President Trump said Friday that he's moving to set up direct talks with Russian President Vladimir Putin as soon as h... [3691 chars]",
        "url": "https://www.cbsnews.com/news/trump-putin-russia-ukraine-war-meeting-proposal/",
        "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/16/17df6eef-a4e4-40f2-b134-593ee02bf31c/thumbnail/1200x630/a36a79ff24306d66ad753882a5105722/trump-uae-2214740554.jpg?v=6df9366690ed146f169dd0670c453f91",
        "publishedAt": "2025-05-16T17:03:01Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "Trump applauds Middle East trip, says Ukraine talks won't progress until he, Putin \"get together\"\n\nAbu Dhabi, United Arab Emirates — President Trump said Friday that he's moving to set up direct talks with Russian President Vladimir Putin as soon as he can, after Putin opted to skip peace talks between Russia and Ukraine in Turkey.\n\n\"I think it's time for us to just do it,\" Mr. Trump told reporters as he wrapped a four-day visit to the Middle East. Later, he told reporters on Air Force One, setting off on the journey back to Washington, that he might call Putin soon.\n\n\"He and I will meet, and I think we'll solve it or maybe not,\" Mr. Trump said. \"At least we'll know. And if we don't solve it, it'll be very interesting.\"\n\nPresident Trump attends the U.S.-UAE Business Council in Abu Dhabi, United Arab Emirates, May 16, 2025. Waleed Zein/Anadolu/Getty\n\nThe president reiterated that he wasn't surprised by Putin's decision to skip the talks taking place Friday in Turkey. Putin didn't want to go because he's not there, Mr. Trump said.\n\nMeetings between Ukrainian and Russian delegations did get underway in Istanbul Friday, though Putin sent a lower-level delegation. This prompted accusations from Ukraine and its European partners that Moscow wasn't really interested in a negotiated resolution to the war.\n\nAfter the meetings concluded, Vladimir Medinsky, who led the Russian delegation, said in a statement that the two countries agreed that \"in the coming days,\" they'll hold a large-scale exchange of 1,000 prisoners of war for each side. He also said Russia has \"taken notice\" of Ukraine's request for direct talks between the heads of state, and that each side \"would present its vision of a possible future ceasefire.\" Once the detailed outlines are presented, negotiations will continue.\n\nMr. Trump said he would hold a meeting with Putin, \"as soon as we can set it up.\"\n\n\"I would actually leave here and go,\" he said, noting that his daughter Tiffany just gave birth to her first child. \"I do want to see my beautiful grandson.\"\n\nUkrainian President Volodymyr Zelenskyy agreed to take part in the talks as Mr. Trump pressed for the leaders to find a solution to the war, ongoing since Russia's February 2022 full-scale invasion of Ukraine. But Putin spurned the call to meet face-to-face with Zelenskyy.\n\nMr. Trump has pressed both sides to quickly come to an agreement to end the war. Zelenskyy has agreed to an American plan for an initial 30-day halt to hostilities, but Russia has not signed on and has continued to strike at targets inside Ukraine.\n\nFirefighters extinguish a fire at a plastic tableware business damaged by a Russian drone attack, May 15, 2025, in Velyka Chernechchyna, Sumy Oblast, Ukraine. Oleksandr Oleksiienko/Kordon.Media/Global Images Ukraine/Getty\n\n\"He didn't go, and I understand that,\" Mr. Trump said Friday of Putin's decision to skip the talks in Istanbul. \"We're going to get it done. We got to get it done. Five thousand young people are being killed every single week on average, and we're going to get it done.\"\n\nThe U.S. president told reporters on Thursday that a meeting between himself and Putin was crucial to breaking the deadlock.\n\n\"I don't believe anything's going to happen, whether you like it or not, until he and I get together,\" Mr. Trump said. \"But we're going to have to get it solved because too many people are dying.\"\n\nSpeaking to reporters in Moscow on Friday, Kremlin spokesman Dmitry Peskov said any meeting between Putin and Mr. Trump would have to be \"well prepared\" for, but he said such an encounter was indeed necessary in Russia's view, as \"a serious conversation on international issues is needed, including the Ukrainian crisis.\"\n\nShould the talks in Istanbul fail to make any progress, Zelenskyy said Friday that there should be a \"strong reaction,\" as it would be clear, in his view, that Russia does not have any interest in ending the war.\n\ncontributed to this report."
    },
    {
        "title": "A timeline of the Trump administration’s evolving approach Russia-Ukraine peace talks",
        "description": "President Donald Trump has taken an intense personal interest in ending the war between Ukraine and Russia, recently suggesting that “nothing” will happen until he has an official meeting with Russian President Vladimir Putin.",
        "content": "CNN —\nPresident Donald Trump has taken an intense personal interest in ending the war between Ukraine and Russia, recently suggesting that “nothing” will happen until he has an official meeting with Russian President Vladimir Putin.\nTrump and his adm... [1152 chars]",
        "url": "https://edition.cnn.com/2025/05/16/politics/trump-timeline-russia-ukraine-putin-zelensky-dg",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201185317.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-16T16:33:32Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nPresident Donald Trump has taken an intense personal interest in ending the war between Ukraine and Russia, recently suggesting that “nothing” will happen until he has an official meeting with Russian President Vladimir Putin.\n\nTrump and his administration’s views on the negotiations have evolved over time. Secretary of State Marco Rubio warned about a month ago that the United States could walk away from mediation efforts between the warring nations if progress were not made within “days.” Now, Trump appears to be publicly pressing for the one-on-one with Putin and implying he’s the only one who can bring the conflict to an end, after months of stalled peace talks.\n\nTrump has personally oscillated between criticizing Ukrainian President Volodymyr Zelensky, saying he “has no cards” after a highly contentious Oval Office meeting in February, and taking Putin to task, demanding that he “STOP” the attacks and suggesting the Russian leader is “tapping me along.”\n\nLately, it seems Trump’s patience with Putin is waning, as the Russian president blew off the chance to meet directly with Zelensky in Turkey — a face-to-face meeting Putin suggested. The Ukrainian and Russian delegations agreed to a prisoner swap on Friday in Istanbul, but a larger peace deal, which Trump once said he could get on Day One of his second presidential term, remains elusive.\n\nHere’s a look at how we got here:"
    },
    {
        "title": "European leaders, Trump agree that Russia's position on talks unacceptable",
        "description": "U.K. Prime Minister Keir Starmer says European leaders agree with U.S. President Trump that Russia’s position in ceasefire talks is unacceptable and they intend to coordinate a response.",
        "content": "By LLAZAR SEMINI and LORNE COOK, Associated Press\nTIRANA, Albania (AP) — European leaders have agreed with U.S. President Donald Trump that Russia’s position in ceasefire talks with Ukraine is unacceptable and they intend to coordinate a response, U.... [6048 chars]",
        "url": "https://www.nydailynews.com/2025/05/16/eruope-trump-putin-ceasefire-position/",
        "image": "https://www.nydailynews.com/wp-content/uploads/2025/05/AP25136439316578.jpg?w=1024&h=682",
        "publishedAt": "2025-05-16T14:05:50Z",
        "source": {
            "name": "New York Daily News",
            "url": "https://www.nydailynews.com"
        },
        "full_content": "By LLAZAR SEMINI and LORNE COOK, Associated Press\n\nTIRANA, Albania (AP) — European leaders have agreed with U.S. President Donald Trump that Russia’s position in ceasefire talks with Ukraine is unacceptable and they intend to coordinate a response, U.K. Prime Minister Keir Starmer said on Friday.\n\nStarmer spoke from Albania’s capital, Tirana, where leaders of dozens of European countries were gathered for the European Political Community, or EPC, summit attended by Ukrainian President Volodymyr Zelenskyy.\n\n“We just had a meeting with President Zelensky and then a phone call with President Trump to discuss the developments in the negotiations today, and the Russian position is clearly unacceptable,” Starmer told reporters.\n\n“As a result of that meeting with President Zelensky, under discussion with President Trump, we are now closely aligning and coordinating our responses and will continue to do so,” he said.\n\nHe said that the decision with Trump was also agreed on with the leaders of France, Germany and Poland.\n\nRussia and Ukraine held their first first direct peace talks since the early weeks of Moscow’s full-scale invasion, which began on Feb. 24, 2022. The latest Russia-Ukraine talks were held in Turkey on Friday, but they ended after less than two hours, according to the Turkish Foreign Ministry and a Ukrainian official.\n\nKyiv accused the Kremlin of introducing new “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory, according to the official, who spoke to The Associated Press on condition of anonymity because he wasn’t authorized to make official statements.\n\nEarlier, Zelenskyy had said that Ukraine is committed to ending the war, but urged dozens of European leaders to ramp up sanctions if Russian President Vladimir Putin continues to play for time in talks aimed at securing a truce.\n\n“Ukraine is ready to take all realistic steps to end this war,” Zelenskyy told leaders at the European summit. But he warned: “If it turns out that the Russian delegation really is just theatrical and can’t deliver any results today, the world must respond.”\n\nThat reaction, he said, should include “sanctions against Russia’s energy sector and banks.”\n\nStarmer backed his call, saying in a summit speech that “Russia is dragging its feet and playing games.”\n\n“We must be prepared to follow through because if Russia won’t come to the negotiating table, Putin must pay the price,” he said.\n\nEuropean leaders criticize Putin’s decision not to met Zelenskyy\n\nZelenskyy’s remarks came after Putin declined to attend face-to-face talks.\n\n“I think Putin made a mistake by sending a low-level delegation,” NATO Secretary-General Mark Rutte said as he arrived for the summit under a steady drizzle. “The ball is clearly in his part of the field now, in his court. He has to play ball. He has to be serious about wanting peace.”\n\nEuropean Union foreign policy chief Kaja Kallas said that Putin was “playing games, which shows that they are not serious about peace.”\n\nEuropean Commission President Ursula von der Leyen said that it was clear that “President Zelenskyy was ready to meet but President Putin never showed up, and this shows his true belief. So we will increase the pressure.”\n\nVon der Leyen said that the EU is preparing a new package of sanctions. She said that the measures will target the shadow fleet of aging cargo vessels that Russia is using to bypass international sanctions and the Nord Stream pipeline consortium.\n\nRussia’s financial sector would also be targeted, she said. EU envoys have been working on the new sanctions package for several weeks, and the bloc’s foreign ministers could enact them as soon as Tuesday.\n\nItalian Premier Giorgia Meloni stressed that efforts to reach a deal on Ukraine must continue.\n\n“I think … that we must not throw in the towel. I think we must insist, we must insist for an unconditional ceasefire and a serious peace agreement that includes guarantees of security for Ukraine,” she said.\n\nSummit a chance for bilateral meetings\n\nThe theme of the summit in Tirana was “New Europe in a new world: unity — cooperation — joint action.” The gathering of leaders from about 50 nations and organizations was also addressing ways to improve the continent’s competitiveness and tackle unauthorized migration.\n\nBut the summit best serves as a setting for leaders to meet bilaterally, or in small groups, to weigh in on major security issues. The inaugural summit in Prague in 2022 saw the leaders of Azerbaijan and Armenia holding rare talks in an effort to ease tensions between the longtime adversaries.\n\nThe last summit, hosted by Hungarian Prime Minister Viktor Orbán, an ardent supporter of Trump, was dominated by the concerns and opportunities that might arise in the wake of Trump’s reelection.\n\nThe leaders arrived in Tirana’s central Skanderbeg Square on a rainy morning and were greeted by a brief performance by dancers in folk costumes before heading into the temporary conference hall, set up at the foot of a monument to Albania’s national hero Gjergj Kastrioti Skenderbeu, or Skanderbeg, who fought against the Ottoman Empire.\n\nAlbania hosts a major summit days after election\n\nThe summit comes after the governing Socialist Party of the host, Prime Minister Edi Rama, won Albania’s May 11 parliamentary election, attracting voters who support the country’s long and somewhat uphill effort to join the EU. The vote secured a fourth term for Rama.\n\nThe prime minister said that the summit is a point of pride for Albania, and an “inspiration and motivation to continue further on.”\n\nHis Socialist Party says it can deliver EU membership in five years.\n\nThe EPC forum is Macron’s brainchild, and was backed by former German Chancellor Olaf Scholz, aiming to boost security and prosperity across the continent. But critics claimed it was an attempt by them to put the brakes on EU enlargement.\n\nThe 2022 inaugural summit involved the EU’s 27 member countries, aspiring partners in the Balkans and Eastern Europe, as well as neighbors like the U.K. — the only country to have left the EU — and Turkey.\n\nRussia is the one major European power not invited, along with Belarus, its neighbor and supporter in the war with Ukraine.\n\nThe next meeting will take place in Denmark later this year.\n\nLorne Cook reported from Brussels."
    },
    {
        "title": "Trump says he'll soon meet with Putin, a no-show at peace talks in Turkey",
        "description": "President Donald Trump says he may call Russian President Vladimir Putin soon, after Putin skipped peace talks between Russia and Ukraine in Turkey.",
        "content": "ABU DHABI, United Arab Emirates (AP) — President Donald Trump said Friday he’s moving to set up direct talks with Russian President Vladimir Putin as soon as he can, after Putin opted to skip peace talks between Russia and Ukraine in Turkey.\n“I think... [2066 chars]",
        "url": "https://apnews.com/article/trump-putin-meeting-summit-soon-russia-meet-83ff8027e1860d8480dc7f5567e76062",
        "image": "https://dims.apnews.com/dims4/default/3bd2683/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fff%2Fdaff523a38676554517c6eb1848c%2F612d843240e740189d986f78a9fdc227",
        "publishedAt": "2025-05-16T13:13:27Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "full_content": "ABU DHABI, United Arab Emirates (AP) — President Donald Trump said Friday he’s moving to set up direct talks with Russian President Vladimir Putin as soon as he can, after Putin opted to skip peace talks between Russia and Ukraine in Turkey.\n\n“I think it’s time for us to just do it,” Trump told reporters as he wrapped a four-day visit to the Middle East.\n\nTrump later told reporters after boarding Air Force One to begin the journey back to Washington that he may call Putin soon.\n\n“He and I will meet, and I think we’ll solve it or maybe not,” Trump said. “At least we’ll know. And if we don’t solve it, it’ll be very interesting.”\n\nTrump reiterated that he wasn’t surprised that Putin skipped out on the talks set for Friday in Turkey. Putin didn’t want to go because he’s not there, Trump said.\n\nThe Republican president added that he would hold a meeting with Putin “as soon as we can set it up.”\n\n“I would actually leave here and go,” said Trump, who noted his daughter Tiffany just gave birth to her first child. “I do want to see my beautiful grandson.”\n\nUkrainian President Volodymyr Zelenskyy agreed to take part in the talks as Trump pressed for the leaders to find a solution to the war, ongoing since Russia’s February 2022 invasion of Ukraine. But Putin spurned the call to meet face-to-face with Zelenskyy.\n\nTrump has pressed both sides to quickly come to a war-ending agreement. Zelenskyy has agreed to an American plan for an initial 30-day halt to hostilities, but Russia has not signed on and has continued to strike at targets inside Ukraine.\n\nStill, Russia and Ukraine were holding their first direct peace talks in three years Friday, gathering in Istanbul for negotiations. Officials and observers expect them to yield little immediate progress on stopping the more than 3-year-old war.\n\n“He didn’t go, and I understand that,” Trump said. “We’re going to get it done. We got to get it done. Five thousand young people are being killed every single week on average, and we’re going to get it done.”\n\nTrump on Thursday told reporters that a meeting between himself and Putin was crucial to breaking the deadlock.\n\n“I don’t believe anything’s going to happen, whether you like it or not, until he and I get together,” Trump said. “But we’re going to have to get it solved because too many people are dying.”"
    },
    {
        "title": "Russia-Ukraine peace talks end after less than 2 hours",
        "description": "The first direct peace talks between Russia and Ukraine since 2022 ended after less than two hours. Kyiv and Moscow said they did agree to exchange 1,000 prisoners of war each",
        "content": "By HANNA ARHIROVA, ANDREW WILKS and LORNE COOK, Associated Press\nISTANBUL, Turkey (AP) — The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed o... [5756 chars]",
        "url": "https://www.nydailynews.com/2025/05/16/russia-ukraine-peace-talks-turkey/",
        "image": "https://www.nydailynews.com/wp-content/uploads/2025/05/Turkey_US_Ukraine_11098.jpg?w=1024&h=682",
        "publishedAt": "2025-05-16T12:04:12Z",
        "source": {
            "name": "New York Daily News",
            "url": "https://www.nydailynews.com"
        },
        "full_content": "By HANNA ARHIROVA, ANDREW WILKS and LORNE COOK, Associated Press\n\nISTANBUL, Turkey (AP) — The first direct Russia-Ukraine peace talks since the early weeks of Moscow’s 2022 invasion ended after less than two hours Friday, and while both sides agreed on a large prisoner swap, they clearly remained far apart on key conditions for ending the fighting.\n\nUkrainian President Volodymyr Zelenskyy said he discussed the results of the talks with U.S. President Donald Trump and the leaders of France, Germany, the U.K. and Poland. In a post on X from a European leadership meeting in Albania, he urged “tough sanctions” against Moscow if it rejects “a full and unconditional ceasefire and an end to killings.”\n\nAt the brief Istanbul talks, Kyiv and Moscow agreed to exchange 1,000 prisoners of war each, according to the heads of both delegations, in what would be their biggest such swap.\n\nBoth sides also discussed a ceasefire and a meeting between their heads of state, according to chief Ukrainian delegate, Defense Minister Rustem Umerov.\n\nRussian presidential aide Vladimir Medinsky, who headed Moscow’s delegation, said both sides agreed to provide each other with detailed ceasefire proposals and Ukraine requested the heads of state meeting, which Russia took under consideration.\n\nDuring the talks, a senior Ukrainian official said Russia introduced new, “unacceptable demands” to withdraw Ukrainian forces from huge swaths of territory. The official, who was not authorized to make official statements, spoke to The Associated Press on the condition of anonymity. The proposal had not been previously discussed, the official said.\n\nThe Ukrainian side reiterated it remained focused on achieving real progress — an immediate ceasefire and a pathway to substantive diplomacy — “just like the U.S., European partners, and other countries proposed,” the official added.\n\nThe two sides sat opposite each other at a U-shaped table in the Dolmabahce Palace but remained far apart in their conditions for ending the war. Trump, who has pressed both Moscow and Kyiv for an end to the conflict, said a meeting between himself and Russian President Vladimir Putin would happen “as soon as we can set it up.”\n\n“I think it’s time for us to just do it,” Trump told reporters in Abu Dhabi as he wrapped up a trip to the Middle East.\n\nTurkish Foreign Minister Hakan Fidan opened the talks by urging the delegates “to take advantage of this opportunity,” adding that it was “critically important that the ceasefire happens as soon as possible.”\n\nIn a social media post afterward, Fidan described the POW swap as a “confidence-building measure” and said the parties had agreed in principle to meet again.\n\nZelenskyy was in Tirana, Albania, with leaders of 47 European countries to discuss security, defense and democratic standards against the backdrop of the war. He met with French President Immanuel Macron, German Chancellor Friedrich Merz, U.K. Prime Minister Keir Starmer and Polish Prime Minister Donald Tusk.\n\n“Pressure on Russia must be maintained until Russia is ready to end the war,” Zelenskyy said on X, posting a photo of five leaders during the call, the second for the group since May 10.\n\nDiplomatic maneuvering\n\nBoth countries engaged in diplomatic maneuvering this week as they tried to show Trump that they are eager to negotiate, although he has expressed frustration over the slow progress and threatened to punish foot-dragging.\n\nOn Thursday, Putin spurned an offer by Zelenskyy to meet face-to-face in Turkey. Zelenskyy accused Moscow of not making a serious effort to end the war by sending a low-level delegation.\n\nUkraine has accepted a U.S. and European proposal for a full, 30-day ceasefire, but Putin has effectively rejected it by imposing far-reaching conditions.\n\nCommenting on a possible Trump-Putin meeting, Kremlin spokesman Dmitry Peskov appeared to indicate that momentum for such a summit is building. He told reporters that top-level talks were “certainly needed,” but added that preparing a summit would take time.\n\nFighting continues in Ukraine\n\nRussian forces, meanwhile, are preparing a fresh military offensive, Ukrainian government and Western military analysts say.\n\nA Friday morning drone attack on the northeastern Ukrainian city of Kupiansk killed a 55-year-old woman and wounded four men, said Oleh Syniehubov, head of the Kharkiv Regional Military Administration..\n\nRussia’s invasion has killed more than 12,000 Ukrainian civilians, the U.N. says, and razed towns and villages. Tens of thousands of Ukrainian soldiers have died, and likely a larger number of Russian troops, officials and analysts say.\n\nOn the battlefield, one Ukrainian soldier said he wasn’t hopeful that the talks would bring a swift end to the war.\n\n“I don’t think they will agree on anything concrete, because summer is the best time for war,” he said, using only the call sign “Corsair,” in accordance with the rules of the Ukrainian military. “The enemy is trying to constantly escalate the situation.”\n\nBut he told AP that many of his comrades “believe that by the end of the year there will be peace, albeit an unstable one, but peace.”\n\nBefore the talks, Ukrainian officials met with national security advisers from the U.S., France, Germany and the U.K. to coordinate positions, the senior Ukrainian official told AP. The U.S. team was led by retired Lt. Gen. Keith Kellogg, Trump’s special envoy to Ukraine and Russia, while Umerov and presidential office chief Andriy Yermak represented Ukraine, the official said.\n\nA three-way meeting between Turkey, the U.S. and Ukraine also took place, Turkish Foreign Ministry officials said. The U.S. side included Secretary of State Marco Rubio as well as Kellogg.\n\nOn Thursday, Rubio said “we don’t have high expectations of what will happen” at the Russia-Ukraine talks.\n\nHe said he believed a breakthrough was only possible is a meeting between Trump and Putin.\n\nCook reported from Brussels. Associated Press writer Aamer Madhani in Dubai, United Arab Emirates, contributed."
    },
    {
        "title": "Russia Demands Ukraine Withdraw All Troops: Report - Live Updates",
        "description": "Russia is demanding Ukraine withdraw all troops for a ceasefire, a move Kyiv calls unrealistic and far beyond previous discussions. Follow Newsweek's live blog.",
        "content": "Continuous updates; facts and sources are still being cross-checked.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\nTensions remain high at the Istanbul peace talks as a Ukrainian diplomatic source... [14982 chars]",
        "url": "https://www.newsweek.com/russia-ukraine-peace-talks-istanbul-live-updates-2073201",
        "image": "https://d.newsweek.com/en/full/2645995/ukraine-russia-peace-talks.jpg",
        "publishedAt": "2025-05-16T11:25:20Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /russia-ukraine-peace-talks-istanbul-live-updates-2073201 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/russia-ukraine-peace-talks-istanbul-live-updates-2073201"
    },
    {
        "title": "Ukraine ramps up calls for ‘pressure’ on Russia as talks end with no ceasefire",
        "description": "Russia and Ukraine’s first direct talks in three years began Friday with hopes as dim as the gray Istanbul skies.",
        "content": "Istanbul, Turkey CNN —\nRussia and Ukraine’s first direct talks in three years began Friday with hopes as dim as the gray Istanbul skies.\nAnd while the weather brightened as the talks went on, the prospects for peace did not.\nIn the end a large prison... [4145 chars]",
        "url": "https://edition.cnn.com/2025/05/16/europe/ukraine-russia-turkey-talks-ceasefire-hopes-dim-latam-intl",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-05-16-at-11-02-31.jpeg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-16T04:00:00Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "Istanbul, Turkey CNN —\n\nRussia and Ukraine’s first direct talks in three years began Friday with hopes as dim as the gray Istanbul skies.\n\nAnd while the weather brightened as the talks went on, the prospects for peace did not.\n\nIn the end a large prisoner swap (one of many in this war) and two discussion topics for future talks – a meeting between Russian President Vladimir Putin and his Ukrainian counterpart Volodymyr Zelensky, and the contours of a ceasefire – were the only deliverables, as the press pack at Istanbul’s Dolmabahçe Palace thinned out and the sun sank over the Bosphorus.\n\nThe issue of a ceasefire is where the intractable differences are clearest.\n\nRussia, by proposing these talks last weekend, had managed to sidestep an ultimatum from Ukraine and its allies to sign up to an unconditional 30-day ceasefire or face major new sanctions.\n\nUkraine, meanwhile, was “ready to have a ceasefire agreed today,” Ukraine’s foreign ministry spokesman, Heorhii Tykhyi, told reporters in a hastily arranged briefing late Friday afternoon, suggesting this wasn’t achievable because Russia’s low-level delegation “probably has (a) limited mandate.”\n\nYet that is not the only obstacle. Russia’s delegation made clear Friday, a Turkish official told CNN, that an unconditional ceasefire was not on the table, and if Ukraine wanted the guns to fall silent it would have to withdraw from territory Russia does not yet occupy in the four regions (Luhansk, Donetsk, Zaporizhzhia and Kherson) that Russia attempted to illegally annex in 2022.\n\nNot a new demand, but one which is both unacceptable to Kyiv and led US Vice President JD Vance to state earlier this month that Russia was “asking for too much” in its requirements to end the war.\n\nA convoy arrives as Ukrainian and Russian delegates meet for peace talks at the office of the Turkish president in Dolmabahce Palace, Istanbul, on May 16, 2025. Yasin Akgul/AFP/Getty Images\n\nAs the diplomatic cars slipped through Istanbul’s crowded streets, US frustration seemed to mount. After US officials met with both sides soon before their direct talks, US Secretary of State Marco Rubio left Istanbul with a scathing assessment of their prospects.\n\n“We came because we were told that there might be a direct engagement between the Russians and the Ukrainians; that was originally the plan,” he told reporters.\n\n“That was not to be the case, or, if it is, it’s not at the levels we had hoped it would be at.”\n\nAnd so, the Ukrainian side moved quickly to control the narrative.\n\nBarely had the delegations emerged in Istanbul before Zelensky, at a summit in Albania, convened a call with US President Donald Trump and key European allies.\n\n“Ukraine is ready to take the fastest possible steps to bring real peace,” Zelensky wrote on social media after the call. But he also made it clear that it was not just Ukraine that must act, adding “if the Russians reject a full and unconditional ceasefire and an end to killings, tough sanctions must follow.”\n\nUkrainian officials in Istanbul took a similar tone.\n\n“The tentative success of today’s negotiations is still to be consolidated,” First Deputy Foreign Minister Sergiy Kyslytsya told reporters later in the afternoon. “That means that the pressure on the Russian Federation must continue.”\n\nThere was also a clear effort to emphasize the positives. “If we managed to agree on 1,000 for 1,000 exchange we think this was already worth it” said Tykhyi, the foreign ministry spokesman, referring to an agreed prisoner swap. “This is a great achievement by the Ukrainian delegation.”\n\nThe media gather as delegates for the peace talks hosted by Turkey, aimed at ending the war between Russia and Ukraine, enter the Dolmabahçe Office of the Presidency on May 16 in Istanbul. Berkman Ulutin/dia images/Getty Images\n\nYet in a week where Russia has again rejected a ceasefire, ignored calls to send top-level officials to talks, and come to the table with demands that the US has already deemed unacceptable, there is still no sign of increased pressure from the US.\n\nInstead, Trump promised Friday to meet with Putin “as soon as we can set it up,” having previously claimed “nothing’s going to happen (on Ukraine) until Putin and I get together.”\n\nAnd so, the official Russian assessment from its chief negotiator, Vladimir Medinsky, kept it simple. “We are satisfied with the outcome and ready to continue our contacts.”"
    },
    {
        "title": "Russia-Ukraine peace talks downgraded after Moscow sends junior-level delegation",
        "description": "The first direct peace talks between Ukraine and Russian in three years due to get underway in Turkey on Thursday were thrown into doubt in a dispute over the seniority of their respective delegations.",
        "content": "Turkish President Recep Tayyip Erdogan (R) greets Ukrainian President Volodymyr Zelensky in Ankara on Thursday after he arrived in the Turkish capital. Photo courtesy Turkish Presidential Office/EPA-EFE\nMay 15 (UPI) -- The first direct peace talks be... [3796 chars]",
        "url": "https://www.upi.com/Top_News/World-News/2025/05/15/Turkey-Russia-Ukraine-peace-talks-limbo/9071747297474/",
        "image": "https://cdnph.upi.com/sv/ph/og/upi_com/9071747297474/2025/1/a89c2b8829c1be70175a6c6e936bf569/v1.5/Russia-Ukraine-peace-talks-downgraded-after-Moscow-sends-junior-level-delegation.jpg",
        "publishedAt": "2025-05-15T11:33:57Z",
        "source": {
            "name": "UPI News",
            "url": "https://www.upi.com"
        },
        "full_content": "Turkish President Recep Tayyip Erdogan (R) greets Ukrainian President Volodymyr Zelensky in Ankara on Thursday after he arrived in the Turkish capital. Photo courtesy Turkish Presidential Office/EPA-EFE\n\nMay 15 (UPI) -- The first direct peace talks between Russia and Ukraine in three years, due to get underway in Turkey on Thursday, were thrown into doubt after it emerged neither President Vladimir Putin nor President Volodymyr Zelensky would be there.\n\nZelensky said he would only participate if Putin attended, but the Russian team being sent to Istanbul, posted on X at the last minute in the early hours of Thursday, did not include Putin, Foreign Minister Sergei Lavrov or any senior officials.\n\nThe Russian delegation was hand-picked by a Putin-chaired meeting of high-level diplomatic, security and intelligence officials and military brass, including \"all commanders of groups in the special military operation zone [Ukraine],\" the Kremlin said in a follow up news release some hours later.\n\nSpeaking on arrival at Ankara for talks with Turkish President Recep Tayyip Erdogan, Zelensky accused Russia of sending \"stand-in props,\" prompting Moscow to lash out, calling Zelensky a \"clown and a loser talking about respectable people [the Russian delegation].\"\n\nHowever, Kyiv also appeared to be taking a cagey approach.\n\nIn a post on X on Wednesday evening, Zelensky said he was still consulting with his senior officials and advisers regarding the team he should dispatch to Turkey, but expressed the hope U.S. President Donald Trump might divert to Istanbul from his Middle East tour as he has twice hinted at doing.\n\n\"I am waiting to see who will come from Russia, and then I will decide which steps Ukraine should take. So far, the signals from them in the media are unconvincing,\" said Zelensky.\n\n\"This week really may change a lot -- but only may. Everything is being decided right now.\"\n\nZelensky's office confirmed in a post on X Thursday that the president was accompanied by what it said was a high-level delegation with authority to \"prepare necessary decisions,\" and contrasted its team with Russia's \"rather low-level one,\" which it said had no clear mandate.\n\nZelensky previously welcomed Putin's offer on Sunday of \"unconditional\" Russia-Ukraine talks but demanded a face-to-face meeting, saying he would be there in person \"waiting for Putin in Turkey on Thursday.\"\n\nA team of U.S. officials, led by U.S. Secretary of State Marco Rubio, already on the ground in Turkey for a meeting of NATO foreign ministers in Antalya, was on standby to travel to Istanbul to mediate in the talks.\n\n\"[President Trump] has been abundantly clear he wants the war to end. He's open to virtually any mechanism that gets us to a just, enduring, and lasting peace, and that's what he wants to see,\" Rubio said in comments Thursday before heading into a meeting with NATO Secretary-General Mark Rutte.\n\n\"We'll see what happens over the next couple of days in that regard, but we want to see progress made. And whatever mechanism is outlined, whatever the process is that needs to happen, I mean, we are open to being constructive and helpful in any way we can to end the conflict.\n\n\"I will say this and I'll repeat it, that there is no military solution to the Russia-Ukraine conflict. This war is going to end not through a military solution but through a diplomatic one, and the sooner an agreement can be reached on ending this war, the less people -- less people will die and the less destruction there will be,\" Rubio added.\n\nThe BBC said the Russian delegation had arrived in Turkey and that Russian sources had told it that the talks would go ahead as planned but in the afternoon. Ukrainian sources said the meeting was postponed until Friday.\n\nHowever, any talks would be a significant step given there have been no direct Russia-Ukraine negotiations since their respective foreign ministers initiated peace talks in Turkey in the very early stages of the war in March 2022.\n\nThose talks petered out after several weeks without any tangible progress."
    },
    {
        "title": "Ukraine-Russia talks to open in Istanbul without Putin, Kremlin confirms",
        "description": "Ukrainian and Russian representatives will meet in Istanbul, Turkey, for their first meeting since the opening weeks of Moscow's invasion.",
        "content": "Ukraine-Russia talks to open in Istanbul without Putin, Kremlin confirms\nUkrainian and Russian representatives will meet in Istanbul, Turkey, on Thursday, for their first meeting since the opening weeks of Moscow's 3-year-old invasion of its neighbor... [7349 chars]",
        "url": "https://abc7.com/post/ukraine-russia-talks-open-istanbul-putin-kremlin-confirms/16423567/",
        "image": "https://cdn.abcotvs.com/dip/images/16423599_051525-cc-ap-putin-img.jpg?w=1600",
        "publishedAt": "2025-05-15T11:31:00Z",
        "source": {
            "name": "KABC-TV",
            "url": "https://abc7.com"
        },
        "full_content": "Trump says Ukraine-Russia peace 'not going to happen' without him meeting with Putin\n\nUkrainian and Russian representatives will meet in Istanbul, Turkey, on Thursday, for their first meeting since the opening weeks of Moscow's 3-year-old invasion of its neighbor.\n\nRussian President Vladimir Putin will not attend Thursday's talks, despite an invitation from Ukrainian President Volodymyr Zelenskyy for a face-to-face meeting between the two leaders. Kremlin spokesperson Dmitry Peskov confirmed to journalists on Thursday that the Russian leader would not be taking part.\n\nPresident Donald Trump cast doubt on the potential for success in comments aboard Air Force One on Thursday, despite having this week repeatedly suggested a breakthrough was possible.\n\n\"Nothing's going to happen until Putin and I get together, okay?\" Trump said, after it became clear the Russian leader would not attend the talks in Istanbul.\n\n\"And obviously he wasn't going to go,\" Trump added. \"He was going to go, but he thought I was going to go. He wasn't going if I wasn't there. And I don't believe anything's going to happen, whether you like it or not, until he and I get together, but we're going to have to get it solved, because too many people are dying.\"\n\nThe return to Istanbul is symbolic, the historic Turkish city having played host to arguably the most successful bursts of diplomacy in three years of devastating warfare.\n\nIt was there in March 2022 that Ukrainian and Russian negotiators produced the Istanbul Communiqué -- the framework of a possible peace agreement to end Russia's nascent full-scale invasion.\n\nIts tradeoff was essentially one of Ukraine accepting permanent neutrality -- meaning forever abandoning any hope of becoming a member of NATO -- in exchange for ironclad security guarantees.\n\nThe subsequent intensification of the war and emerging evidence of alleged Russian war crimes -- as well as suspicions of sabotage operations against peace talks participants -- fatally undermined those early peace efforts.\n\nLater, Istanbul was also the hub of the Black Sea Grain Initiative that ran from 2022 to 2023, which with the support of Turkey and the United Nations temporarily allowed for the safe export of grain and other agricultural goods from Ukrainian and Russian ports through the Black Sea -- which had by then become a key theater of the fighting -- to the rest of the world.\n\nKremlin aide Vladimir Medinsky -- who led talks in 2022 -- will lead the Russian delegation.\n\nMedinsky will be joined by Deputy Foreign Minister Mikhail Galuzin, Deputy Defense Minister Alexander Fomin and Igor Kostyukov, the head of Russia's military intelligence agency.\n\nZelenskyy and Putin last met in person in France in 2019 for a session of the Normandy Format, a peace forum convened with France and Germany in a bid to end the conflict in eastern Ukraine.\n\nThe fighting there was touched off by Russia's annexation of Crimea and subsequent fomentation of a separatist revolt against Kyiv in the Donbas region. Moscow's 2022 full-scale invasion was a continuation of that initial cross-border aggression, with Russian columns surging out of occupied Crimea, Donetsk and Luhansk to seize more territory.\n\nZelenskyy said at a news conference this week he would not meet any other Russian representative, because \"everything in Russia depends\" on its president.\n\nZelenskyy arrived in the Turkish capital Ankara on Thursday to meet with President Recep Tayyip Erdogan. Once there, he posted to social media confirming Ukraine's \"top-level delegation,\" adding its representatives were \"ready to make any decisions that could lead to a long-awaited just peace.\"\n\n\"I have not yet received official confirmation regarding the Russian level of representation,\" he added. \"But from what we can observe, it appears theatrical. We will decide on our next steps after the conversation with President Erdogan.\"\n\n\"We will have several hours for an important discussion and very important decisions,\" Zelenskyy wrote. \"It is essential to understand the level of the Russian delegation, what mandate they hold, and whether they are authorized to make any decisions at all -- because we all know who actually makes decisions in Russia.\"\n\nPresident Donald Trump -- who since returning to office has been seeking a ceasefire and eventual peace deal -- suggested this week that he hoped for progress at Thursday's talks.\n\n\"I think we're having some pretty good news coming out of there today and maybe tomorrow and maybe Friday,\" Trump said upon arrival in Qatar on Wednesday.\n\nThe president even hinted he might even travel to Istanbul, though did not say whether he expected Putin to do the same.\n\n\"Well I don't know if he's showing up,\" Trump said of his Russian counterpart. \"He would like me to be there, and that's a possibility. If we could end the war, I'd be thinking about that,\" Trump added.\n\nAt a Thursday roundtable in Qatar during the second leg of his ongoing Middle East visit, Trump again floated the idea of traveling to Istanbul.\n\n\"If something happened, I'd go on Friday if it was appropriate,\" the president said. \"But we have people right now negotiating, and I think that I just hope that Russia and Ukraine are able to do something, because it has to stop, not only the money.\"\n\nTrump said he did not expect Putin to attend. \"I actually said, why would he go if I'm not going? Because I wasn't going to go. I wasn't planning to. I would go, but I wasn't planning to go. And I said, I don't think he's going to go if I don't go. And that turned out to be right.\"\n\nThe U.S. delegation to Turkey includes Secretary of State Marco Rubio and senior envoys Steve Witkoff and Keith Kellogg. Speaking at a gathering of NATO foreign ministers in Ankara on Thursday, Rubio said of his hopes for the upcoming Ukraine-Russia talks, \"We'll see what happens over the next couple of days.\"\n\n\"I will say this, and I'll repeat it, that there is no military solution to the Russia-Ukraine conflict, Rubio continued. \"This war is going to end not through a military solution, but through a diplomatic one, and the sooner an agreement can be reached on ending this war, the less people, less people will die and the less destruction there will be.\"\n\nTrump, Rubio said, \"is interested in building things, not destroying. He wants economies and countries focused on building things, making things, providing opportunity and prosperity for its people, and he's against all the things that keep that from happening, like wars, like terrorism and all the instability that comes with that.\"\n\nPutin proposed the talks last weekend, in response to Ukraine's demand -- backed by the leaders of France, Germany, the U.K. and Poland during a joint visit to Kyiv -- for a full 30-day ceasefire during which time peace talks could proceed. Trump agreed to the plan by phone, the European leaders said.\n\nBut Trump then also backed Putin's offer to restart the talks that collapsed in 2022. Trump even publicly pressed Zelenskyy to \"immediately\" agree to the meeting.\n\nDespite the significance of renewed direct Ukraine-Russia talks, Oleg Ignatov -- the International Crisis Group's senior Russia analyst -- told ABC News he had low expectations of an immediate breakthrough.\n\n\"The Russians clearly say that they're interested in keeping military and diplomatic pressure on Ukraine,\" he said. \"They clearly say that there will be long negotiations and Ukraine should be prepared for this.\"\n\nWhile Trump agitates for a deal he can sell as a political win, Kyiv and Moscow are maneuvering to avoid blame for the failure of peace talks -- and dodge Trump's subsequent wrath.\n\nUkrainian Foreign Minister Andrii Sybiha met with Rubio on Wednesday in Istanbul. \"I reaffirmed Ukraine's strong and consistent commitment to President Trump's peace efforts and thanked the United States for its involvement,\" the former wrote om X.\n\n\"We are ready to advance our cooperation in a constructive and mutually beneficial manner,\" he added. \"It is critical that Russia reciprocate Ukraine's constructive steps. So far, it has not. Moscow must understand that rejecting peace comes at a cost.\"\n\nRussian Foreign Ministry spokesperson Maria Zakharova, meanwhile, said during a Thursday morning press briefing that Moscow \"is ready for serious negotiations.\""
    },
    {
        "title": "Estonia warns Russia may use military force to defend its shadow fleet of tankers dodging sanctions",
        "description": "Estonia is warning that Russia appears willing to defend with military force its shadow fleet of aging tankers dodging international sanctions to keep oil revenue flowing.",
        "content": "ANTALYA – Estonia warned on Thursday that Russia appears willing to defend with military force its shadow fleet of aging tankers dodging international sanctions to keep oil revenue and equipment flowing, even through the territorial waters of Europea... [1621 chars]",
        "url": "https://www.clickondetroit.com/news/world/2025/05/15/estonia-warns-russia-may-use-military-force-to-defend-its-shadow-fleet-of-tankers-dodging-sanctions/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/KVCRZESHCRAQNGUVAZ7W66YCDA.jpg?_a=DATAdteAZAA0",
        "publishedAt": "2025-05-15T10:47:13Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "ANTALYA – Estonia warned on Thursday that Russia appears willing to defend with military force its shadow fleet of aging tankers dodging international sanctions to keep oil revenue and equipment flowing, even through the territorial waters of European countries.\n\nEstonian Foreign Minister Margus Tsahkna said that a Russian fighter jet entered NATO airspace in recent days after Estonia’s navy had intercepted a suspected shadow fleet ship in its waters.\n\nRecommended Videos\n\nTsahkna said the navy stopped the ship, the Jaguar, because it was flying no flag and apparently had no insurance. The Russian warplane appeared on the scene while the ship was stopped.\n\n“This fighter jet violated NATO territory, for one minute. This is something very new,” he told reporters at a NATO meeting in Antalya, Turkey. He said that NATO aircraft scrambled to intercept the Russian fighter.\n\n“We need to understand that Russia has officially tied and connected itself to the Russian shadow fleet,” Tsahkna said, and underlined the importance of air patrols over the Baltic Sea, saying that “we need to understand that the situation is really serious.”\n\nThe shadow fleet is made up of aging tankers bought used, often by nontransparent entities with addresses in non-sanctioning countries such as the United Arab Emirates or the Marshall Islands, and flagged in places like Gabon or the Cook Islands.\n\nSome of the vessels are owned by the Russian state Sovcomflot shipping company. Their role is to help Russia’s oil exporters avoid the $60 per barrel price cap imposed by Ukraine’s allies.\n\nThe European Union has been targeting the ships, which sometimes also carry stolen Ukrainian grain, with sanctions. In February, 70 vessels believed to be part of the shadow fleet were added to more than 50 already listed.\n\nEU foreign ministers are expected next week to slap sanctions on dozens more."
    },
    {
        "title": "Putin skips out on the direct Ukraine peace talks that he suggested",
        "description": "The Kremlin confirmed Thursday that Russia's President Putin would skip Moscow's first direct peace negotiations with Ukraine that Putin himself had suggested.",
        "content": "ISTANBUL — Confusion swirled around high-stakes peace talks between Russia and Ukraine called for by Russian President Vladimir Putin Thursday, as the Kremlin confirmed that Putin himself would be skipping the negotiations.\nThe chaos over the start d... [3460 chars]",
        "url": "https://www.nbcnews.com/world/ukraine/putin-trump-zelenskyy-ukraine-russia-peace-turkey-istanbul-ankara-rcna206961",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-PutinRS-5e3e4f.jpg",
        "publishedAt": "2025-05-15T10:41:11Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "full_content": "ISTANBUL — High-stakes peace talks Thursday between Russia and Ukraine that were called for by Vladimir Putin hit speed bumps as the Kremlin confirmed he would be skipping the negotiations and President Donald Trump added that \"nothing\" would happen unless he and his Russian counterpart attended.\n\nUncertainty over the start date, location and whether either side would even participate made for chaotic scenes in the Turkish capital, Ankara, as well as in Antalya and Istanbul — where some 200 journalists and crew were massed outside the Ottoman-era Dolmabahçe Palace with no clear idea of when talks would get underway. The talks were later postponed for Friday.\n\nThe build-up to Thursday's talks had included a back and forth between Kyiv, Moscow and the Trump administration which hinted at the possibility of a three-way meeting involving Trump, Putin and Ukrainian President Volodymyr Zelenskyy. That did not ultimately materialize.\n\nWhile speaking to reporters on Air Force One en route to the United Arab Emirates, Trump was asked about the level of the delegation Russia sent to Turkey.\n\n“Look, nothing’s going to happen until Putin and I get together, OK?” he said, adding that Putin did not lead the delegation because Trump had chosen not to attend. “He wasn’t going if I wasn’t there.”\n\nUkrainian President Volodymyr Zelenskyy arriving in Ankara, Turkey, on Thursday. Evgeniy Maloletka / AP\n\nLater on Thursday, Secretary of State Marco Rubio said that he would meet with the Ukrainian delegation in Istanbul on Friday. Echoing Trump's comments, he reaffirmed that the involvement of both Trump and Putin would be \"the only way we're going to have a breakthrough\" in the war.\n\nRubio said the U.S. will decide on a timeline for a possible meeting between Trump and Putin after the Friday talks, adding that the president is willing to “stick with” the process as long as it takes to achieve peace.\n\nPrior to Rubio's comments, Kremlin spokesperson Dmitry Peskov had told CNN “no,” when asked whether Putin would be attending talks in Turkey, and had separately said at the time that there were “no preparations” for talks between Putin and Trump in the coming days.\n\nPutin made the suggestion for negotiations “without any preconditions” after Ukrainian allies, including Germany, France and Britain presented an ultimatum to Moscow to either accept the ceasefire proposal or face additional sanctions.\n\nThe Russian leader's no-show is expected to further antagonize the White House, which has markedly changed its tone over the war in the past weeks. After his historic Oval Office shouting match with Zelenskyy, Vice President JD Vance has shifted to accusing Moscow of “asking for too much” in the bilateral peace talks senior Trump administration officials have held with Russia in recent weeks.\n\nThat is partly because Trump’s major gripe with Ukraine — that American taxpayers have mostly funded its defense — was soothed after the two nations struck a minerals deal that would go some way to repaying American military aid.\n\nPutin in Moscow on Wednesday. Alexander Kazakov / AFP - Getty Images\n\nZelenskyy has also presented himself as compliant, backing Trump’s calls for an immediate 30-day ceasefire between Ukraine and Russia.\n\nTrump has said he is “always considering” additional sanctions against Russia if he believes Moscow is blocking the peace process, with officials also suggesting secondary sanctions on the buyers of Russian oil.\n\nAfter heeding Trump’s calls to accept Putin’s initial suggestion of talks Sunday, Zelenskyy landed Thursday in Ankara.\n\nBefore a planned meeting with Turkish President Recep Tayyip Erdogan, Zelenskyy said he would meet with a broader Turkish delegation, as well as American diplomats.\n\n“The level of the Russian delegation is not officially known to me yet, but from what we see — it looks like not a serious level,” Zelenskyy said, using a Ukrainian word meaning \"sham\" or \"theatrical.\"\n\n“We must understand the level of the Russian delegation and what mandate they have — whether they are even capable of making any decisions on their own,” he added, “because we all know who actually makes decisions in Russia.”\n\nThat was instead of joining the talks initially planned for Istanbul, after the Kremlin indicated late Wednesday that rather than Putin, or even Foreign Minister Sergei Lavrov, it was instead sending a relatively junior team headed by Kremlin aide Vladimir Medinsky and Deputy Foreign Minister Mikhail Galuzin.\n\nWhile the Kremlin's last-minute naming of a junior team has done little to dispel Ukrainian and European allegations that Putin is not taking Trump's peace-brokering attempts seriously, the Russian delegation that arrived Thursday in Istanbul was “ready for serious work,” the Russian Foreign Ministry's Maria Zakharova said at a news briefing the same day.\n\nUkraine responded to the scaling-down of the talks by vascillating over whether it would even send a delegation to Istanbul, as Kyiv and Moscow appeared to disagree over the start time of talks.\n\nWhile Russian media initially reported a 10 a.m. local time start (3 a.m. ET) at the Dolmabahçe Palace, that shifted to midday and then after 5 p.m, before being postponed to Friday.\n\nFurther illustrating the confusion in Istanbul, American personnel were seen late Thursday morning still appearing to prepare a venue for a U.S. delegation to use as a base, with officials huddled in urgent meetings and two security staff arriving with a German shepherd dog.\n\nKeir Simmons and Natasha Lebedeva reported from Istanbul, and Mithil Aggarwal from Hong Kong."
    },
    {
        "title": "Russian scientist Kseniia Petrova, already facing deportation, charged with smuggling frog embryos into U.S.",
        "description": "Harvard researcher Kseniia Petrova, already facing possible deportation back to Russia, has now been charged with smuggling undeclared biological material into the U.S.",
        "content": "Russian scientist at Harvard detained by ICE at Logan Airport and more top stories\nRussian scientist at Harvard detained by ICE at Logan Airport and more top stories\nRussian scientist at Harvard detained by ICE at Logan Airport and more top stories\nB... [3580 chars]",
        "url": "https://www.cbsnews.com/news/russian-scientist-kseniia-petrova-harvard-charged-smuggling-frog-embryos/",
        "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/15/6cfce639-4abc-4748-80cf-fdb449280d6e/thumbnail/1200x630/2ef9dfe5186629b343ed42a0ef259329/kseniia-petrova-ap25134796297228.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
        "publishedAt": "2025-05-15T09:24:35Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "Russian scientist at Harvard detained by ICE at Logan Airport and more top stories\n\nRussian scientist at Harvard detained by ICE at Logan Airport and more top stories\n\nRussian scientist at Harvard detained by ICE at Logan Airport and more top stories\n\nBoston — A Russian-born scientist and Harvard University researcher, who was already facing deportation back to Russia, was charged Wednesday with trying to smuggle frog embryos into the country. Kseniia Petrova , 30, was sent to a U.S. Immigration and Customs Enforcement facility in Louisiana after her February arrest. She continues to await a judge's decision on whether she will be deported to Russia, where she fears she will be imprisoned or worse. A hearing on her case was held Wednesday in Vermont.\n\nBut in the case's latest twist, federal prosecutors charged her with one count of smuggling goods into the United States. It says she was taken into custody Wednesday. If convicted, Petrova faces a sentence of up to 20 years in prison and a fine of up to $250,000.\n\nA lawyer for Petrova could not be reached for comment. It is unclear if she is being moved from the ICE facility.\n\nAn undated photo provided by Polina Pugacheva in April 2025 shows Kseniia Petrova, a Russian-born scientist who was a researcher at Harvard University. Polina Pugacheva/AP\n\nPetrova had been vacationing in France, where she stopped at a lab specializing in splicing superfine sections of frog embryos and obtained a package of samples to be used for research.\n\nAs she passed through a U.S. Customs and Border Protection checkpoint in Boston Logan International Airport, Petrova was questioned about the samples. Petrova told The Associated Press in an interview last month that she didn't realize the items needed to be declared and was not trying to sneak in anything. After an interrogation, Petrova was told her visa was being cancelled.\n\n\"The truth is on my side,\" said Petrova, who spoke with the AP in a video call from the Louisiana ICE detention center in Monroe.\n\nThe Department of Homeland Security said in a statement on the social platform X that Petrova was detained after \"lying to federal officers about carrying substances into the country.\" They allege messages on her phone \"revealed she planned to smuggle the materials through customs without declaring them.\"\n\nFederal prosecutors said Petrova was stopped by Customs and Border Protection agents after a law enforcement canine alerted them to her checked duffle bag. Upon inspection, the frog embryos were discovered in a foam box. She initially denied carrying any biological material in her checked baggage, prosecutors said, but later acknowledged it.\n\nPetrova's boss and mentor, Leon Peshkin, said in an interview last month that the samples were not in any way dangerous or biohazardous.\n\n\"I don't think she did anything wrong,\" Peshkin told the AP. \"But even if she did, at most she should have gotten a warning or maybe a fine of up to $500.\"\n\nHarvard said in a statement that the university \"continues to monitor the situation.\"\n\nPetrova told the AP that she left her country to avoid conflict or possible political repression. She fled after Russia invaded Ukraine in February 2022, marking the start of a bloody three-year war.\n\n\"If I go back, I am afraid I will be imprisoned because of my political position and my position against war,\" Petrova said.\n\nPetrova's case is being closely watched by the scientific community, with some fearing it could impact recruiting and retaining foreign scientists at U.S. universities.\n\n\"I think that there is a wrong perception that foreign scientists are somehow privileged to be in the United States. I feel it's the opposite,\" Peshkin said. \"Foreign scientists come here with gifts ... they are highly skilled experts who are in demand. They enrich the American scientific community.\""
    },
    {
        "title": "Russia-Ukraine Talks: Trump Keeps Door Open to Turkey Trip",
        "description": "Russia and Ukraine are due to hold direct talks in the Turkish capital of Istanbul about ending Moscow's war with Kyiv.",
        "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\nPresident Donald Trump sa... [3981 chars]",
        "url": "https://www.newsweek.com/trump-russia-ukraine-istanbul-zelensky-putin-turkey-2072552",
        "image": "https://d.newsweek.com/en/full/2644970/us-president-donald-j-trump-doha-qatar.jpg",
        "publishedAt": "2025-05-15T07:38:26Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /trump-russia-ukraine-istanbul-zelensky-putin-turkey-2072552 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/trump-russia-ukraine-istanbul-zelensky-putin-turkey-2072552"
    },
    {
        "title": "Rubio and other top NATO diplomats meet in Turkey ahead of possible Ukraine-Russia talks",
        "description": "U.S. Secretary of State Marco Rubio and his NATO counterparts meet in Turkey to prepare a pivotal summit of alliance leaders next month that will set the course for future European security as America focuses on challenges elsewhere.",
        "content": "Secretary of State Marco Rubio departs a lunch between President Donald Trump and Qatar's Emir Sheikh Tamim bin Hamad Al Thani at the Amiri Diwan in Doha, Qatar, Wednesday, May 14, 2025. (AP Photo/Alex Brandon)\nANTALYA – U.S. Secretary of State Marco... [5557 chars]",
        "url": "https://www.clickondetroit.com/news/world/2025/05/15/rubio-and-other-top-nato-diplomats-meet-in-turkey-ahead-of-possible-ukraine-russia-talks/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/NEJCBO73P5GKBOXAVYNJRTFNQ4.jpg?_a=DATAdteAZAA0",
        "publishedAt": "2025-05-15T02:00:53Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "ANTALYA – NATO foreign ministers on Thursday debated an American demand to massively ramp up defense investment as the United States focuses on security challenges outside of Europe.\n\nAt talks in Antalya, NATO Secretary-General Mark Rutte said more investment and military equipment are needed to deal with threats posed by Russia and terrorism but also by China, which has become the focus of U.S. concern.\n\nRecommended Videos\n\n“When it comes to the core defense spending, we need to do much, much more,” Rutte told reporters. He underlined that once Russia's war in Ukraine is over, Moscow could reconstitute its armed forces within three years to five years.\n\nU.S. Secretary of State Marco Rubio said “the alliance is only as strong as its weakest link.” He insisted that the U.S. demand for allies to invest 5% of their gross domestic product on defense over the next seven years is about “spending money on the capabilities that are needed for the threats of the 21st century.”\n\nThe debate on defense spending is heating up before the summit of President Donald Trump and his NATO counterparts in the Netherlands on June 24-25. That gathering will set the course for future European security, including that of Ukraine.\n\nFurther to that, Russian and Ukrainian delegations plan to hold their first direct peace talks in three years in Istanbul, even as Russian President Vladimir Putin spurned Ukrainian President Volodymyr Zelenskyy’s offer to meet face to face.\n\nRubio said he would confer Friday in Istanbul with Turkish Foreign Minister Hakan Fidan and the Ukrainian delegation. He said the Russian delegation would be meeting with other members of the U.S. team and he hoped all the sides could come together.\n\nIn other diplomacy, Rubio met with Syrian Foreign Minister Asaad al-Shaibani on the sidelines of the NATO meeting, underscoring support for lifting U.S. sanctions and welcoming Syria's “calls for peace with Israel,” the State Department said.\n\nNATO members consider defense spending plan\n\nThe NATO sessions focused on a new spending plan in the works. As Russia’s war on Ukraine entered its second year, NATO leaders agreed in 2023 to spend at least 2% of gross domestic product on national defense budgets. So far, 22 of the 32 member countries have done so.\n\nThe new plan is for all allies to aim for 3.5% of GDP on their defense budgets by 2032, plus an extra 1.5% on potentially defense-related things like infrastructure — roads, bridges, airports and seaports.\n\nWhile the two figures add up to 5%, factoring in infrastructure and cybersecurity would change the basis on which NATO traditionally calculates defense spending. The seven-year time frame is also short by the alliance’s usual standards.\n\nRutte refused to confirm the numbers but acknowledged the importance of including infrastructure.\n\nIt’s difficult to see how many members would reach a new 3.5% goal. Belgium, Canada, Croatia, Italy, Luxembourg, Montenegro, Portugal, Slovenia and Spain are not even spending 2% yet, though Spain expects to reach that goal this year, a year past the deadline.\n\nThe U.S. demand would require investment at an unprecedented scale. But Trump has cast doubt over whether the U.S. would defend allies that spend too little — an incentive to do more, even as European allies realize that they must match the threat posed by Russia.\n\nA push for Europe to ensure its security\n\nEurope-wide, industry leaders and experts have pointed out challenges the continent must overcome to be a truly self-sufficient military power, chiefly its decades-long reliance on the U.S. as well as its fragmented defense industry.\n\n“There is a lot at stake for us,” Lithuanian Foreign Minister Kęstutis Budrys said. He urged NATO partners to meet the investment goals faster than the 2032 target \"because we see the tempo and the speed, how Russia generates its forces now as we speak.”\n\nBritish Foreign Secretary David Lammy said his country should reach 2.5% by 2027, and then 3% by the next U.K. elections planned for 2029.\n\n“It’s hugely important that we recommit to Europe’s defense and that we step up alongside our U.S. partners in this challenging geopolitical moment where there are so many precious across the world, and particularly in the Indo-Pacific,” he said.\n\nAs an organization, NATO plays no direct security role in Asia, and it's unclear what demands the Trump administration might make of the allies as it turns its attention to China. The last NATO security operation outside the Euro-Atlantic area, its 18-year stay in Afghanistan, ended in chaos.\n\nAsked whether the next summit communique will underline that Russia still poses the greatest threat to NATO allies, Rutte said, \"We will see what is the best way to play that.”\n\nQuestions also hang over the way the leaders will frame NATO's commitment to Ukraine. The war has dominated recent summits, with envoys struggling to find language that would further anchor the country to the alliance without actually allowing it to join.\n\nBut this year, Washington has taken Ukraine's membership off the table. Trump has shown impatience with Zelenskyy and remains unclear whether the Ukrainian leader will be invited to the June meeting in The Hague.\n\n___\n\nCook reported from Brussels, and Fraser from Ankara, Turkey."
    },
    {
        "title": "Putin skipping part of delegation heading to Turkey for Ukraine-Russia peace talks, Kremlin says",
        "description": "Russian President Vladimir Putin will not attend a high-stakes meeting in Turkey aimed at finding a way to end the three-year-long war in Ukraine.",
        "content": "Russian President Vladimir Putin will not attend a high-stakes meeting in Turkey aimed at ending the three-year-long war in Ukraine.\nDespite proposing the direct talks in Istanbul, Putin’s name did not appear on a list released by the Kremlin on Wedn... [2270 chars]",
        "url": "https://nypost.com/2025/05/14/us-news/putin-wont-be-part-of-delegation-heading-to-turkey-for-ukraine-russia-peace-talks-kremlin-says/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-t3x70uoc7-1747267209303.jpg?quality=75&strip=all&1747252860&w=1024",
        "publishedAt": "2025-05-15T00:43:48Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "Russian President Vladimir Putin will not attend a high-stakes meeting in Turkey aimed at ending the three-year-long war in Ukraine.\n\nDespite proposing the direct talks in Istanbul, Putin’s name did not appear on a list released by the Kremlin on Wednesday of Russian officials who would be attending the negotiations, according to the BBC.\n\n3 Putin did not appear on the Kremlin’s list of people participating in Thursday’s peace talks in Turkey. Getty Images\n\nUkrainian President Volodymyr Zelensky, who has not had a face-to-face meeting with Putin since 2019, is expected to be in Istanbul for the talks taking place on Thursday.\n\nZelensky will be joined by a high-level US delegation, led by Secretary of State Marco Rubio.\n\nPresident Trump, who is visiting the Middle East, is not expected to attend the meeting, despite floating the possibility that he might earlier this week.\n\nRussia’s delegation will be headed by top Putin aide Vladimir Medinsky, according to the Kremlin.\n\nPutin, who ordered the invasion of Ukraine in February 2022, suggested on Sunday that Ukraine and Russia hold direct talks “without pre-conditions” in Turkey’s largest city.\n\nTrump urged Zelensky to take Putin up on the offer shortly after the proposal was floated.\n\n“Ukraine should agree to this, IMMEDIATELY,” Trump posted on Truth Social Sunday. “At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the U.S., will know where everything stands, and can proceed accordingly!”\n\n“HAVE THE MEETING, NOW!!!.” the president added.\n\nThe same day, Zelensky announced that he would “be waiting for Putin in Türkiye on Thursday. Personally.”\n\n3 Zelensky quickly pledged to attend Thursday’s meeting after Putin proposed direct talks on Sunday. Global Images Ukraine via Getty Images\n\n3 Rubio arrived in Turkey on Wednesday and will lead the US delegation in Thursday’s peace talks. AP\n\nTrump, who pledged on the 2024 campaign trail to quickly end the bloodiest conflict in Europe since World War II, is optimistic about the meeting.\n\n“I think we’re having some pretty good news coming out of there today and maybe tomorrow and maybe Friday, frankly,” he said in Qatar on Wednesday. “But we’ll see about that.”\n\nTrump added that if a peace agreement is not reached, secondary sanctions could be imposed against Russia.\n\n“As you know, I put secondary sanctions on Iran again, and hopefully they’re going to make the right decision, because something’s going to happen one way or the other,” he said."
    },
    {
        "title": "If Russia won’t go for peace, US must boost Ukraine aid",
        "description": "Talks between Moscow and Kyiv will test whether Vladimir Putin is serious about a cease-fire deal, as they'll also test President Donald Trump’s approach to the conflict.",
        "content": "Thursday’s talks in Turkey between Moscow and Kyiv will serve as the latest test of whether Vladimir Putin is serious about a cease-fire deal.\nAnd if Putin fails, President Donald Trump faces a test of his own.\nThe prez expressed optimism that “some ... [1272 chars]",
        "url": "https://nypost.com/2025/05/14/opinion/if-cease-fire-talks-fail-trump-needs-to-boost-ukraine-aid-and-hit-russia-with-sanctions/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/DMELDME.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2025-05-14T23:55:22Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "Thursday’s talks in Turkey between Moscow and Kyiv will serve as the latest test of whether Vladimir Putin is serious about a cease-fire deal.\n\nAnd if Putin fails, President Donald Trump faces a test of his own.\n\nThe prez expressed optimism that “some pretty good news” will emerge from the negotiations.\n\nYet Moscow has feigned an interest in peace before, only to show its real stripes.\n\nRemember, Putin was the one who started this war and who’s broken past cease-fire terms.\n\nAs long as he believes he can gain some advantage, he’ll keep up his attacks — no matter what he “agrees” to.\n\nSo it’s good Trump is threatening secondary sanctions on Moscow if no accord is reached.\n\nRussia’s economy is already precarious, and it would suffer serious hurt from serious additional blows.\n\nBut getting Putin to accept any realistic peace agreement will likely also require Trump and the West to boost aid to Kyiv — particularly military aid: weapons and equipment that can make a difference on the ground.\n\nRussia’s been seeing “significant” and increasing troop losses per square mile of territory gained, reports the Institute for the Study of War. But it’s poised to more than replace those troops.\n\nUkraine badly needs to raise Russia’s costs on the battlefield, if not halt (or even roll back) its recent advances.\n\nThe best news: Trump increasingly seems to realize that Putin, not Volodymyr Zelensky, is the chief obstacle to peace.\n\nIf he truly wants to end the war soon, he’ll need to tighten all the screws on Vlad — to the max."
    },
    {
        "title": "Harvard researcher charged with trying to smuggle frog embryos into United States",
        "description": "BOSTON (AP) — A Russian-born scientist and Harvard University researcher, who was already facing deportation back to Russia, was charged Wednesday with trying to smuggle frog",
        "content": "Crime Harvard researcher charged with trying to smuggle frog embryos into United States The Department of Homeland Security said in a statement on the social platform X that Kseniia Petrova was detained after “lying to federal officers about carrying... [3665 chars]",
        "url": "https://www.boston.com/news/crime/2025/05/14/harvard-researcher-petrova-charged-with-trying-to-smuggle-frog-embryos-into-united-states/",
        "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/Immigration-Harvard_Researcher_67394-6825244b49143-768x432.jpg",
        "publishedAt": "2025-05-14T23:21:58Z",
        "source": {
            "name": "Boston.com",
            "url": "https://www.boston.com"
        },
        "full_content": "Crime Harvard researcher charged with trying to smuggle frog embryos into United States The Department of Homeland Security said in a statement on the social platform X that Kseniia Petrova was detained after “lying to federal officers about carrying substances into the country.” This undated photo provided by Polina Pugacheva in April 2025 shows Kseniia Petrova, a Russian-born scientist who was a researcher at Harvard University. Polina Pugacheva via AP\n\nBOSTON (AP) — A Russian-born scientist and Harvard University researcher, who was already facing deportation back to Russia, was charged Wednesday with trying to smuggle frog embryos into the country.\n\nKseniia Petrova, 30, was sent to a U.S. Immigration and Customs Enforcement facility in Louisiana after her February arrest. She continues to await a judge’s decision on whether she will be deported to Russia, where she fears she will be imprisoned or worse. A hearing on her case was held Wednesday in Vermont.\n\nBut in the case’s latest twist, federal prosecutors charged her with one count of smuggling goods into the United States. It says she was taken into custody Wednesday. If convicted, Petrova faces a sentence of up to 20 years in prison and a fine of up to $250,000.\n\nAdvertisement:\n\nA lawyer for Petrova could not be reached for comment. It is unclear if she is being moved from the ICE facility.\n\nPetrova had been vacationing in France, where she stopped at a lab specializing in splicing superfine sections of frog embryos and obtained a package of samples to be used for research.\n\nAs she passed through a U.S. Customs and Border Protection checkpoint in Boston Logan International Airport, Petrova was questioned about the samples. Petrova told The Associated Press in an interview last month that she didn’t realize the items needed to be declared and was not trying to sneak in anything. After an interrogation, Petrova was told her visa was being cancelled.\n\nAdvertisement:\n\n“The truth is on my side,” said Petrova, who spoke with the AP in a video call from the Louisiana ICE detention center in Monroe.\n\nThe Department of Homeland Security said in a statement on the social platform X that Petrova was detained after “lying to federal officers about carrying substances into the country.” They allege messages on her phone “revealed she planned to smuggle the materials through customs without declaring them.”\n\nFederal prosecutors said Petrova was stopped by Customs and Border Protection agents after a law enforcement canine alerted them to her checked duffle bag. Upon inspection, the frog embryos were discovered in a foam box. She initially denied carrying any biological material in her checked baggage, prosecutors said, but later acknowledged it.\n\nPetrova’s boss and mentor, Leon Peshkin, said in an interview last month that the samples were not in any way dangerous or biohazardous.\n\n“I don’t think she did anything wrong,” Peshkin told the AP. “But even if she did, at most she should have gotten a warning or maybe a fine of up to $500.”\n\nHarvard said in a statement that the university “continues to monitor the situation.”\n\nPetrova told the AP that she left her country to avoid conflict or possible political repression. She fled after Russia invaded Ukraine in February 2022, marking the start of a bloody three-year war.\n\nAdvertisement:\n\n“If I go back, I am afraid I will be imprisoned because of my political position and my position against war,” Petrova said.\n\nPetrova’s case is being closely watched by the scientific community, with some fearing it could impact recruiting and retaining foreign scientists at U.S. universities.\n\n“I think that there is a wrong perception that foreign scientists are somehow privileged to be in the United States. I feel it’s the opposite,” Peshkin said. “Foreign scientists come here with gifts … they are highly skilled experts who are in demand. They enrich the American scientific community.”"
    },
    {
        "title": "Russia Could Be Ready to Strike NATO in Two Years, New Report Says",
        "description": "NATO's eastern flank has grown increasingly nervous that Moscow's forces could quickly rebuild after a ceasefire in Ukraine.",
        "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\nRussia could be ready to ... [6231 chars]",
        "url": "https://www.newsweek.com/russia-strike-nato-two-years-us-europe-ceasefire-agreement-2069537",
        "image": "https://d.newsweek.com/en/full/2643574/russias-president-vladimir-putin.jpg",
        "publishedAt": "2025-05-14T23:00:01Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /russia-strike-nato-two-years-us-europe-ceasefire-agreement-2069537 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/russia-strike-nato-two-years-us-europe-ceasefire-agreement-2069537"
    },
    {
        "title": "Severe wildfires in Russia’s Siberia region rage through 600,000 hectares of forest",
        "description": "Since the beginning of this year, more than 1.4 million hectares of land have been affected by wildfires in Russia.",
        "content": "CNN —\nSevere wildfires raging in a Siberian region of Russia have engulfed more than 600,000 hectares of forest, local authorities have warned.\nIn the Eastern Siberian territory of Zabaykalsky Krai, a federal-level state of emergencies has been in pl... [1899 chars]",
        "url": "https://edition.cnn.com/2025/05/14/europe/russia-wildfires-rage-siberia-region-intl-latam",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214985054.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-14T19:30:55Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nSevere wildfires raging in a Siberian region of Russia have engulfed more than 600,000 hectares of forest, local authorities have warned.\n\nIn the Eastern Siberian territory of Zabaykalsky Krai, a federal-level state of emergencies has been in place since late April, Russian state news agency TASS reported.\n\nDespite huge efforts to tackle wildfire outbreaks in the region, which borders Mongolia, 49 forest fires continue to burn, with a total area exceeding 629,000 hectares, the Russian Ministry of Emergency Situations said Wednesday.\n\nSince the beginning of this year, more than 1.4 million hectares of land have been affected by wildfires, according to figures from Russia’s Federal Agency for Forestry published on Tuesday, about three times the total area affected by fires in the United States and Canada so far this year combined.\n\nSmoke from the fires is seen spreading for hundreds of miles, and forecasts from Copernicus, Europe’s climate change service, show the smoke reaching as far as Beijing and the Korean Peninsula by this weekend.\n\nStates of emergency have been declared across Russia’s far east Siberian regions since April in response to the wildfires.\n\nOn Tuesday, the Russian republic of Buryatia declared a regional-level state of emergency on Tuesday and closed all access to the forests, state news agency RIA Novosti reported.\n\nSince mid-March, 174 forest fires have blazed in Buryatia, which also borders Mongolia, the region’s forestry agency said according to RIA Novosti. Of those fires, 90% were caused by careless human activity, the agency said.\n\nMore than 530 firefighting personnel have been deployed to tackle the blazes, with 22 active fires in the Buryatia region as of Tuesday.\n\nRussia’s wildfire season started earlier than usual this year, with fires recorded as early as mid-March, compared to May in previous years.\n\nDryer, hotter weather in Russia, exacerbated by climate change, create tinder box conditions that can cause a small fire to spread rapidly.\n\nAcross Russia, more than 2,100 forest fires have been recorded this year, official data from Russia’s Federal Aerial Forest Protection Service showed."
    },
    {
        "title": "White House officials say Trump won’t attend Ukraine-Russia talks, ending speculation sparked by president’s remarks",
        "description": "For days, President Donald Trump repeatedly floated the possibility of scrapping his Middle East travel schedule — one his team meticulously crafted for weeks — and adding a stop to personally mediate Ukraine-Russia peace talks in Turkey.",
        "content": "Doha, Qatar CNN —\nNo, President Donald Trump is not going to Turkey to personally mediate Ukraine-Russia peace talks.\nFor days, Trump repeatedly stirred speculation that he might upend his Middle East travel schedule – one his team meticulously craft... [2360 chars]",
        "url": "https://edition.cnn.com/2025/05/14/politics/trump-turkey-ukraine-russia-putin",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2214401253.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2025-05-14T16:08:05Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "Doha, Qatar CNN —\n\nNo, President Donald Trump is not going to Turkey to personally mediate Ukraine-Russia peace talks.\n\nFor days, Trump repeatedly stirred speculation that he might upend his Middle East travel schedule – one his team meticulously crafted for weeks — to join the Russians and Ukrainians at the negotiating table. He told reporters on Wednesday that Russian President Vladimir Putin would “like me to be there.”\n\nBut shortly after the Kremlin released a list of their delegation attending the talks – signaling for the first time Putin would not be on hand – two White House officials told CNN that Trump would also not be attending.\n\nWhether it was an effort to save face – or simply accepting the reality that Trump’s participation was always a lofty goal – the timing of both announcements signaled another chapter in the Trump-Putin relationship.\n\nChanging Trump’s travel schedule at this point in his three-country trip to the Middle East would have been a logistical nightmare, officials said, never mind a major diplomatic challenge to prepare the president for such high-stakes talks in such short order.\n\nYet that didn’t stop Trump from continuing to drop hints that he might attend.\n\nThe former reality TV star seemed to be purposely injecting a “will he or won’t he” dynamic, one that kept his supporters and even some of his closest aides and allies guessing.\n\nPutin would “like me to be there, and that’s a possibility. That doesn’t mean I wouldn’t do it to save a lot of lives and come back,” Trump said in response to a question from CNN’s Kaitlan Collins aboard Air Force One Wednesday.\n\nHe continued, “I don’t know that he would be there if I’m not there.”\n\nYet even as Trump toyed with going, Putin had not yet agreed to attend the talks despite proposing it himself. And Ukraine President Volodymyr Zelensky said he wouldn’t hold talks with any Russian representative other than Putin himself.\n\nAsked about Putin’s strategy and whether he still feels that the Russian leader is “tapping him along,” as he suggested in a previous post to social media, Trump told reporters he would let them know in a few days.\n\nTrump first said on Monday that he was considering flying in to Turkey for the peace talks: “There’s a possibility of it, I guess, if I think things can happen.”\n\nTrump is currently scheduled to be in Doha, Qatar, and Abu Dhabi, United Arab Emirates, on Thursday, before flying back to Washington on Friday, as the diminished peace talks get underway in Turkey.\n\nThis story and headline have been updated with additional details.\n\nCNN’s Caitlin Danaher contributed to this report."
    }
]