[
    {
        "title": "Will Trump’s tariff threats protect the dollar’s dominance?",
        "description": "Brics nations’ plan to create rival to greenback is bound to fail even without president-elect’s measures",
        "content": "In 2023, the leaders of Brazil and the other Brics countries at the time – China, India, Russia, and South Africa – discussed collaboration on a new shared currency. The Brazilian president, Luiz Inácio Lula da Silva, has been a vocal proponent of an... [6307 chars]",
        "url": "https://www.theguardian.com/business/2024/dec/24/will-trumps-tariff-threats-against-brics-nations-backfire",
        "image": "https://i.guim.co.uk/img/media/c5cc051a9951af3695c6c480404d23a4bd2deea9/0_62_2255_1353/master/2255.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=c3b5e6365596e11a753183536759bbef",
        "publishedAt": "2024-12-24T11:59:38Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "In 2023, the leaders of Brazil and the other Brics countries at the time – China, India, Russia, and South Africa – discussed collaboration on a new shared currency. The Brazilian president, Luiz Inácio Lula da Silva, has been a vocal proponent of an alternative to the US dollar, the dominant global currency for the past 75 years, and the Russian president, Vladimir Putin, publicly promoted the idea during the Brics summit in October by brandishing a symbolic Brics banknote. The bloc’s new members – Egypt, Ethiopia, Iran, and the United Arab Emirates – would presumably also be included in the new joint currency.\n\nThe proposed challenge to the dollar has already drawn the ire of the US president-elect, Donald Trump, who has threatened to impose punitive tariffs of 100% on countries that move away from the greenback. At the end of last month, Trump warned Brics countries against creating or supporting an alternative reserve currency. “We require a commitment from these countries that they will neither create a new Brics currency nor back any other currency to replace the mighty US dollar, or they will face 100% tariffs,” he declared on Truth Social, his social media platform.\n\nThis ultimatum follows Trump’s threats to impose a 25% tariff on Mexico and Canada if they fail to curb fentanyl smuggling into the USs, a 60% tariff on Chinese goods, and a 10-20% tariff on other trade partners. Despite Trump’s bluster, these increasingly extreme threats will not result in one of his self-proclaimed successful “deals”.\n\nWhile Trump’s rhetoric suggests he views a Brics currency as a serious threat, such a project is likely to fail anyway, regardless of his actions or ultimatums.\n\nIf the proposed currency is intended to exist alongside Brics countries’ national currencies, it will not gain traction. A successful international currency requires a home base. That is why English, not Esperanto, became the world’s lingua franca, and why the special drawing right (SDR) – the International Monetary Fund’s reserve asset, whose value is based on a basket of major currencies – has not been successful as an international currency.\n\nFor a Brics unit to compete with the US dollar, then, member countries would need to form a fully fledged monetary union, relinquishing their national currencies and establishing a unified central bank to oversee the new money.\n\nBut the Brics economies differ too much from each other for a monetary union to function effectively. Successful monetary unions are typically formed by small, interconnected economies that trade extensively with one another and share common goals, cultural ties, correlated business cycles and relatively integrated labour markets.\n\nWhen member economies are too dissimilar, one may enter a recession while another overheats. In a monetary union, member states must give up control over their money supply, interest rates, and the exchange rate, limiting their ability to respond to cyclical economic fluctuations. In the absence of alternative adjustment mechanisms such as increased labour mobility and a strong political commitment, these disparities can lead to significant discord and needless macroeconomic instability.\n\nExamples of successful monetary unions include the CFA franc zones, comprising West African and Central African states that use a common currency pegged to the euro, and the Eastern Caribbean Currency Union, which consists of English-speaking islands such as Anguilla, Antigua, and Barbuda. These unions work because their members are small neighbouring countries that share cultural and historical roots. The largest member of the CFA, for example, is Ivory Coast, whose GDP is smaller than that of Buffalo, New York.\n\nThe notable exception, of course, is the eurozone. But although it consists of relatively large economies, its 20 members also share borders, maintain integrated economies, and are bound by a shared commitment to the vision of a peaceful, unified Europe. Even so, European countries such as the UK, Sweden, and Norway have chosen to remain outside the eurozone, and peripheral members such as Greece have struggled to adapt to the constraints of the euro’s monetary straitjacket.\n\nSome regional blocs have long discussed adopting a common currency but made little progress. In 2001, the six-member Gulf Cooperation Council (GCC) announced plans to establish a currency union by 2010, but the plan failed to materialise. If even the small, culturally aligned, and cyclically correlated GCC countries have been unwilling to relinquish their monetary sovereignty, the proposed Brics currency stands little chance.\n\nMany of the Brics+ countries are large. They span four continents. They speak different languages. And their borders have historically been sources of conflict rather than economic integration. China and India, for example, were locked in a protracted military standoff along their shared Himalayan border before reaching a fragile truce in October.\n\nThere is also little correlation among the Brics economies’ business cycles. Rising world energy prices benefit oil-producing countries such as Russia, Brazil, Iran, and the UAE, while putting pressure on energy-importing countries such as China and India. This dynamic makes the Brics far less suited for a monetary union than the GCC countries.\n\nTo be sure, a gradual global shift away from the dollar is already under way. This process, while slow, has gained momentum in recent years, driven partly by America’s increasingly frequent use of financial sanctions. But if the Trump administration were to retaliate against the Brics with 100% tariffs, the move could backfire, prompting central banks to turn to the yuan, smaller currencies, or even gold for their international reserves.\n\nTrump’s clumsy efforts to enforce the international use of the dollar are at odds with his other stated objectives, such as improving the US trade balance by devaluing the dollar against the yuan and the currencies of other countries that run bilateral surpluses with the US. Talking down the dollar aligns with other inflationary Trump promises, such as his threats to weaken the Federal Reserve’s independence and his proposed mass deportations. But an international reserve currency that is prone to inflation and depreciation is hardly attractive. Trump’s tariff threats won’t resolve that contradiction.\n\nJeffrey Frankel is a professor of capital formation and growth at Harvard University. He served as a member of President Bill Clinton’s Council of Economic Advisers.\n\n© Project Syndicate"
    },
    {
        "title": "Trump threat of 100% tariffs against Brics nations raises trade war fears",
        "description": "US president-elect threatens retaliation if emerging economies create new currency to rival US dollar",
        "content": "Fears of a global trade war have risen after Donald Trump threatened to impose 100% tariffs on countries in the Brics group if they create a new currency to rival the US dollar.\nWriting on his social media platform, Truth Social, on Saturday, Trump d... [2717 chars]",
        "url": "https://www.theguardian.com/business/2024/dec/01/trump-threat-100-per-cent-tariffs-brics-nations-dollar",
        "image": "https://i.guim.co.uk/img/media/6c9319fec8a8a62e0f1ce0e612a8097ae9bf3b35/34_0_1911_1147/master/1911.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=81d764d793ae7f202353c8770c828de1",
        "publishedAt": "2024-12-01T14:50:25Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Fears of a global trade war have risen after Donald Trump threatened to impose 100% tariffs on countries in the Brics group if they create a new currency to rival the US dollar.\n\nWriting on his social media platform, Truth Social, on Saturday, Trump declared that he would also act if they supported another currency to replace the dollar.\n\n“We require a commitment from these countries that they will neither create a new Brics currency nor back any other currency to replace the mighty US dollar or they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US economy,” Trump said.\n\n“They can go find another sucker. There is no chance that the Brics will replace the US dollar in international trade, and any country that tries should wave goodbye to America,” he added.\n\nThe warning came less than a week after Trump declared he would impose tariffs on Canada, Mexico and China once he was inaugurated as president.\n\nThe Brics group was originally made up of Brazil, Russia, India, China and South Africa and has been joined by Egypt, the United Arab Emirates, Ethiopia and Iran.\n\nSome Brics members have shown interest in de-dollarising the world economy. In October, Vladimir Putin called for an alternative international payments system that could prevent the US from using the dollar as a political weapon. Others, though, fear the consequences of severing relations with the US and other western countries by breaking away from the dollar, which underpins world finance.\n\nA 100% tariff at the US border, if implemented, would drive up sharply the cost of goods from Brics members, fuelling US inflation and destabilising global trade flows.\n\nStephen Innes, a managing partner at SPI Asset Management, said Trump had laid down the gauntlet with a “blistering proposal” of a 100% tariff.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“Trump’s recent electoral triumph was heavily fortified by his promise to impose harsh tariffs on foreign imports to the US, advocating for an aggressive 60% tariff on Chinese goods,” he said.\n\n“This hardline approach on trade reflects Trump’s broader ‘America First’ economic policy, which aims to recalibrate global trade dynamics and reinforce US economic sovereignty. As the world watches, the potential for a global trade upheaval looms, setting the stage for a contentious start to Trump’s administration.”"
    },
    {
        "title": "Trump or Harris? Whoever wins will face a shift in power in the global economy",
        "description": "West’s dominance is being challenged, with Brics summit showing emerging markets are unwilling to bow to pressure",
        "content": "It is November 1992 and the US is at the height of its power. Communism has been defeated. The Berlin Wall has been demolished. The Soviet Union has broken up and Russia is being used as the laboratory mouse for free-market shock treatment. Liberalis... [6153 chars]",
        "url": "https://www.theguardian.com/business/2024/nov/03/trump-or-harris-whoever-wins-will-face-a-shift-in-power-in-the-global-economy",
        "image": "https://i.guim.co.uk/img/media/4a1d523461e650ab10f9a828b61d55627952f91d/10_92_2979_1789/master/2979.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=d1eb775056bd7c424c0c05e2ef5c0331",
        "publishedAt": "2024-11-03T11:36:27Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "It is November 1992 and the US is at the height of its power. Communism has been defeated. The Berlin Wall has been demolished. The Soviet Union has broken up and Russia is being used as the laboratory mouse for free-market shock treatment. Liberalisation of the Chinese economy offers the opportunity for US multinationals to outsource production. An era of American-dominated globalisation has dawned.\n\nTwo liberal internationalists – George HW Bush and Bill Clinton – are battling for the presidency. In the end, Clinton defeats Bush, the sitting Republican president, because the protectionist Ross Perot takes more votes from the Republicans than he does from the Democrats.\n\nMuch has changed in the 32 years since Clinton became the first baby boomer to enter the White House. As Americans prepare to go to the polls on Tuesday, they do so in the knowledge that their country is still the world’s largest economy and strongest military power. But its supremacy is no longer unchallenged and the unipolar new world order that Bush boasted of in 1991 at the end of the first Gulf War has collapsed.\n\nIn the 1990s, there was talk of a state-free world where money, goods and people would move freely without hindrance. Controls on capital were removed. Independent central banks set interest rates. The World Trade Organization would break down trade barriers and police the global trading system.\n\nBut things quickly started to go wrong and the neoliberal utopia never materialised. Free movement of capital coupled with only the scantiest of regulation led to a series of localised meltdowns that eventually went global in the banking crisis of 2008. China became a much bigger and powerful economy than the US had envisaged. The WTO proved incapable of negotiating new trade deals. Voters expressed anger at slow growth, deindustrialisation and mass migration. The Covid pandemic exposed the fragility of global supply chains. The nation state made a comeback, along with activist industrial policies and protectionism. Bush’s vision of the world marching in step to the US’s tune lasted no more than a decade.\n\nLast month’s Brics summit, hosted by Vladimir Putin, was a sign of the times. Originally a group of five countries – Brazil, Russia, India, China and South Africa – the meeting in Kazan welcomed four new members in Egypt, Ethiopia, Iran and the United Arab Emirates. At least another couple of dozen countries – including Saudi Arabia, Turkey and Indonesia – showed up as observers and are interested in joining the club.\n\nPutin’s interest in an expanded Brics is easy to understand; it sends out a message that – despite sanctions imposed and tightened since its invasion of Ukraine two and a half years ago – Russia is not isolated.\n\nFor now, Putin’s ambition of creating a Brics currency as a rival to the US dollar has no real chance of coming to anything. The dollar is stable and easily convertible: it is under no immediate threat. Nor are countries such as India, Brazil and South Africa willing to sever relations with the US and other western countries but instead want to keep a foot in both camps.\n\nHowever, Kazan was still important for three reasons. First, it demonstrated that sanctions have not led to the collapse of the Russian economy – and probably never will. China and India are willing customers for Putin’s oil, while the domestic Russian economy has also proved to be resilient. Hard though it might be for western governments to acknowledge, Russia can keep fighting for a long time, and is winning the war.\n\nThe second thing Kazan has demonstrated is that the bigger emerging market economies are unwilling to bow to western pressure. That applies not only to Russia but also to China, which fears being locked out of western markets by tariffs and other trade restrictions.\n\nIf Donald Trump wins on Tuesday, he has pledged to impose a 60% tariff on all Chinese imports into the US – a considerable blow given that in 2022 China ran a $400bn (£310bn) trade surplus with the US. Yet the Democrats have taken a tough line with China, too.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nKamala Harris would stick to the less draconian but still robust approach taken by Joe Biden during his presidency, which has included 100% tariffs on Chinese electric vehicles, investment bans and sanctions against technology companies.\n\nDespite attempts to rebalance its growth model towards domestic consumption, China remains an export-dependent economy. It needs to find markets for the goods being turned out by its factories, and while the Brics members are no substitute for the much richer countries of North America and Europe, they include the more important middle-income nations.\n\nThe final reason Kazan was important was that it demonstrated the growing influence and impatience of the global south, which accounts for a majority of the world’s population and an ever-growing share of the global economy. The combined GDP of the G7 nations – the US, Japan, Germany, the UK, France, Italy and Canada – has fallen from 67% in 1994 to 44% in 2022, while China’s has quadrupled to 20% over the same period.\n\nThe new world order was supposed to produce prosperity for all but failed to achieve that. According to the World Bank, progress in the fight against global poverty has stalled as a result of wars, rising debt, the pandemic and climate change. Rich countries are incapable or unwilling to respond to this polycrisis. The G7 and the west more generally act as if they are still as powerful as they were in 1944 when the World Bank and the International Monetary Fund were created by the Bretton Woods conference.\n\nBut this is now a different global economy. No matter who wins the White House race, the west’s dominance is being challenged as it hasn’t been for the past 500 years."
    },
    {
        "title": "Ukraine war briefing: Navalny widow blasts UN chief Guterres for meeting ‘murderer’ Putin",
        "description": "Secretary general calls for ‘just peace’ in Ukraine at Brics summit; Putin not denying North Korean troops brought into war. What we know on day 975",
        "content": "The Russian opposition figure Yulia Navalnaya has slammed the UN secretary general, António Guterres, for meeting Vladimir Putin. “It was the third year of the war, and the UN secretary general was shaking hands with a murderer ,” Navalnaya said on X... [4622 chars]",
        "url": "https://www.theguardian.com/world/2024/oct/25/ukraine-war-briefing-navalny-widow-blasts-un-chief-guterres-for-meeting-murderer-putin",
        "image": "https://i.guim.co.uk/img/media/f0057a6842cfa43d136008f184e89ce03fef2a0c/0_0_5733_3440/master/5733.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=960be123e64d43f3cfb418d9c09b0f25",
        "publishedAt": "2024-10-24T23:41:54Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The Russian opposition figure Yulia Navalnaya has slammed the UN secretary general, António Guterres, for meeting Vladimir Putin. “It was the third year of the war, and the UN secretary general was shaking hands with a murderer ,” Navalnaya said on X, posting a photo of Putin greeting Guterres. Navalnaya is the widow of Alexei Navalny , the Russian opposition figurehead who died as a Russian political prisoner in February.\n\nGuterres told the Russian president on Thursday that “the Russian invasion of Ukraine was in violation of the United Nations charter and international law” a readout from the UN chief’s spokesperson said after their meeting on the sidelines of the Brics summit in Kazan, Russia. Guterres called on Thursday for a “just peace” in Ukraine.\n\nMoscow was ready to consider any options to end the conflict in Ukraine but only proceeding from “reality on the ground”, and was “not ready for anything else”, Putin said on Thursday. He accused the west of using Ukraine to “create critical threats to Russia’s security”.\n\nPutin made no denial of North Korean troops being brought into the war as he spoke on Thursday about defence ties with Kim Jong-un’s regime, writes Patrick Wintour, the Guardian’s diplomatic editor. Asked by a reporter about satellite imagery showing North Korean troop movements, Putin said: “Images are a serious thing. If there are images, then they reflect something.” The US and South Korea have said North Korean troops have reached Ukraine, while Ukraine’s military intelligence service said on Thursday that the first of them had been deployed in Russia’s Kursk region which has been counter-invaded by the Ukrainians.\n\nRussian attacks on eastern Ukraine killed at least six people and wounded 10 on Thursday, regional authorities said. A thermobaric bomb hit the town of Kupiansk in the Kharkiv region, wounding 10 people, said the regional governor, Oleh Syniehubov. One woman died later in hospital. “The enemy struck near a shop and the town market,” Syniehubov said. Russian shelling later in the day killed three people around Pokrovsk in the eastern Donetsk region, said the governor, Vadym Filashkin, adding later that a Russian strike on a branch of the Nova Poshta delivery service killed two people in Oleksiyevo-Druzhkiva, near the frontline towns of Chasiv Yar and Kostyantynivka.\n\nRussian media and war bloggers reported on Thursday that Russian forces had advanced into the coal mining town of Selydove, about 20km (12 miles) south-east of Pokrovsk. Ukraine’s military general staff said that currently the most intense Russian assaults along the frontline were taking place on the Pokrovsk front, including near Selydove.\n\nThe international criminal court reported Mongolia to its oversight organisation on Thursday for failing to arrest Vladimir Putin when he visited in September. The ICC has an arrest warrant out for Putin related to the Ukraine war, but instead of arresting the Russian ruler as required by its membership of the ICC, Mongolia rolled out the red carpet. “In view of the seriousness of Mongolia’s failure to cooperate with the court, the chamber deemed it necessary to refer the matter to the assembly of states parties,” the court said, referring to its oversight body that meets in December in The Hague. The organisation, made up of all 124 of the court’s member states, can “take any measure it deems appropriate”, according to the ICC.\n\nA father and son from Ukraine have been sentenced to 20 years’ jail each in Belarus after being convicted of preparing terrorist acts. Serhiy Kabarchuk and his son Pavlo were arrested in February for allegedly assembling a store of weapons and explosives. State television later ran footage in which the Kabarchuks said they were acting under the direction of Ukraine’s SBU security service. Many observers claim such televised confessions in the authoritarian country are made under duress.\n\nUkraine said on Thursday it had detained six people including three army recruitment officials in Kyiv as part of a probe into “illegal evasion of mobilisation by persons liable for military service”. The State Bureau of Investigation (SBI) added: “More than $1.2 million and 45,000 euros in cash were discovered and seized. In addition, 11 luxury cars worth over $100,000 each were seized.” The SBI alleged a civilian acted as a liaison between the recruitment officials and people seeking to avoid being drafted. The price to be removed from the call-up list ranged from $2,000 to $15,000 and the scheme may have aided “thousands” to evade service. Ukraine’s president, Volodymyr Zelenskyy, this week ordered the scrapping of the central body that issues medical disability certificates, and Ukraine’s prosecutor general, Andriy Kostin, resigned after security services uncovered a large-scale scheme that provided draft exemptions for government officials."
    },
    {
        "title": "'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe",
        "description": "The Russian president closed this year's BRICS summit by addressing a variety of topics, including claims Russia is trying to create mayhem in the UK.",
        "content": "Vladimir Putin has dismissed as \"utter rubbish\" claims by the UK's MI5 intelligence chief that Russia is aiming to cause chaos across Britain and Europe.\nSpeaking on the closing day of the annual summit of the BRICS bloc of developing economies, the ... [2163 chars]",
        "url": "https://news.sky.com/story/utter-rubbish-putin-dismisses-mi5-claims-russia-trying-to-create-mayhem-in-uk-and-europe-13240462",
        "image": "https://e3.365dm.com/24/10/1600x900/skynews-putin-brics_6726741.jpg?20241024192441",
        "publishedAt": "2024-10-24T20:49:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Vladimir Putin has dismissed as \"utter rubbish\" claims by the UK's MI5 intelligence chief that Russia is aiming to cause chaos across Britain and Europe.\n\nSpeaking on the closing day of the annual summit of the BRICS bloc of developing economies, the Russian president responded to MI5 chief Ken McCallum's claims that Russian military intelligence is \"on a sustained mission to generate mayhem on British and European streets\".\n\nMr McCallum said his service had \"seen arson, sabotage and more\".\n\nMr Putin, who has been hosting the three-day summit in the Russian city of Kazan, responded saying the situation \"on the streets of European cities\" was caused by the actions of European authorities.\n\nThis year's BRICS summit was touted by the Kremlin as \"the largest foreign policy event ever held\" by Russia.\n\nRead more:\n\n'Global South' interested in joining BRICS\n\nThe battle of the summits?\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.\n\nTurkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nFollow Sky News on WhatsApp Keep up with all the latest news from the UK and around the world by following Sky News Tap here\n\nDespite US-led efforts by Western countries to isolate Russia in the aftermath of its full-scale invasion of Ukraine back in February 2022, 36 countries attended the summit.\n\nMr Putin told the summit Russia was ready to consider options to end the conflict.\n\n\"We are prepared to consider any options for peace agreements based on the realities on the ground. And are not ready for anything else,\" he said.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nHe also addressed US claims that North Korea had sent troops to Russia, which he didn't deny.\n\nBut he said it was up to Moscow how to operate within the framework of an article of Russia's partnership deal with North Korea, which deals with mutual defence.\n\nThe US has said that it had seen evidence that North Korea has sent 3,000 troops to Russia for possible deployment in Ukraine, viewed by the West as a significant escalation.\n\nAsked by a reporter about satellite imagery showing North Korean troop movements, Mr Putin said: \"Images are a serious thing. If there are images, then they reflect something.\""
    },
    {
        "title": "Putin does not deny North Korea has sent soldiers to Russia",
        "description": "President’s comments at Brics summit are ambiguous, however, US says it has evidence of movement of troops who could fight in Ukraine",
        "content": "Vladimir Putin has sidestepped claims that North Korea has sent soldiers to Russia, insisting that it was up to Moscow how to run its mutual defence clause with Pyongyang.\nSpeaking at the close of the Brics summit in Kazan on Thursday, he accused the... [3082 chars]",
        "url": "https://www.theguardian.com/world/2024/oct/24/putin-does-not-deny-north-korea-has-sent-soldiers-to-russia",
        "image": "https://i.guim.co.uk/img/media/ab2ccf1d6761b8a0e16b6654d8d4de6b12da61d5/0_136_4855_2912/master/4855.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2fa85b3d2724d7ce51bedc01ec6d44a9",
        "publishedAt": "2024-10-24T18:08:17Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin has sidestepped claims that North Korea has sent soldiers to Russia, insisting that it was up to Moscow how to run its mutual defence clause with Pyongyang.\n\nSpeaking at the close of the Brics summit in Kazan on Thursday, he accused the west of escalating the Ukraine war and said it was “living an illusion” if it thought it could inflict a strategic defeat on Russia.\n\nThe US said it had seen evidence that North Korea had sent 3,000 troops to Russia for possible deployment in Ukraine, a move that could mark a fundamental challenge to Ukraine due to its manpower shortages.\n\nAsked by a reporter about satellite imagery apparently showing North Korean troop movements, Putin said: “Images are a serious thing. If there are images, then they reflect something.”\n\nHe repeated his claims that the west had escalated the Ukraine crisis and said Nato officers and instructors were directly involved in the Ukraine war.\n\n“We know who is present there, from which European Nato countries, and how they carry out this work,” Putin said.\n\nThe US and South Korea have said that North Korean troops have reached Ukraine and, although Putin may be being deliberately ambiguous to lower Ukraine morale, it is also striking he did not deny the allegations given a high-profile opportunity to do so.\n\nNo fellow Brics leader raised the issue in public during the summit, which instead heard vague calls for restraint.\n\nOn Thursday, Ukraine’s military intelligence service said that the first North Korean units trained in Russia had been deployed in the Kursk region, the Russian border area where Ukrainian forces staged a major incursion in August.\n\n“On October 23, 2024, their presence was recorded in the Kursk region,” the Ukrainian intelligence agency said in a statement.\n\nThe UN secretary general, António Guterres, used his speech to call for a “just peace”.\n\nGuterres was in Russia for the first time since April 2022 and was due to hold private talks on Ukraine with Putin later in the day. Moscow is seeking to use the forum to build a united front of emerging economies that use alternatives to the dollar with which to trade.\n\nIn a brief passage on Ukraine, the UN chief said: “We need peace in Ukraine, a just peace in line with the UN charter, international law and the [UN] general assembly resolution.”\n\nHe said: “We must uphold the values of the UN charter, the rule of law and the principles of sovereignty, territorial integrity and political independence of all states.” He made no reference to the North Korean troops.\n\nIt is the first time Guterres has met Putin since the international criminal court in March 2023 issued a warrant for the arrest of the Russian leader because of children in Ukraine being abducted and taken to Russia. The Ukrainian foreign ministry has criticised Guterres over the meeting, especially since he rejected an invitation to attend a Ukrainian-sponsored peace summit this summer.\n\nGuterres urged members of Brics not to see the organisation as an alternative to the UN, saying: “No single group and no single country can act alone or in isolation. It takes a community of nations, working as one global family, to address global challenges.”\n\nPutin stated that the emergence of a “more just world order” was being hampered by “forces accustomed to thinking and acting in the logic of domination over everything and everyone”. He said Kyiv’s foreign backers did not any longer even hide their goal of inflicting a strategic defeat on his country.\n\nPutin said: “Only those who don’t know the history of Russia can believe in this, because they don’t take into account the unity and the strength of spirit of Russians forged over the centuries.”"
    },
    {
        "title": "Watch live: Putin holding news conference after Russia's 'largest ever' foreign policy summit",
        "description": "Vladimir Putin is speaking after a summit with leaders of the BRICS bloc of countries, including China's Xi Jinping and India's Narendra Modi. He has touted the group as part of \"radical changes\" under way to shape a \"multipolar world\" and challenge Western war sanctions. Watch live below.",
        "content": "Putin holds news conference after Russia's 'largest ever' foreign policy summit\nVladimir Putin is giving a news conference from 3.30pm UK time after hosting a summit with leaders of the BRICS bloc of countries, including China's Xi Jinping and India'... [1559 chars]",
        "url": "https://news.sky.com/story/watch-live-putin-holding-news-conference-after-russias-largest-ever-foreign-policy-summit-13240223",
        "image": "https://e3.365dm.com/24/10/1600x900/skynews-brics-vladimir-putin_6725052.jpg?20241023100600",
        "publishedAt": "2024-10-24T13:41:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 404 Client Error: Not Found for url: https://news.sky.com/story/watch-live-putin-holding-news-conference-after-russias-largest-ever-foreign-policy-summit-13240223 on URL https://news.sky.com/story/watch-live-putin-holding-news-conference-after-russias-largest-ever-foreign-policy-summit-13240223"
    },
    {
        "title": "Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit",
        "description": "Antonio Guterres's message at the summit of BRICS countries in Kazan comes after President Xi Jinping told leaders yesterday that China has a peace plan for Ukraine - along with Brazil.",
        "content": "The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.\nAppearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"i... [4803 chars]",
        "url": "https://news.sky.com/story/ukraine-war-a-just-peace-needed-to-end-conflict-un-chief-tells-putin-at-new-global-order-brics-summit-13240297",
        "image": "https://e3.365dm.com/24/10/1600x900/skynews-vladimir-putin-antonio-guterres_6726367.jpg?20241024123628",
        "publishedAt": "2024-10-24T13:32:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.\n\nAppearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"in line with the UN Charter, international law and UN General Assembly resolutions\".\n\nHe said summit attendees: \"Across the board, we need peace. We need peace in Ukraine.\"\n\nIt comes after President Xi Jinping claimed on Wednesday that China and fellow BRICS member Brazil have put forward a peace plan for the war in Ukraine.\n\nHe told Mr Putin and other leaders at the three-day summit that they intend to rally further international support in the hope of bringing fighting there to an end.\n\nMr Xi said: \"We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift de-escalation of the situation.\"\n\nThe BRIC coalition formed in 2009, bringing together Brazil, Russia, India, and China. South Africa joined the following year, changing the name to BRICS.\n\nMore on Brics 'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe\n\nIt was largely disregarded at first - but it has since grown in both membership and influence with Russia's war in Ukraine and Iran's involvement in the wars in Gaza, Israel, and Lebanon dominating global geopolitics.\n\nImage: Leaders in Kazan this week. Pic: Reuters\n\nJust weeks before Russia invaded Ukraine in February 2022, Mr Putin and Mr Xi signed a \"no limits\" partnership between their two countries.\n\nBeijing, however, has kept largely quiet on the Ukraine war and not tried to use its influence on Moscow to bring it to an end. This week's claims of a peace plan could result in new impetus for talks to resolve the conflict.\n\nImage: Xi Jinping and Vladimir Putin attend the BRICS summit in Kazan. Pic Reuters\n\nIndia's Prime Minister Narendra Modi added that his country \"supports dialogue and diplomacy, not war\".\n\nMr Guterres has not visited Russia in over two years and the decision sparked criticism from Ukrainian officials.\n\nUkraine's foreign ministry wrote on X ahead of the summit that his trip to Kazan would \"only damage the UN's reputation\".\n\n\"This is a wrong choice that does not advance the cause of peace,\" it added, also rejecting the China-Brazil plan.\n\nFarhan Haq, deputy spokesman for Mr Guterres, responded by saying it is \"standard practice in attending meetings of organisations with large numbers of important member states, such as the G7 and the G20\" - pointing out that BRICS countries represent \"half the world's population\".\n\nNotably, President Tayyip Erdogan of Turkey, which is a NATO member and hoping to enter the European Union, was also there.\n\nImage: Vladimir Putin and Narendra Modi in Kazan. Pic: Reuters\n\nAppearing alongside BRICS members on Thursday, Mr Guterres also called for peace in the conflicts in Gaza, Lebanon, and Sudan.\n\nOn the Middle East, Mr Xi called for a comprehensive ceasefire in Gaza.\n\nAlternative payment system would counter sanctions\n\nIn a joint declaration bringing the three days to a close, BRICS members voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions\".\n\nMr Putin's priority for the meeting was discussions of an alternative global payment system that could be used between members - after Russia was cut off from SWIFT at the outbreak of its invasion, due to Western sanctions.\n\nAs such, the attendees' statement talked of a \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access\".\n\nMr Putin said it was important as all the BRICS members \"share similar aspirations and values and a vision of new democratic global order\".\n\nSuch a system would allow member countries to bypass the US dollar, which is currently used for oil transactions and other major international trade.\n\nImage: Vladimir Putin shakes hands with Iranian President Masoud Pezeshkian. Pic: Reuters\n\nOn the sidelines of the summit, Mr Putin also met Iranian President Masoud Pezeshkian.\n\nHe reiterated the \"truly friendly\" ties between Russia and Iran that he hopes will be solidified with a \"comprehensive strategic partnership treaty\", which is due to be signed by the pair on Mr Pezeshkian's planned trip to Moscow.\n\nA date for that visit has not been decided, Kremlin foreign affairs adviser Yuri Ushakov said.\n\nCommenting on the Middle East crisis, Mr Pezeshkian added: \"The flames of war continue to rage in the Gaza Strip and\n\ncities of Lebanon, and international institutions, particularly the UN Security Council as a driver of international peace and security, lack the necessary effectiveness to extinguish the fire of this crisis.\"\n\nMr Modi and President Cyril Ramaphosa have chosen to go to the BRICS summit rather than, as leaders of India and South Africa, attend the Commonwealth Heads of Government Meeting, which is also taking place at the same time and is being visited by UK prime minister Sir Keir Starmer, among others."
    },
    {
        "title": "Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit",
        "description": "Antonio Guterres's message at the summit of BRICS countries in Kazan comes after President Xi Jinping told leaders yesterday that China has a peace plan for Ukraine - along with Brazil.",
        "content": "The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.\nAppearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"i... [4803 chars]",
        "url": "https://news.sky.com/story/ukraine-war-a-just-peace-needed-to-end-conflict-un-chief-tells-putin-13240297",
        "image": "https://e3.365dm.com/24/10/1600x900/skynews-vladimir-putin-antonio-guterres_6726367.jpg?20241024123628",
        "publishedAt": "2024-10-24T13:32:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "The UN secretary general has told Vladimir Putin that \"a just peace\" is needed to end the Ukraine war.\n\nAppearing alongside Mr Putin at a BRICS summit in the Russian city of Kazan, Antonio Guterres called on the Russian leader to agree a peace deal \"in line with the UN Charter, international law and UN General Assembly resolutions\".\n\nHe said summit attendees: \"Across the board, we need peace. We need peace in Ukraine.\"\n\nIt comes after President Xi Jinping claimed on Wednesday that China and fellow BRICS member Brazil have put forward a peace plan for the war in Ukraine.\n\nHe told Mr Putin and other leaders at the three-day summit that they intend to rally further international support in the hope of bringing fighting there to an end.\n\nMr Xi said: \"We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift de-escalation of the situation.\"\n\nThe BRIC coalition formed in 2009, bringing together Brazil, Russia, India, and China. South Africa joined the following year, changing the name to BRICS.\n\nMore on Brics 'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe\n\nIt was largely disregarded at first - but it has since grown in both membership and influence with Russia's war in Ukraine and Iran's involvement in the wars in Gaza, Israel, and Lebanon dominating global geopolitics.\n\nImage: Leaders in Kazan this week. Pic: Reuters\n\nJust weeks before Russia invaded Ukraine in February 2022, Mr Putin and Mr Xi signed a \"no limits\" partnership between their two countries.\n\nBeijing, however, has kept largely quiet on the Ukraine war and not tried to use its influence on Moscow to bring it to an end. This week's claims of a peace plan could result in new impetus for talks to resolve the conflict.\n\nImage: Xi Jinping and Vladimir Putin attend the BRICS summit in Kazan. Pic Reuters\n\nIndia's Prime Minister Narendra Modi added that his country \"supports dialogue and diplomacy, not war\".\n\nMr Guterres has not visited Russia in over two years and the decision sparked criticism from Ukrainian officials.\n\nUkraine's foreign ministry wrote on X ahead of the summit that his trip to Kazan would \"only damage the UN's reputation\".\n\n\"This is a wrong choice that does not advance the cause of peace,\" it added, also rejecting the China-Brazil plan.\n\nFarhan Haq, deputy spokesman for Mr Guterres, responded by saying it is \"standard practice in attending meetings of organisations with large numbers of important member states, such as the G7 and the G20\" - pointing out that BRICS countries represent \"half the world's population\".\n\nNotably, President Tayyip Erdogan of Turkey, which is a NATO member and hoping to enter the European Union, was also there.\n\nImage: Vladimir Putin and Narendra Modi in Kazan. Pic: Reuters\n\nAppearing alongside BRICS members on Thursday, Mr Guterres also called for peace in the conflicts in Gaza, Lebanon, and Sudan.\n\nOn the Middle East, Mr Xi called for a comprehensive ceasefire in Gaza.\n\nAlternative payment system would counter sanctions\n\nIn a joint declaration bringing the three days to a close, BRICS members voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions\".\n\nMr Putin's priority for the meeting was discussions of an alternative global payment system that could be used between members - after Russia was cut off from SWIFT at the outbreak of its invasion, due to Western sanctions.\n\nAs such, the attendees' statement talked of a \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access\".\n\nMr Putin said it was important as all the BRICS members \"share similar aspirations and values and a vision of new democratic global order\".\n\nSuch a system would allow member countries to bypass the US dollar, which is currently used for oil transactions and other major international trade.\n\nImage: Vladimir Putin shakes hands with Iranian President Masoud Pezeshkian. Pic: Reuters\n\nOn the sidelines of the summit, Mr Putin also met Iranian President Masoud Pezeshkian.\n\nHe reiterated the \"truly friendly\" ties between Russia and Iran that he hopes will be solidified with a \"comprehensive strategic partnership treaty\", which is due to be signed by the pair on Mr Pezeshkian's planned trip to Moscow.\n\nA date for that visit has not been decided, Kremlin foreign affairs adviser Yuri Ushakov said.\n\nCommenting on the Middle East crisis, Mr Pezeshkian added: \"The flames of war continue to rage in the Gaza Strip and\n\ncities of Lebanon, and international institutions, particularly the UN Security Council as a driver of international peace and security, lack the necessary effectiveness to extinguish the fire of this crisis.\"\n\nMr Modi and President Cyril Ramaphosa have chosen to go to the BRICS summit rather than, as leaders of India and South Africa, attend the Commonwealth Heads of Government Meeting, which is also taking place at the same time and is being visited by UK prime minister Sir Keir Starmer, among others."
    },
    {
        "title": "Ukraine war briefing: Brics summit backfired on Putin with calls for peace, says Kyiv",
        "description": "Xi Jinping among world leaders in Russia advising against escalation; any North Korean troops ‘fair game’ on Ukraine battlefield, says US. What we know on day 974",
        "content": "North Korean troops would be legitimate military targets – “fair game” – if they engaged in combat in Ukraine, White House spokesperson John Kirby said on Wednesday. The US has said for the first time that it has seen evidence of North Korean troops ... [3597 chars]",
        "url": "https://www.theguardian.com/world/2024/oct/24/ukraine-war-briefing-brics-summit-backfired-on-putin-with-calls-for-peace-says-kyiv",
        "image": "https://i.guim.co.uk/img/media/230100305d4b728ae3bc38d14c651e56a2a4101c/0_0_7623_4573/master/7623.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9a0dccf11019ca0330ba2de6552dca86",
        "publishedAt": "2024-10-24T00:10:32Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "North Korean troops would be legitimate military targets – “fair game” – if they engaged in combat in Ukraine, White House spokesperson John Kirby said on Wednesday. The US has said for the first time that it has seen evidence of North Korean troops in Russia, and South Korean lawmakers have said about 3,000 soldiers have been sent to support the Kremlin’s war in Ukraine, with Kim Jong-un’s regime promising to provide a total of about 10,000 troops by December.\n\nThe Brazilian president, Luiz Inacio Lula da Silva, called for “avoiding escalation and initiating peace negotiations ”. Without referring to any specific conflict, the Indian prime minister, Narendra Modi, also issued a call for peace: “We support dialogue and diplomacy, not war.” In private talks, Vladimir Putin welcomed offers by several of the Brics leaders to mediate in Ukraine , even as he told them his forces were advancing, said his spokesman, Dmitry Peskov, according to Russian state media.\n\nThe foreign ministry in Kyiv said on Wednesday that Moscow had failed to win support for its invasion of Ukraine at the Brics summit it is hosting, where Putin faced direct calls to end the conflict from some of his closest and most important partners. “The Brics summit, which Russia planned to use to split the world, has once again demonstrated that the world majority remains on the side of Ukraine in its quest to guarantee a comprehensive, just and sustainable peace,” the ministry said. The Chinese president, Xi Jinping, told the summit that there must be “no escalation of fighting” in Ukraine , saying: “We must adhere to the three principles of ‘no spillover from the battlefield, no escalation of fighting and no adding oil to the fire by relevant parties’, so as to ease the situation as soon as possible.”\n\nAlexander Lukashenko – the Belarusian president, who has stayed in power by running a client state of Russia – said in interviews broadcast on Wednesday that Putin deploying any foreign forces in the Ukraine conflict would inevitably lead to an escalation, possibly involving Nato troops. Lukashenko claimed it was “rubbish” that North Korean troops were going to fight in Ukraine: “Knowing his character Putin would never try to persuade another country to involve its army in Russia’s special operation in Ukraine … [it] would be a step towards the escalation of the conflict if the armed forces of any country, even Belarus, were on the contact line.” That would prompt Ukraine’s allies to point to foreign involvement “so Nato troops would be deployed to Ukraine”.\n\nUkrainian authorities have announced the mandatory evacuation of children and their families from Borova in the north-eastern region of Kharkiv, where Russian forces have been making advances. The governor of the Donetsk region earlier said all children had been removed from the frontline town of Myrnograd and just several dozen remained in the nearby transport hub of Pokrovsk - the main target of Russian advances. Authorities in the Zaporizhzhia region, which the Kremlin claimed to have annexed alongside Donetsk and two others, said two men aged 40 and 73 had been killed in a drone attack.\n\nThe Biden administration is trying to provide Ukraine with US$10bn in military aid as part of its $20bn commitment under a $50bn loan coordinated with the G7 and EU, the White House National Security Council said on Wednesday. Joe Biden, the US president, said: “We will provide $20bn in loans to Ukraine that will be paid back by the interest earned from immobilised Russian sovereign assets. Make no mistake: Russia will not prevail in this conflict … tyrants will be responsible for the damages they cause”. The US plans to disperse $10bn by December as economic aid, but needs US lawmakers’ approval for a further $10bn, the White House national security council has said on Wednesday."
    },
    {
        "title": "Putin calls for alternative international payment system at Brics summit",
        "description": "Russian president’s goal to de-dollarize world economy alarms members that do not want bloc to turn against west",
        "content": "Vladimir Putin has opened the expanded Brics summit by issuing a call for an alternative international payments system that could prevent the US using the dollar as a political weapon.\nBut the summit communique indicated that little progress had been... [4445 chars]",
        "url": "https://www.theguardian.com/world/2024/oct/23/putin-world-economy-bloc-brics-summit",
        "image": "https://i.guim.co.uk/img/media/8e0d9c9b64cb7c80cc8f53f8f0397fa53879c2f9/0_52_5265_3158/master/5265.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3b8dd9c2fbfaee735d00ac01325e9c1b",
        "publishedAt": "2024-10-23T16:08:17Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin has opened the expanded Brics summit by issuing a call for an alternative international payments system that could prevent the US using the dollar as a political weapon.\n\nBut the summit communique indicated that little progress had been made on an alternative payment system.\n\nSpeaking at the summit in the Russian city of Kazan, Putin said: “The dollar is being used as a weapon. We really see that this is so. I think that this is a big mistake by those who do this.” He said that nearly 95% of trade between Russia and China is now conducted in rubles and yuan.\n\nThe move to de-dollarize the world economy unnerves some Brics members – notably Brazil and India – that do not want their rapidly expanding club to become solely pro-Chinese and anti-western.\n\nRussia is working on creating a settlement and payment infrastructure that would bypass the Swift payment system based in Belgium.\n\nThe de-dollarization initiative is probably the most concrete proposal likely to emerge from the summit that has been remarkable for giving Putin his biggest international platform since the Russian invasion of Ukraine in February 2022. The summit has been attended by the nine Brics members including the Indian prime minister, Narendra Modi, the Chinese premier and the president of South Africa, Cyril Ramaphosa.\n\nThe UN secretary general, António Guterres, also arrived late on Monday with criticism from Ukraine ringing in his ears for finding time to fly from New York to meet a Russian leader for whom an arrest warrant has been issued by the international criminal court. Ukraine complained that Guterres refused to attend the Ukraine peace conference in July.\n\nGuterres’s spokesperson insisted that he would not retreat from any of his longstanding positions on the illegality of the Russian invasion of Ukraine, and would make that clear in his public as well as private remarks. The spokesperson added special provisions applied to allow the UN secretary general to meet world leaders that are subject to arrest warrants.\n\nThe final summit communique will contain a single reference to a joint Brazil-China peace plan for Ukraine, saving its strongest language for a condemnation of Israel in Gaza. The Ukrainian president, Volodymyr Zelenskyy, has already rejected the Brazilian alternative to Ukraine’s own peace plan saying its “half-hearted settlement plans, so-called sets of principles” would only give Moscow the political space to continue the war.\n\nModi was probably the most direct of world leaders saying he wanted peace in Ukraine, while Xi discussed the war in a private session with Putin. Putin has said that Moscow will not hand back the four regions of eastern Ukraine that it says are now part of Russia.\n\n“The Brics summit, which Russia planned to use to split the world, has once again demonstrated that the world majority remains on the side of Ukraine in its quest to guarantee a comprehensive, just and sustainable peace,” the Ukrainian foreign ministry said in a statement.\n\nThe future purpose and size of the Brics summit – now in its 16th year - also proved controversial, with Putin saying it would be wrong to ignore the unprecedented interest in global south countries wishing to join the organisation, and keeping the organisation effective.\n\nBrazil in alliance with India has been trying to prevent Brics, already expanded from five to nine members at last year’s Brics summit in South Africa, being reshaped simply into an anti-western alliance that acts as a cheerleader for Russia and China.\n\nSpeaking by video link the Brazilian president, Luiz Inácio Lula da Silva, said: “Many insist on dividing the world into friends and enemies. But the most vulnerable are not interested in simplistic dichotomies; what they want is plenty of food, decent work and quality universally accessible public schools and hospitals.”\n\nNations to be admitted were only agreed after Brazil successfully held out a veto against Venezuela.\n\nThe new members, a diverse geographical and political group, are expected to be Cuba, Bolivia, Thailand, Vietnam, Malaysia, Indonesia, Belarus, Turkey, Nigeria, Uganda, Kazakhstan and Uzbekistan. The decision by Turkey, a member of Nato, to attend has raised eyebrows.\n\nAgathe Demarais, a sanctions specialist at the European Council of Foreign Relations, said: “At this stage it is hard to imagine a widespread development and adoption of Brics financial tools globally. The US dollar’s domination of the global currency landscape is entrenched, both for trade transactions and foreign exchange reserves; more than 80% of global trade transactions are invoiced in US dollars, which also accounts for nearly 60% of central banks reserves."
    },
    {
        "title": "'Global South' interested in joining BRICS - as it's 'tone deaf' to anti-Russia rhetoric",
        "description": "The message from the Kremlin is loud and clear - the West's efforts to isolate Russia have not worked. Instead of losing friends, Moscow has made them.",
        "content": "For Vladimir Putin, the optics could not be better.\nMore than two and a half years into his war in Ukraine, he is shaking hands this week with not just one world leader, or two, but more than 20.\nChina's Xi Jinping, India's Prime Minister Narendra Mo... [6218 chars]",
        "url": "https://news.sky.com/story/global-south-interested-in-joining-brics-as-its-tone-deaf-to-anti-russia-rhetoric-13238956",
        "image": "https://e3.365dm.com/24/10/1600x900/skynews-vladimir-putin-brics_6719579.jpg?20241018112842",
        "publishedAt": "2024-10-22T18:47:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "For Vladimir Putin, the optics could not be better.\n\nMore than two and a half years into his war in Ukraine, he is shaking hands this week with not just one world leader, or two, but more than 20.\n\nChina's Xi Jinping, India's Prime Minister Narendra Modi, the new Iranian President Masoud Pezeshkian…there's even Turkey's Recep Tayyip Erdogan, the leader of a NATO member state and EU candidate country.\n\nThey have all come to the Russian city of Kazan for the BRICS summit of emerging economies.\n\nAs you might expect, the Russian president was positively beaming as he sat down with various heads of state for a string of one-on-one meetings.\n\nThe message from the Kremlin is loud and clear - the West's efforts to isolate Russia have not worked. Instead of losing friends, Moscow has made them.\n\nImage: Mr Putin and Mr Xi shake hands during their meeting on the sidelines of BRICS Summit. Pic: AP\n\nRead more from Sky News:\n\nMillions of Sudanese displaced by war now face a new fight\n\nMystery tar balls wash up on Sydney beaches forcing seven to close\n\n\"It shows something about the weakness of the sanctions regime,\" Mark Galeotti, principal director of Mayak Intelligence, told Sky News.\n\n\"There was a lot of exaggerated sense as to how the West could put a stranglehold on Russia, and many countries are, frankly, not willing to play those games.\n\n\"It highlights the degree to which in this incredibly complex, multi-connected, modern world, it's very hard to actually isolate any country, especially one as large and as engaged in global commerce as Russia.\"\n\nImage: Mr Putin embraces Narendra Modi during their meeting on the sidelines of the BRICS Summit in Kazan. Pic: Reuters\n\nThe first BRIC summit was in 2009, involving Brazil, Russia, India and China. South Africa joined in 2010 to add the S on the end of the acronym.\n\nFor much of the last decade and a half, the group has been dismissed by economists as an alphabet soup of countries - too spread out and fundamentally different from one another to form any meaningful alliance.\n\nBut in the last few years, it has grown more significant and seemingly influential.\n\n'A powerful platform'\n\nThe group has expanded its membership to include Egypt, Ethiopia, Iran and the United Arab Emirates. Saudi Arabia has also been invited to join, and according to Russia, there are dozens of other countries that want to become part of the club.\n\nThat's despite Russia's full-scale invasion of Ukraine, and the West's attempts to cast Mr Putin as a war criminal.\n\n\"A lot of countries in the Global South are really tone deaf to rhetoric about Russia breaking the rules,\" Alexander Gabuev, director of the Carnegie Russia Eurasia Center, told Sky News.\n\nHandshake between Putin and Xi will be key moment at BRICS but temperatures are high Nicole Johnston News correspondent @nicole_reporter For China, the BRICS conference is another opportunity to show the West that when it comes to its multi-polar vision of the world it's not alone. Chinese President Xi Jinping and Russia's President Vladimir Putin are united in actively challenging the US-led international order. One of the key moments of this BRICS will be a handshake between these leaders. Behind it though the international temperature is high. The US has imposed sanctions on two China-based companies and their alleged Russian business partners, accusing them of supplying complete weapons systems to Russia for its war in Ukraine. Previously China was accused of sending dual-use items like machinery tools and semiconductors to Russia, but not complete weapons. The US Treasury Department said China and Russia had collaborated to produce Moscow's 'Garpiya series' of long-range unmanned aerial vehicles. There are two dozen countries with emerging economies also attending the BRICS summit who are not yet members. Clearly interest from countries in the \"global south\" is strong. But for many of them it's not about choosing the West or China. It’s about having options in an increasingly complicated and fragmented world.\n\n\"All the questions 'what about Iraq?' are not driven by Russian propaganda points but by genuine concern about the US abusing its role as the most powerful country.\n\n\"They realise that the current international order underwritten by the US doesn't really deliver for them and they don't know what the alternative is but BRICS is really a powerful platform where these issues can be discussed.\"\n\nTop of the agenda this week is an alternative platform for international payments, which Mr Putin hopes will end the dominance of the dollar and make the BRICS economies immune to Western sanctions.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nBecause despite all the talk of sanctions not having the desired effect, they have caused Russia problems.\n\nIt's been cut off from international markets, and more recently, the country's had difficulties with cross-border trade, even with friendly countries like China, because it's linked to the dollar and there's a threat of secondary sanctions by the US.\n\nAn entirely new system, not involving the dollar, would bypass those issues. But it's unlikely to come to fruition this week.\n\nFor one, the idea is still in its infancy. What's more, not all the BRICS members, like India and Brazil, share Mr Putin's anti-Western sentiment.\n\nFollow Sky News on WhatsApp Keep up with all the latest news from the UK and around the world by following Sky News Tap here\n\n\"There is concern among these countries about how close you want to move towards Russia or an agenda that's seen as enabling this horrible war from Russia in Ukraine,\" Mr Gabuev said.\n\nBrazil and India are not alone. Saudi Arabia and Turkey also share strong ties with the West. Their presence in Kazan can be seen more as an attempt to play both sides, rather than overt support of Russia.\n\nBut that does not seem to matter to the residents of Kazan. Most people we have spoken to here view the summit as the Kremlin intends.\n\n\"This is a wonderful event,\" Alexandra told us. \"I think that this will be a breakthrough and that the world has become multipolar.\"\n\nAlexei is another who is proud of his president.\n\n\"He is looking in all directions and it's bearing fruit,\" he said. \"If someone thinks we're isolated, it is probably only their problem.\"\n\nNot everyone shares that opinion, though.\n\nFavaris points to Russia's closer ties with North Korea: \"If you are friends with an outcast, then you have fallen lower than ever.\""
    },
    {
        "title": "Putin plays host to 36 world leaders at Brics summit in Russia",
        "description": "Unclear if UN secretary general will attend Kazan meeting of countries including China, India and Iran",
        "content": "The Russian president, Vladimir Putin, ostracised by the west and labeled a potential war criminal by the International criminal court, has played host to 36 world leaders from nations including China, India and Iran as part of a summit of the Brics ... [4817 chars]",
        "url": "https://www.theguardian.com/business/2024/oct/22/putin-brics-summit-russia-china-india-iran-kazan",
        "image": "https://i.guim.co.uk/img/media/cdf3912294856483d8cf7d68704b1072b5c3295e/0_0_7879_4728/master/7879.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=09ec45e1978203a4776d256877bd4739",
        "publishedAt": "2024-10-22T13:51:09Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin, ostracised by the west and labelled a possible war criminal by the international criminal court, has played host to 36 world leaders from nations including China, India and Iran as part of a summit of the Brics group designed to display Moscow as anything but isolated.\n\nOne of the main aims of the summit will be to speed up ways to reduce the number of dollar transactions, and so mitigate the US ability to use the threat of sanctions to seek to impose its political will.\n\nThe spokesperson for the UN secretary general confirmed António Guterres would attend the summit as he did last year. His decision infuriated many in the west, including the Ukrainian foreign ministry, since the international criminal court issued warrants for Putin’s arrest in March 2023 over the abduction of children. The UN said Guterres would repeat his view that the invasion of Ukraine is in breach of the UN charter.\n\nMoscow said the representatives from 36 countries were attending parts of the three-day meeting, making it the largest international gathering hosted by Putin since he ordered the full-scale invasion of Ukraine in February 2022. Russia is this year’s chair of the group.\n\nThe Chinese president, Xi Jinping, greeted Putin in Kazan as his dear friend, praising the “profound” friendship between the two countries. He said: “The world is undergoing profound changes unseen in a century, and the international situation is chaotic and intertwined.”\n\nChina-Russia ties have “injected strong impetus into the development, revitalisation and modernisation of the two countries,” the Chinese leader said.\n\nPutin said he wanted to strengthen ties with China to bring greater global stability. “We intend to further increase coordination in all multilateral platforms to ensure global security and a just world order,” he told Xi.\n\nThe Indian prime minister, Narendra Modi, said he wanted the Ukraine conflict resolved quickly and peacefully. Modi visited Kyiv in August and Moscow in July in an effort to encourage talks, casting Delhi as a potential peacemaker, but there have been few developments since.\n\nCyril Ramaphosa, the South African president, who has also sought to play the role of mediator in the conflict, praised Moscow as a “valued ally” and friend “who supported us from the very beginning in the fight against apartheid”.\n\nPutin, speaking on Tuesday with the president of the Brics New Development Bank, Dilma Rousseff, said the use of local currencies instead of the dollar or euro “helps to keep economic development free from politics as far as possible in the context of today’s world”.\n\nRussia claims the group now represents the global majority that can make up a substantial element of a coming new global order.\n\nThe Brics group has already expanded from its five members – South Africa, Russia, China, Brazil and India – to a broader group including Egypt, the United Arab Emirates. Ethiopia and Iran. Argentina applied and then withdrew after its presidential elections.\n\nEgypt’s president, Abdelfattah al-Sisi, hailed Russian support for Egypt’s economic projects when he met Putin. Chief among them, Sisi said, was Egypt’s first nuclear power plant at El-Dabaa on the Mediterranean coast, built by Russia’s state atomic energy corporation Rosatom.\n\nNew applicants, often known as hedging states, that are in various stages of seeking membership include Turkey and Saudi Arabia.\n\nOthers due to attend the event, apart from the wavering Guterres, include the Palestinian president, Mahmoud Abbas, as well as leaders from Algeria, Azerbaijan, Belarus, Indonesia and Mexico.\n\nMasoud Pezeshkian, the Iranian president, said on the way to the summit in Kazan: “Brics can be a way out of American totalitarianism and create a path of multilateralism. Brics can be a solution to deal with the dominance of the dollar and deal with the economic sanctions of countries.”\n\nView image in fullscreen People in Kazan, Russia, welcome the Chinese president, Xi Jinping. Photograph: Xinhua/Rex/Shutterstock\n\nBut with expansion of Brics membership comes the risk of a loss of clear ideological cohesion.\n\nskip past newsletter promotion Sign up to Global Dispatch Free newsletter Get a different world view with a roundup of the best news, features and pictures, curated by our global development team Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nIndia and Brazil share some of the desire to be freed of the dollar’s dominance, but not to the same extent as China or Russia. Despite the anti-western language in summit communiques, Brazil’s president, Luiz Inácio Lula da Silva, for instance, has insisted that Brics is “not against anyone”. Brazil is advising against Venezuela being admitted to the group as part of an effort to prevent the alliance becoming purely anti-western.\n\nVenezuelan president Nicolas Maduro made a previously unannounced arrival. He was quoted by Russian news agencies as calling the group “the epicentre of the new multi-polar world”.\n\nAlex Gabuev, director of the Carnegie Russia Eurasia Centre in Berlin, said overall the Brics summit was already a gift to Putin.\n\nWriting in Foreign Affairs, he said the message of the gathering will be: “Not only is [Russia] far from being an international pariah but also is now a pivotal member of a dynamic group that will shape the future of the international order. That message is not mere rhetorical posturing, nor is it simply a testament to the Kremlin’s skilful diplomacy with non-western countries or to those countries’ self-interested, pragmatic engagement with Russia.”\n\nPutin was unable to risk attending the last Brics summit in Johannesburg because he did not want to embarrass his hosts, who would have been obliged to arrest him on the ICC warrant since South Africa is a signatory to the Rome Statute.\n\nThe Russian president may be hoping more generally that world events are swinging in his direction, with the possible return of Donald Trump to the White House next month and the possibility of favourable result in the elections in Georgia this weekend.\n\nThe future of the Ukraine conflict in the short term rests on Trump’s election, but even if he loses, war fatigue in Europe is leading all sides to conclude that Ukraine will at least have to open talks with Putin while Russian troops still occupy a large part of eastern Ukraine. A decision by Guterres to attend the summit would have international consequences.\n\nIn 2014, Brazil, China, India and South Africa abstained from voting on a UN general assembly resolution in support of Ukraine’s territorial integrity after Russia’s annexation of Crimea. Their unity was diluted after Russia’s invasion of Ukraine in 2022, where India, China and South Africa abstained, and Brazil condemned Russia’s actions.\n\nBut the Brics+ founding purpose is not security but a means to develop economic and tech platforms that are immune to US pressure and sanctions, in part by circumventing the dollar and pushing the internationalisation of the yuan.\n\nDespite Brics+ group having a larger combined GDP than either the G7 or the EU, its capital share and subsequent voting influence within institutions such as the International Bank for Reconstruction and Development (IBRD) remains significantly smaller, because each member country’s voting power is weighted on the basis of its financial contribution to the World Bank."
    },
    {
        "title": "Brazil president Lula cancels Brics trip to Russia after ‘small brain haemorrhage’ from fall",
        "description": "Doctors say president sustained ‘great’ trauma to head and slight brain bleed, with long-haul travel cancelled as a precaution but is otherwise fit for duty",
        "content": "The Brazilian president, Luiz Inácio Lula da Silva, on Sunday cancelled his trip to Russia for the Brics summit after a fall at home caused a minor brain haemorrhage.\nIn a statement, the presidential office said Lula, 78, would participate via videoc... [1285 chars]",
        "url": "https://www.theguardian.com/world/2024/oct/21/brazil-president-luiz-inacio-lula-da-silva-fall-russia-trip-brics",
        "image": "https://i.guim.co.uk/img/media/f7f9337b1ef1fa855e6e9e617e6dcf5e367a8877/0_183_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ecda57211a335b50a9f0b9c1b6366ec1",
        "publishedAt": "2024-10-21T00:40:01Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The Brazilian president, Luiz Inácio Lula da Silva, on Sunday cancelled his trip to Russia for the Brics summit after a fall at home caused a minor brain haemorrhage.\n\nIn a statement, the presidential office said Lula, 78, would participate via videoconference after receiving medical advice to temporarily avoid long-haul flights. He was initially scheduled to depart at 5pm on Sunday.\n\nLula’s doctor, Roberto Kalil, said in an interview with GloboNews TV channel that the president had a fall that caused “great” trauma to the back of his head, requiring stitches and resulting in a “small brain haemorrhage” in the temporal-frontal region.\n\n“It’s a condition that will require repeat tests throughout the week. Any brain haemorrhage, theoretically, can worsen in the following days, so observation is important,” Kalil said, adding that Lula was doing well and could engage in normal activities.\n\nAccording to a medical report issued earlier on Sunday by the Sirio Libanes hospital in Brasília, Lula suffered a laceration to the “occipital region” of the back of his head on Saturday.\n\nThe report said Lula “was advised to avoid long-distance air travel but is otherwise able to carry out his regular duties”.\n\nThe government announced that Mauro Vieira, the foreign minister, was designated to lead the Brazilian delegation to the Brics summit, departing on Sunday.\n\nGleisi Hoffmann, a congresswoman and president of Lula’s Workers party, said she had spoken with the president and that “he is doing very well, just avoiding a long trip”."
    },
    {
        "title": "Milei says Argentina will not be joining Brics bloc in U-turn",
        "description": "Far-right president says not ‘opportune’ for Argentina – which had been set to become a member on 1 January – to be part of alliance",
        "content": "Argentina has formally announced that it will not join the Brics bloc of developing economies, the latest in a dramatic shift in foreign and economic policy by Argentina’s new far-right populist president, Javier Milei.\nIn a letter addressed to the l... [2027 chars]",
        "url": "https://www.theguardian.com/world/2023/dec/29/milei-argentina-brics-bloc",
        "image": "https://i.guim.co.uk/img/media/b7622c81b7a4a8b9cab3a124b4d5402d2614075c/0_0_4000_2401/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5ac46ba4fe6a15b62d645145efff6ab6",
        "publishedAt": "2023-12-29T19:23:59Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Argentina has formally announced that it will not join the Brics bloc of developing economies, the latest in a dramatic shift in foreign and economic policy by Argentina’s new far-right populist president, Javier Milei.\n\nIn a letter addressed to the leaders of Brazil, Russia, India, China and South Africa – all members of the alliance – Milei said the moment was not “opportune” for Argentina to join as a full member. The letter was dated a week ago, 22 December, but released by the Argentinian government on Friday, the last working day of 2023.\n\nArgentina was among six countries invited in August to join the bloc – made up of Brazil, Russia, India, China and South Africa to make an 11-nation bloc – and had been set to become a member on 1 January 2024.\n\nThe move comes as Argentina has been left reeling by deepening economic crisis.\n\nMilei’s predecessor, the former center-left president Alberto Fernández, endorsed joining the alliance as an opportunity to reach new markets. The Brics currently account for about 40% of the world’s population and more than a quarter of the world’s GDP.\n\nBut economic turmoil left many in Argentina eager for change, ushering the chainsaw-wielding political outsider Milei into the presidency.\n\nMilei, who defines himself as an “anarcho-capitalist” – a current within liberalism that aspires to eliminate the state – has implemented a series of measures to deregulate the economy, which in recent decades has been marked by strong state interventionism.\n\nIn foreign policy, he has proclaimed full alignment with the “free nations of the west” – especially the United States and Israel.\n\nThroughout the campaign for the presidency, Milei also disparaged countries ruled “by communism” and announced that he would not maintain diplomatic relations with them despite growing Chinese investment in South America.\n\nHowever, in the letter addressed to his counterpart Luiz Inácio Lula da Silva in neighboring Brazil and the rest of the leaders of full Brics members – Xi Jinping of China, Narendra Modi of India, Vladimir Putin of Russia and Cyril Ramaphosa of South Africa – Milei proposed to “intensify bilateral ties” and increase “trade and investment flows”.\n\nMilei also expressed his readiness to hold meetings with each of the five leaders."
    },
    {
        "title": "US has wrecked chances of peace in Middle East, Putin tells Brics summit",
        "description": "Russian president blames US for Gaza conflict as he attempts to woo global south",
        "content": "US unilateralism has wrecked the chances of peace in the Middle East, Vladimir Putin, the Russian president, told a crisis Brics meeting on Gaza as he attempted to woo leaders of the global south.\nThe virtual meeting of 11 nations, convened by South ... [5404 chars]",
        "url": "https://www.theguardian.com/world/2023/nov/21/us-has-wrecked-chances-of-peace-in-middle-east-putin-tells-brics-summit",
        "image": "https://i.guim.co.uk/img/media/de5f470313dbfd588b3333c85140732c1d18a123/0_286_4518_2711/master/4518.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=88f9cfebf4da3b68d50396b3a39fd2c1",
        "publishedAt": "2023-11-21T18:24:03Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "US unilateralism has wrecked the chances of peace in the Middle East, Vladimir Putin, the Russian president, told a crisis Brics meeting on Gaza as he attempted to woo leaders of the global south.\n\nThe virtual meeting of 11 nations, convened by South Africa’s president, Cyril Ramaphosa, came as Arab foreign ministers toured capitals to drum up support for a fresh UN security council resolution mandating Israel to introduce a full ceasefire and end what they say are breaches of international humanitarian law.\n\nThe moves are the latest sign of a revolt brewing among global south nations about US double standards in refusing to do more to stop the Israeli bombardment of Gaza, which so far has claimed more than 13,000 civilian lives, according to the Palestinian health ministry.\n\nThe UN security council last week made a call, not amounting to an instruction, for Israel to accept humanitarian pauses, but the Arab foreign ministers want a firmer resolution and are prepared to challenge the US not to use its veto to protect Israel. It was notable that the Arab foreign ministers, including those not allied to Iran, chose to travel first to China and Moscow to enlist their support.\n\nPutin told the Brics meeting that the US was undermining the chances of peace by trying to monopolise diplomacy in its own self-interest. He said that “the deaths of thousands of people, the mass displacement of civilians and the humanitarian catastrophe that has unfolded are deeply disturbing”.\n\nHe added: “Due to the sabotage of UN efforts, more than one generation of Palestinians are being brought up with a sense of unfairness to their state while the Israeli people cannot fully guarantee their own security.”\n\nPutin accused the US of sidelining other members of the Middle East Quartet – a group seeking to navigate the Israeli-Palestinian peace process that also includes Russia, the UN, and the EU. Washington had attempted to “monopolise the role of the mediator” while blocking the efforts of other international actors, he said. “History has vividly demonstrated that attempts to single-handedly cut the Palestinian knot are not viable and counterproductive.”\n\nOther countries attending the meeting include Brazil, India, China, Iran, Saudi Arabia and the United Arab Emirates, reflecting how the expanded Brics group is now a strong rival to the western G7 group of leading industrialised nations.\n\nThe Chinese president, Xi Jinping, added his voice to the call for a ceasefire in Gaza, telling the summit: “All parties in the conflicts should immediately cease fire and hostilities, stop all violence and attacks targeting civilians, and release civilian detainees to avoid more loss of lives and suffering.”\n\nXi said: “The root cause of the Palestinian-Israeli situation is the fact that the right of the Palestinian people to statehood, their right to existence, and their right of return have long been ignored.”\n\nHowever, the eventual joint statement was relatively mild and called only for Israel to comply with international humanitarian law and accept “full, immediate, safe, unhindered and sustained humanitarian access”. It also warned Israel not to attempt to displace Palestinans from Gaza.\n\nThe Biden administration has been repeatedly told, including by its own diplomats, that it risks losing the support of the global south nations. Many of them accuse the US of double standards in condemning Russian war crimes in Ukraine while remaining largely silent on Israel’s actions in Gaza.\n\nOpening the Brics meeting, Ramaphosa accused Israel of committing war crimes that were tantamount to genocide and collective punishment. “The collective punishment of Palestinian civilians through the unlawful use of force by Israel is a war crime,” Ramaphosa said. “The deliberate denial of medicine, fuel, food and water to the residents of Gaza is tantamount to genocide.”\n\nIran’s president, Ebrahim Raisi, called on the security council to adopt a binding resolution in the UN general assembly to stop attacks on Gaza and to label Israel as a terrorist regime and its army as a terrorist organisation. He called for the US to be held to account and urged the world to recognise the right of Palestinians to self-defence, a phrase that would absolve Hamas for its October attacks on Israel.\n\nMohammed bin Salman, the Saudi crown prince, criticised the killing of innocent civilians and the destruction of health facilities and places of worship.\n\nThe Indian prime minister, Narenda Modi, did not attend.\n\nThe Brics meeting comes before a virtual meeting on Wednesday of the wider G20 group of nations, convened by India, that will be attended by Putin.\n\nThe delegation of Arab diplomats is being led by a group appointed by the Organisation of Islamic Cooperation, including the foreign ministers of Jordan, Egypt, Indonesia, Saudi Arabia, Palestine and the secretary general of the Arab League.\n\nThey visited the Chinese foreign minister, Wang Yi, in Beijing on Monday, before travelling to Moscow to meet the Russian foreign minister, Sergei Lavrov.\n\nThe delegation is expected also to visit France and the UK this week.\n\nThe Egyptian foreign ministry said the diplomats had “drafted a new resolution to be submitted to the security council by the Arab and Islamic groups, to deal with existing obstacles and imbalances of humanitarian aid entry to Gaza”.\n\nEgypt’s foreign ministry said it remained convinced that the “continued bombing targeting displaced people in the south had a clear objective, and that was to force Gaza’s residents to leave the strip. Egypt has clearly declared its utter rejection of any attempt to enforce displacement of Palestinians.”"
    },
    {
        "title": "Study: 1.3 million lives lost every year to cancers caused by smoking tobacco across 7 countries",
        "description": "Every year 1.3 million lives are lost to cancers caused by smoking tobacco across the UK, US and BRICS nations (Brazil, Russia, India, China and South Africa), according to a new study, funded by Cancer Research UK.",
        "content": "Every year 1.3 million lives are lost to cancers caused by smoking tobacco across the UK, US and BRICS nations (Brazil, Russia, India, China and South Africa), according to a new study, funded by Cancer Research UK.\nResearchers found that together, t... [6376 chars]",
        "url": "https://www.news-medical.net/news/20231115/Study-13-million-lives-lost-every-year-to-cancers-caused-by-smoking-tobacco-across-7-countries.aspx",
        "image": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Tobacco-620x480.jpg",
        "publishedAt": "2023-11-16T03:05:00Z",
        "source": {
            "name": "News-Medical.net",
            "url": "https://www.news-medical.net"
        },
        "full_content": "Every year 1.3 million lives are lost to cancers caused by smoking tobacco across the UK, US and BRICS nations (Brazil, Russia, India, China and South Africa), according to a new study, funded by Cancer Research UK.\n\nResearchers found that together, the seven countries represented more than half of the global burden of cancer deaths every year. They concluded that smoking, as well as three other preventable risk factors – alcohol, overweight or obesity, and human papillomavirus (HPV) infections caused almost 2 million deaths combined.\n\nThe study, carried out by researchers from the International Agency for Research on Cancer (IARC), Queen Mary University of London (QMUL) and Kings College London, also analysed the years of life lost to cancer.\n\nThis approach allowed researchers to examine whether certain risk factors are causing deaths more prematurely, enabling them to better measure the impact of cancer deaths on society – for example, a cancer death at age 60 will result in more years of life lost than a death at age 80.\n\nResearchers concluded that the four preventable risk factors resulted in over 30 million years of life lost each year. Smoking tobacco had by far the biggest impact - leading to 20.8 million years of life being lost, the study said.\n\nAcross the globe, cancer is increasingly impacting low- and middle-income countries. Cancer Research UK analysis shows that new cancer cases are expected to rise by around 400%, from 0.6 million to 3.1 million per year in low-income countries over the next 50 years. Very-high-income countries like the UK are projected to see an increase of around 50% over the same time period.\n\nThese numbers are staggering, and show that with action on a global scale, millions of lives could be saved from preventable cancers. Action on tobacco would have the biggest impact – smoking causes 150 cases of cancer in the UK every single day. Raising the age of sale here in England is a critical step on the road to creating the first ever smokefree generation, and we call on MPs from all parties to support the legislation. There are cost-effective tools at hand to prevent cases of cancer, which will save lives around the world. Tobacco control measures are chronically underfunded. And as a recognised leader in global health, the UK Government can play a significant role in addressing this.\" Dr Ian Walker, Cancer Research UK's executive director of policy and information\n\nGlobally, cancer is increasingly impacting low- and middle-income countries. Cancer Research UK analysis shows that new cancer cases are expected to rise by around 400%, from 0.6 million to 3.1 million per year in low-income countries over the next 50 years. Very-high-income countries like the UK are projected to see an increase of around 50% over the same time period.\n\nAge standardized mortality rates (per 100,000 people) for each risk factor and how countries compare\n\nThe number of years of life lost to preventable cancers each year was calculated by using the age at which cancer patients died from their disease and the average life expectancy for the general population at that age to estimate how many years are lost to cancer.\n\nThe researchers made the findings, published today in eClinicalMedicine, by collecting population attributable fractions of the four risk factors from previous global studies, and applied these to estimates of cancer deaths during 2020.\n\nSome of the other key findings from the study include:\n\nPreventable risk factors were associated with different cancer types in different places. For example, in India, there were more premature deaths from head and neck cancer in men, and gynaecological cancer in women, but in every other country, tobacco smoking caused the most years of life to be lost to lung cancer.\n\nResearchers believe that this is due to differences in each of the countries – cervical screening is less comprehensive in India and South Africa than in other countries like the UK and US, which would explain why there are more premature deaths from gynaecological cancers due to HPV infection in India and South Africa. The higher number of years of life lost to head and neck cancer in men in India could be explained by smoking habits being different to those in the UK, with the general population smoking different tobacco products.\n\nThere are gender differences in the number of cancer deaths and years of life lost to different risk factors. Men have higher rates of years of life lost to smoking and drinking alcohol, because smoking and drinking rates tend to be higher in men. In China, India and Russia, rates of years of life lost to tobacco smoking and alcohol were up to nine times higher in men than women.\n\nMeanwhile, being overweight or obese, and HPV infection, led to more cancer deaths and years of life lost in women than in men. In South Africa and India, HPV led to particularly high rates of years of life lost with a large gender imbalance. Rates were 60 times higher in women than men in South Africa, and 11 times higher in India, which highlights the urgent need for improved access to cervical screening and the HPV vaccination in these countries.\n\nThe differences in cancers linked to HPV infection are stark - mortality rates are six times higher in South Africa than in the UK and US. Cervical cancer has been largely prevented by screening in the UK and US, and is on track to be almost eliminated through HPV vaccination in the UK.\n\nDr Judith Offman, Senior Lecturer in Cancer Prevention and Early Detection at Queen Mary University of London, who worked on the study while at King's College London, said:\n\n\"Seeing how many years of life are lost to cancer due to these risk factors in countries around the world allows us to see what certain countries are doing well, and what isn't working.\n\n\"Globally, someone dies every two minutes from cervical cancer. 90% of these deaths occur in low- and middle-income countries and could be cut drastically with comprehensive screening and HPV vaccination programmes.\n\n\"We know that HPV vaccination prevents cervical cancer. This, coupled with cervical screening, could eliminate cervical cancer as a public health problem. Countries need to come together on this ambition.\"\n\nIn England, Cancer Research UK is launching its Manifesto for Cancer Care and Research on November 28 to outline how the UK government can transform cancer care and survival in this country, and help other countries around the world save more lives from cancer. The manifesto will provide a blueprint of actionable policies that any political party can adopt to improve outcomes for cancer patients."
    },
    {
        "title": "Will the dollar keep its global dominance? The US needs to get its act together",
        "description": "The American position depends not only on relations with Russia, China and the Brics countries, but on fixing its own economic and political problems",
        "content": "Is the dollar poised to lose its dominance of global economic and financial transactions? Many commentators apparently think so.\nRussia obviously hopes they are right, given that it has been shut out of the US banking system and suspended from the So... [5910 chars]",
        "url": "https://www.theguardian.com/business/2023/sep/11/us-dollar-global-dominance-us-russia-china-brics",
        "image": "https://i.guim.co.uk/img/media/f0aec50e0e383f6ea3d57909087c0da161875346/0_92_4284_2570/master/4284.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=bb09cfb79aae5a648b3cc0211782d7ef",
        "publishedAt": "2023-09-11T13:10:43Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Is the dollar poised to lose its dominance of global economic and financial transactions? Many commentators apparently think so.\n\nRussia obviously hopes they are right, given that it has been shut out of the US banking system and suspended from the Society for Worldwide Interbank Financial Telecommunication (Swift). China evidently wants to help the process along by encouraging countries to undertake transactions in yuan. And the Brazilian president, Luiz Inácio Lula da Silva, has called for the Brics countries (Brazil, Russia, India, China and South Africa) to create a common currency as an alternative to the dollar.\n\nRussia’s shift away from the dollar, which got under way after its illegal annexation of Crimea in 2014, was prompted by the fear – and then the fact – of US sanctions. More than a few commentators have since warned that other countries, witnessing US “weaponisation” of the dollar, will follow the Kremlin’s example.\n\nChina’s yuan internationalisation campaign reflects not only tensions with the US but also a desire to project power internationally, with the drive for economic and financial self-sufficiency reflected in other aspects of Chinese policy as well. The dollar’s singular pre-eminence, in this view, is unlikely to survive a world dominated by two large economies at loggerheads, only one of which benefits from the dollar’s “exorbitant privilege”.\n\nSimilarly, Lula’s common currency campaign reflects the view that the rising power and influence of the Brics can no longer be denied, and that they deserve a seat at the top monetary table, whether the US agrees or not.\n\nHistory confirms that international currency status can be lost\n\nSo, do these global geopolitical developments augur the end of dollar dominance? History – at least 20th-century history – suggests not. To be sure, this history confirms that international currency status can be lost. But whether that happens depends on the actions of the issuing country, not simply on geopolitical circumstances beyond its control.\n\nTo a significant extent, the 20th-century history of global currency status is a history of the British pound sterling, the leading global currency of the preceding century. Britain emerged from the first world war economically and financially weakened. It had lost skilled manpower, sold off assets to finance the war effort and faced intense competition from other economies.\n\nImportantly, Britain had incurred a public debt on the order of 130% of GDP, which was six times prewar levels. That raised questions about whether the country would maintain the value of its obligations or, alternatively, inflate them away, as Germany, France and Italy eventually did.\n\nYet even though the dollar had emerged as a competitor by the early 1920s, sterling’s international status was successfully maintained. A decision was taken by the then chancellor of the exchequer, Winston Churchill, with broad support from the political class, to focus on this objective. Prices were pushed back down toward prewar levels, permitting earlier exchange rates against gold and the dollar to be restored. Painful steps were considered, and in some cases taken, to limit public spending.\n\nThese policies came at a cost to British competitiveness and hence to output and employment. But this sacrifice was accepted in the interest of reestablishing sterling’s role in the global economy – a goal that financial leaders regarded as being in their self-interest, and that imperialists saw as necessary for maintaining Britain’s geopolitical reach. As a result, the currency’s international role survived even the turbulent 1930s, when it remained the pivot of the sterling area, the British-led currency zone.\n\nThe UK emerged from the second world war even more heavily indebted. In addition, it now had an overriding commitment to full employment, implying very different policies toward sterling. The currency was devalued in 1949 in an effort to reconcile demand stimulus and full employment with external balance. The disorderly liquidation of sterling balances by other central banks and governments was prevented with exchange controls and commercial threats.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe shift away from sterling was already well under way in the aftermath of second world war\n\nSuch measures were antithetical to international currency status. Contrary to the textbook view of ongoing competition between sterling and the dollar, scholars such as Maylis Avaro show that the shift away from sterling was already well under way in the aftermath of second world war.\n\nAt this point, geopolitics intervened. When the UK participated in an invasion of Egypt in 1956 to seize control of the Suez Canal and sterling crashed, Dwight Eisenhower’s administration refused to help until Britain withdrew its forces. This diminished sterling’s global stature once and for all. But these geopolitical events only validated a decline and fall that was already a fait accompli.\n\nThe fundamental lesson, then, is that the issuer of an incumbent international currency has it within its power to defend or neglect that status. Thus, whether the dollar retains its global role will depend not simply on US relations with Russia, China or the Brics. Rather, it will hinge on whether the US brings its soaring debts under control, avoids another unproductive debt-ceiling showdown, and gets its economic and political act together more generally.\n\nBarry Eichengreen is professor of economics at the University of California, Berkeley, and a former senior policy adviser at the IMF.\n\n© Project Syndicate"
    },
    {
        "title": "Could Brics Plus reshape the world economy?",
        "description": "Saudi Arabia and Iran are among six new members to join the alliance.",
        "content": "Chinese President Xi Jinping with Brazil's former President Michel Temer meeting in 2017. Brazil and China are original members of the Brics. Photo by Lintao Zhang/Pool/Getty Images.\nIn 2001, when Chinese economic output was worth around $1.3trn (les... [7567 chars]",
        "url": "https://www.newstatesman.com/spotlight/economic-growth/economic-policy/2023/09/brics-plus-reshape-world-economy",
        "image": "https://dl6pgk4f88hky.cloudfront.net/2023/09/01/GettyImages-841517496-800x418.jpg?1693773782",
        "publishedAt": "2023-09-01T11:30:02Z",
        "source": {
            "name": "New Statesman",
            "url": "https://www.newstatesman.com"
        },
        "full_content": "Chinese President Xi Jinping with Brazil's former President Michel Temer meeting in 2017. Brazil and China are original members of the Brics. Photo by Lintao Zhang/Pool/Getty Images.\n\nIn 2001, when Chinese economic output was worth around $1.3trn (less than the UK’s GDP), the Goldman Sachs economist Jim O’Neill wrote a briefing note: Building Better Economic Brics. In it, he predicted the growing importance of emerging markets in Brazil, Russia, India and China (South Africa was added in later). Today, Chinese economic output is worth around $18trn, or about five and a half times the size of UK GDP. Now, as China’s economy slows, India is outpacing it with phenomenal rates of growth (around 7.8 per cent in this year’s April-June quarter).\n\nIn 2009, the Brics went from being a handy acronym to a formal organisation. Last week, they announced the admission of six new members: Iran, Saudi Arabia, Egypt, Ethiopia, Argentina and the United Arab Emirates. The move was heralded as “historic” by the Chinese premier Xi Jinping. Some even declared it the beginnings of a “Brics world order”.\n\nO’Neill, for one, is unconvinced. Speaking to Spotlight‘s Green Transition newsletter, the former Treasury minister said: “I don’t think [the Brics] have really achieved much in their first 14 years as a political entity.” Nor is he optimistic about the expanded set of members: “I don’t really see the purpose beyond symbolism.”\n\nIn the organisation’s joint declaration, the Brics+ (as it is now called) promised “multilateral cooperation” to ensure “a just, affordable and sustainable transition to a low carbon and low-emission economy”. Eyebrows were raised at the inclusion of Saudi Arabia and UAE in the new members’ list. The Brics+ now encompasses 45 per cent of the world’s oil production.\n\nThere are few concrete policy proposals between the members – this isn’t a free-trade agreement like Nafta, or a transnational common currency bloc like the eurozone, nor is it a military alliance like Nato. There’s no cross-governmental agreement on topics such as climate change, either. The choice of new members is odd too, O’Neill adds, because they don’t share common characteristics other than wanting to join.\n\nBut even the original members are less than united on many issues. “India and China rarely agree about anything,” says O’Neill. More appropriate candidates like Indonesia are biding their time before being seen to join what some are billing as an anti-Western alliance (a reputation enhanced by the inclusion of Iran as a new member, as well as the reluctance of the Brics to toe the Western line on the Ukraine conflict). “[The expansion] suggests that China and Russia had a bigger say on the choice of countries than India or Brazil,” O’Neill tells me. “Because if you look at the six [that have joined], arguably, there’s only one of them that’s a democracy.”\n\nBut the Brics expansion does have consequences, even if they are symbolic. The US is consciously attempting to “decouple” its economy from China’s. O’Neill points me towards figures suggesting that “decoupling” is reducing trade with China while upping trade with third countries, which themselves are trading more with China. This makes the trade adjustment less a “decouple” and more of an increasingly polygamous arrangement. Part of that process began with Trump’s protectionist tariffs, but much is centred around the big-ticket industrial strategy policies of the Biden administration, including the Inflation Reduction Act.\n\nSubscribe to The New Statesman today from only £8.99 per month Subscribe\n\nThere’s just one problem: China currently controls the supply chain for key green industries that the Inflation Reduction Act subsidises in the billions of dollars. Research by the Centre for Strategic and International Studies shows that Beijing controls 53 per cent of the raw materials, 89 per cent of the components and 70 per cent of the production and manufacturing capacity for solar. For wind energy, its share is 54 per cent, 56 per cent, and 23 per cent, respectively. Its control over the lithium-ion battery market (essential for electric vehicles), has been estimated as high as 80 per cent, and the country is now the world’s number one electric vehicle exporter.\n\nIf the Brics expansion is partly about sometimes oil-rich nations placing their bets with the Chinese, even if initially only symbolically, then they could do worse than siding with the principal technological and financing leader for the green transition. The group will likely continue trading in fossil fuels for as long as it sees fit – but when it comes to intensifying trade wars and geopolitical standoffs, it is less likely to side with the US hegemon than ever before.\n\nThis article was originally published on the Green Transition newsletter. To see previous newsletters and subscribe, click here.\n\n[See also: The age of hyper-globalisation is ending]"
    },
    {
        "title": "Brazil: the world will not be the same after BRICS expansion, says president",
        "description": "Brazilian President Luiz Inacio Lula da Silva has said that the world with its different blocs and powers “will not be the same after the ...",
        "content": "Brazilian President Luiz Inacio Lula da Silva has said that the world with its different blocs and powers “will not be the same after the expansion of the BRICS group” during the recent South African summit. President da Silva, otherwise known simply... [1070 chars]",
        "url": "https://www.middleeastmonitor.com/20230830-brazil-the-world-will-not-be-the-same-after-brics-expansion-says-president/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/AA-20230824-31989849-31989848-15TH_BRICS_LEADERS_SUMMIT_IN_S_AFRICA.jpg",
        "publishedAt": "2023-08-30T12:39:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230830-brazil-the-world-will-not-be-the-same-after-brics-expansion-says-president/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230830-brazil-the-world-will-not-be-the-same-after-brics-expansion-says-president/"
    },
    {
        "title": "When the torturer is the ‘saviour’, can BRICS and the Global South help us to escape Western hegemony?",
        "description": "At the zenith of the mass protests in Egypt on 25 January 2011, Twitter, Facebook and other social media platforms based in the West appeare...",
        "content": "At the zenith of the mass protests in Egypt on 25 January 2011, Twitter, Facebook and other social media platforms based in the West appeared to be the most essential tools for the Egyptian Revolution. Although some observers later contested the desc... [9833 chars]",
        "url": "https://www.middleeastmonitor.com/20230829-when-the-torturer-is-the-saviour-can-brics-and-the-global-south-help-us-to-escape-western-hegemony/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/AA-20230824-31988317-31988316-15TH_BRICS_LEADERS_SUMMIT_IN_S_AFRICA.jpg",
        "publishedAt": "2023-08-29T14:55:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230829-when-the-torturer-is-the-saviour-can-brics-and-the-global-south-help-us-to-escape-western-hegemony/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230829-when-the-torturer-is-the-saviour-can-brics-and-the-global-south-help-us-to-escape-western-hegemony/"
    },
    {
        "title": "The Guardian view on Brics: demand for membership is a symptom of global disorder",
        "description": "Editorial: As the world grows more fractured, developing countries are looking for new coalitions to stay out of a possible cold war",
        "content": "The last decade of annual summits held by Brazil, Russia, India, China and South Africa (Brics) has rarely merited much attention beyond their own capitals. But last week’s conference in Johannesburg, South Africa, is likely to be remembered as a tur... [3218 chars]",
        "url": "https://www.theguardian.com/commentisfree/2023/aug/28/the-guardian-view-on-brics-demand-for-membership-is-a-symptom-of-global-disorder",
        "image": "https://i.guim.co.uk/img/media/587bd252fb94ef3d1add0d71fa16accf9544bbe7/392_629_3011_1806/master/3011.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=bb7b478d3e43c961e463e80454cadcf5",
        "publishedAt": "2023-08-28T18:09:37Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The last decade of annual summits held by Brazil, Russia, India, China and South Africa (Brics) has rarely merited much attention beyond their own capitals. But last week’s conference in Johannesburg, South Africa, is likely to be remembered as a turning point in modern history – with six large nations joining the current five members. A few dozen more states wish to sign up. But the club’s popularity is not a sign that an anti-western bloc is coalescing. “Brics-11” contains two US allies: Saudi Arabia and the United Arab Emirates. Rather, demand for Brics membership looks more like an expression of concern at the way in which global disorder is growing.\n\nAs the world grows more fractured, developing countries are stressing self-reliance and looking for new coalitions to keep their options open. What unites the Brics-11 nations is their view of geopolitics. Since Russia’s invasion of Ukraine, the transatlantic alliance has consolidated, and Moscow and Beijing have drawn closer. Brics members see the world moving towards a cold war-type mentality between a US-led coalition of democracies and a rival grouping of autocracies. This is not something that the leaders in many middle-order countries desire. Few would welcome a situation that constrains their political and economic freedom of action, as happened during the decades of Soviet-American rivalry.\n\nDeveloping countries prize the bargaining power to gain better trade, technology and weapons deals. No doubt countries such as Argentina and Iran see Brics membership as a way to access Chinese investment. The club’s original members had two things in common: they were large economies with high potential growth rates. The addition of South Africa in 2010 did suggest that the club was interested in recasting the power structures of the international system. But the US alone had the same nominal GDP as the Brics countries in 2022. Perhaps Brics’ most tangible achievement has been the New Development Bank – an institution that has approved almost $33bn of loans mainly for infrastructure projects since 2015.\n\nGiven that Brics operates on consensus, its 26-page Johannesburg declaration is a triumph of drafting rather than diplomacy. Where Brics members agree, for example on Syria and Libya, they make a collective pronouncement, and where they have diverging positions – such as on Ukraine – they do not. Getting agreement on a common currency across such a diverse grouping would dwarf the kind of problems encountered so far, rendering such an idea a pipe dream. The next big international jamboree is the annual meeting of the G20, the group that contains most of the world’s largest economies, and will be held in India in September. Just as with the Brics meeting, Russia’s Vladimir Putin will not attend the G20 summit, although he did address Brics leaders by video link.\n\nLast year, Indonesia chaired the G20 and argued successfully that global food security was within the summit’s remit, opening the door to condemnation of Russian belligerence. Mr Putin has been described as “the apostle of payback”. By sticking to its guns, Indonesia probably waved goodbye to Brics membership this year. China and Russia are still attempting to block censure by the G20 of the Ukraine invasion. An old order is disappearing and a new one is struggling to be born. It is gut-wrenching that this process will mean Mr Putin will be able to dominate the next Brics summit – as he will be its host."
    },
    {
        "title": "In a multipolar world the dollar’s dominance won’t last forever",
        "description": "While we shouldn’t read too much into the Brics expansion, the geopolitical landscape is shifting",
        "content": "Two big international gatherings took place last week. The one that was held in the Rocky Mountain resort of Jackson Hole was a demonstration of the grip the US has on the global economy. The one that was held in Johannesburg was evidence of the chal... [6063 chars]",
        "url": "https://www.theguardian.com/business/2023/aug/27/multipolar-world-dollars-dominance-wont-last-forever-brics",
        "image": "https://i.guim.co.uk/img/media/1388eec0053dee543d1aff7c21d21d7b0e07a044/0_167_2500_1500/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=2d31fa4bda0dc2753f523a2e31a2c90a",
        "publishedAt": "2023-08-27T09:39:42Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Two big international gatherings took place last week. The one that was held in the Rocky Mountain resort of Jackson Hole was a demonstration of the grip the US has on the global economy. The one that was held in Johannesburg was evidence of the challenge posed to America from the leading emerging market countries.\n\nLet’s start with Jackson Hole, where Jerome Powell took centre stage. What the head of America’s central bank had to say about interest rates clearly mattered for the US, where the economy has so far emerged relatively unscathed from the severest tightening of policy in four decades. The message was that the battle against inflation was not over and further increases in interest rates were possible.\n\nBut, by virtue of the dollar’s position as the world’s principal reserve currency, what Powell and his colleagues at the Federal Reserve do in the coming months affects life well beyond America’s shores. Commodities such as oil are priced in dollars. Countries that borrow in dollars can see their repayments soar if the US currency rises in value. Countries that run current-account surpluses use the proceeds to buy US Treasury bonds, enabling the US to run massive trade and budget deficits.\n\nThere is nothing new in this. It is the way the international financial system has operated since the second world war. Unsurprisingly, Washington wants the status quo to continue because it allows the US to fund its twin deficits without needing to take the tough deflationary action that would be demanded of less privileged countries.\n\nEqually unsurprisingly, the US’s financial hegemony is not universally popular. One of the motivations for the creation of the euro was that a European single currency would be a rival reserve currency to the dollar. Last week’s gathering in Johannesburg of the Brics – Brazil, Russia, India, China and South Africa – was another attempt to mount a challenge to the US-dominated international order.\n\nThere are a number of reasons for this. Looked at from the perspective of a developing country, the way the global economy is run looks like a stitch-up. The US and its western allies have controlled the International Monetary Fund and the World Bank since they were founded in 1944, to the extent that every IMF managing director has been a European and every World Bank president an American. By virtue of their permanent seats on the UN security council, the US, Britain and France can veto any initiatives they don’t like. Between them, the US and the EU can prevent the leading developing nations exerting any real influence at the World Trade Organization.\n\nWhat’s more, it is clear that this is not the unipolar world that policymakers in the US envisaged after the break-up of the Soviet Union. China has emerged as a genuine rival, and has been successfully expanding its sphere of influence. One illustration of this is a global map produced by the consultancy Capital Economics that divides the world into countries that are strongly aligned or lean towards either the US or China. Outside the rich, developed nations of North America, Europe, Japan and Australasia, there are few countries strongly aligned with the US, and the only emerging economies of note leaning towards Washington are India and Vietnam.\n\nBy contrast, most of Africa is seen as aligned or leaning towards China, as is most of Asia and a significant chunk of South America.\n\nIs this that much of a shock? Not really. The Brics have their own bank, which, in contrast to the strict conditions demanded by the IMF and the World Bank, offers loans on a no-strings attached basis. The selfish behaviour of the G7 countries – the US, the UK, Germany, France, Italy, Japan and Canada – when they hoarded vaccines during the Covid-19 crisis was not exactly conducive to winning friends in the emerging world.\n\nThe shift in the geopolitical landscape was demonstrated by the countries invited to join the Brics club at last week’s summit: three were oil producers (Saudi Arabia, Iran and the UAE); two were from Africa (Egypt and Ethiopia) and one (Argentina) was from South America.\n\nIt would be unwise to read too much into the Brics expansion. There are tensions between China and India, and between Saudi Arabia and Iran, while South Africa is eager to maintain good relations with the west. Like the G7, the Brics summits are essentially talkfests, where little of substance is decided. Having 11 members rather than five increases the chances of disagreement. Talk of a common Brics currency is for the birds.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWhat’s more, it will take years – perhaps decades – for the Brics to create a financial infrastructure similar to that which supports the dollar. Crucially, investors would need to be as willing to hold bonds denominated in a non-dollar currency as they are to hold US Treasury bonds. The dollar’s dominance is not under immediate threat.\n\nBut that might not always been the case. Saudi Arabia’s decision to join the Brics also poses a threat to the dollar’s dominance. The oil-rich kingdom has traditionally been a reliable US ally in the Middle East but relations between Washington and Riyadh have recently cooled markedly. The expectation is that the Saudis will increasingly accept payment for oil from other Brics members in their own currencies.\n\nThe US Treasury secretary, Janet Yellen, has expressed concerns about the long-term consequences of using financial sanctions as a tool of American foreign policy, saying there was a risk “over time it could undermine the hegemony of the dollar”.\n\nYellen is right to be worried. A single, all-powerful reserve currency sits oddly with a multipolar world. It won’t happen overnight but a challenge to the dollar is coming."
    },
    {
        "title": "Egypt hopes BRICS entry will lure foreign cash, but analysts counsel patience",
        "description": "Egypt hopes its imminent inclusion in the BRICS bloc of developing nations will help ease its shortage of foreign currency and attract new i...",
        "content": "Egypt hopes its imminent inclusion in the BRICS bloc of developing nations will help ease its shortage of foreign currency and attract new investment, but analysts say it may take time before any benefits appear, Reuters reports.\nThe bloc, which incl... [2577 chars]",
        "url": "https://www.middleeastmonitor.com/20230825-egypt-hopes-brics-entry-will-lure-foreign-cash-but-analysts-counsel-patience/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/GettyImages-842691596-scaled-e1692983310589.jpg",
        "publishedAt": "2023-08-25T18:09:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230825-egypt-hopes-brics-entry-will-lure-foreign-cash-but-analysts-counsel-patience/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230825-egypt-hopes-brics-entry-will-lure-foreign-cash-but-analysts-counsel-patience/"
    },
    {
        "title": "BRICS welcomes new members in push to reshuffle world order",
        "description": "The BRICS bloc of developing nations agreed, on Thursday, to admit Saudi Arabia, Iran, Ethiopia, Egypt, Argentina and the United Arab Emirat...",
        "content": "The BRICS bloc of developing nations agreed, on Thursday, to admit Saudi Arabia, Iran, Ethiopia, Egypt, Argentina and the United Arab Emirates in a move aimed at accelerating its push to reshuffle a world order it sees as outdated.\nThe group’s leader... [4786 chars]",
        "url": "https://www.middleeastmonitor.com/20230824-brics-welcomes-new-members-in-push-to-reshuffle-world-order/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/AA-20230822-31973598-31973597-15TH_BRICS_SUMMIT_IN_SOUTH_AFRICA.jpg",
        "publishedAt": "2023-08-24T17:48:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230824-brics-welcomes-new-members-in-push-to-reshuffle-world-order/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230824-brics-welcomes-new-members-in-push-to-reshuffle-world-order/"
    },
    {
        "title": "UAE President hails BRICS membership",
        "description": "United Arab Emirates (UAE) President, Sheikh Mohammed bin Zayed, on Thursday, welcomed the Gulf Kingdom’s inclusion in BRICS, a bloc o...",
        "content": "United Arab Emirates (UAE) President, Sheikh Mohammed bin Zayed, on Thursday, welcomed the Gulf Kingdom’s inclusion in BRICS, a bloc of emerging economies, Anadolu Agency reports.\n“We respect the vision of the BRICS leadership and appreciate the incl... [676 chars]",
        "url": "https://www.middleeastmonitor.com/20230824-uae-president-hails-brics-membership/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/AA-20230822-31973944-31973942-15TH_BRICS_SUMMIT_IN_SOUTH_AFRICA.jpg",
        "publishedAt": "2023-08-24T13:19:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230824-uae-president-hails-brics-membership/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230824-uae-president-hails-brics-membership/"
    },
    {
        "title": "BRICS invites 6 new members including UAE, Iran, Saudi Arabia",
        "description": "The BRICS alliance invited six countries to join, including the UAE, Saudi Arabia, Iran, Ethiopia, Argentina and Egypt. BRICS is currently m...",
        "content": "The BRICS alliance invited six countries to join, including the UAE, Saudi Arabia, Iran, Ethiopia, Argentina and Egypt.\nBRICS is currently made up of five countries – Brazil, Russia, India, China and South Africa. The new members would be brought in ... [1557 chars]",
        "url": "https://www.middleeastmonitor.com/20230824-brics-invites-6-new-members-including-uae-iran-saudi-arabia/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/GettyImages-1619742914-scaled-e1692874935260.jpg",
        "publishedAt": "2023-08-24T12:02:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230824-brics-invites-6-new-members-including-uae-iran-saudi-arabia/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230824-brics-invites-6-new-members-including-uae-iran-saudi-arabia/"
    },
    {
        "title": "Brics to admit six new countries to bloc including Iran and Saudi Arabia",
        "description": "Argentina, Ethiopia, Egypt and UAE also to join club of large emerging economies in major expansion",
        "content": "The five Brics nations – Brazil, Russia, India, China and South Africa – have announced the admission of six new countries from next year as the club of large and populous emerging economies seeks to reshape the global order.\nArgentina, Ethiopia, Ira... [2544 chars]",
        "url": "https://www.theguardian.com/business/2023/aug/24/five-brics-nations-announce-admission-of-six-new-countries-to-bloc",
        "image": "https://i.guim.co.uk/img/media/2f784a93b0a3d0e44e075b7983b2904a30acffe8/0_130_2943_1766/master/2943.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=08802528c9a2f917cb08cf9a560f8ca2",
        "publishedAt": "2023-08-24T09:48:09Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "The Brics group of big emerging economies has announced the admission of six new members, in an attempt to reshape the global world order and provide a counterweight to the US and its allies.\n\nFrom the beginning of next year, Iran, Saudi Arabia, Egypt, Argentina, the UAE and Ethiopia will join the current five members – Brazil, Russia, India, China and South Africa – it was announced at a summit in Johannesburg on Thursday.\n\nChina’s president, Xi Jinping, described the expansion as “historic”. He had been the leading proponent of the admission of new members, presenting an enlarged Brics as a way for the global south to have a stronger voice in world affairs.\n\nIt is unclear, however, how the expansion would significantly enhance the group’s clout on the global stage. That would depend on how far it will be able to act in unison, analysts said, and the group of new members has made it even more disparate, a mix of powerful autocracies with middle-income and developing democracies.\n\n“It’s not entirely clear what the newest Brics members will have to gain from their membership in the bloc,” Margaret Myers, the director of the Asia and Latin America programme at the Inter-American Dialogue. “For the moment, at least, this move is more symbolic than anything – it’s an indication of wide-ranging global south support for a recalibration of the global order.”\n\nVladimir Putin did not attend the three-day summit in person, as he faces an arrest warrant for war crimes in Ukraine issued by the international criminal court, but the Brics enlargement represents a symbolic boost for him, as he fights a US-led effort to isolate his regime to force a withdrawal and an end to the war.\n\nThe decision to admit Iran, also looking for a way to sidestep sanctions, represented a win for Putin and Xi, helping give the group a more anti-western, non-democratic tinge. They prevailed over the more cautious approach of the other members, who prefer to portray the group as non-aligned.\n\nFor Argentina, facing dire economic problems, membership represents a potential lifeline to escape from the deepening crisis. Its president, Alberto Fernández, said it represented a “new scenario” for the country.\n\n“We open up our possibilities of joining new markets, of consolidating existing markets, of raising investment coming in, of creating jobs and raising imports,” Fernandez said.\n\nEthiopia became the only low-income country in the group. Its prime minister, Abiy Ahmed, described it as “a great moment” for his country.\n\nNearly two dozen countries had formally applied to join the group, but there had to be consensus among its existing five members for candidate countries to be admitted.\n\nSouth Africa’s president, Cyril Ramaphosa, said the members had agreed on “the guiding principles, standards, criteria and procedures of the Brics expansion process”. Those criteria were not explained, however. Indonesia, for example, with a population of 274 million and a powerful force in Asia, applied to join but was not admitted.\n\n“For China and Russia, this is a win. They have been pushing for this for five plus years now,” said Ryan Berg, the head of the Americas programme at the Centre for Strategic and International Studies. “For China, it allows them to continue to build what they hope is a Beijing-centric order. For Russia, who is hosting it next year, it sees this as a tremendous opportunity in its current moment of significant isolation.”\n\n“If you’re Brazil, or if you’re India, you’re less enthusiastic about expansion, even though they’re rhetorically committed to it, because it dilutes the power of your membership in an organisation that includes global power like China,” Berg said.\n\nThere is not likely to be an immediate economic benefit from membership for members, who already have extensive bilateral ties with China. The group’s New Development Bank is still relatively small. But Myers said that although the move is largely symbolic that does not mean it is unimportant.\n\n“This is significant, and shouldn’t be dismissed by G7 and other global north actors,” she argued. “With these new members – especially the major oil producing ones – on board, the Brics configuration represents a much more significant share of the global economy and global population.”"
    },
    {
        "title": "BRICS agrees on group expansion mechanisms",
        "description": "The BRICS group of nations has adopted a document that sets out guidelines and principles for the group’s expansion, South Africa’s Fore...",
        "content": "The BRICS group of nations has adopted a document that sets out guidelines and principles for the group’s expansion, South Africa’s Foreign Minister Naledi Pandor said yesterday according to Reuters.\nEstablishing a framework and criteria for admittin... [1244 chars]",
        "url": "https://www.middleeastmonitor.com/20230824-brics-agrees-on-group-expansion-mechanisms/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/AA-20230822-31973944-31973940-15TH_BRICS_SUMMIT_IN_SOUTH_AFRICA-e1692865237604.jpg",
        "publishedAt": "2023-08-24T09:20:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230824-brics-agrees-on-group-expansion-mechanisms/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230824-brics-agrees-on-group-expansion-mechanisms/"
    },
    {
        "title": "Putin defends invasion of Ukraine in Brics summit address",
        "description": "Russian president seeks to rally leaders meeting in South Africa to Moscow’s side by blaming west",
        "content": "Vladimir Putin has defended Russia’s invasion of Ukraine and sought to rally leaders of the Brics nations meeting in South Africa to the Kremlin’s side.\nIn a prerecorded video message aired on Tuesday to the leaders of Brazil, India, China and South ... [4264 chars]",
        "url": "https://www.theguardian.com/world/2023/aug/23/putin-defend-russian-invasion-ukraine-brics-summit-south-africa",
        "image": "https://i.guim.co.uk/img/media/0ffabfdc6ca282346ba0b88c7d990fe2aa7d299d/0_193_4736_2841/master/4736.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=720558590fe9dc93d93fa494eaefc55a",
        "publishedAt": "2023-08-23T14:37:35Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin has defended Russia’s invasion of Ukraine and sought to rally leaders of the Brics nations meeting in South Africa to the Kremlin’s side.\n\nIn a prerecorded video message aired on Tuesday to the leaders of Brazil, India, China and South Africa, Putin repeated his earlier unfounded claims that the west was responsible for the war in Ukraine.\n\n“Our actions in Ukraine are dictated by only one thing – to end the war that was unleashed by the west and its satellites against the people who live in the Donbas,” Putin said, referring to the eastern part of Ukraine where Russian proxies have been fighting the Ukrainian army since 2014.\n\n“I want to note that it was the desire to maintain their hegemony in the world, the desire of some countries to maintain this hegemony that led to the severe crisis in Ukraine,” he added.\n\nPutin was the only leader of the five-nation Brics summit not to attend in person and spoke instead by video because he faces an arrest warrant for war crimes issued by the international criminal court (ICC).\n\nIn the run-up to the summit, South Africa, which was party to the treaty that created the ICC and would have been obliged to arrest Putin if he had travelled there, had asked the Russian leader to stay away.\n\nThe Russian president also accused the west of sabotaging the Black Sea grain deal that his country exited last month.\n\nThe grain deal proved key for stabilising global food price, a topic of serious concern to many developing countries, including those in the bloc.\n\nThe South African president, Cyril Ramaphosa, who earlier in the summer presented Putin with an African peace plan to end the war in Ukraine, said in response to the Russian president’s speech that Brics members would continue to support efforts to bring the conflict to an end. Ramaphosa also called for the resumption of the grain deal.\n\nThe Brics countries represent about 40% of the world’s population and a quarter of global GDP, but the group is considering expansion. Leaders from more than 40 countries, largely from Africa and elsewhere in the global south, flew in for the three-day summit in Johannesburg alongside Brazil’s Luiz Inácio Lula da Silva, China’s Xi Jinping and Narendra Modi of India.\n\nAccording to the South African organisers, many of those countries have expressed interest in joining – though there had been divisions among the Brics leaders over how many and how quickly. South Africa’s foreign minister, Naledi Pandor, on Wednesday said an agreement had been made on expansion and a more detailed announcement would follow before the end of the summit.\n\n“We have agreed on the matter of expansion,” she told Ubuntu Radio, a station run by South Africa’s foreign ministry. “We have a document that we’ve adopted which sets out guidelines and principles, processes for considering countries that wish to become members of Brics ... That’s very positive.”\n\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nHowever, analysts have questioned Putin’s assertion that the Brics bloc will soon grow to represent the “global majority”.\n\n“Even if other countries are ultimately welcomed to the new group, it remains unlikely that this will be a genuine challenge to the international order,” said Maximilian Hess, a fellow at the Foreign Policy Research Institute thinktank and a political risks consultant based in London.\n\n“That is because none of the Brics countries except for Russia seek a direct confrontation with America and its allies. Given the perilous state many Brics economies currently find themselves in, antagonising Washington risks adding fuel to the fire,” Hess added.\n\nIn a clear sign the bloc’s members are wary of the fallout from Russia’s war in Ukraine, its flagship New Development Bank (NDB) has suspended all operations in Moscow out of fear of having sanctions imposed by the west. The Brics nations set up the NDB in 2015 as a counterweight to US-dominated financial institutions such as the World Bank."
    },
    {
        "title": "Can BRICS challenge the Western order?",
        "description": "An enduring quote from Shakespeare’s Hamlet encapsulates a conflictual tension between reality and uncertainty: “We know what we...",
        "content": "An enduring quote from Shakespeare’s Hamlet encapsulates a conflictual tension between reality and uncertainty: “We know what we are, but know not what we may be.” These words gain even more currency in today’s discussions surrounding the organisatio... [5935 chars]",
        "url": "https://www.middleeastmonitor.com/20230823-can-brics-challenge-the-western-order/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/08/GettyImages-1618781942-scaled-e1692797491544.jpg",
        "publishedAt": "2023-08-23T14:32:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230823-can-brics-challenge-the-western-order/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230823-can-brics-challenge-the-western-order/"
    },
    {
        "title": "Xi Jinping unexpectedly pulls out of BRICS summit speech in 'extraordinary' move",
        "description": "The Chinese leader has flown out to South Africa for the summit but asked his commerce minister to read out his remarks.",
        "content": "Chinese President Xi Jinping unexpectedly pulled out of delivering a speech at the BRICS summit in South Africa - leading to speculation he might be unwell.\nThe Chinese leader was in Johannesburg for the business forum but asked his commerce minister... [3492 chars]",
        "url": "https://news.sky.com/story/xi-jinping-unexpectedly-pulls-out-of-brics-summit-speech-in-extraordinary-move-12945564",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-brics-summit-xi-jinping_6259776.jpg?20230823085311",
        "publishedAt": "2023-08-23T08:42:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Chinese President Xi Jinping unexpectedly pulled out of delivering a speech at the BRICS summit in South Africa - leading to speculation he might be unwell.\n\nThe Chinese leader was in Johannesburg for the business forum but asked his commerce minister Wang Wentao to deliver the remarks instead.\n\nThe unusual move has sparked speculation that something was \"amiss\" but it is unlikely the Chinese government will provide an explanation.\n\nImage: Chinese President Xi Jinping, second from left, with other world leaders at the BRICS summit. Pic: AP\n\nThe president's speech brought an air of confrontation to the summit in Johannesburg.\n\nIn a thinly-veiled swipe at the United States, Mr Wang said \"some country, obsessed with maintaining its hegemony, has gone out of its way to cripple the emerging markets and developing countries\".\n\n\n\n\"Whoever is developing fast becomes its target of containment. Whoever is catching up, becomes its target of obstructions.\"\n\nThe remarks are another development in the growing friction between the US and China - with Mr Xi having earlier blamed the West for the difficulties faced by his country's economy.\n\nMr Xi had met with South African president Cyril Ramaphosa on Tuesday before he pulled out of delivering his speech.\n\nBill Bishop, author of Sinocism, a popular newsletter about Chinese affairs, highlighted how there had already been a long period this month with Mr Xi not making any public appearances.\n\nMr Bishop said this seemed \"a bit strange\".\n\nHe added: \"This last-minute decision to skip the business forum looks even stranger. So in the absence of any useful information from the PRC [People's Republic of China] system rumours will fly.\"\n\nRead more world news\n\nAt least 17 dead in India bridge collapse\n\nMoscow threatens to annex Georgia breakaway regions\n\nImage: Wang Wentao reads out Xi Jinping's speech. Pic: AP\n\nImage: Xi Jinping receives the order of South Africa from President Cyril Ramaphosa at the summit. Pic: AP\n\nThe China Global South Project, a podcast exploring the country's involvement in Africa, wrote: \"To say [Xi's absence] is extraordinary is an understatement as Chinese leaders never miss highly choreographed events like this.\"\n\nBonnie Glaser, managing director of the Indo-Pacific Programme at the German Marshall Fund, wondered if his absence meant something was \"amiss\".\n\nJames Palmer, deputy editor of Foreign Policy magazine, wrote: \"The odds are very heavily that Xi Jinping just skipped that speech because he's sick.\"\n\nThe BRICS group of countries is made up of Brazil, Russia, India, China and South Africa.\n\nMr Xi was scheduled to join Brazilian President Luiz Inacio Lula da Silva, Indian Prime Minister Narendra Modi and Mr Ramaphosa for dinner at a luxury estate in suburban Johannesburg on Tuesday.\n\nPlease use Chrome browser for a more accessible video player 1:56 Putin hits out at the West\n\nRussian President Vladimir Putin has not attended the summit as he currently faces an arrest warrant for war crimes which was issued by the International Criminal Court.\n\nMr Putin planned to take part in the dinner virtually, officials said.\n\nThe Russian president gave a 17-minute prerecorded speech, criticising the impact of sanctions and indirectly accused the West by criticising the \"trampling of all rules of free trade and economic life which we thought to be immovable before\".\n\nThe leaders were expected to discuss the top agenda point for the three-day summit - a possible expansion of the BRICS group of nations.\n\nThe group aims to be a counterweight to Western economic and geopolitical dominance.\n\nThe five BRICS countries are home to 40% of the world's population and responsible for more than 30% of global economic output, and more than 20 nations have applied to join, according to South African officials, including Saudi Arabia, Iran and the United Arab Emirates."
    },
    {
        "title": "Rumours swirl after Xi Jinping fails to give key Brics speech",
        "description": "Xi was due to address high profile forum in South Africa, but instead his speech was read out by his commerce minister",
        "content": "China’s leader, Xi Jinping, unexpectedly skipped a scheduled speech at a key multilateral business forum in South Africa on Tuesday.\nXi arrived in Johannesburg for the Brics summit on Monday evening on what is only his second international trip this ... [2857 chars]",
        "url": "https://www.theguardian.com/world/2023/aug/23/xi-jinping-brics-china-fails-to-give-key-speech",
        "image": "https://i.guim.co.uk/img/media/df95616d6bf1cb4936ddbc87f25b020058d0caba/0_236_4654_2794/master/4654.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9255d3dc7acbcfc451d08224d342f27",
        "publishedAt": "2023-08-23T05:17:05Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "China’s leader, Xi Jinping, unexpectedly skipped a scheduled speech at a key multilateral business forum in South Africa on Tuesday.\n\nXi arrived in Johannesburg for the Brics summit on Monday evening on what is only his second international trip this year, after visiting Moscow in March. He was met on the airport tarmac by South African president Cyril Ramaphosa.\n\nAccording to the summit schedule, Xi was expected to attend the forum and deliver remarks alongside other leaders on Tuesday. But instead his speech was read out by his commerce minister, Wang Wentao.\n\nXi later attended the summit dinner, but no reason was given for missing the speech. It appeared to be a last-minute decision, as state media articles and social media posts from China’s foreign ministry spokesperson were published as though he had delivered it himself.\n\nSome China watchers speculated whether something was “amiss” or if Xi was temporarily ill, but an explanation is unlikely to be given.\n\nBill Bishop, author of Sinocism, a popular newsletter about Chinese affairs, noted there had already been a long period this month without any public appearances by Xi, which seemed “a bit strange”.\n\n“This last-minute decision to skip the business forum looks even stranger. So in the absence of any useful information from the PRC [People’s Republic of China] system rumours will fly,” he said.\n\nThe China Global South Project noted this was the second unexplained absence by a Chinese official after former foreign minister Qin Gang – who has not been seen in public for months – also missed last month’s foreign ministers Brics meeting.\n\n“To say [Xi’s absence] is extraordinary is an understatement as Chinese leaders never miss highly choreographed events like this,” it said.\n\nView image in fullscreen China’s minister of commerce, Wang Wentao, reads a speech by Xi Jinping to leaders at the Brics summit. Photograph: Jérôme Delay/AP\n\nThe speech, delivered by Wang, made thinly veiled attacks on the US, describing an unnamed country as “obsessed with maintaining hegemony, [and] has gone out of its way to cripple the emerging markets and developing countries”.\n\n\n\n“Whoever develops first becomes their target of containment. Whoever is catching up becomes its target of obstruction,” Wang said on behalf of Xi.\n\nThe Brics countries – Brazil, Russia, India, China and South Africa – represent about 40% of the world’s population and a quarter of global GDP. Leaders of all member nations except Vladimir Putin attended in person as he currently faces an arrest warrant for war crimes issued by the international criminal court.\n\nThe summit was attended by representatives of dozens of other countries, as the main members consider expanding its membership.\n\nSome members like China are seeking to build up Brics as a counterweight to western blocs like the G7 or G20, although there is division within the group. On Tuesday Brazil’s president, Luiz Inácio Lula da Silva, said it wasn’t the group’s aim to compete with western institutions. India’s leadership, which has an often fractious relationship with China, is also hesitant over empowering Beijing through Brics."
    },
    {
        "title": "Russia-Ukraine war at a glance: what we know on day 546 of the invasion",
        "description": "Ukrainians believed to have retaken south-eastern village of Robotyne; Putin tells Brics countries Russia could take Ukraine’s place as grain supplier",
        "content": "Ukraine said its troops had entered the strategically important south-eastern village of Robotyne, a potentially significant advance in its counteroffensive against Russia. Hanna Maliar, Ukraine’s deputy defence minister, said Ukrainian soldiers were... [3442 chars]",
        "url": "https://www.theguardian.com/world/2023/aug/23/russia-ukraine-war-at-a-glance-what-we-know-on-day-546-of-the-invasion",
        "image": "https://i.guim.co.uk/img/media/156d89336093eecc9231897c64be2d172d529a97/124_0_3833_2300/master/3833.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a568c978b6c60a98c9b15b16ad1efb7b",
        "publishedAt": "2023-08-22T23:07:25Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Ukraine said its troops had entered the strategically important south-eastern village of Robotyne, a potentially significant advance in its counteroffensive against Russia. Hanna Maliar, Ukraine’s deputy defence minister, said Ukrainian soldiers were organising the evacuation of civilians, but were still coming under fire from Russian forces.\n\nA prominent Russian journalist said on Tuesday that Gen Sergei Surovikin, former commander of Moscow’s war effort in Ukraine, had been dismissed as head of Russia’s aerospace forces. There was no official confirmation of the report by Alexei Venediktov, the well-connected former head of the now defunct Ekho Moskvy radio station, but it was cited by some other Russian news outlets on social media, Reuters reported.\n\nThree people were killed and two were injured as a result of Russian shelling of several villages in Ukraine’s Donetsk region, the prosecutor general’s office said. According to the prosecutors, all three people, two women and a man, were killed in the village of Torske on Tuesday evening. The prosecutors provided no further detail of the attack.\n\nRussia said on Tuesday that it destroyed two Ukrainian military boats in the Black Sea. Moscow’s defence ministry said one of its Sukhoi Su-30sm jets destroyed a Ukrainian “reconnaissance boat” near Russian gas production facilities. It later said it also destroyed a US-made speedboat carrying Ukrainian troops east of Snake Island, without providing further detail. The claims were not verified.\n\nA group of Ukrainian “saboteurs” tried to breach Russia’s border in the Bryansk region, the regional governor, Alexander Bogomaz, said on Tuesday, Reuters reported. The claim was not verified.\n\nThe Russian president, Vladimir Putin, said Russia would remain a “responsible supplier” of food and grain to African countries and could take Ukraine’s place as an international supplier of grain, in recorded remarks to a summit of the Brics countries in South Africa. He also said said the use of US dollars in trade between Brics nations was decreasing, as the countries moved towards national currencies and away from dollars in an “irreversible process of de-dollarisation”.\n\nThe international court of justice will hear Russia’s objections to its jurisdiction in a genocide case brought by Ukraine in hearings starting in September, the body said on Tuesday. Ukraine filed a case with the ICJ shortly after Russia’s invasion began on 24 February 2022, which accused Moscow of falsely applying genocide law to justify the attack, Reuters reported.\n\nDenmark has begun training eight Ukrainian pilots in flying F-16 fighter jets as part of its commitment to donate aircraft, the Danish armed forces said on Tuesday. Denmark and the Netherlands pledged on Sunday to donate F-16s to Ukraine.\n\nThe leaders of 11 Balkan and eastern European countries signed a joint declaration backing Ukraine’s territorial integrity at a summit in Athens on Monday. In the presence of Volodymyr Zelenskiy, they expressed their “unwavering support for Ukraine’s independence, sovereignty and territorial integrity within its internationally recognised borders” in the face of Russia’s aggression.\n\nPoland’s president has said Russia is in the process of shifting some short-range nuclear weapons to neighbouring Belarus. Andrzej Duda said the move would shift the security architecture of the region and the entire Nato military alliance, Associated Press reported.\n\nMykhailo Podolyak, a senior adviser to Ukraine’s president, Volodymyr Zelenskiy, has said the commitment made by some European countries to donate F-16 fighter jets to Ukraine will help to minimise Ukrainian losses and de-escalate the conflict."
    },
    {
        "title": "Ukraine war - latest: Russia scrambles jets against drones off Crimea; Putin hits out at West in major speech",
        "description": "Vladimir Putin has spoken at the BRICS summit in South Africa via videolink as an international arrest warrant prevented him from leaving Russia. And Moscow has sent two jets to forces reconnaissance drones away from Crimea.",
        "content": "Russia planning to sink ferries to protect Crimean bridge, claims Ukraine\nRussia is planning to sink six ferries in the Kerch Strait to protect the Crimean Bridge from attacks, Ukraine's military intelligence has reported.\nRussian forces believe subm... [1129 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-russia-scrambles-jets-against-drones-off-crimea-putin-hits-out-at-west-in-major-speech-12541713",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-vladimir-putin-moscow_6259385.jpg?20230822173042",
        "publishedAt": "2023-08-22T20:44:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "In depth analysis: Putin's ceasefire may be a ploy - but it's also a moment of truth with plenty at stake\n\nBy Dominic Waghorn, international affairs editor, in Kyiv\n\nDonald Trump has a soft spot for military spectacles and autocrats.\n\nHe will be looking on with envy as Vladimir Putin parades both tomorrow in Moscow, with Chinese leader Xi Jinping already in Russia's capital to join Victory Day events in Red Square.\n\nEuropean allies of Ukraine will be watching nervously, wary of anything that could upturn the delicate quest for peace.\n\nTrump's patience for peddling his much vaunted 'peace deal' has been wearing thin, and allies had feared Ukraine could be punished for it.\n\nThat would have been grotesquely unfair, of course.\n\nUkraine has bent over backwards to accommodate Trump's one-sided diplomacy that has so far seemed to favour the aggressor in this obscene war.\n\nTrue, the Trump proposal doesn't agree to Russian annexation of all the land already taken by force and stops short of ordering the complete demilitarisation of Ukraine - but otherwise the proposals are pretty much everything that Moscow has asked for.\n\nOut of his depth and lost in the rough?\n\nThe deal is being pushed by Steve Witkoff, Trump's golf partner-turned-chief negotiator, a man regarded by diplomats as out of his depth and lost in the rough when it comes to the art of statecraft.\n\nLike his president, Witkoff has a history of doing business with Russian oligarchs, an apparently starry-eyed view of the Russian leader and has called Ukraine a \"false country\".\n\nWitkoff and Trump have so far given Putin the benefit of the doubt, but a moment of truth is approaching.\n\nWhile Ukraine has agreed to a longer ceasefire in principle, Vladimir Putin will not.\n\nUkraine's European allies feared Trump was about to despair of progress, blame Ukraine and take US military support with him.\n\nThen came the minerals agreement between the US and Ukraine.\n\nThe breakthrough gave the US president something to show for his efforts and assuaged his desire for some kind of deal.\n\nHe seems to have moved on, for now at least, and approved the first $50m of arms sales to Ukraine.\n\nBut these remain a tense few days ahead, with plenty at stake.\n\nPutin's 'pointless pause' could risk escalation\n\nPutin's self-declared three-day ceasefire raises the spectre paradoxically of escalation, if either side breaks it - and both have accused the other of violations already.\n\nThe Russian lull is seen here in Kyiv as little more than a ploy.\n\nIf the Russian leader were serious about giving peace a chance, they say, he would have signed up to the permanent ceasefire being proposed by the Trump team.\n\nBesides, Russia broke the last truce in Easter as soon as it had begun and used it to carry out surveillance and reinforcement operations, says Kyiv.\n\nWhy risk another pointless pause that is exploited by the invaders?\n\nIf Russia plays the same games this time and Ukraine retaliates, there could be a significant escalation.\n\nLikewise, with any Ukrainian drone attack on Moscow during Victory Day.\n\nAny major flare-up will not be looked on favourably by the US president if it upstages his first trip abroad this presidency, a three-day tour of the Middle East.\n\nCan Europe fill vacuum left by Trump?\n\nFor now, his attention is not so much on the Ukraine conflict, and he is no longer issuing threats to walk away and stop supporting the Ukrainians.\n\nThat will be a relief here in the Ukrainian capital. They would be unwise to do anything to reengage him, for now at least.\n\nTheir European allies, though, know US involvement in this war appears to be receding.\n\nCan they fill the vacuum?\n\nThis week, they remember the sacrifices made to bring peace and security to their continent 80 years ago.\n\nCan they find the political will and unity to do so again, even without the US?\n\nAstonishingly, given all we have been through, that is still an open question.\n\nFor more on Donald Trump, watch the latest episode of the Trump 100 podcast below:"
    },
    {
        "title": "Vladimir Putin attends BRICS summit virtually to avoid war crimes arrest",
        "description": "The Russian president gave a 17-minute prerecorded speech as the bloc opened its first in-person meeting since before the COVID-19 pandemic in South Africa. Mr Putin is wanted by the International Criminal Court over the abduction of children from Ukraine.",
        "content": "Vladimir Putin has addressed a summit of the BRICS group of emerging economies virtually to avoid an International Criminal Court (ICC) warrant for his arrest for war crimes.\nThe Russian president gave a 17-minute prerecorded speech as the bloc, name... [3452 chars]",
        "url": "https://news.sky.com/story/vladimir-putin-attends-brics-summit-virtually-to-avoid-war-crimes-arrest-12945353",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-vladimir-putin-russia_6259499.jpg?20230822202223",
        "publishedAt": "2023-08-22T20:16:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "Vladimir Putin has addressed a summit of the BRICS group of emerging economies virtually to avoid an International Criminal Court (ICC) warrant for his arrest for war crimes.\n\nThe Russian president gave a 17-minute prerecorded speech as the bloc, named after its member states Brazil, Russia, India, China and South Africa, opened its first in-person meeting since before the COVID-19 pandemic in South Africa.\n\nMr Putin is wanted by the ICC over the abduction of children from Ukraine.\n\nUkraine war - latest: Putin hits out at West in major speech\n\nImage: Pic: AP\n\nThe Russian leader criticised the impact of sanctions and indirectly accused the West by criticising the \"trampling of all rules of free trade and economic life which we thought to be immovable before\".\n\nHe said these have caused an \"exacerbation of serious problems\", in particular affecting the cereals industry.\n\nIt is worth noting Russia's invasion of Ukraine and its decision to pull out of the Black Sea grain deal have had a significant impact on the grains industry.\n\nMr Putin also gave an update on his offer of free grain for African countries, saying talks are almost finished and Russia remains and will be a reliable food supplier to Africa.\n\nRussian foreign minister Sergey Lavrov is representing Moscow in Johannesburg, but Kremlin spokesman Dmitry Peskov stressed Mr Putin would fully engage with the summit while participating remotely.\n\nLocal officials said the Russian president would \"virtually\" attend a welcome dinner hosted by South Africa on Tuesday. The agenda also lists him giving a speech via video link on Wednesday.\n\nRead more:\n\nWagner Group chief shares first video address since aborted coup\n\nRussian space agency boss blames decades of inactivity for moon crash\n\nImage: South Africa's President Cyril Ramaphosa bestows the Order of South Africa on Chinese President Xi Jinping\n\nXi Jinping also absent from summit\n\nChinese President Xi Jinping was also absent from the beginning of the summit, though he was in South Africa and held a bilateral morning meeting with President Cyril Ramaphosa.\n\nNo reason was given for his absence, with Chinese Commerce Minister Wang Wentao reading his speech.\n\nMr Xi, who has gradually resumed foreign travel after lifting his country's strict COVID-19 restrictions, joined Mr Ramaphosa to watch a ceremonial parade by soldiers at the Union Buildings, the official seat of the South African government.\n\nHe made brief comments, saying China was ready for more cooperation with Africa's most advanced economy \"to take our comprehensive strategic partnerships to new heights\".\n\nBe the first to get Breaking News Install the Sky News app for free\n\nBRICS officials insist bloc is not taking anti-West position\n\nBRICS officials have argued against suggestions the bloc is shifting towards an anti-West position under the influence of China and Russia, saying instead it is looking out for the interests of the Global South.\n\nBut the BRICS stance is at odds with its Western allies on a number of issues, including Russia's invasion of Ukraine.\n\nThe European Union has called on Mr Xi, Mr Ramaphosa, Brazilian President Luiz Inacio Lula da Silva and Indian Prime Minister Narendra Modi to use the three-day summit to condemn Russia and Mr Putin for the war in Ukraine - something that is unlikely to happen.\n\nInstead BRICS has been a forum for Russia to express its anti-Western rhetoric, with Mr Lavrov using BRICS foreign minister meeting in June to lambast the West for its \"hegemony\" and use of \"financial blackmail\" to serve its \"selfish interests\".\n\nA small protest against Russia's invasion of Ukraine was held at a public park more than 3km (1.8 miles) from the summit on Tuesday."
    },
    {
        "title": "Putin says Brics should become trading bloc representing ‘global majority’",
        "description": "Russian president addresses group at South Africa summit, blaming western sanctions for causing volatility in global markets",
        "content": "Vladimir Putin has told a summit of the Brics group of countries in South Africa, that it should become a trading bloc representing the “global majority”.\nHowever, differences among the group – comprising Brazil, Russia, India, China and South Africa... [3328 chars]",
        "url": "https://www.theguardian.com/business/2023/aug/22/putin-brics-summit-south-africa-trade",
        "image": "https://i.guim.co.uk/img/media/7095adc5cce2b2ddb4bcda9ff04eafae6692f870/0_178_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0dc9b97a89a76902e5ae4d2b922db4d8",
        "publishedAt": "2023-08-22T18:41:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin has told a summit of the Brics group of countries in South Africa that it should become a trading bloc representing the “global majority”.\n\nHowever, differences among the group – comprising Brazil, Russia, India, China and South Africa – have become apparent at the summit over accepting new members, and whether to turn Brics into a geopolitical counterweight to the west.\n\nBrazil’s president, Luiz Inácio Lula da Silva, insisted on Tuesday that it was not the group’s aim to compete with western institutions.\n\n“We do not want to be a counterpoint to the G7, G20 or the United States,” he said on Tuesday. “We just want to organise ourselves.”\n\nThe White House, too, played down the likelihood of Brics turning into a powerful and cohesive bloc.\n\n“This is a very diverse collection of countries … with differences of view on critical issues,” the national security adviser, Jake Sullivan, said at a briefing.\n\nIn his recorded remarks to the meeting, Putin blamed the volatility in global markets for food and other commodities on western sanctions, and said that Brics would be a force for fairness in international relations.\n\n“We cooperate on the principles of equality, mutual support and respect for each other’s interests,” he said. “This is the essence of the future-oriented strategic course of our association, a course that meets the aspirations of the main part of the world community, the so-called global majority.”\n\nThe Brics countries represent about 40% of the world’s population and a quarter of global GDP, but the group is considering expansion. Leaders from more than 40 countries, largely from Africa and elsewhere in the global south, flew in for the three-day summit in Johannesburg alongside Lula, China’s Xi Jinping and India’s Narendra Modi. According to the South African organisers, many of those countries have expressed interest in joining.\n\nAmong the disparate group of countries attending as observers and candidate members are Iran, Argentina, Saudi Arabia, Kazakhstan, Vietnam, Indonesia, Ethiopia and Venezuela. There is debate among members about how far expansion should go, India being the most cautious, and what criteria should be used in deciding membership. Brazil supports the admission of Argentina into Brics, but has warned that rapid expansion could dilute the group’s influence.\n\nXi did not attend the first day of the summit, for reasons that were not explained. His remarks were delivered on his behalf by the Chinese commerce minister, Wang Wentao. In his speech, Xi insisted that the expansion of Brics was not aimed at “asking countries to take sides, or creating bloc confrontation, rather to expand the architect of peace and development”.\n\nThere is expected to be common ground in the discussion of alternatives to trading in dollars, and possible creation of parallel financial institutions to the World Bank and the International Monetary Fund. However, the South African hosts have said there will be no proposals for a Brics common currency as an alternative to the dollar or euro.\n\nRussia’s invasion of Ukraine is expected to be a significantly divisive issue. Putin did not attend in person and spoke instead by video, because he faces an arrest warrant for war crimes issued by the international criminal court.\n\nThe summit’s host, the South African president, Cyril Ramaphosa, has said he would use the meeting to push for the revival of the Black Sea Grain Initiative, which had facilitated the export of Ukrainian cereals to the rest of the world, and which Russia ended last month.\n\nSpeaking on Sunday, Ramaphosa said he would also press for the return of Ukrainian children who had been taken to Russia from occupied Ukrainian territory since the start of the full-scale invasion in February 2022.\n\nAnother substantial barrier to closer integration of the group is unresolved tension between China and India over their mutual border, which has escalated into brawls between their soldiers in recent years."
    },
    {
        "title": "Ukraine war - latest: Putin hits out at West in major speech; video shows moment drone downed over Moscow region",
        "description": "Vladimir Putin has spoken at the BRICS summit in South Africa via videolink as an international arrest warrant prevented him from leaving Russia. And drone attacks on Russian soil are becoming almost a nightly occurrence.",
        "content": "Watch: Liberated Ukrainians in tears after being rescued\nUkrainians in a southern village that has seen intense fighting for the last two months have been liberated by Kyiv's troops.\nIn a video shared by the 47th Brigade of Ukrainian Armed Forces, ci... [457 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-putin-hits-out-at-west-in-major-speech-video-shows-moment-drone-downed-over-moscow-region-12541713",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-vladimir-putin-moscow_6259385.jpg?20230822173042",
        "publishedAt": "2023-08-22T17:08:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "In depth analysis: Putin's ceasefire may be a ploy - but it's also a moment of truth with plenty at stake\n\nBy Dominic Waghorn, international affairs editor, in Kyiv\n\nDonald Trump has a soft spot for military spectacles and autocrats.\n\nHe will be looking on with envy as Vladimir Putin parades both tomorrow in Moscow, with Chinese leader Xi Jinping already in Russia's capital to join Victory Day events in Red Square.\n\nEuropean allies of Ukraine will be watching nervously, wary of anything that could upturn the delicate quest for peace.\n\nTrump's patience for peddling his much vaunted 'peace deal' has been wearing thin, and allies had feared Ukraine could be punished for it.\n\nThat would have been grotesquely unfair, of course.\n\nUkraine has bent over backwards to accommodate Trump's one-sided diplomacy that has so far seemed to favour the aggressor in this obscene war.\n\nTrue, the Trump proposal doesn't agree to Russian annexation of all the land already taken by force and stops short of ordering the complete demilitarisation of Ukraine - but otherwise the proposals are pretty much everything that Moscow has asked for.\n\nOut of his depth and lost in the rough?\n\nThe deal is being pushed by Steve Witkoff, Trump's golf partner-turned-chief negotiator, a man regarded by diplomats as out of his depth and lost in the rough when it comes to the art of statecraft.\n\nLike his president, Witkoff has a history of doing business with Russian oligarchs, an apparently starry-eyed view of the Russian leader and has called Ukraine a \"false country\".\n\nWitkoff and Trump have so far given Putin the benefit of the doubt, but a moment of truth is approaching.\n\nWhile Ukraine has agreed to a longer ceasefire in principle, Vladimir Putin will not.\n\nUkraine's European allies feared Trump was about to despair of progress, blame Ukraine and take US military support with him.\n\nThen came the minerals agreement between the US and Ukraine.\n\nThe breakthrough gave the US president something to show for his efforts and assuaged his desire for some kind of deal.\n\nHe seems to have moved on, for now at least, and approved the first $50m of arms sales to Ukraine.\n\nBut these remain a tense few days ahead, with plenty at stake.\n\nPutin's 'pointless pause' could risk escalation\n\nPutin's self-declared three-day ceasefire raises the spectre paradoxically of escalation, if either side breaks it - and both have accused the other of violations already.\n\nThe Russian lull is seen here in Kyiv as little more than a ploy.\n\nIf the Russian leader were serious about giving peace a chance, they say, he would have signed up to the permanent ceasefire being proposed by the Trump team.\n\nBesides, Russia broke the last truce in Easter as soon as it had begun and used it to carry out surveillance and reinforcement operations, says Kyiv.\n\nWhy risk another pointless pause that is exploited by the invaders?\n\nIf Russia plays the same games this time and Ukraine retaliates, there could be a significant escalation.\n\nLikewise, with any Ukrainian drone attack on Moscow during Victory Day.\n\nAny major flare-up will not be looked on favourably by the US president if it upstages his first trip abroad this presidency, a three-day tour of the Middle East.\n\nCan Europe fill vacuum left by Trump?\n\nFor now, his attention is not so much on the Ukraine conflict, and he is no longer issuing threats to walk away and stop supporting the Ukrainians.\n\nThat will be a relief here in the Ukrainian capital. They would be unwise to do anything to reengage him, for now at least.\n\nTheir European allies, though, know US involvement in this war appears to be receding.\n\nCan they fill the vacuum?\n\nThis week, they remember the sacrifices made to bring peace and security to their continent 80 years ago.\n\nCan they find the political will and unity to do so again, even without the US?\n\nAstonishingly, given all we have been through, that is still an open question.\n\nFor more on Donald Trump, watch the latest episode of the Trump 100 podcast below:"
    },
    {
        "title": "Ukraine war - latest: Putin giving major speech; video shows moment drone downed over Moscow region",
        "description": "Vladimir Putin is speaking at the BRICS summit in South Africa via videolink as an international arrest warrant has prevented him from leaving Russia - watch his speech in the stream below. And drone attacks on Russian soil are becoming more regular.",
        "content": "Putin hits out at 'pessimistic outlook' from West\nVladimir Putin is discussing Russia's economic situation as he appears via videolink at the BRICS summit.\nHe says Russia is part of the five most economically powerful countries in the world despite \"... [1135 chars]",
        "url": "https://news.sky.com/story/ukraine-war-latest-putin-giving-major-speech-video-shows-moment-drone-downed-over-moscow-region-12541713",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-vladimir-putin-moscow_6259385.jpg?20230822173042",
        "publishedAt": "2023-08-22T16:31:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "In depth analysis: Putin's ceasefire may be a ploy - but it's also a moment of truth with plenty at stake\n\nBy Dominic Waghorn, international affairs editor, in Kyiv\n\nDonald Trump has a soft spot for military spectacles and autocrats.\n\nHe will be looking on with envy as Vladimir Putin parades both tomorrow in Moscow, with Chinese leader Xi Jinping already in Russia's capital to join Victory Day events in Red Square.\n\nEuropean allies of Ukraine will be watching nervously, wary of anything that could upturn the delicate quest for peace.\n\nTrump's patience for peddling his much vaunted 'peace deal' has been wearing thin, and allies had feared Ukraine could be punished for it.\n\nThat would have been grotesquely unfair, of course.\n\nUkraine has bent over backwards to accommodate Trump's one-sided diplomacy that has so far seemed to favour the aggressor in this obscene war.\n\nTrue, the Trump proposal doesn't agree to Russian annexation of all the land already taken by force and stops short of ordering the complete demilitarisation of Ukraine - but otherwise the proposals are pretty much everything that Moscow has asked for.\n\nOut of his depth and lost in the rough?\n\nThe deal is being pushed by Steve Witkoff, Trump's golf partner-turned-chief negotiator, a man regarded by diplomats as out of his depth and lost in the rough when it comes to the art of statecraft.\n\nLike his president, Witkoff has a history of doing business with Russian oligarchs, an apparently starry-eyed view of the Russian leader and has called Ukraine a \"false country\".\n\nWitkoff and Trump have so far given Putin the benefit of the doubt, but a moment of truth is approaching.\n\nWhile Ukraine has agreed to a longer ceasefire in principle, Vladimir Putin will not.\n\nUkraine's European allies feared Trump was about to despair of progress, blame Ukraine and take US military support with him.\n\nThen came the minerals agreement between the US and Ukraine.\n\nThe breakthrough gave the US president something to show for his efforts and assuaged his desire for some kind of deal.\n\nHe seems to have moved on, for now at least, and approved the first $50m of arms sales to Ukraine.\n\nBut these remain a tense few days ahead, with plenty at stake.\n\nPutin's 'pointless pause' could risk escalation\n\nPutin's self-declared three-day ceasefire raises the spectre paradoxically of escalation, if either side breaks it - and both have accused the other of violations already.\n\nThe Russian lull is seen here in Kyiv as little more than a ploy.\n\nIf the Russian leader were serious about giving peace a chance, they say, he would have signed up to the permanent ceasefire being proposed by the Trump team.\n\nBesides, Russia broke the last truce in Easter as soon as it had begun and used it to carry out surveillance and reinforcement operations, says Kyiv.\n\nWhy risk another pointless pause that is exploited by the invaders?\n\nIf Russia plays the same games this time and Ukraine retaliates, there could be a significant escalation.\n\nLikewise, with any Ukrainian drone attack on Moscow during Victory Day.\n\nAny major flare-up will not be looked on favourably by the US president if it upstages his first trip abroad this presidency, a three-day tour of the Middle East.\n\nCan Europe fill vacuum left by Trump?\n\nFor now, his attention is not so much on the Ukraine conflict, and he is no longer issuing threats to walk away and stop supporting the Ukrainians.\n\nThat will be a relief here in the Ukrainian capital. They would be unwise to do anything to reengage him, for now at least.\n\nTheir European allies, though, know US involvement in this war appears to be receding.\n\nCan they fill the vacuum?\n\nThis week, they remember the sacrifices made to bring peace and security to their continent 80 years ago.\n\nCan they find the political will and unity to do so again, even without the US?\n\nAstonishingly, given all we have been through, that is still an open question.\n\nFor more on Donald Trump, watch the latest episode of the Trump 100 podcast below:"
    },
    {
        "title": "Watch Putin deliver speech at BRICS summit",
        "description": "Watch Putin deliver speech at BRICS summit",
        "content": "YouTube\nYouTube , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable YouTube cookies or to allow those cookies just on... [373 chars]",
        "url": "https://news.sky.com/story/watch-putin-deliver-speech-at-brics-summit-12945269",
        "image": "https://e3.365dm.com/23/08/1600x900/skynews-vladimir-putin-kremlin_6252859.jpg?20230816154716",
        "publishedAt": "2023-08-22T16:08:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "YouTube\n\nYouTube , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable YouTube cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options"
    },
    {
        "title": "Brics group looks to expand at summit despite divisions among key members",
        "description": "Experts say India concerned about expansion and any overt anti-west turn as leaders fly into South Africa",
        "content": "Leaders from developing countries representing almost half the world’s population including China and Russia are to meet in South Africa for a key summit aimed at reinforcing their alliance as a counterweight to the west.\nThe Brics grouping summit in... [5392 chars]",
        "url": "https://www.theguardian.com/world/2023/aug/21/brics-looks-to-expand-bloc-south-africa-summit-divisions-key-members-india",
        "image": "https://i.guim.co.uk/img/media/c0c92680fb4ed6e68ab7bae258d7dbb41904bdf7/0_0_2809_1686/master/2809.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=05bbd874cd8b2496c3c8b71f5718d5f8",
        "publishedAt": "2023-08-21T18:01:53Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Leaders from developing countries representing almost half the world’s population including China and Russia are meeting in South Africa for a key summit aimed at reinforcing their alliance as a counterweight to the west.\n\nThe Brics grouping summit in Johannesburg is being hosted by the South African president, Cyril Ramaphosa, and brings together the prime minister of India, Narendra Modi, as well the presidents of China, Xi Jinping, and Brazil, Luiz Inácio Lula da Silva.\n\nDozens of leaders of other countries in Africa, Asia and the Middle East are also attending, many hoping to be invited to join the bloc. The two-day summit opens on Tuesday morning.\n\nRussia is being represented by its foreign minister, Sergei Lavrov, after Vladimir Putin decided not travel to Johannesburg to avoid forcing South Africa to choose between fulfilling conflicting obligations as hosts of the summit and as a member of the international criminal court.\n\nThe ICC has issued an arrest warrant for the Russian president for alleged war crimes in Ukraine that would have theoretically compelled South Africa to detain him. Putin will now only attend virtually.\n\nThe summit may see the Brics group, whose economies account for a quarter of global gross domestic product, take a clearly anti-western turn. This raises the prospect of a new and re-energised economic and political actor against the US and its allies in world affairs.\n\nOn Sunday, Ramaphosa sought to reassure concerned observers and domestic opponents that South Africa would “not be drawn into a contest between global powers” and wanted to avoid a world that was “increasingly polarised into competing camps”.\n\n“Our decision not to align with any one of the global powers does not mean that we are neutral on matters of principle or national interest,” he told viewers in a televised national address.\n\nOne issue at the summit will be moves to undermine the dominance of the US dollar in international trade transactions, which would be helpful to Russia as its economy struggles with sanctions imposed after its full-scale invasion of Ukraine last year.\n\nChina is looking to build a broader coalition of developing countries to extend Beijing’s influence and reinforce its efforts to compete with the US on the global stage.\n\n“The traditional global governing system has become dysfunctional, deficient and missing in action,” the Chinese ambassador to South Africa, Chen Xiaodong, said at a briefing in Pretoria last week, adding that the Brics grouping was “increasingly becoming a staunch force in defending international justice”.\n\nBut both China’s expansion plans and the more explicitly political stance that Beijing has outlined has riled India, the most populous country in the group.\n\nProf Harsh Pant, an international relations expert at the Observer Research Foundation, a thinktank in Delhi, said: “India is looking to ensure that this platform doesn’t just drift off into [being] an openly anti-western platform, and there is a danger of that with both Russia and China having a certain agenda.\n\n“India and least of all Modi have no interest in shaping India’s foreign policy in an anti-western direction. Brics was conceived as a geoeconomic platform but is drifting into a geopolitical role and India is not likely to be comfortable with that.”\n\nOfficials in South Africa say more than 40 countries have expressed interest in joining Brics. Twenty three are thought to have asked formally to be admitted.\n\nAnil Sooklal, South Africa’s ambassador at large for Asia and the Brics, said one of the reasons countries were lining up to join the group was a “very polarised world” that had been further polarised by the Ukraine war, and that countries were being forced to take sides.\n\n“Countries in the [global] south don’t want to be told who to support, how to behave and how to conduct their sovereign affairs. They are strong enough now to assert their respective positions,” said Sooklal.\n\nAmong potential new members are Iran and Venezuela, both hit by sanctions and diplomatically isolated.\n\nRamón Lobo, Venezuela’s former finance minister and central bank president, told Reuters: “Other integration frameworks that exist globally have been blinded by the hegemonic vision put forward by the US government.”\n\nRussia also sees the summit as an opportunity to reinforce its alliances in the developing world, particularly in Africa. Putin hosted African leaders in St Petersburg for a second Russia-Africa summit last month.\n\nAfrican candidates for membership such as Ethiopia and Nigeria are attracted by the bloc’s commitment to UN reforms that would give Africa a more powerful global voice. Others believe an expanded Brics may be able to drive through changes to the World Trade Organization, the International Monetary Fund and the World Bank.\n\nWith India’s opposition to any new members of Brics without very strict safeguards and its concerns that Beijing will pack the group with anti-western allies, there is very unlikely to be consensus, say experts, meaning immediate expansion is improbable.\n\n“I don’t think we’ll see any explicit messages on this issue, just some anodyne statement,” said Pant.\n\nMany analysts are also sceptical of hopes that even an enlarged Brics grouping could have much impact. Since its foundation in 2009, the bloc’s ambitions to exert significant global political and economic influence has been undermined by the differences between the values, interests and political systems of its members.\n\nSteven Gruzd of the South African Institute of International Affairs, a thinktank, said: “They may have too high expectations of what Brics membership will actually bring in practice.”"
    },
    {
        "title": "Morocco not to attend BRICS summit in Johannesburg",
        "description": "Morocco has refrained from submitting an application to join BRICS and will be absent from the upcoming summit in Johannesburg, as confirmed...",
        "content": "Morocco has refrained from submitting an application to join BRICS and will be absent from the upcoming summit in Johannesburg, as confirmed by the state news agency MAP on Saturday, Anadolu reports.\nCiting an undisclosed source within the Foreign Mi... [1902 chars]",
        "url": "https://www.middleeastmonitor.com/20230819-morocco-not-to-attend-brics-summit-in-johannesburg/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2019/05/Morocco-flag22907715_cddeaf3604_o.jpg",
        "publishedAt": "2023-08-19T16:48:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230819-morocco-not-to-attend-brics-summit-in-johannesburg/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230819-morocco-not-to-attend-brics-summit-in-johannesburg/"
    },
    {
        "title": "South Africa: 8 Arab countries request to join BRICS",
        "description": "Eight Arab countries have officially applied to join the BRICS group of fast-developing economies, the South African foreign minister said...",
        "content": "Eight Arab countries have officially applied to join the BRICS group of fast-developing economies, the South African foreign minister said.\nNaledi Pandor told reporters that a total of 23 countries have officially applied to join the group, including... [798 chars]",
        "url": "https://www.middleeastmonitor.com/20230815-south-africa-8-arab-countries-request-to-join-brics/",
        "image": "https://www.middleeastmonitor.com/wp-content/uploads/2023/06/AA-20230602-31313470-31313468-BRICS_FOREIGN_MINISTERS_MEETING_IN_SOUTH_AFRICA.jpg",
        "publishedAt": "2023-08-15T08:33:00Z",
        "source": {
            "name": "Middle East Monitor",
            "url": "https://www.middleeastmonitor.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.middleeastmonitor.com', port=443): Max retries exceeded with url: /20230815-south-africa-8-arab-countries-request-to-join-brics/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1010)'))) on URL https://www.middleeastmonitor.com/20230815-south-africa-8-arab-countries-request-to-join-brics/"
    },
    {
        "title": "Vladimir Putin to miss South Africa summit amid row over possible arrest",
        "description": "Cyril Ramaphosa faced demands for Russian president to be detained under ICC warrant if he attended Brics summit",
        "content": "Vladimir Putin will not attend a Brics summit in South Africa next month amid speculation that he could be detained under an international criminal court warrant for his arrest for war crimes in Ukraine.\nSouth Africa’s presidential office announced t... [2230 chars]",
        "url": "https://www.theguardian.com/world/2023/jul/19/vladimir-putin-to-miss-south-africa-summit-amid-row-over-possible-arrest",
        "image": "https://i.guim.co.uk/img/media/6c7bde720f1c5160e45750537769142a344ec937/0_66_4375_2624/master/4375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=afed39334d9c534e806d5b7c87581d62",
        "publishedAt": "2023-07-19T17:46:14Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "Vladimir Putin will not attend a Brics summit in South Africa next month amid speculation that he could be detained under an international criminal court warrant for his arrest for war crimes in Ukraine.\n\nSouth Africa’s presidential office announced that the Russian president would not be attending the summit after holding a “number of consultations” with the Kremlin.\n\nSouth Africa is an ICC signatory and would be expected to aid in his arrest if the Russian leader came to the summit.\n\nPutin’s potential attendance had sparked a domestic political scandal.\n\nPresident Cyril Ramaphosa said taking part in arresting Putin would risk a war with Russia.\n\nHis remarks came after the Democratic Alliance, the largest opposition party, sued the government to demand that Putin be arrested if he arrived in the country.\n\n“Russia has made it clear that arresting its sitting president would be a declaration of war,” Ramaphosa responded, according to court documents. “It would be inconsistent with our constitution to risk engaging in war with Russia.”\n\nThe Kremlin denied that it had explicitly told Pretoria that an attempt to arrest Putin in South Africa would be tantamount to a declaration of war. But it did not deny that fact either.\n\n“Nobody informed anyone about anything,” said Dmitry Peskov, the Kremlin spokesperson. “In this world, it’s absolutely clear to everyone what an attempt to encroach on the Russian leader means.”\n\n“Therefore, there’s no need to explain anything to anyone here.”\n\nIn March, the ICC issued an arrest warrant for Putin for overseeing the abduction of Ukrainian children in its invasion of Ukraine. Both Putin and Russia’s children’s rights commissioner Maria Alekseyevna Lvova-Belova bore responsibility for the “unlawful deportation” of thousands of Ukrainian children, the court, based in The Hague, said. It was a rare indictment of a sitting head of state.\n\nRussia has denounced the ICC decision and said it does not apply to Russia because Moscow is not a signatory to the treaty. But Putin has not travelled abroad, save for the occupied territories of Ukraine, since the ICC warrant was announced.\n\nPutin will attend the Brics summit by videoconference, the Kremlin has said. The Russian foreign minister, Sergei Lavrov, will lead a delegation to South Africa.\n\nThe summit is set to take place on 24-26 August. It will bring together representatives of Brazil, Russia, India, China and South Africa. It is the first in-person Brics summit since Covid."
    },
    {
        "title": "South Africa may seek way out of hosting Brics summit over Putin arrest",
        "description": "Pretoria would be required to arrest Putin if he attended and send him to The Hague for trial on war crimes charges",
        "content": "South Africa may abandon its role as host of this year’s Brics summit in an attempt to avoid international pressure to arrest the Russian president, Vladimir Putin, who is wanted by the international criminal court on charges of war crimes.\nIn a flur... [4234 chars]",
        "url": "https://www.theguardian.com/world/2023/jun/11/south-africa-may-seek-way-out-of-hosting-brics-summit-over-putin-arrest",
        "image": "https://i.guim.co.uk/img/media/751d2a504b3851e0541fec1db574b1ca014bf5c2/0_24_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eaa78295e6553e6214bc0f2b5c2efd00",
        "publishedAt": "2023-06-11T16:48:24Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "South Africa may abandon its role as host of this year’s Brics summit in an attempt to avoid international pressure to arrest the Russian president, Vladimir Putin, who is wanted by the international criminal court on charges of war crimes.\n\nIn a flurry of diplomatic activity around Ukraine, South Africa with five other African states is trying to garner support for a new peace plan. South Africa’s president, Cyril Ramaphosa, on Saturday briefed Chinese leader, Xi Jinping, on the upcoming visit by African leaders to Russia and Ukraine in an attempt to end hostilities. China has its own peace mission under way, and it is not clear what the Africa mission might add.\n\nRamaphosa has recruited Zambia, Senegal, Republic of Congo, Uganda, and Egypt to join his peace delegation.\n\nAs a party to the Rome statute, the treaty underpinning the court, Pretoria would be required to arrest Putin and then send him to The Hague for trial.\n\nBut China and India, if they hosted the summit, would not face the same obligation, leading some South African officials to suggest handing the summit to Beijing. Brazil, the fifth member of Brics (Brazil, Russia, India, China and South Africa) is also a party to the court, so faces the same dilemma as South Africa.\n\nUkraine hopes to capitalise on the proliferation of peace plans emerging from the global south by staging a peace conference in July, possibly in Denmark, at which it would set out its terms for a settlement to the conflict.\n\nThe aspiration is that by then Ukraine’s counteroffensive would have changed the dynamic of the war, and Kyiv hopes the global south will realise that Russia needs to leave Ukraine to avoid further bloodshed. The Danish foreign minister, Lars Løkke Rasmussen, has already said he is willing to host such an event.\n\nThe Ukrainian president, Volodymr Zelenskiy, said he would speak on Sunday to the Polish president, Andrzej Duda, about a dinner Duda intends to attend on Monday with the German chancellor, Olaf Scholz, and the French president, Emmanuel Macron, focused on Ukraine’s bid for Nato membership at a summit in Vilnius in July.\n\nThe three leaders are expected to discuss the postwar security guarantees that can be offered to Ukraine, and how specific a route map to Nato membership can be offered. Zelenskiy said: “Let’s hope that our colleagues are thinking about how to speed up Ukraine’s accession to Nato. Or not. Let’s see.”\n\nIn an unprecedented speech in Bratislava this month, Macron not only held out an olive branch to eastern European states he has criticised in the past, including Poland, but proposed guarantees to Ukraine that match those provided by the US to Israel. The guarantees would not necessarily be provided by Nato itself but by Nato member states.\n\nHe said Ukraine warranted “strong, concrete and tangible” security guarantees and argued that it should be offered “a path towards membership”. However, Scholz struck a different tone, saying last Thursday that the focus should not be on Nato membership. He said: “It is also clear that we will have to discuss what security guarantees can be provided in the postwar situation”\n\nThe exact nature of the offer that could be made to Ukraine is complicated by the fact that when the Nato members meet, the context may have changed depending on perceptions of the state of the counteroffensive currently under way. Ukraine could not be offered Nato membership while at war with Russia since that would require the alliance taking on a commitment to go to war with Moscow.\n\nUS envoy to Nato, Juliette Smith, told Politico last week: “I think the allies now are in agreement that a proper invitation is unlikely while they’re engaged in a full-scale war.”\n\nAt the same time, the fear is that if the Vilnius summit sends out a weak signal to Ukraine, that may encourage Putin to believe western support is wavering and that he could ultimately win the war or at least achieve a frozen conflict. Poland wants the focus to be on the guarantees that can be provided before membership, covering ammunition production inside Ukraine, continued supplies of arms and air power to Ukraine and the interoperability of Ukrainian and Nato weaponry.\n\nThe US president, Joe Biden, is also being urged to make progress on the issue at Vilnius rather than wait until next year’s Nato summit in Washington, which will fall in the middle of an election campaign consumed by the question of whether the US should extend its defence commitments with Europe."
    },
    {
        "title": "South Africa grants Putin and Brics leaders diplomatic immunity for summit",
        "description": "ICC warrant for Russian president’s arrest issued in March over alleged war crimes in Ukraine",
        "content": "South Africa has issued blanket diplomatic immunity to all leaders attending an August summit, meaning Vladimir Putin might be able to travel to Johannesburg and not fear the country acting on an international criminal court warrant for his arrest.\nS... [3608 chars]",
        "url": "https://www.theguardian.com/world/2023/may/30/south-africa-grants-putin-and-brics-leaders-diplomatic-immunity-for-summit",
        "image": "https://i.guim.co.uk/img/media/751e9587c11cb483557b60a8b9eb9d15a657625a/0_39_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=094d3f6eb383fe710851dfc9e7e304c9",
        "publishedAt": "2023-05-30T14:51:35Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "South Africa has issued blanket diplomatic immunity to all leaders attending an August summit, meaning Vladimir Putin might be able to travel to Johannesburg and not fear the country acting on an international criminal court warrant for his arrest.\n\nSouth African officials insisted the broad offer of immunity, issued in a government gazette, may not trump the ICC arrest warrant. As an ICC member, South Africa would be under pressure, and possibly under a legal requirement, to arrest Putin. The court issued a warrant for his arrest in March over the alleged forcible deportation of children from Ukraine to Russia.\n\nSouth Africa is hosting a summit of the Brics group: Brazil, China, India, Russia and South Africa, in August. A two-day planning meeting of foreign ministers is due to take place this Thursday.\n\n“This is a standard conferment of immunities that we do for all international conferences and summits held in South Africa, irrespective of the level of participation,” the Department of Foreign Affairs said on Tuesday. “The immunities are for the conference and not for specific individuals. They are meant to protect the conference and its attendees from the jurisdiction of the host country for the duration of the conference.”\n\nIn April, South African president, Cyril Ramaphosa, appointed an inter-ministerial committee headed by his deputy president, Paul Mashatile, to look into how the law applied to a visit by the Russian president. The government is looking into the wording of the Rome Statute, the charter that established the ICC, for a loophole that would enable Putin to attend without South Africa having to arrest him.\n\nArticle 98 of the ICC Rome Statute states: “The court may not proceed with a request for surrender or assistance which would require the requested State to act inconsistently with its obligations under international law with respect to the State or diplomatic immunity of a person … of a third state, unless the court can first obtain the cooperation of that third State for the waiver of the immunity.” Some say this wording provides South Africa with a chance to invite Putin and not be under any obligation to arrest him.\n\nA similar row occurred in 2005 when the then Sudanese president Omar al-Bashir came to South Africa. He swiftly left the county as it became increasingly likely that the South African high court was about to rule that he had to be arrested.\n\nRussia has stepped up its drive to boost ties with Africa to help offset a chill in relations with the west prompted by its invasion of Ukraine, and plans to hold an Africa-Russia summit in St Petersburg in July.\n\nIt is not clear yet if Putin would be willing to save South Africa from the diplomatic dilemma by not attending in person. The Kremlin said on Tuesday that Russia would take part at the “proper level”. The foreign minister, Sergei Lavrov, is already slated to attend the planning meeting.\n\nThe Brics group of large emerging economies is increasingly seen as a rival to the G7 group of western industrialised countries.\n\nAsked at a regular news briefing about the possibility of an arrest warrant, the Kremlin spokesperson, Dmitry Peskov, said: “Of course we count as a bare minimum on partner countries in such an important format not being guided by such illegal decisions.”\n\nSouth Africa has been accused of fence-sitting over Russia’s invasion of Ukraine. The US embassy recently claimed South Africa had sent weapons to Russia. Support for Russia inside the ruling ANC is strong due to the Soviet Union’s role in opposing colonialism.\n\nThe government notice about immunity, which was gazetted on Monday, was routine protocol to protect the conference, the foreign ministry said, adding: “These immunities do not override any warrant that may have been issued by any international tribunal against any attendee of the conference.”"
    },
    {
        "title": "The awkward multi-polar world of the West versus ever-wealthy developing countries",
        "description": "The political clout of the BRICS is turning out to be as important as their increasing economic heft. Assumptions in 2001 that these countries would become friendly allies in a US-dominated world order are proving false.",
        "content": "When Jim O'Neill, the Goldman Sachs banker, popularised the term BRIC in 2001, he was talking about investment opportunities in the fastest growing economies in the world: Brazil, Russia, India and China, with South Africa added in 2010 making the ac... [8375 chars]",
        "url": "https://news.sky.com/story/the-awkward-multi-polar-world-of-the-west-versus-ever-wealthy-developing-countries-12862152",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-brics-boulton_6128126.jpg?20230420220600",
        "publishedAt": "2023-04-21T02:31:00Z",
        "source": {
            "name": "Sky News",
            "url": "https://news.sky.com"
        },
        "full_content": "When Jim O'Neill, the Goldman Sachs banker, popularised the term BRIC in 2001, he was talking about investment opportunities in the fastest growing economies in the world: Brazil, Russia, India and China, with South Africa added in 2010 making the acronym up to BRICS.\n\nThe countries identified swiftly formed a club, with leaders meeting regularly for summits. Vladimir Putin may well dodge sanctions to attend the next meeting in August in South Africa.\n\nThe political clout of the BRICS is turning out to be as important as their increasing economic heft. Assumptions in 2001 that these countries would become friendly allies in a US-dominated world order are proving false.\n\nNone of the BRICS have backed the West - roughly comprising the US, UK, EU and Japan - in opposing Russia's invasion of Ukraine.\n\nRussia is the aggressor in Ukraine, and China is its \"partner without limits\", as agreed by presidents Xi and Putin, so no surprise there.\n\nIndia and South Africa have economic and energy needs and colonial resentment, which Russia and China have been keenly exploiting.\n\nHopes were highest that Brazil might support the Western position, under the newly restored leadership of President Luiz Ignacio Lula da Silva. Instead, Lula celebrated his first 100 days back in office with a state visit to China, and by playing host to the Russian foreign minister Sergei Lavrov.\n\nIn public statements, Lula attacked the US for \"encouraging\" and \"incentivising\" the Ukraine conflict, bemoaned the US dollar's role as the global reserve currency and argued for \"new geopolitics to change world governance by giving more representation to the UN\".\n\nHis foreign minister, Fernando Haddad, warned bluntly that Brazil is \"too big to be choosing partners\".\n\nBrazil is a major power in the world. It is the largest country with the biggest population in Latin America, its economy is in the world's top 10 in terms of size and its Amazonian rain forest is essential to reducing climate change.\n\nImage: Lula was sworn in as Brazil's president for the third time in January\n\nBrazil's international political stance is also critical when the United States' \"unipolar moment\" of world dominance is over and new superpowers such as China and India are rising, potentially threatening the \"Western democratic\" notions of governance established after the Second World War.\n\nLula served two terms as president of Brazil between 2003 and 2010. A working-class trade unionist from the Workers Party, his repeated electoral success consolidated his country as a representative democracy. He was feted as a regular guest at the summits of the G7 club of rich nations.\n\nAfter standing down as president in 2010 he was convicted and imprisoned on corruption charges. These were subsequently annulled, enabling him to run for office again in 2022. European leaders barely hid their satisfaction when he beat the right-wing Trumpian incumbent Jair Bolsonaro in the second round of voting.\n\nWestern leaders praised Lula\n\nPrime Minister Rishi Sunak tweeted: \"Congratulations to @LulaOficial on his victory in Brazil's election.\n\n\"I look forward to working together on the issues that matter to the UK and Brazil, from growing the global economy to protecting the planet's natural resources and promoting democratic values.\"\n\nKeir Starmer was similarly effusive: \"Congratulations to @LulaOficial on the great news of his election as president of Brazil. This win must also be the start of a new era of global cooperation and action in the fight against climate change.\"\n\nLula reappointed his sometime rival Marina Silva, a widely respected politician and environmentalist, as minister of the environment and climate change, but so far delivery by his administration has been disappointing.\n\nImage: Deforestation in the Amazon is not slowing down\n\nThe rate of deforestation in the Amazon went up 75% under President Bolsonaro and it has not yet slowed down. February 2023 was the worst ever month.\n\nAccording to the DEFER surveillance by Brazil's own INPE (National Institute for Space Research) 209 square kilometres of forest were destroyed, the equivalent of 30,000 football pitches.\n\nLula's priorities for his presidency are fighting hunger and poverty and managing de-industrialisation through investment in new technologies. He has also set the ambitious target of zero deforestation by 2030. This is largely dependent on international donations to the Amazon Fund.\n\nBoth Germany and Norway have resumed their pledged contributions since his return to office. But the European Union is getting anxious about Brazil's evolving stance. A briefing paper for next week's EU foreign ministers summit, seen by Politico, \"is concerned about Brazil's position on Russia's war on Ukraine and Brazil's lack of delivery on climate environment\".\n\nThese concerns are likely to further delay completion of an historic trade and cooperation pact with the Mercosur trade bloc (Brazil, Argentina, Uruguay and Paraguay) which has been under discussion for 20 years. After signing a Double Tax Agreement with Brazil in December the UK is also hoping for a deal and increased trade with Brazil.\n\nEnvironmental concerns v closer economic ties\n\nCloser economic ties are threatened by environmental concerns in Europe. To take the area of agricultural exports as an example, the UK government is being pressed to take a tougher line on so-called \"Cattle-laundering\", the practice whereby animals are raised on illegally deforested land but moved to other farms to qualify as legal meat at slaughter.\n\nThe censorious imposition of trade sanctions by the US and Europe for political reasons and perceived violations of international laws is antagonizing other countries. Instead of entering into multilateral rules-based agreements, Brazil, like many other middle to high income economies, is striking bilateral deals with China and Russia. In China's case, this is often backed up by inward investment and foreign aid.\n\nPlease use Chrome browser for a more accessible video player 1:18 US warns China not to help Russia\n\nAt this month's IMF World Bank meeting the former US Treasury Secretary Larry Summers admitted he is troubled that the US and its allies are becoming isolated as other powers get together. People from developing countries are saying to him: \"What we get from China is an airport. What we get from America is a lecture.\"\n\nChina is already, by far, Brazil's greatest trading partner, exchanges are at a record of high of $150 billion annually.\n\n\"The West\" may broadly agree on political outlook but their circumstance means that the US and European nations are dealing with Chinese expansionism in different ways.\n\nThe US has the capacity to be largely self-sufficient and, encouraged by incentives in President Biden's Inflation Reduction Act, is \"re-shoring\" key technologies. Ford has closed its electronic vehicle plant in Brazil.\n\nFriction over Ukraine\n\nEuropean politicians want to increase investment in energy and digital in Latin America and they are in desperate need of raw materials and rare earth minerals from there for new technology. From Bolivia to Afghanistan, China is investing in lithium extraction, a key element in batteries.\n\nFollowing outcry in the US and Europe, President Lula has not repeated his early view of Ukraine's President Zelenskyy that \"this guy is responsible as Putin for the war\" and has conceded that Russia is in \"violation of Ukraine's territorial integrity\".\n\nNext week, Lula is due to visit Spain - his country's closest historical links are with Iberia. It remains to be seen if he will take up Zelenskyy's invitation to come and see what is happening for himself.\n\nPlease use Chrome browser for a more accessible video player 5:11 Who is Brazil's new president?\n\nLula has suggested that Ukraine should be ready to \"give up Crimea\". His stance is consistent with Brazil's longstanding non-aligned advocacy of \"peace\". It is also a de facto strengthening of Russia's position in the eyes of the world community if and when peace negotiations take place.\n\nIt undermines NATO's determined opposition to reverse the violent occupation of the party of another sovereign state. The stakes over Taiwan and its world-beating micro-chip industry have been raised even higher.\n\nThe alternative diplomatic and economic path being taken by the BRICS, and especially Lula's democratic Brazil, which was potentially the West's most natural ally in the Ukraine crisis, is writing on the wall for the UK and its European neighbours.\n\nOur values are not supreme. The US umbrella is not a sufficient shield. Welcome to the awkward multi-polar world."
    },
    {
        "title": "Putin’s errors over Ukraine could herald big change for global finance",
        "description": "The inventor of the Brics acronym says sanctions against Russia have exposed nations’ dependence on the western economic system",
        "content": "During the brief heyday of Russia as a “Bric”, the acronym I dreamed up in 2001 to describe the possible future largest emerging economies in the world – Brazil, Russia, India and China – I would go to Russia reasonably frequently.\nIn 2008, I was ask... [5094 chars]",
        "url": "https://www.theguardian.com/business/2022/mar/01/putin-errors-ukraine-global-finance-sanctions-russia",
        "image": "https://i.guim.co.uk/img/media/beef24f9772505b75e153a0c78508c32cbb56300/0_252_5629_3378/master/5629.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a1423a37995afc7a17508500553c7dfa",
        "publishedAt": "2022-03-01T11:40:02Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "full_content": "During the brief heyday of Russia as a “Bric”, the acronym I dreamed up in 2001 to describe the possible future largest emerging economies in the world – Brazil, Russia, India and China – I would go to Russia reasonably frequently.\n\nIn 2008, I was asked by the organisers to give a special presentation on where Russia’s economy might be, by 2020, to the St Petersburg Summit, Russia’s own version of Davos. To my slight embarrassment, I hadn’t really appreciated that they would be quite irritated if I didn’t suggest that Russia was likely to be in the top five largest economies of the world by 2020, which I did realise afterwards, when my presentation and comments caused a bit of stir in the post-event coffee areas and media.\n\nEssentially I suggested that given Russia’s challenging demographics, and that crude oil prices were unlikely to continue the one-way rise that had characterised the decade to date, Russia’s potential growth rate was probably not much more than 2%. And if they really wanted to have the powerful economic growth that had been experienced in (those) recent years, they needed to undertake significant reforms to boost productivity.\n\nThe reaction to my presentation among officialdom was my first real suspicion that Russia might have challenges ahead, which of course, was without realising the scale of chaos that was about to unfold in the global financial system and the subsequent economic collapse around much of the world. That set of circumstances contributed to a major multi-year peaking in oil prices, and much of what happened since, which for Russia, has been persistent economic disappointment.\n\nI have no great expertise at geopolitics but I have broadly assumed in the past decade or so that Vladimir Putin had decided that his huge domestic popularity would decline because he couldn’t achieve the growth that had taken place pre-crisis. Nor could he really reform, because much of his personal financial benefit and those of some close to him depended on the status quo, so he had to shift to another platform, which was loosely based around the idea of making Russia great.\n\nDuring those years, I got to know several senior technocrats in the policy world, primarily from the central bank and finance ministry, and leading economic influencers, and I was often struck by how widely the belief was about Putin’s excellence as a strategist.\n\nI had for some years been expecting some great era of big reforms to be unleashed due to these views but alas, they never came, and instead, this game of playing on his perception of western weakness dominated his apparent strategic thinking.\n\nWell, after the weekend just passed, and the western financial sanctions announced, it seems to me that Putin isn’t such a great strategist after all.\n\nI don’t know where the idea of freezing the central bank’s foreign exchange reserves originated, but whoever thought of it has come up with a cracker, alongside the bold move by leading western nations to agree to remove key Russian banks from the Swift plumbing network of the financial system.\n\nIn one fell swoop, that announcement has essentially eradicated the relevance of Russia’s massive official foreign exchange reserves, and with it, sowed the seeds for big problems for the Russian economy. I had been thinking throughout recent weeks: how can a country that is no longer in the top 10 largest of the world’s economy (barely 2% of global GDP now) have such apparent military importance around the world? After the further collapse of the currency, the ability of Russia to remain anywhere near as important globally is starting to rapidly fade. Based on the exchange rate on Monday, Russia could at the end of 2022 rank no higher than 15th.\n\nWhile the background to recent awful events had included a picture of increasing closeness between Beijing and Moscow, I suspect the Chinese leadership might be scathing about what Putin has provoked as a response from the west. Now any country thinking of using its supposed military might to pick on a small neighbour to the dislike of the western democratic alliance will have to calculate the consequences for their own central bank being frozen out of the system, and with it, economic warfare being used in such speedy form as a much more powerful form of influence.\n\nSign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk\n\nOf course, there are many other aspects that go along in parallel, not least the remarkable shift in German policy on its own defence spending, its decision to pay for some weapons for Ukraine, and, of course, its sudden opposition to the previously agreed deal for a pipeline for more Russian gas. And with this, there has been a much more joined-up and robust EU policy response.\n\nIt is now likely the case that some thinkers around the large emerging economies will have to, once again, rethink their happy dependency on the western-dominated financial system, and it is not impossible that current events sow the seeds for a big reform of the global financial system. There is no way that is going to happen unless such countries, China included, shift their approach to the use of their currency, and with it, many aspects of their economic and related systems. As for Russia, some huge reflection on its leadership must surely soon occur."
    }
]