[
    {
        "title": "Trump mistakes Spain for Brics member and repeats tariffs threat",
        "description": "Spain is not in the bloc of nations known as Brics, which is an acronym for Brazil, Russia, India, China and South Africa.",
        "content": "US President Donald Trump has apparently confused Spain for a member of the Brics bloc of developing economies, causing some head-scratching and jitters over possible tariffs in Madrid.\nSpain is not in Brics, an acronym for Brazil, Russia, India, Chi... [1574 chars]",
        "url": "https://www.breakingnews.ie/us-election/trump-mistakes-spain-for-brics-member-and-repeats-tariffs-threat-1720450.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDFcXFwvMjExNDQ4NDlcXFwvN2I3YzAyZDVhODYzNGNjZmI2MWMwYTJkY2MxYjEwOWYuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI5OWRmNGM0NzNkNzRmNzNmM2FjNGU1MzdiZTFjNDBmNDNjMzljMDVjIn0=/trump-mistakes-spain-for-brics-member-and-repeats-tariffs-threat.jpg",
        "publishedAt": "2025-01-21T00:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "US President Donald Trump has apparently confused Spain for a member of the Brics bloc of developing economies, causing some head-scratching and jitters over possible tariffs in Madrid.\n\nSpain is not in Brics, an acronym for Brazil, Russia, India, China and South Africa. Spain is a member of Nato, along with the US, and of the European Union.\n\nAdvertisement\n\nMr Trump erroneously said Spain was in Brics when a journalist asked him about Nato countries like Spain which do not meet the Nato minimum of spending 2% of economic output on defence. Spain ranked last in the 32-nation military alliance, estimated to spend 1.28% on defence last year.\n\nMr Trump started his answer by saying “Spain is very low,” referring to its defence expenditures, but quickly veered into speaking about Brics.\n\n“They’re a Brics nation, Spain. Do you know what a Brics nation is? You’ll figure it out,” he told the reporter from the presidential desk in the Oval Office.\n\nMr Trump repeated his threat to put costly tariffs on Brics, saying “we are going to put at least a 100% tariff on the business they do with the United States,” part of his economic plans that would overturn decades of free trade consensus.\n\nAdvertisement\n\nSpanish education minister Pilar Alegria, who acts as a spokeswoman for the government, said she was not sure why Mr Trump made the comment.\n\n“I don’t know if the affirmation made by president Trump was the result of a mix-up or not, but I can confirm that Spain is not in Brics,” Ms Alegria told reporters on Tuesday.\n\nSpain has been a committed member of Nato for the past four decades, she added, and the Spanish government considers the US “a natural ally”.\n\nSpain is one of eight countries that failed to meet Nato’s 2% spending target last year. Mr Trump has said he wants Nato members to reach 5% spending on defence."
    },
    {
        "title": "Diplomatic success for Putin was also demonstration of Brics dynamism",
        "description": "Kazan Declaration reflects the grievances and aspirations shared by the disparate countries that are part of Brics",
        "content": "Chinese president Xi Jinping and Russian president Vladimir Putin were among more than 20 world leaders to attend this week's Brics summit in Kazan, Russia. Photograph: Maxim Shipenkov/Pool/AFP via Getty Images\nWith more than 20 leaders showing up in... [5374 chars]",
        "url": "https://www.irishtimes.com/world/asia-pacific/2024/10/25/diplomatic-success-for-putin-was-also-demonstration-of-brics-dynamism/",
        "image": "https://www.irishtimes.com/resizer/v2/SSGYJBFOOTO2J2OUXSR45GTUKY.jpg?smart=true&auth=c98a118ef3f260e4a9adfa910d737a57c9051996a99104a925f588bb152acf7a&width=1200&height=630",
        "publishedAt": "2024-10-25T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/asia-pacific/2024/10/25/diplomatic-success-for-putin-was-also-demonstration-of-brics-dynamism/"
    },
    {
        "title": "Commonwealth and Brics",
        "description": "A new world order",
        "content": "Sir, – You gave an apt description in your editorial (October 22nd) of “a shifting world order” to the international summits taking place on our planet.\nLeaders of the Commonwealth headed to Samoa while Brazil, India, China and South Africa went to K... [924 chars]",
        "url": "https://www.irishtimes.com/opinion/letters/2024/10/25/commonwealth-and-brics/",
        "image": "https://www.irishtimes.com/resizer/v2/VHFAVTA4U5C7FE2ZTPOGOKHXN4.jpg?smart=true&auth=1f202b740bd44798a55898a19ef6a892873ae4e538e9e94222c2b3519c6cad0e&width=1200&height=630",
        "publishedAt": "2024-10-24T23:30:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/opinion/letters/2024/10/25/commonwealth-and-brics/"
    },
    {
        "title": "Putin presides over BRICS summit seeking to expand Russia’s clout",
        "description": "The three-day summit in the city of Kazan covered the deepening of financial cooperation, regional conflicts and moving to expand the group.",
        "content": "Russian President Vladimir Putin on Thursday presided over a closing session of a summit of the BRICS bloc of developing economies, hailing its role as a counterbalance to the West.\nThe three-day summit in the city of Kazan covered the deepening of f... [2988 chars]",
        "url": "https://www.breakingnews.ie/world/putin-presides-over-brics-summit-seeking-to-expand-russias-clout-1687001.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjRcXFwvMTBcXFwvMjQxMDU0MjRcXFwvZTc3YzFhOGUzNDU2NGMyNGE2ZGQ2YjI2ODBlYzNlNmMuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJkMDRlOGJjODJiMjA0YWRkZmE3MGM4OWZkYWI4MGNkOTRjYTE1OGRiIn0=/putin-presides-over-brics-summit-seeking-to-expand-russia-s-clout.jpg",
        "publishedAt": "2024-10-23T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russian President Vladimir Putin on Thursday presided over a closing session of a summit of the BRICS bloc of developing economies, hailing its role as a counterbalance to the West.\n\nThe three-day summit in the city of Kazan covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, as well as settling regional conflicts and moving to expand the BRICS group of countries.\n\nAdvertisement\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.\n\n\n\nRussian President Vladimir Putin, right, and other participants pose for a photo at the BRICS Summit in Kazan, Russia (Alexander Nemenov/AP)\n\nTurkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nSpeaking during Thursday’s session, which included countries that consider joining the grouping, Putin said they all “share similar aspirations and values and a vision of new democratic global order”.\n\nThe summit was attended by 36 countries, highlighting the failure of US-led efforts to isolate Russia over its actions in Ukraine.\n\nAdvertisement\n\nThe Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network Swift and allow Moscow to dodge Western sanctions and trade with partners.\n\nIn a joint declaration issued Wednesday, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS.\n\nThey noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access”.\n\nAdvertisement\n\nChina’s President Xi Jinping has emphasised the bloc’s role in ensuring global security.\n\nMr Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\nPutin and Mr Xi had announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022.\n\nThey already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organisation summit in Kazakhstan in July.\n\nAdvertisement\n\nRussia’s cooperation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China.\n\nWhile Western allies want India to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasising a peaceful settlement.\n\nPutin, who held a series of bilateral meetings on the side-lines of the summit, was set to meet Thursday with UN Secretary-General Antonio Guterres, who is making his first visit to Russia in more than two years.\n\nMr Guterres’s trip to Kazan has drawn an angry reaction from Kyiv."
    },
    {
        "title": "Financial co-operation and Brics expansion on table as Putin hosts leaders",
        "description": "The Brics summit in Kazan is intended to push back against Western dominance in the world’s affairs.",
        "content": "Russia’s President Vladimir Putin has hosted China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the Brics bloc of developing economies – part of the Kremlin’s efforts to challenge Western global clout.\nSpeaking at the st... [3736 chars]",
        "url": "https://www.breakingnews.ie/world/financial-co-operation-and-brics-expansion-on-table-as-putin-hosts-leaders-1686361.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjRcXFwvMTBcXFwvMjMxMDQ1MzhcXFwvMTljMjE3YWZmM2FiNDVmYTgyNTMzYjExNjEzNTYxZGEuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJjNGFkYjFlNGQ5ZjA5YTFjMjhlNzYzYjljOTM4ZjRmODNjOWQxNWJkIn0=/financial-co-operation-and-brics-expansion-on-table-as-putin-hosts-leaders.jpg",
        "publishedAt": "2024-10-22T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russia’s President Vladimir Putin has hosted China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the Brics bloc of developing economies – part of the Kremlin’s efforts to challenge Western global clout.\n\nSpeaking at the start of the Brics meeting, Mr Putin underlined deepening co-operation in the financial sector as part of its agenda.\n\nAdvertisement\n\nHe said participants were also set to discuss a range of international issues including the settlement of regional conflicts, along with the expansion of the Brics group of countries.\n\n\n\n\n\n“The Brics strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Mr Putin said.\n\n“This approach is especially relevant in the current conditions when truly radical changes are underway across the globe, including the shaping of a multipolar world.”\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia.\n\nAdvertisement\n\nTurkey, Azerbaijan and Malaysia have formally applied to become members, and several others have expressed an interest in joining.\n\nThe three-day summit in the city of Kazan was attended by 36 countries, highlighting the failure of US-led efforts to isolate Russia over its actions in Ukraine. The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\n\n\nChinese President Xi Jinping’s attendance will be carefully watched over signs of coolness over the Russian invasion of Ukraine (Pool via AP)\n\nThe Kremlin has cast Brics as a counterbalance to the Western-dominated global order and redoubled its efforts to court the countries of the Global South after sending troops into Ukraine in February 2022.\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network Swift and allow Moscow to dodge Western sanctions and trade with partners.\n\nAdvertisement\n\nSpeaking at the summit, Mr Putin accused the US of “weaponising” the dollar and described it as a “big mistake”.\n\n“It’s not us who refuse to use the dollar,” he said. “But if they don’t let us work, what can we do? We are forced to search for alternatives.”\n\nHe also proposed creating a new Brics investment platform, saying it could “become a powerful tool for supporting our economies, and would also provide financial resources to countries of the Global South and East”.\n\n\n\nThe summit is intended to counter western dominance on the world stage (Pool via AP)\n\nIn a joint declaration, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within Brics.\n\nAdvertisement\n\nThey noted the benefits of “faster, low cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimising trade barriers and non-discriminatory access”.\n\nMr Putin, who is set to hold more than a dozen bilateral meetings on the sidelines, conferred with Mr Xi, Mr Modi and South African President Cyril Ramaphosa on Tuesday ahead of the summit’s opening.\n\nMr Xi and Mr Putin announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022.\n\nThey have already met twice this year, in Beijing in May and at a Shanghai Cooperation Organisation summit in Kazakhstan in July.\n\nAdvertisement\n\n\n\n\n\n#BRICS2024\n\n\n\n🛬 UN Secretary-General @antonioguterres arrived in Kazan. He was warmly welcomed at the airport, in accordance with long-standing Russian and Tatar traditions. As a guest of honour, the Secretary-General was treated to the famous Russian bread & salt. pic.twitter.com/qfDAM58hGh — MFA Russia 🇷🇺 (@mfa_russia) October 23, 2024\n\nDuring Tuesday’s meeting with Mr Xi, Mr Putin described the relations between Moscow and Beijing as “one of the main stabilising factors on the world arena”.\n\nHe vowed to “expand co-ordination on all multilateral forums for the sake of global stability and a fair world order”.\n\nMr Xi, hailing the “unprecedented character” of Russia-China ties, said: “Amid tectonic transformations unseen for centuries, the international situation is undergoing serious changes and upheavals.”\n\nRussia’s co-operation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China.\n\n\n\nMr Putin hailed his relationship with China’s President (Pool via AP)\n\nWestern allies want India to be more active in persuading Moscow to end the war in Ukraine, but Mr Modi has avoided condemning Russia while emphasizing a peaceful settlement.\n\n“We fully support the quickest establishment of peace and stability,” said Mr Modi, who last visited Russia in July.\n\nOn Thursday, Mr Putin is also set to meet with United Nations Secretary-General Antonio Guterres, who will be making his first visit to Russia in more than two years.\n\nMr Guterres has repeatedly criticised Russia’s actions in Ukraine."
    },
    {
        "title": "The Irish Times view on the Brics summit: signs of shifting international alliances",
        "description": "Driven by Russia and China, the Brics aspire to be a global counterweight to western power, though it can be an uncomfortable alliance",
        "content": "Two international summits opened yesterday, with leaders of the Commonwealth heading to Samoa, while Russia hosted the Brics – also including Brazil, India, China and South Africa – in Kazan. The decisions by Indian prime minister Narendra Modi and S... [1789 chars]",
        "url": "https://www.irishtimes.com/opinion/editorials/2024/10/22/the-irish-times-view-on-the-brics-summit-signs-of-shifting-international-alliances/",
        "image": "https://www.irishtimes.com/resizer/v2/CT7KUNHPWZUD3QPZZ5KNFUEUMI.jpg?smart=true&auth=000235379fdc015389ec46632abff170055f201c88dfa1d8c0d9ba29ce2f7477&width=1200&height=630",
        "publishedAt": "2024-10-22T19:10:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/opinion/editorials/2024/10/22/the-irish-times-view-on-the-brics-summit-signs-of-shifting-international-alliances/"
    },
    {
        "title": "Putin hosts Brics summit to show the West it can’t keep Russia off global stage",
        "description": "The Brics summit in Kazan aims to counterbalance the Western-led world order.",
        "content": "Russian President Vladimir Putin is to host a meeting featuring China’s Xi Jinping, India’s Narendra Modi, Turkey’s Recep Tayyip Erdogan and Iran’s Masoud Pezeshkian this week, defying predictions that the war in Ukraine and an international arrest w... [5109 chars]",
        "url": "https://www.breakingnews.ie/world/putin-hosts-brics-summit-to-show-the-west-it-cant-keep-russia-off-global-stage-1685790.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjRcXFwvMTBcXFwvMjIwOTIxMTdcXFwvMzg0M2MwMDlkOGNiNDBiMTkyNmIwZTI4Y2NhZWQ5N2YuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI2YjU4NThiNWI1ZDIyYWQzOTFkZjRhMzMwNThmZTAxYjVkYTYxNmIzIn0=/putin-hosts-brics-summit-to-show-the-west-it-can-t-keep-russia-off-global-stage.jpg",
        "publishedAt": "2024-10-21T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Russian President Vladimir Putin is to host a meeting featuring China’s Xi Jinping, India’s Narendra Modi, Turkey’s Recep Tayyip Erdogan and Iran’s Masoud Pezeshkian this week, defying predictions that the war in Ukraine and an international arrest warrant would turn him into a pariah.\n\nThe leaders will appear in the Russian city of Kazan for a meeting of the Brics (Brazil, Russia, India, China, South Africa) bloc of developing economies.\n\nAdvertisement\n\nThe alliance, which aims to counterbalance the Western-led world order, initially included Brazil, Russia, India, China and South Africa, but is expanding rapidly.\n\n\n\nIndian Prime Minister Narendra Modi is one of the senior delegates in Kazan (Photo host brics-russia2024.ru via AP)\n\nIran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia joined in January; Turkey, Azerbaijan and Malaysia have formally applied, and a number of others expressed a desire to be members.\n\nRussian officials already see the meeting as a massive success. Mr Putin’s foreign policy aide Yuri Ushakov said 36 countries confirmed their participation, and more than 20 will send heads of state.\n\nMr Putin will hold around 20 bilateral meetings, Mr Ushakov said, and the summit could turn into “the largest foreign policy event ever held” on Russian soil.\n\nAdvertisement\n\nOn the sidelines of the summit, Mr Putin also will meet United Nations Secretary-General Antonio Guterres, Mr Ushakov said. It will be the first visit to Russia in more than two years for Mr Guterres, who has repeatedly criticised Russia’s war in Ukraine.\n\n\n\nMr Putin will want to promote his close ties with Chinese President Xi Jinping – with the latter being watched for any signs of coolness over the war in Ukraine (Kremlin Pool Photo via AP)\n\nAnalysts say the Kremlin wants the optics of standing shoulder-to-shoulder with its global allies amid continued tensions with the West, as well as the practicality of negotiating deals with them to shore up Russia’s economy and its war effort.\n\nFor the other participants, it is a chance to amplify their voices and narratives.\n\n“The beauty of Brics is that it doesn’t put too many obligations on you,” said Alexander Gabuyev, director of the Carnegie Russia Eurasia Centre.\n\nAdvertisement\n\n“There are not that many strings attached, really, to being part of Brics. And at the same time, there might be interesting opportunities coming your way, including just having more face time with all of these leaders.”\n\nFor Mr Putin, the summit is important personally because it shows the failure of Western efforts to isolate him, Mr Gabuyev said.\n\nThe gathering will demonstrate at home and abroad that “Russia is really an important player that is leading this new group that will end the Western dominance – that’s his personal narrative”, he said.\n\n\n\nThe summit will take place in Kazan (AP)\n\nThe Kremlin will be able to talk to major players like India and China about expanding trade and bypassing Western sanctions. India is an important market for Russian commodities, while China is where Moscow hopes to source dual-use and various military-related goods, Mr Gabuyev said.\n\nAdvertisement\n\nRussia also wants more countries participating in a payment system project that would be an alternative to the global bank messaging network SWIFT, allowing Moscow to trade with partners without worrying about sanctions.\n\n“The Russian idea is that if you create a platform where there is China, Russia, India and Brazil and Saudi Arabia, many countries that are vital partners for the US, the US will not be ready to go after this platform and sanction it,” Mr Gabuyev said.\n\nRussia is also expected to sign a “comprehensive strategic partnership” treaty with Iran, bolstering the increasingly close ties between Moscow and Tehran.\n\nAfter the invasion of Ukraine, Iran provided Moscow with hundreds of drones and helped launch their production in Russia.\n\nAdvertisement\n\n\n\nTurkey has formally applied to join the bloc (AP)\n\nThe Iranian drone deliveries, which Moscow and Tehran have denied, have allowed for a constant barrage of long-range drone strikes at Ukraine’s infrastructure.\n\nIran, in turn, wants sophisticated Russian weapons like long-range air defence systems and fighter jets to help fend off a possible attack by Israel. Kremlin spokesman Dmitry Peskov refused to comment when asked whether the treaty will include mutual military assistance.\n\nFor China, Brics is among several international organisations – along with the security-focused Shanghai Cooperation Organisation – through which it seeks to promote an alternative to the US-led world order.\n\nMr Xi pushed for enlarging Brics, and the Kazan summit will consolidate economic, technological and military ties in the expanded bloc, said Willy Lam, a senior China fellow at the Jamestown Foundation.\n\nBeijing and Moscow also want to see if a new international trading currency could “challenge so-called dollar hegemony”, Mr Lam said.\n\nThe summit will allow Mr Xi and Mr Putin to flaunt their close relationship. The two, who announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022, already have met at least twice this year, in Beijing in May and at a SCO summit in Kazakhstan in July.\n\nAlthough they will continue to present a united front, experts are watching for subtle signs of Mr Xi distancing himself from Mr Putin over the war in Ukraine."
    },
    {
        "title": "Putin hosts Global South leaders at Brics summit intended to counter West",
        "description": "At the meeting in Kazan, Vladimir Putin will be keen to show that efforts to isolate Russia over the war in Ukraine have failed.",
        "content": "China’s Xi Jinping, India’s Narendra Modi and other global leaders have arrived in the Russian city of Kazan for a summit of the Brics bloc of developing economies which the Kremlin hopes to turn into a rallying point for defying the Western liberal ... [5445 chars]",
        "url": "https://www.breakingnews.ie/world/putin-hosts-global-south-leaders-at-brics-summit-intended-to-counter-west-1685819.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjRcXFwvMTBcXFwvMjIxMDU0MzJcXFwvOGQxYmViMzJjMDYxNDQ2MTkyNzViMDJjODZjZmJkZTAuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJmZTQ3ZmVmZTIyNzg1MDJiOTgyMDc5NWI1MTE2ZjA3NGNiMmYwNGE4In0=/putin-hosts-global-south-leaders-at-brics-summit-intended-to-counter-west.jpg",
        "publishedAt": "2024-10-21T23:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "China’s Xi Jinping, India’s Narendra Modi and other global leaders have arrived in the Russian city of Kazan for a summit of the Brics bloc of developing economies which the Kremlin hopes to turn into a rallying point for defying the Western liberal order.\n\nFor Russian President Vladimir Putin, the three-day meeting also offers a powerful way to demonstrate the failure of US-led efforts to isolate Russia over its action in Ukraine.\n\nAdvertisement\n\nKremlin foreign affairs adviser Yuri Ushakov touted the summit as “the largest foreign policy event ever held” by Russia, with 36 countries attending and more than 20 of them represented by heads of state.\n\n\n\n\n\n📹 The #BRICS2024 Summit starts today!\n\n\n\n📍 Kazan, Russia\n\n\n\nThe main venue – Kazan Expo International Exhibition Center – is tingling in anticipation of the many foreign guests 🤗 pic.twitter.com/v48y7aaL7w — MFA Russia 🇷🇺 (@mfa_russia) October 22, 2024\n\nThe Brics alliance, which aims to counterbalance the Western-led world order, initially included Brazil, Russia, India, China and South Africa, but is expanding rapidly.\n\nIran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia joined in January; Turkey, Azerbaijan and Malaysia have formally applied, and a number of others expressed a desire to be members.\n\nRussian officials already see the meeting as a massive success. Mr Putin’s foreign policy aide Yuri Ushakov said 36 countries confirmed their participation, and more than 20 will send heads of state.\n\nAdvertisement\n\nMr Putin will hold around 20 bilateral meetings, Mr Ushakov said, and the summit could turn into “the largest foreign policy event ever held” on Russian soil.\n\nOn the sidelines of the summit, Mr Putin also will meet United Nations Secretary-General Antonio Guterres, Mr Ushakov said. It will be the first visit to Russia in more than two years for Mr Guterres, who has repeatedly criticised Russia’s war in Ukraine.\n\n\n\nMr Putin will want to promote his close ties with Chinese President Xi Jinping – with the latter being watched for any signs of coolness over the war in Ukraine (Kremlin Pool Photo via AP)\n\nAnalysts say the Kremlin wants the optics of standing shoulder-to-shoulder with its global allies amid continued tensions with the West, as well as the practicality of negotiating deals with them to shore up Russia’s economy and its war effort.\n\nFor the other participants, it is a chance to amplify their voices and narratives.\n\nAdvertisement\n\n“The beauty of Brics is that it doesn’t put too many obligations on you,” said Alexander Gabuyev, director of the Carnegie Russia Eurasia Centre.\n\n“There are not that many strings attached, really, to being part of Brics. And at the same time, there might be interesting opportunities coming your way, including just having more face time with all of these leaders.”\n\nFor Mr Putin, the summit is important personally because it shows the failure of Western efforts to isolate him, Mr Gabuyev said.\n\nThe gathering will demonstrate at home and abroad that “Russia is really an important player that is leading this new group that will end the Western dominance – that’s his personal narrative”, he said.\n\nAdvertisement\n\n\n\nThe summit will take place in Kazan (AP)\n\nThe Kremlin will be able to talk to major players like India and China about expanding trade and bypassing Western sanctions. India is an important market for Russian commodities, while China is where Moscow hopes to source dual-use and various military-related goods, Mr Gabuyev said.\n\nRussia also wants more countries participating in a payment system project that would be an alternative to the global bank messaging network SWIFT, allowing Moscow to trade with partners without worrying about sanctions.\n\n“The Russian idea is that if you create a platform where there is China, Russia, India and Brazil and Saudi Arabia, many countries that are vital partners for the US, the US will not be ready to go after this platform and sanction it,” Mr Gabuyev said.\n\nRussia is also expected to sign a “comprehensive strategic partnership” treaty with Iran, bolstering the increasingly close ties between Moscow and Tehran.\n\nAdvertisement\n\nAfter the invasion of Ukraine, Iran provided Moscow with hundreds of drones and helped launch their production in Russia.\n\n\n\nTurkey has formally applied to join the bloc (AP)\n\nThe Iranian drone deliveries, which Moscow and Tehran have denied, have allowed for a constant barrage of long-range drone strikes at Ukraine’s infrastructure.\n\nIran, in turn, wants sophisticated Russian weapons like long-range air defence systems and fighter jets to help fend off a possible attack by Israel. Kremlin spokesman Dmitry Peskov refused to comment when asked whether the treaty will include mutual military assistance.\n\nFor China, Brics is among several international organisations – along with the security-focused Shanghai Cooperation Organisation – through which it seeks to promote an alternative to the US-led world order.\n\nMr Xi pushed for enlarging Brics, and the Kazan summit will consolidate economic, technological and military ties in the expanded bloc, said Willy Lam, a senior China fellow at the Jamestown Foundation.\n\nBeijing and Moscow also want to see if a new international trading currency could “challenge so-called dollar hegemony”, Mr Lam said.\n\nThe summit will allow Mr Xi and Mr Putin to flaunt their close relationship. The two, who announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022, already have met at least twice this year, in Beijing in May and at a SCO summit in Kazakhstan in July.\n\nAlthough they will continue to present a united front, experts are watching for subtle signs of Mr Xi distancing himself from Mr Putin over the war in Ukraine."
    },
    {
        "title": "Brics and Global South directly shifting world order dominated so far by G7",
        "description": "Diplomats and analysts in New Delhi look to reworked multipolar, mutually equitable and sustainable global relations",
        "content": "Narendra Modi, India's prime minister: India views China’s foreign policy (the Belt and Road Initiative), striving to connect Asia, Africa and Europe via land and sea routes, as a hegemonic ploy to encircle it and dominate South Asia. Photograph: Pra... [6267 chars]",
        "url": "https://www.irishtimes.com/world/asia-pacific/2024/09/27/brics-and-global-south-directly-shifting-world-order-dominated-so-far-by-g7/",
        "image": "https://www.irishtimes.com/resizer/v2/XSEKV7PT6BI2WMCDVU3CB23OOQ.jpg?smart=true&auth=3b84a267061537cf430cdc718f6fa8954a28b4dda1b110bbe462f544da627cf2&width=1200&height=630",
        "publishedAt": "2024-09-27T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/asia-pacific/2024/09/27/brics-and-global-south-directly-shifting-world-order-dominated-so-far-by-g7/"
    },
    {
        "title": "European Union ‘failed to pay attention’ to Global South for years",
        "description": "Europe struggling to navigate growing force of Brics countries on international stage",
        "content": "The European Union and other major western powers have for years failed to pay enough attention to the Global South, and as a result are struggling to understand the shifting world order, according to several experts and academics.\nAfter long periods... [4532 chars]",
        "url": "https://www.irishtimes.com/world/europe/2024/09/26/european-union-failed-to-pay-attention-to-global-south-for-years/",
        "image": "https://www.irishtimes.com/resizer/v2/IIT5KN5ET3PHM42C324KEJMI24.jpg?smart=true&auth=4bcd07b5e1be29f18ea21e1d3928c0532ed6589810ea33d73218bb6a2daf703d&width=1200&height=630",
        "publishedAt": "2024-09-26T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/europe/2024/09/26/european-union-failed-to-pay-attention-to-global-south-for-years/"
    },
    {
        "title": "Argentina announces it will not join economic bloc in latest policy shift",
        "description": "President Javier Milei said the moment was not ‘opportune’ for Argentina to join Brics as a full member.",
        "content": "Argentina formally announced on Friday that it will not join the Brics bloc of developing economies, the latest in a dramatic shift in foreign and economic policy by Argentina’s new far-right populist President Javier Milei.\nIn a letter addressed to ... [2175 chars]",
        "url": "https://www.breakingnews.ie/world/argentina-announces-it-will-not-join-economic-bloc-in-latest-policy-shift-1570058.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjNcXFwvMTJcXFwvMjkxOTIxMTVcXFwvNWRmODlkZGYwZTJhNDZiZGFhMzRhMjBhMTIxZTkzYmYtMS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjYwMGQ5NTU5NzhkNzRhYzM5ZjgyNzdiMjU5MjMxN2M5MDEzYTVhODQifQ==/argentina-announces-it-will-not-join-economic-bloc-in-latest-policy-shift.jpg",
        "publishedAt": "2023-12-29T00:00:00Z",
        "source": {
            "name": "BreakingNews.ie",
            "url": "https://www.breakingnews.ie"
        },
        "full_content": "Argentina formally announced on Friday that it will not join the Brics bloc of developing economies, the latest in a dramatic shift in foreign and economic policy by Argentina’s new far-right populist President Javier Milei.\n\nIn a letter addressed to the leaders of Brazil, Russia, India, China and South Africa — all members of the alliance — Mr Milei said the moment was not “opportune” for Argentina to join as a full member.\n\nAdvertisement\n\nThe letter was dated a week ago, December 22, but released by the Argentine government on Friday, the last working day of 2023.\n\nArgentina was among six countries invited in August to join the bloc made up of Brazil, Russia, India, China and South Africa to make an 11-nation bloc. Argentina was set to join January 1, 2024.\n\nThe move comes as Argentina has been left reeling by deepening economic crisis.\n\nMr Milei’s predecessor, former center-left president Alberto Fernandez, endorsed joining the alliance as an opportunity to reach new markets. The Brics currently account for about 40% of the world’s population and more than a quarter of the world’s GDP.\n\nAdvertisement\n\n\n\nArgentina’s President Javier Milei after he was sworn in earlier in December (Matilde Campodonico/AP)\n\nBut economic turmoil left many in Argentina eager for change, ushering chainsaw-wielding political outsider Mr Milei into the presidency.\n\nMr Milei, who defines himself as an “anarcho-capitalist” — a current within liberalism that aspires to eliminate the state — has implemented a series of measures to deregulate the economy, which in recent decades has been marked by strong state interventionism.\n\nIn foreign policy, he has proclaimed full alignment with the “free nations of the West”, especially the US and Israel.\n\nThroughout the campaign for the presidency, Mr Milei also disparaged countries ruled “by communism” and announced that he would not maintain diplomatic relations with them despite growing Chinese investment in South America.\n\nAdvertisement\n\nHowever, in the letter addressed to his counterpart Luiz Inacio Lula Da Silva in neighbouring Brazil and the rest of the leaders of full Brics members — Xi Jinping of China, Narenda Mondi of India, Vladimir Putin of Russia and Cyril Ramaphosa of South Africa — Mr Milei proposed to “intensify bilateral ties” and increase “trade and investment flows”.\n\nMr Milei also expressed his readiness to hold meetings with each of the five leaders."
    },
    {
        "title": "The Irish Times view on the Brics summit: a new world order in the making",
        "description": "Dissatisfaction in many countries about how power is distributed internationally is an important lesson to draw from this event",
        "content": "The Brics summit in Johannesburg last week was a significant event in the changing international order. The decision to enlarge membership is both ambitious and ambiguous in the current changing times. Brazil, Russia, India and China started out as a... [1846 chars]",
        "url": "https://www.irishtimes.com/opinion/editorials/2023/08/27/the-irish-times-view-on-the-brics-summit-a-new-world-order-in-the-making/",
        "image": "https://www.irishtimes.com/resizer/8e01lyvNZNrbiCjcrajUaINy3m8=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/X4MGYKERA5OAG5FX7BKAOKBJSI.jpg",
        "publishedAt": "2023-08-27T19:07:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/opinion/editorials/2023/08/27/the-irish-times-view-on-the-brics-summit-a-new-world-order-in-the-making/"
    },
    {
        "title": "Robotaxi rides in San Francisco have taken on a whole new meaning",
        "description": "Planet Business: Hollywood’s crowded picket lines, a reshuffle at Bloomberg and the countries set to join Brics",
        "content": "A Cruise robotaxi self-drives on a street in San Francisco. But what's going on behind those darkened backseat windows? Photograph: John G. Mabanglo/EPA\nImage of the week: A to B via a big O?\nOn the streets of San Francisco, some citizens have been f... [4568 chars]",
        "url": "https://www.irishtimes.com/business/2023/08/26/enjoying-the-ride-robotaxis-in-san-francisco-give-rise-to-a-new-kind-of-auto-eroticism-with-mixed-results/",
        "image": "https://www.irishtimes.com/resizer/kI5Q1ImALiAbtNSS-7_W3Xxi5hA=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/XR5BPYEBPI443K553I7QLQDBCE.jpg",
        "publishedAt": "2023-08-26T05:30:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/business/2023/08/26/enjoying-the-ride-robotaxis-in-san-francisco-give-rise-to-a-new-kind-of-auto-eroticism-with-mixed-results/"
    },
    {
        "title": "Brics group set to expand with six more countries to join next year",
        "description": "South African president Cyril Ramaphosa says Argentina, Egypt, Ethiopia, Iran, Saudi Arabia and United Arab Emirates to join",
        "content": "Delegates attend a meeting during the 2023 Brics Summit at the Sandton Convention Centre in Johannesburg on Thursday. Photograph: Marco Longari/AFP/Getty\nThe leaders of the Brics states have agreed to invite six countries from Africa, the Middle East... [3514 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/08/24/brics-group-set-to-expand-with-six-more-countries-to-join-next-year/",
        "image": "https://www.irishtimes.com/resizer/-JLkdxFExI4fndvefdKNNg_uXek=/1200x630/filters:format(jpg):quality(70):focal(1656x1060:1666x1070)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/TPT4JMLSUYVGCOOXCAWGAHMQRU.jpg",
        "publishedAt": "2023-08-24T14:57:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/08/24/brics-group-set-to-expand-with-six-more-countries-to-join-next-year/"
    },
    {
        "title": "Vladimir Putin defends Ukraine war during address to Brics summit in Johannesburg",
        "description": "Leaders from Brazil, Russia, India, China and South Africa gather on day two to discuss bloc's common interests",
        "content": "Delegates listening to Russian president Vladimir Putin via video-link at the Brics summit in Johannesburg on Wednesday. Photograph: Alet Pretorius/Getty Images\nRussia’s president Vladimir Putin has used his platform at the Brics Summit in Johannesbu... [3041 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/08/23/vladimir-putin-defends-ukraine-war-during-address-to-brics-summit-in-johannesburg/",
        "image": "https://www.irishtimes.com/resizer/bXf_fU_FTv7vAwXUF0T5XVX8eSk=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/KS2UVFZZKOA2DYTKQ4STFVQBOE.jpg",
        "publishedAt": "2023-08-23T20:37:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/08/23/vladimir-putin-defends-ukraine-war-during-address-to-brics-summit-in-johannesburg/"
    },
    {
        "title": "Brics leaders unite in stand over dominance of trade and finance by West",
        "description": "Brazil, Russia, India, China and South Africa say they will consider requests from more than 20 countries to join group",
        "content": "Leaders of the Brics nations have taken a united stand against the dominance the US and EU exert over international trade and financial systems in their opening remarks at the group’s 15th annual summit in Johannesburg. The leaders of Brazil, Russia,... [2976 chars]",
        "url": "https://www.irishtimes.com/business/economy/2023/08/22/brics-leaders-unite-in-stand-over-dominance-of-trade-and-finance-by-west/",
        "image": "https://www.irishtimes.com/resizer/mfX7EjfMBdQ4XcRQa53D5cjYYIc=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/2ENGJSTX7PWHUDFYDRQXV72PIU.jpg",
        "publishedAt": "2023-08-22T18:32:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/business/economy/2023/08/22/brics-leaders-unite-in-stand-over-dominance-of-trade-and-finance-by-west/"
    },
    {
        "title": "South Africa’s Ramaphosa gives full support to expansion of Brics group ahead of summit",
        "description": "Country’s president emphasises commitment to non-alignment, saying it would not be forced to side with any nation",
        "content": "A janitor works next to a welcome sign as final preparations are underway for the 15th Brics Summit at the Sandton Convention Centre, Johannesburg, South Africa on Monday. Photograph: Kim Ludbrook/EPA\nSouth Africa’s president Cyril Ramaphosa has give... [2730 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/08/21/south-africas-ramaphosa-gives-full-support-to-expansion-of-brics-group-ahead-of-summit/",
        "image": "https://www.irishtimes.com/resizer/PUDrWkYspE6f1O7sDdz_RHluirU=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/FMKH4LH2ZQNCUR5NS6QUEAJEHM.jpg",
        "publishedAt": "2023-08-21T18:17:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/08/21/south-africas-ramaphosa-gives-full-support-to-expansion-of-brics-group-ahead-of-summit/"
    },
    {
        "title": "Brics summit in South Africa to look at expanding group of five nations",
        "description": "Decision taken in June by Brics leaders that Russia’s president Vladimir Putin would stay away",
        "content": "Although economic development is the central theme of a Brics summit South Africa is hosting this week, expanding the group of five nations to increase its influence over world affairs is also high on the bloc’s agenda.\nSouth Africa’s leader Cyril Ra... [4156 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/08/20/brics-summit-in-south-africa-to-look-at-expanding-group-of-five-nations/",
        "image": "https://www.irishtimes.com/resizer/eSNVBO08TXUFMIMy0xHMCRb7-kk=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/SCRNLLOXM5DNP2MLO5BMZVYRPY.jpg",
        "publishedAt": "2023-08-20T20:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/08/20/brics-summit-in-south-africa-to-look-at-expanding-group-of-five-nations/"
    },
    {
        "title": "Putin calls off trip to emerging economies conference in South Africa",
        "description": "Russian president to be replaced by foreign minister Sergei Lavrov at the Brics Summit in Johannesburg, says Cyril Ramaphosa",
        "content": "South African president Cyril Ramaphosa meets Russian president Vladimir Putin during the welcoming ceremony at the Russia-Africa Summit in Black Sea resort of Sochi, Russia in October 2019. Photograph: Mikhail Svetlov/Getty\nRussian president Vladimi... [2772 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/07/19/putin-calls-off-trip-to-emerging-economies-conference-in-south-africa/",
        "image": "https://www.irishtimes.com/resizer/Fydh3duXUx87D-Xl7VXJR1-UrB0=/1200x630/filters:format(jpg):quality(70):focal(439x153:449x163)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/ZSIYZFSPOE4UBBSR3TI6PSFQXY.jpg",
        "publishedAt": "2023-07-19T13:42:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/07/19/putin-calls-off-trip-to-emerging-economies-conference-in-south-africa/"
    },
    {
        "title": "South Africa insists summit immunity will not override warrant for Putin",
        "description": "Brics meeting in Johannesburg in August likely to be attended by Russian president accused of war crimes by the International Criminal Court",
        "content": "South African president Cyril Ramaphosa with Russian president Vladimir Putin: Since the war in Ukraine broke out, South Africa’s government has refused to condemn the Russian invasion, stating it has adopted a non-aligned approach to the conflict. P... [3007 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/05/30/south-africa-insists-summit-immunity-will-not-override-warrant-for-putin/",
        "image": "https://www.irishtimes.com/resizer/5zHbM_VGLjJZPWc6PYQSUes0Kyk=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/ZSIYZFSPOE4UBBSR3TI6PSFQXY.jpg",
        "publishedAt": "2023-05-30T16:18:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/05/30/south-africa-insists-summit-immunity-will-not-override-warrant-for-putin/"
    },
    {
        "title": "Putin’s planned visit to Durban poses a geopolitical dilemma for South Africa",
        "description": "Durban is hosting a summit of the Brics group of nations but as a member of the International Criminal Court South Africa is obliged to arrest the Russian president",
        "content": "Russian president Vladimir Putin’s acceptance of an invitation to attend a summit in Durban for major emerging economies has left South Africa with a significant geopolitical dilemma to resolve.\nLast week, Professor Anil Sooklal, South Africa’s repre... [5874 chars]",
        "url": "https://www.irishtimes.com/world/africa/2023/04/28/wanted-war-criminal-putins-planned-visit-to-durban-poses-a-geopolitical-dilemma-for-south-africa/",
        "image": "https://www.irishtimes.com/resizer/5zHbM_VGLjJZPWc6PYQSUes0Kyk=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/ZSIYZFSPOE4UBBSR3TI6PSFQXY.jpg",
        "publishedAt": "2023-04-28T04:00:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/africa/2023/04/28/wanted-war-criminal-putins-planned-visit-to-durban-poses-a-geopolitical-dilemma-for-south-africa/"
    },
    {
        "title": "Lula says Putin has congratulated him on Brazil election win",
        "description": "Kremlin says both leaders expressed confidence that the countries’ ‘strategic partnership...will develop successfully... within BRICS framework’",
        "content": "Brazil's President-elect Luiz Inacio Lula da Silva gestures during a meeting to celebrate Christmas with collectors of recycling material, in Sao Paulo, Brazil, last week. Photograph: Nelson Almeida/AFP/Getty\nBrazil’s President-elect Luiz Inacio Lula... [1442 chars]",
        "url": "https://www.irishtimes.com/world/2022/12/20/lula-says-putin-has-congratulated-him-on-brazil-election-win/",
        "image": "https://www.irishtimes.com/resizer/zZxNWdOfI2OQ6s8ZvISRD-EQiTM=/1200x630/filters:format(jpg):quality(70):focal(3755x1410:3765x1420)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/IVIHWUQ3GM6BGNAIHC3XT3IG2Q.jpg",
        "publishedAt": "2022-12-20T18:23:00Z",
        "source": {
            "name": "The Irish Times",
            "url": "https://www.irishtimes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.irishtimes.com', port=443): Read timed out. (read timeout=7) on URL https://www.irishtimes.com/world/2022/12/20/lula-says-putin-has-congratulated-him-on-brazil-election-win/"
    }
]