[
    {
        "title": "Brics countries denounce ‘resurgence of trade protectionism’, slam Trump's tariffs",
        "description": "Brics, formed in 2009 by Brazil, Russia, India, and China and currently include Egypt, Ethiopia, Indonesia, Iran, Saudi Arabia, South Africa, and the United Arab Emirates, has emerged as a key counterbalance to Western-led groups such as the G7",
        "content": "Brics, formed in 2009 by Brazil, Russia, India, and China and currently include Egypt, Ethiopia, Indonesia, Iran, Saudi Arabia, South Africa, and the United Arab Emirates, has emerged as a key counterbalance to Western-led groups such as the G7 read ... [3862 chars]",
        "url": "https://www.firstpost.com/world/brics-countries-denounce-resurgence-of-trade-protectionism-slam-trumps-tariffs-13884189.html",
        "image": "https://images.firstpost.com/uploads/2025/04/AFP__20250429__43WU8H4__v1__HighRes__BrazilBricsTradeDiplomacy-2025-04-988743e019abcaf569537e33dd4cb0dc-1200x675.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-04-30T00:21:11Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "Brics, formed in 2009 by Brazil, Russia, India, and China and currently include Egypt, Ethiopia, Indonesia, Iran, Saudi Arabia, South Africa, and the United Arab Emirates, has emerged as a key counterbalance to Western-led groups such as the G7 read more\n\nForeign Ministers and senior diplomats from BRICS countries pose for a family photo during the second day of the BRICS Foreign Ministers meeting in Rio de Janeiro, Brazil. AFP\n\nChina, Brazil, and other Brics members denounced the “resurgence of trade protectionism” on Tuesday during a conference in Rio de Janeiro, overshadowed by US President Donald Trump’s tariff blitz.\n\nChinese Foreign Minister Wang Yi and his Russian colleague Sergei Lavrov were among the 11-country group’s senior diplomats who met for two days to discuss problems ranging from Trump’s trade war to the fight for peace in Ukraine.\n\nMauro Vieira, the foreign minister of Brazil, which now holds the rotating Brics leadership, stated that the bloc emphasised its “firm rejection” of protectionism without directly alluding to Trump.\n\nSTORY CONTINUES BELOW THIS AD\n\nSince returning to the White House in January, Trump has imposed a blanket 10% tax on dozens of nations, while China faces levies of up to 145% on numerous imports.\n\nBeijing has replied with 125% levies on US products.\n\nBrics, formed in 2009 by Brazil, Russia, India, and China and currently include Egypt, Ethiopia, Indonesia, Iran, Saudi Arabia, South Africa, and the United Arab Emirates, has emerged as a key counterbalance to Western-led groups such as the G7.\n\nIt currently accounts for about half of the world’s population and 39% of the global GDP.\n\nThe meeting in Rio came at a critical moment for the world economy after the International Monetary Fund slashed growth forecasts over the impact of Trump’s sweeping levies on imports.\n\nThe ministers did not issue a joint statement.\n\nBrazil instead settled for a declaration summarizing the discussions.\n\nVieira said there was “absolute consensus” on the subject of “trade conflicts and tariffs.”\n\nDDD\n\nSome Brics members have avoided Trump’s trade fury.\n\nBrazilian exports to the United States are subject to 10 percent tariffs, a fraction of those imposed on China.\n\nSTORY CONTINUES BELOW THIS AD\n\nAnd while Latin America’s biggest economy has been hit by Trump’s tariffs on steel imports – Brazil is the second-biggest supplier of steel to the US – President Luiz Inacio Lula’s government has declined to retaliate and sought to negotiate with Washington instead.\n\nBrazil has however made no secret of its frustration with European Union regulations on some of its agricultural exports, imposed over Amazon deforestation.\n\nVieira hit out Tuesday at the use of “non-tariff” trade barriers, deployed under “environmental pretexts.”\n\nThe group trod more carefully on the issue of non-dollar transactions among Brics members.\n\nAt a summit last year in Russia, Brics leaders discussed boosting such transactions, eliciting a swift rebuke from Trump who threatened them with 100 percent tariffs if they undercut the US currency.\n\nBrazil said the ministers this week had “underlined the importance of greater use of local currencies.”\n\nClimate ambitions in jeopardy\n\n“Multilateralism” and “cooperation” were the watchwords of the meeting, which also discussed the wars in Ukraine and Gaza.\n\nSTORY CONTINUES BELOW THIS AD\n\nThe Brics ministers called for a “complete withdrawal” of Israeli forces from Gaza, terming Israel’s more than 50-day aid blockade of the territory “unacceptable.”\n\nThey had less to say about the war in Ukraine, which is at a critical juncture, with Washington threatening to end its efforts to broker peace in the absence of a breakthrough.\n\nAs in the past, Russia’s Brics partners stopped short of condemning Moscow’s invasion of its neighbor, while calling for a “lasting peace deal.”\n\nThe growing global polarization is of particular concern to Brazil as it prepares to host the annual, often fractious UN climate conference in November in the Amazon.\n\nOn Tuesday, Brazil warned that the international “fragmentation” was jeopardizing global “climate action ambitions.”"
    },
    {
        "title": "China’s Unyielding Coal Investments: A BRICS Conundrum",
        "description": "Despite pledges to halt overseas coal financing, China continues to invest in new coal power plants in Indonesia, primarily to support nickel smelters. Chinese involvement signifies a contradiction in global climate efforts, especially among BRICS nations where fossil fuel dependency remains high amid rising energy demands.",
        "content": "Despite China's 2021 promise to stop financing overseas coal projects, Chinese firms are actively involved in constructing new coal-fired power plants in Indonesia, particularly to support nickel smelters. A report by Global Energy Monitor highlights... [834 chars]",
        "url": "https://www.devdiscourse.com/article/headlines/3362916-chinas-unyielding-coal-investments-a-brics-conundrum",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/26_04_2025_07_32_37_905761.png?width=920&format=jpeg",
        "publishedAt": "2025-04-29T02:20:19Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Despite China's 2021 promise to stop financing overseas coal projects, Chinese firms are actively involved in constructing new coal-fired power plants in Indonesia, particularly to support nickel smelters. A report by Global Energy Monitor highlights China's involvement in 7.7 gigawatts of coal power construction in the country.\n\nThe BRICS bloc, encompassing nations such as Brazil, Russia, India, and China, along with newer members like Indonesia, accounts for a substantial portion of the global economy and carbon emissions. While renewable energy has surged in Brazil, India, and China, new BRICS partners rely heavily on fossil fuels, often with support from China.\n\nA concerning trend, identified by GEM, reveals that 62% of the new generation capacity in 10 BRICS countries is financed and constructed by Chinese state-owned enterprises. Experts, including GEM's James Norman, warn that reliance on coal, oil, and gas poses environmental risks. Climate action will be a key focus for BRICS leaders at an upcoming meeting in Brazil ahead of COP 30.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Which BRICS Nations Are Emerging on the Global AI Playing Field?",
        "description": "India, Russia, and China, among other countries, could soon emerge as strong players in shaping AI leadership.",
        "content": "Growing trade ties between Russia and India are set to hit new heights, with artificial intelligence (AI) opening a new chapter in their bilateral ties. However, this potential collabоration is just one piece of a bigger puzzle. It’s important to con... [6269 chars]",
        "url": "https://analyticsindiamag.com/ai-features/which-brics-nations-are-emerging-on-the-global-ai-playing-field/",
        "image": "https://analyticsindiamag.com/wp-content/uploads/2025/04/Global-Ai.jpg",
        "publishedAt": "2025-04-09T12:30:00Z",
        "source": {
            "name": "Analytics India Magazine",
            "url": "https://analyticsindiamag.com"
        },
        "full_content": "Growing trade ties between Russia and India are set to hit new heights, with artificial intelligence (AI) opening a new chapter in their bilateral ties. However, this potential collabоration is just one piece of a bigger puzzle. It’s important to consider how the broader BRICS+ bloc is stepping up efforts in AI development.\n\nWe analysed several AI landscapes and indexes, including those from Tortoise and Stanford. The following countries stand out in the alliance—those who might emerge as strong contenders on the world’s global AI leaderboard.\n\nIndia\n\nAccording to the Global AI Index by Tortoise Media, India currently ranks 10th overall, second in AI talent, and third in AI operating environment.\n\nA report by the IMARC Group specifies that India’s core AI technology market is projected to reach $4 billion by 2028. In contrast, Ken Research’s broader estimates already value the market at nearly $6 billion.\n\nNotably, India consistently ranks among the top five globally for AI-related scholarly papers, producing twice as many master’s-level engineering graduates as the global AI leader, the US. Bengaluru, India’s Silicon Valley, is home to numerous tech firms specialising in AI advancements. The number of tech startups has increased twentyfold in the past five years.\n\nIndia’s strong presence in the AI-as-a-service sector and GenAI tools, especially natural language processing (NLP), instills confidence in its AI capabilities. India’s Union information technology minister Ashwini Vaishnaw has recently committed to delivering a national foundation model within the next 10 months and domestically-produced GPUs within three to five years.\n\nWhen it comes to leading AI players and key accomplishments, Sarvam AI is currently in discussions with the Indian government to develop a sovereign LLM tailored to accommodate India’s multilingual landscape. Meanwhile, Krutrim, India’s first AI unicorn, launched Krutrim-2 last month. It is a best-in-class LLM for Indic languages, and is simultaneously opening a dedicated AI research lab.\n\nReliance Industries recently launched a small language model in Hindi, and Meesho became the first Indian e-commerce company to deploy AI-generated voice for live customer support.\n\nRussia\n\nRussia ranks 21st in government strategies and 22nd in absolute AI capacity in the Global AI Index by Tortoise. Multiple sources state that Russia’s AI economic impact is projected to reach $45-$75 billion by 2028, roughly 4% of the nation’s GDP.\n\nThe nation’s AI-skilled workforce is growing rapidly, supported by prestigious technical universities. Russian IT and AI teams have secured 16 victories at the International Collegiate Programming Contest (ICPC) over the past 25 years—the most of any country since the start of the millennium. As a result, the nation ranks in the top 20 globally in AI research (2.4% global share).\n\nData from the National Center for the Development of Artificial Intelligence indicates that 66% of Russian organisations in priority sectors (finance, healthcare, education, and ICT) actively adopted AI by mid-2024. In comparison, according to Yakov & Partners’ State of AI report, 20% of Russian companies have integrated GenAI into their business operations.\n\nIn the country, a handful of industry leaders have developed their own GenAI models, though their numbers are few. Among Russian tech on the global AI market, only Yandex’s generative models stand alongside top GenAI solutions worldwide. This might come from being the only Russian IT company today mentioned in the same breath as Big Tech, making a big impact on global AI research and teaming up with machine learning groups around the world.\n\nAI tech finds its biggest use in medicine, industry, energy, and finance. For example, 80% of AI solutions used in heavy industry were created domestically. Among the latest developments is a neural network algorithm that improves the quality of turning and lathe machining processes.\n\nChina\n\nAccording to Tortoise Media, China is ranked second overall, trailing only the United States. The nation also holds the second position in terms of absolute AI capacity, as well as commercial implementation and AI infrastructure. China is a major contributor to global AI research and development, leading in the number of AI patents.\n\nThe number of Chinese AI professionals is growing rapidly, with China now producing the highest number of academic papers on machine learning and data science.\n\nChina boasts a large number of prominent AI players recognised for their groundbreaking solutions and pioneering research, with intense competition often driven by aggressive price cuts. Arguably, the most famous of these players outside of China is DeepSeek.\n\nBaidu has also emerged as an AI powerhouse. The company is known for its Ernie chatbot and Baidu AI Cloud for business applications, a standalone AI search app called Simple Search, and Apollo Go, an AI-powered robotaxi service.\n\nMoreover, ByteDance, the parent company of TikTok, is another dominant force in AI, known for its highly rated Doubao LLM and text-to-video models, Jimeng and X-Portrait. One of the world’s largest e-platforms, Alibaba, has also invested tens of billions of dollars into AI research through its DAMO Academy and released several notable solutions, including Qwen.\n\nAnother tech titan, Tencent, continues to expand its AI footprint with innovations like the Hunyuan foundation model and the Hunyuan text-to-video generator.\n\nMENA: BRICS+\n\nAmong the latest BRICS+ members, Saudi Arabia and the United Arab Emirates stand out, surpassing other new entrants in AI development and ambition.\n\nSaudi Arabia, ranked 14th overall and first in government strategy by Tortoise, has launched the $100 billion Project Transcendence, aiming to position itself as the world’s premier AI hub by 2030. Under Vision 2030, the Kingdom targets a $9.2 billion AI market. Institutions like KAUST—home to Shaheen III, the most powerful supercomputer in MENA—lead national AI research, supported by a growing AI-skilled workforce expanding at 51% annually.\n\nThe UAE, ranked 20th overall and ninth in development by Tortoise, is the first country to appoint a minister of AI. The nation follows an ambitious path with its National Strategy for AI 2031 and a market CAGR of 36%, expected to reach $8.2 billion by 2030. Entities like Digital Dubai, G42, and the Mohamed bin Zayed University of Artificial Intelligence drive AI adoption across sectors from healthcare and energy to finance and smart cities."
    },
    {
        "title": "AI can boost growth in BRICS but worsen poverty without strong governance",
        "description": "The findings show that while AI adoption is statistically linked to increases in GDP per capita, it also correlates with rising poverty in countries with fragile institutions. The study warns that unless governance is strengthened, the benefits of AI could be unequally distributed, potentially worsening income inequality and social exclusion.",
        "content": "Artificial intelligence (AI) can promote long-term economic growth in BRICS-Plus countries but may simultaneously increase poverty in the short term if governance frameworks are weak, a new international study has found.\nPublished in the journal AI &... [4777 chars]",
        "url": "https://www.devdiscourse.com/article/technology/3316109-ai-can-boost-growth-in-brics-but-worsen-poverty-without-strong-governance",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_03_2025_14_37_48_1313231.webp?width=920&format=jpeg",
        "publishedAt": "2025-03-22T11:47:39Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Artificial intelligence (AI) can promote long-term economic growth in BRICS-Plus countries but may simultaneously increase poverty in the short term if governance frameworks are weak, a new international study has found.\n\nPublished in the journal AI & Society, the study \"Artificial intelligence (AI)-poverty-economic growth nexus in selected BRICS-Plus countries: does the moderating role of governance matter?\" by Dr. Charles Shaaba Saba of the University of Johannesburg analyzed data from 2012 to 2023 across Brazil, Russia, India, China, and South Africa. Using econometric modeling, the research assessed whether AI investments contribute to higher GDP and reduced poverty, and whether governance quality influences these outcomes.\n\nThe findings show that while AI adoption is statistically linked to increases in GDP per capita, it also correlates with rising poverty in countries with fragile institutions. The study warns that unless governance is strengthened, the benefits of AI could be unequally distributed, potentially worsening income inequality and social exclusion.\n\nAI linked with higher growth, but short-term poverty spike\n\nThe research found that a 1% increase in AI investment is associated with a 0.016% rise in GDP per capita among the BRICS nations. However, in the short term, AI adoption contributed to higher poverty rates, particularly in countries with weak labor markets or limited digital access.\n\nAccording to the study, AI’s economic efficiency gains can lead to job displacement and wage polarization in the early phases of deployment, effects that disproportionately impact lower-income households. The lack of adequate social safety nets or retraining programs can cause poverty levels to rise even as overall GDP increases.\n\nA key finding of the study is the moderating role of governance in the AI–poverty–growth nexus. Countries with stronger governance indicators, including regulatory quality, rule of law, and control of corruption, were better able to translate AI-driven growth into poverty reduction.\n\nUsing the Cross-Sectional Autoregressive Distributed Lag (CS-ARDL) model, the study showed that good governance amplifies AI’s positive effects on economic performance while minimizing its adverse social impacts.\n\nIn contrast, poor governance appeared to neutralize AI’s growth potential and worsen inequality. The presence of weak institutions, political instability, or ineffective public sector management was correlated with rising poverty alongside increased AI deployment.\n\nBRICS countries show diverging trends\n\nWhile grouped as an emerging economies bloc, the five BRICS nations display divergent patterns in AI readiness and governance strength. China has made the most significant AI investments, while India has prioritized digital inclusion and innovation policy. Brazil and South Africa, despite democratic institutions, struggle with regulatory enforcement and infrastructure gaps. Russia’s governance profile, characterized by centralization and political risk, presented unique challenges.\n\nThese variations influence how each country’s AI strategy plays out on the ground. In nations with stronger economic governance, including public financial management and regulatory frameworks, AI was more likely to support poverty alleviation. In others, technological advancements benefited elite sectors with limited trickle-down effects.\n\nThe study also conducted panel causality tests, finding that economic growth leads to AI adoption, not vice versa. Additionally, AI was shown to influence governance quality over time, potentially by improving administrative efficiency and data-driven decision-making in the public sector.\n\nThis bidirectional link reinforces the need for synchronized progress across institutional and technological domains. “Governments must invest not just in AI capacity, but in the rule of law, anti-corruption enforcement, and regulatory competence,” Saba said.\n\nPolicy implications: Technology requires institutions\n\nThe study calls for a dual-track approach to AI development: one that combines investment in technology with governance reform. Key recommendations include:\n\nStrengthening institutional capacity and anti-corruption frameworks to support fair AI deployment.\n\nExpanding digital infrastructure and training programs to improve access and reduce skills gaps.\n\nDesigning AI-specific regulatory systems to prevent misuse, bias, and inequality.\n\nUsing AI to enhance delivery of public services, including education, welfare, and justice.\n\nThough focused on BRICS nations, the study’s conclusions have broader implications for the Global South. Many developing economies are turning to AI as part of digital transformation agendas, often without robust institutional checks.\n\nInternational bodies such as the UNDP and World Bank have highlighted governance as a prerequisite for ethical and equitable AI. The findings from this study reinforce that perspective, offering empirical evidence that AI’s promise hinges on the political systems around it."
    },
    {
        "title": "Jaishankar: Brics represents common concerns, not dollar undermining",
        "description": "External Affairs Minister S Jaishankar fiercely supported Brics in Parliament, stating that it represents its members' common concerns and tries to make global discussions and leadership more representative and inclusive",
        "content": "External Affairs Minister S Jaishankar fiercely supported Brics in Parliament, stating that it represents its members’ common concerns and tries to make global discussions and leadership more representative and inclusive read more\nAs US President Don... [1908 chars]",
        "url": "https://www.firstpost.com/india/jaishankar-brics-represents-common-concerns-not-dollar-undermining-13873497.html",
        "image": "https://images.firstpost.com/uploads/2025/03/Jaishankar-Tokyo-July-2024-Reuters-2025-03-15e1fd76555e7aecf40873cf3d5a0303.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-03-22T03:32:40Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "External Affairs Minister S Jaishankar fiercely supported Brics in Parliament, stating that it represents its members’ common concerns and tries to make global discussions and leadership more representative and inclusive read more\n\nAs US President Donald Trump declares war on Brics, threatening it with 100% tariffs for undermining the dollar’s hegemony, India emphasises its position as a founding member of the organisation, stating that it is striving to improve knowledge of Brics operations among the “international community”.\n\nExternal Affairs Minister S Jaishankar fiercely supported Brics in Parliament, stating that it represents its members’ common concerns and tries to make global discussions and leadership more representative and inclusive.\n\nAdvertisement\n\nIn answer to a written question in Lok Sabha on Trump’s tariff threat, Jaishankar stated, “Brics, a platform that has grown in membership and agenda over the last two decades. It is our endeavour to enhance understanding of Brics activities among the international community.”\n\nIndia, on the other hand, has qualified its support for the group in the Trump-Brics de-dollarization dispute, claiming that it is not participating in any attempt to undermine the dollar or establish a unified Brics currency. As Jaishankar has stated in the past, fighting the dollar is not part of India’s economic, political, or strategic agenda. India has regularly communicated this message to US officials during bilateral meetings.\n\n“Understandably, as nations at different levels of development and income, and bearing in mind their individual national interests, Brics members have a range of positions on contemporary issues,” said the minister in response to enquiries regarding Trump’s threats and the members’ views.\n\nAccording to Jaishankar, Brics meetings and debates attempt to discover common ground and collaborate to build the global order, with a commitment to multipolarity serving as a unifying thread.\n\nUS President Donald Trump said last month that Brics, which consists of 11 member governments and nine partner countries, has been “dead” since he made his 100% tariff threat.\n\nAdvertisement"
    },
    {
        "title": "US demands India stop purchase of Russian weapons, lower tariffs & prevent de-dollarisation",
        "description": "US Secretary of Commerce Howard Lutnick Friday urged New Delhi to reduce its reliance on Russian defence platforms and hit out at BRICS for its de-dollarisation efforts.",
        "content": "Lutnick also raised the long-standing issue of India’s high tariffs on products from the US, calling for fairer trade between the two countries.\n“India has historically bought significant amounts of its military from Russia, and we think that is some... [3208 chars]",
        "url": "https://theprint.in/diplomacy/us-demands-india-stop-purchase-of-russian-weapons-lower-tariffs-prevent-de-dollarisation/2538959/",
        "image": "https://static.theprint.in/wp-content/uploads/2025/02/POTUS.png",
        "publishedAt": "2025-03-07T16:45:02Z",
        "source": {
            "name": "ThePrint",
            "url": "https://theprint.in"
        },
        "full_content": "Lutnick also raised the long-standing issue of India’s high tariffs on products from the US, calling for fairer trade between the two countries.\n\n“India has historically bought significant amounts of its military from Russia, and we think that is something that needs to end. India is the ‘I’ in BRICS, trying to create a currency to replace the dollar as the global economic currency. These kinds of things do not create the love and affection that we really, deeply feel towards India. We would like those things to end,” US Secretary of Commerce Howard Lutnick said Friday at the India Today Conclave.\n\nNew Delhi: The US has called on India to stop purchasing weapons from Russia and highlighted India’s role in BRICS, apart from the issue of tariffs, as a potential irritant to New Delhi-Washington ties.\n\nUnder President Donald Trump, the US has of late been calling for India to purchase more American-made security platforms, mainly to reduce the trade deficit. Trump has also criticised attempts by the BRICS members to look at an alternative to the US dollar as an international medium of exchange.\n\nTrump raised the issue on a phone call with Prime Minister Narendra Modi in January this year. Last month, during Modi’s visit to the White House, the US President reiterated the need for India to purchase American defence platforms, going so far as to announce that Washington was willing to look at potential sales of the F35 fighter jets to New Delhi.\n\nIndia announced the purchase of six additional P-8I maritime surveillance aircraft, as well as several joint initiatives, during Modi’s visit to the US, with the joint production of underwater surveillance equipment one of the key projects under consideration now.\n\nExternal Affairs Minister S. Jaishankar on Wednesday downplayed any move by the members of BRICS to replace the US dollar as the global reserve currency, pointing out that there is no unified position within the grouping.\n\nThe grouping has Russia, China, Brazil, South Africa, Ethiopia, the United Arab Emirates, Egypt, Iran, and Indonesia, besides India.\n\nFor countries like Russia and Iran, an alternative to the US dollar is key, given the number of economic sanctions in place by Washington, which have severely curtailed their access to global financial markets.\n\nAnother major irritant for the US is its trade deficit with India. In 2023-2024, India exported roughly $77 billion worth of goods to the US while importing only $42.1 billion worth of goods from the North American country.\n\nFor Trump, deficits are a huge issue, with the US President signing orders to impose additional tariffs on products from countries such as Canada and Mexico while promising to impose reciprocal tariffs starting 2 April this year.\n\nIndia has agreed to a multi-sectoral bilateral trade agreement on goods and services with the US, with the announcement of the first tranche expected by 2025 fall. Minister of Commerce and Industry Piyush Goyal was in the US earlier this week and met with Lutnick to discuss the potential trade deal.\n\nIndia’s tariffs on automobiles and agricultural products have been a sticking point for the US. In the past, Trump has described India as the “tariff king”. So far, it is unclear if Trump will announce the reciprocal sanctions on India, given that negotiations are ongoing for a bilateral deal.\n\n(Edited by Madhurita Goswami)\n\nAlso Read: Here’s why Trump has shifted tariff focus on India from bikes to automobiles"
    },
    {
        "title": "Watch | Jaishankar explains India's stand on FTA with UK, China, Brics currency and global crises at Chatham House",
        "description": "External Affairs Minister S Jaishankar spoke at an event hosted by Chatham House in collaboration with the High Commission of India in the UK, where he discussed India's growing role in global affairs.",
        "content": "External Affairs Minister S Jaishankar spoke at an event hosted by Chatham House in collaboration with the High Commission of India in the UK, where he discussed India’s growing role in global affairs. read more\nFollow us on Google News\nExternal Affa... [756 chars]",
        "url": "https://www.firstpost.com/world/watch-jaishankar-explains-indias-stand-on-fta-with-uk-china-brics-currency-and-global-crises-at-chatham-house-13869117.html",
        "image": "https://images.firstpost.com/uploads/2024/09/Untitled-design-2024-09-10T173051.224-2024-09-eda25b52ad5f25f4312f1b37dcb9935e.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-03-06T03:37:58Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "External Affairs Minister S Jaishankar spoke at an event hosted by Chatham House in collaboration with the High Commission of India in the UK, where he discussed India’s growing role in global affairs. read more\n\nExternal Affairs Minister S Jaishankar addressed the audience at an event hosted by Chatham House in collaboration with the High Commission of India in the UK and discussing India’s evolving role in global affairs.\n\nHe participated in an insightful discussion with Bronwen Maddox, Director and Chief Executive of Chatham House. The conversation addressed India’s evolving foreign policy, regional dynamics, and global economic challenges.\n\nAdvertisement\n\nDuring the session, Jaishankar also provided updates on the India-UK Free Trade Agreement (FTA), emphasising its role in boosting economic ties and fostering growth.\n\nJaishankar spoke about India’s relations with its neighbours, particularly China, acknowledging the challenges of maintaining balance. He stressed the need for stable and respectful ties in a changing regional landscape.\n\nOn global economic stability, he clarified that there is no plan to replace the US dollar, but discussions on economic resilience and diversification are increasing, especially among BRICS nations, which have different views on the matter.\n\nHe also reaffirmed India’s approach to global governance, highlighting the importance of working closely with the United States while supporting a multipolar world.\n\nJaishankar’s reply on human rights concerns\n\nJaishankar dismissed human rights concerns as mostly political, and emphasised that India’s democratic institutions are strong, fair, and dedicated to protecting rights.\n\nHe also expressed optimism about India’s growing role in global research, innovation, and business, highlighting its commitment to the world economy and knowledge sectors.\n\nJaishankar hackled by pro-Khalistan protesters\n\nWhen he went outside after concluding his address, pro-Khalistan protesters demonstrated outside the venue and hackled him.\n\n#WATCH | London, UK | Pro-Khalistan supporters staged a protest outside the venue where EAM Dr S Jaishankar participated in a discussion held by Chatham House pic.twitter.com/ISVMZa3DdT — ANI (@ANI) March 6, 2025\n\nAdvertisement\n\nIn a video circulating online, a man is seen running towards Jaishankar’s vehicle and tearing the Indian national flag. The incident raises concern because this happened right in front of London police officers, who did not react despite the chaos and vandalism."
    },
    {
        "title": "Rome's Global Plan: $200 Billion Annually to Reverse Biodiversity Loss",
        "description": "Countries convened in Rome have succeeded in agreeing on a financial plan to generate $200 billion annually by 2030 to counteract biodiversity loss. The deal, a triumph of multilateralism, was spearheaded by BRICS nations, and offers a significant boost to global environmental cooperation amid geopolitical tensions.",
        "content": "This week in Rome, nations reached a consensus on generating $200 billion annually by 2030 to reverse biodiversity destruction. The agreement marks a major breakthrough following unsuccessful U.N. COP16 talks in Colombia last year.\nNegotiated primari... [654 chars]",
        "url": "https://www.devdiscourse.com/article/science-environment/3281893-romes-global-plan-200-billion-annually-to-reverse-biodiversity-loss",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/31_05_2024_16_49_26_2528147.png?width=920&format=jpeg",
        "publishedAt": "2025-02-28T16:20:47Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "This week in Rome, nations reached a consensus on generating $200 billion annually by 2030 to reverse biodiversity destruction. The agreement marks a major breakthrough following unsuccessful U.N. COP16 talks in Colombia last year.\n\nNegotiated primarily by the BRICS countries - Brazil, Russia, India, China, and South Africa - the plan seeks to consolidate funds from diverse sources to preserve nature. This deal provides a significant fillip amid the U.S.'s scaled-back role in global development finance under President Trump's administration.\n\nA new biodiversity fund remains under consideration, while existing mechanisms like the Global Environment Facility continue to play a vital role. With the average wildlife population sizes plummeting, international efforts must intensify to meet ambitious targets outlined in the Kunming-Montreal Global Biodiversity Framework.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Trump's Tariff Threats on BRICS Currency Plans",
        "description": "U.S. President Donald Trump reiterated warnings of possible tariffs on BRICS nations if they establish a new currency. He asserted that the idea of undermining the dollar is now obsolete. BRICS, including Brazil, Russia, India, China, and South Africa, have discussed creating their own currency.",
        "content": "In a stern warning, U.S. President Donald Trump cautioned that BRICS nations might face U.S. tariffs if they decide to create a collective currency.\nSpeaking at the Oval Office on Friday, Trump declared that any attempts to undermine the U.S. dollar ... [252 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3265655-trumps-tariff-threats-on-brics-currency-plans",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/14_02_2025_19_54_46_7854053.jpg?width=920&format=jpeg",
        "publishedAt": "2025-02-14T19:42:26Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "In a stern warning, U.S. President Donald Trump cautioned that BRICS nations might face U.S. tariffs if they decide to create a collective currency.\n\nSpeaking at the Oval Office on Friday, Trump declared that any attempts to undermine the U.S. dollar had been quashed. He stated, 'The idea is dead now.'\n\nThe BRICS group, comprising Brazil, Russia, India, China, and South Africa, has reportedly entertained discussions about setting up an alternative currency to the dollar.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Trump declares BRICS 'dead' ahead of bilateral meeting with PM Modi at White House",
        "description": "US President Donald Trump attacked BRICS nations ahead of his meeting with PM Modi at White House. Trump said, 'BRICS was made for a bad purpose.'",
        "content": "Follow us on Image Source : AP Donald Trump\nAhead of his meeting with PM Modi, US President Donald Trump made a scathing attack on the BRICS nations over de-dollarisation attempts, declaring it to be a 'dead' group. Trump said, \"BRICS is dead\", as he... [2482 chars]",
        "url": "https://www.indiatvnews.com/news/world/trump-declares-brics-dead-ahead-of-bilateral-meeting-with-pm-modi-at-white-house-2025-02-14-976138",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/02/trumppic-1739480539.jpg",
        "publishedAt": "2025-02-13T21:04:06Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        },
        "full_content": "Trump declares BRICS 'dead' ahead of bilateral meeting with PM Modi at White House US President Donald Trump attacked BRICS nations ahead of his meeting with PM Modi at White House. Trump said, \"BRICS was made for a bad purpose.\"\n\nWashington:\n\nAhead of his meeting with PM Modi, US President Donald Trump made a scathing attack on the BRICS nations over de-dollarisation attempts, declaring it to be a 'dead' group. Trump said, \"BRICS is dead\", as he accused the grouping of being made for a 'bad purpose', as he claimed that he has conveyed to BRICS countries that they will be \"hit by a 100% tariff\" if \"they want to play games with the Dollar.\" He warned the BRICS countries, saying, \"The day they mention that they want to do it, they will come back and say, We beg you, we beg you. BRICS is dead since I mentioned that.\"\n\nTrump also attacked Canada amid the ongoing tariff row between both countries. In a fresh warning to Ottawa, Trump said, \"Canada has been very bad to us on trade. But now Canada is going to have to start paying up. Canada has been tough on the military because they have a very low military cost. They think we are going to protect them with our military, which is unfair.\" Trump reiterated his desire to make Canada the 51st state of the US, saying, \"I think Canada is going to be a very serious contender to be our 51st state.\"\n\nEarlier, PM Modi arrived at the White House to hold wide-ranging talks with US President Donald Trump amid expectations of a raft of specific outcomes including firming up of a new defence framework and boosting cooperation in areas of trade, energy and critical technology.\n\nAhead of his meeting with Modi, the American President announced a new reciprocal tariff policy for all the trading partners of the US, a move that could have some impact on India's trade with the US as well.\n\nBefore meeting Trump, the Indian prime minister held separate talks with US National Security Advisor Mike Waltz, Director of National Intelligence Tulsi Gabbard, billionaire Elon Musk and Republican leader Vivek Ramaswamy.\n\nPM Modi kicked off his two-day visit to Washington DC on Wednesday evening (Thursday morning India time) after concluding his trip to France. Ahead of the Modi-Trump meeting, diplomatic sources indicated that the focus of the talks will be on enhancing cooperation in areas of defence, energy, technology, infrastructure and trade.\n\nThe Trump administration is particularly keen on expanding Washington's defence sales to India and the two sides may broadly finalise a couple of deals including co-production of Stryker armoured fighting vehicles in India. Besides defence, trade is set to be a high priority area in the deliberations between the two leaders.\n\nTwo days back, Trump announced a 25 per cent tariff on global steel and aluminium imports into the US. The move is expected to hit the Indian firms exporting steel and aluminium to the US.\n\n(With agency inputs)"
    },
    {
        "title": "Indian Rupee Crashes to Record Low Amid US Trade Tariff Tensions",
        "description": "The Indian rupee has plunged to an unprecedented low of 87.29 against the US dollar due to US trade tariffs and global uncertainties. The Reserve Bank of India intervened to stabilize the currency, but experts advise waiting to see the impact of further US trade policies on BRICS nations.",
        "content": "The Indian rupee plummeted to a historic low of 87.29 per dollar on Monday. This decline is attributed to escalating trade tariffs imposed by US President Donald Trump amid global market uncertainties.\nHaving already depreciated over 1.5% this year, ... [1530 chars]",
        "url": "https://www.devdiscourse.com/article/business/3250160-indian-rupee-crashes-to-record-low-amid-us-trade-tariff-tensions",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_02_2025_11_39_43_7087924.jpg?width=920&format=jpeg",
        "publishedAt": "2025-02-03T06:09:50Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "The Indian rupee plummeted to a historic low of 87.29 per dollar on Monday. This decline is attributed to escalating trade tariffs imposed by US President Donald Trump amid global market uncertainties.\n\nHaving already depreciated over 1.5% this year, the rupee's latest tumble is regarded as a repercussion of tariff measures enforced by the US government. The currency opened with a substantial gap-down of 43 paise, hitting a low of 87.29 before rebounding to 87.13 following a Reserve Bank of India (RBI) intervention. Currency expert KN Dey explained to ANI that the tariff war, ignited by the US against Canada, Mexico, and China, is responsible for the rupee's decline. KN Dey noted, \"Rupee opened with a gap of 43 paisa which was one of the highest gap openings, touched a new low of 87.29, but is now trading at 87.13 due to RBI intervention.\"\n\nThe situation remains fluid as President Trump has also hinted at possible tariffs on BRICS nations, including India. KN Dey cautioned, \"Though Trump has been threatening BRICS countries also, it remains as to when he would press the button. This could be a knee-jerk reaction on the Rupee, but it's better to wait and watch for a couple of days.\" On a broader scale, this pressure on the rupee is mirrored by a strengthening US dollar against global currencies. Monday saw the Canadian dollar and Mexican peso dip to multi-year lows and the Chinese yuan weaken to a historic low. The US government announced an imminent 25% tariff on imports from Canada and Mexico and a 10% tariff on Chinese goods.\n\nMarket analysts suggest this may be a short-term reaction, with investors advised to observe how circumstances develop. The unfolding situation is anticipated to shape market movements significantly.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Why Trump may accommodate India's defence requirements",
        "description": "Trump’s opposition to BRICS could hurt Indian interests",
        "content": "AS THE TRUMP 2.0 administration takes shape in Washington, DC, New Delhi is actively strategising to doing business with the new leadership. External Affairs Minister S. Jaishankar, who attended President Trump’s inauguration on behalf of India, had ... [2561 chars]",
        "url": "https://www.theweek.in/theweek/cover/2025/02/01/trump-may-accommodate-indias-defence-requirements-given-his-longstanding-animosity-towards-chinas-military-might.html",
        "image": "https://www.theweek.in/content/dam/week/week/magazine/theweek/cover/images/2025/2/1/53-Indian-and-US-army-personnel.jpg",
        "publishedAt": "2025-01-31T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        },
        "full_content": "AS THE TRUMP 2.0 administration takes shape in Washington, DC, New Delhi is actively strategising to doing business with the new leadership. External Affairs Minister S. Jaishankar, who attended President Trump’s inauguration on behalf of India, had earlier visited the US in December to brief Indian diplomats on India’s approach to engaging with the new administration.\n\nThis focus is unsurprising, given the robust ties between the two nations. The United States is India’s largest trading partner, with bilateral trade in goods and services reaching $190 billion. Defence cooperation has grown substantially, with India operating over $20 billion worth of US-origin equipment, including C-130J and C-17 transport aircraft, Apache and Chinook helicopters, MH-60R maritime helicopters and P-8I surveillance aircraft.\n\nKey defence agreements underpin these ties, such as the Security of Supplies Arrangement, the Basic Exchange and Cooperation Agreement, the Communications Compatibility and Security Agreement and the Logistics Exchange Memorandum of Agreement. These frameworks facilitate the integration of military services, assets, and technologies. Additionally, India has a liaison officer posted at the US Special Operations Command in Florida.\n\nOne pressing issue for India is the long-pending deal to procure 99 GE F-414 aero-engines for the Tejas Mk2 indigenous light combat aircraft, with potential applications for other fighter jets in development. However, technology transfer remains a critical concern. India’s fighter aircraft shortage is acute, with a requirement of over 760 fighters but an operational strength of just 560. This deficit is particularly pressing given China’s deployment of advanced fifth-generation stealth fighters and its reported support to Pakistan for similar capabilities. India is also keenly awaiting a decision on whether it will be offered the cutting-edge Lockheed Martin F-35 stealth fighter. Trump’s aversion to China’s military expansion may prompt him to address India’s needs. Defence Secretary Pete Hegseth has emphasised strengthening Indo-Pacific alliances to counter Chinese aggression.\n\nIndia is also acquiring 31 MQ-9B drones from the US in a $4 billion deal, equipped with AGM-114R Hellfire missiles and precision targeting capabilities.\n\nChallenges loom on the horizon. Trump’s opposition to BRICS, particularly its push for “de-dollarisation” and a new currency, could hurt Indian interests. His hard-line policies on Iran and unwavering support for Israel could also hinder India’s role in the International North-South Transport Corridor (INSTC), a vital trade link connecting India, Russia, and Iran.\n\nNavigating these complexities will require deft diplomacy as New Delhi balances its strategic and economic interests in a changing global landscape."
    },
    {
        "title": "Donald Trump Warns 100% Tariff If BRICS Nation Replaces Dollar With New Currency; Internet Erupts In Memes",
        "description": "Pakodanomics needs no additional tariffs fwiw. Rupee is already in the ICU.",
        "content": "> Tech\nShri Shri Donald J. Trump, the 47th president of the USA, has been on a loop yelling ‘tariffs’ from the rooftop and basement ever since his re-election campaign.\nDuring the presidential campaign in 2024, Trump flagged India as a high-tariff na... [1704 chars]",
        "url": "https://in.mashable.com/tech/89078/donald-trump-warns-100-tariff-if-brics-nation-replaces-dollar-with-new-currency-internet-erupts-in-m",
        "image": "https://sm.mashable.com/mashable_in/seo/default/2cvr-51_apdd.jpg",
        "publishedAt": "2025-01-31T11:40:16Z",
        "source": {
            "name": "Mashable India",
            "url": "https://in.mashable.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://in.mashable.com/tech/89078/donald-trump-warns-100-tariff-if-brics-nation-replaces-dollar-with-new-currency-internet-erupts-in-m on URL https://in.mashable.com/tech/89078/donald-trump-warns-100-tariff-if-brics-nation-replaces-dollar-with-new-currency-internet-erupts-in-m"
    },
    {
        "title": "'Find another sucker nation': Trump threatens BRICS with tariffs again. What's at stake for India?",
        "description": "In recent years BRICS has become one of the most economically powerful groups. Two of its member states are among the top five largest economies in the world",
        "content": "In recent years, Brics has become one of the most economically powerful groups. Two of its member states are among the top five largest economies in the world read more\nA week after assuming the presidency, US President Donald Trump reiterated his ta... [2983 chars]",
        "url": "https://www.firstpost.com/world/find-another-sucker-nation-trump-threatens-brics-with-tariffs-again-whats-at-stake-for-india-13858162.html",
        "image": "https://images.firstpost.com/uploads/2024/12/wck5-2024-04-cf7168ecaaba20292a3e087b8b739cba-1-2024-12-7a67991f400571c27dd7db9eed79c96d.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-01-31T11:24:31Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "In recent years, Brics has become one of the most economically powerful groups. Two of its member states are among the top five largest economies in the world read more\n\nTrump warns BRICS nations that he slap 100 per cent tariff on trade if they persue de-dollarisation. File Image / AP\n\nA week after assuming the presidency, US President Donald Trump reiterated his tariff threat to Brics nations, which comprises Brazil, Russia, India, China and South Africa along with other newly appointed countries. Trump issued the repeated warning in the latest post on his own social media platform TruthSocial. The Republican firebrand made a similar statement right after winning the 2024 US Presidential elections.\n\n“The idea that the BRICS countries are trying to move away from the dollar, while we stand by and watch, is OVER,” Trump wrote on Truth Social on Thursday. “We are going to require a commitment from these seemingly hostile countries that they will neither create a new BRICS currency nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs, and should expect to say goodbye to selling into the wonderful US economy,” he added.\n\nAdvertisement\n\nIn recent years Brics has become one of the most economically powerful groups. Two of its member states are among the top five largest economies in the world. The group has expanded in a significant way following the inclusion of countries like Egypt, Ethiopia, Indonesia, Iran, and the United Arab Emirates. Which comes with its strength.\n\nBrics and the US dollar\n\nIt is pertinent to note that the intergovernmental organisation was formed in the year 2009. The main of the group has always been to counter dominance by the US and its Western allies. Over the years, the economies of the member nations rose at an exponential rate. The Brics continues to represent nearly half of the world’s population and is considered a counterpart to the G7 group of countries.\n\nIn the past, the economic bloc has often suggested introducing another reserve currency. The idea gained momentum especially after the West imposed sanctions on Russia following the latter’s military operation in Ukraine in 2022.\n\nHowever, many questioned the group’s aspiration since the power of the US dollar in the world has strengthened recently. The American dollar still remains the world’s primary reserve currency and there is a huge worldwide reliance on it.\n\nHow India is navigating the rough waters\n\nIn recent years, India has attempted to reduce its reliance on the US dollar to internalise the Indian rupee. In 2022, following the sanctions on Russia, the Reserve Bank of India (RBI) has allowed invoicing and payments for international trade in Indian rupees.\n\nWhile addressing the matter at Kazan, Prime Minister Narendra Modi said: “India welcomes efforts to increase financial integration among Brics countries and trade in local currencies and smooth cross-border payments will strengthen our economic cooperation.”\n\nIn November 2024, External Affairs Minister S Jaishankar said at the India-Russia Intergovernmental Commission meeting in Mumbai that “mutual settlement of trade in national currencies is of great importance, especially in the current circumstances”. However, India is also aiming to strengthen its ties with the Trump administration to avoid such tariffs.\n\nAdvertisement"
    },
    {
        "title": "Trump reiterates threat to impose 100% tariffs on BRICS nations if they attempt to replace dollar",
        "description": "The US president said that 25% tariffs on Canada and Mexico would take effect on Saturday.",
        "content": "United States President Donald Trump on Friday reiterated his threat to impose 100% import tariffs on BRICS countries if they moved towards reducing reliance on the US dollar in global trade, reported The Indian Express.\nIn a post on Truth Social, Tr... [2355 chars]",
        "url": "https://scroll.in/latest/1078595/trump-reiterates-threat-to-impose-100-tariffs-on-brics-nations-if-they-attempt-to-replace-dollar",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/book/204070-eiyxdanoti-1729738677.jpeg",
        "publishedAt": "2025-01-31T07:25:00Z",
        "source": {
            "name": "Scroll.in",
            "url": "https://scroll.in"
        },
        "full_content": "United States President Donald Trump on Friday reiterated his threat to impose 100% import tariffs on BRICS countries if they moved towards reducing reliance on the US dollar in global trade, reported The Indian Express.\n\nIn a post on Truth Social, Trump said the US “will not stand idly by” while BRICS countries develop an alternative currency.\n\nThe BRICS group, initially comprising Brazil, Russia, India, China and South Africa, has expanded to include Iran, Indonesia, the United Arab Emirates, Egypt and Ethiopia.\n\nTrump’s warning came a day after he announced that 25% tariffs on Canada and Mexico would take effect on Saturday. He said he was still considering whether to include oil in the import taxes, reported AP.\n\nOn Friday, he demanded that BRICS nations stop efforts to create or support currencies competing with the US dollar, warning of severe consequences, including 100% import tariffs and restricted access to the American market.\n\nDismissing the idea that BRICS could challenge the dollar’s global dominance, Trump called it “mighty” and irreplaceable. “There is no chance that BRICS will replace the US Dollar in International Trade, or anywhere else,” he wrote. He also issued an ultimatum: “Any Country that tries should say hello to Tariffs, and goodbye to America!”\n\nThe BRICS bloc, representing major emerging economies, has been vocal about creating alternatives to the dollar, with Russia and China leading the call for a new reserve currency. A BRICS currency proposal was discussed at last year’s summit in South Africa and the October summit in Russia’s Kazan.\n\nOn December 1, Trump threatened 100% tariffs on the BRICS bloc and its allies unless they abandon efforts to reduce dependence on the dollar. “The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” Trump had said.\n\nThe warnings have been in line with Trump’s trade policy tactics from his first term, where he imposed tariffs to balance trade deficits and support US manufacturing.\n\nIndia’s position\n\nIndia has also been working to reduce its reliance on the US dollar and internationalise the Indian rupee. In 2022, the Reserve Bank of India allowed international trade to be invoiced and paid in rupees, following sanctions on Russia due to the war in Ukraine.\n\nPrime Minister Narendra Modi had said in October, in his remarks at the BRICS summits, that India “welcome[d] efforts to increase financial integration among BRICS countries” and that “trade in local currencies and smooth cross-border payments will strengthen our economic cooperation”."
    },
    {
        "title": "Trump Threatens BRICS Nations With 100% Tariff, Demands Commitment Over Currency",
        "description": "Trump had earlier warned the BRICS nations, comprising Brazil, Russia, India, China and South Africa, from taking any action to replace the US dollar.",
        "content": "Trump Threatens BRICS Nations With 100% Tariff, Demands Commitment Over Currency\nReported By :\nNews18.com\nLast Updated: January 31, 2025, 08:17 IST\nTrump had earlier warned the BRICS nations, comprising Brazil, Russia, India, China and South Africa, ... [1161 chars]",
        "url": "https://www.news18.com/world/trump-threatens-brics-nations-with-100-tariff-if-they-undercut-us-dollar-9208887.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/01/donald-trump-1-2025-01-ec31f0f1093a07ad85f59e647d9fbb5e-16x9.jpg",
        "publishedAt": "2025-01-31T02:47:08Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "'Say Hello To Tariffs, And Goodbye To America': Trump Seeks Loyalty For Dollar From BRICS Nations\n\nReported By :\n\nNews18.com\n\nLast Updated: January 31, 2025, 08:44 IST\n\nTrump had earlier warned the BRICS nations, comprising Brazil, Russia, India, China and South Africa, from taking any action to replace the US dollar.\n\nUnited States President Donald Trump has threatened BRICS group nations with a 100% tariff. (AP Image)\n\nUnited States President Donald Trump on Thursday said that his government needs a commitment from the BRICS member countries that they will neither create any new BRICS currency nor support any other currency which will replace the US dollar. Trump said that if the countries decide to do so, they will face 100% tariffs.\n\nTaking to his social media platform Truth Social, Trump wrote, “The idea that the BRICS Countries are trying to move away from the Dollar, while we stand by and watch, is OVER. We are going to require a commitment from these seemingly hostile Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy.\"\n\nRecommended Stories\n\n“They can go find another sucker Nation. There is no chance that BRICS will replace the U.S. Dollar in International Trade, or anywhere else, and any Country that tries should say hello to Tariffs, and goodbye to America!\" he added.\n\nThe idea that the BRICS Countries are trying to move away from the Dollar, while we stand by and watch, is OVER. We are going to require a commitment from these seemingly hostile Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace…— Donald J. Trump Posts From His Truth Social (@TrumpDailyPosts) January 31, 2025\n\nTrump’s Multiple Warnings To BRICS Nations Over Currency\n\nTrump had earlier warned the BRICS nations, comprising Brazil, Russia, India, China and South Africa, from taking any action to replace the US dollar in December last year after winning the presidential elections.\n\nIn his first presidential term, Trump had slammed BRICS for grouping up against the interest of the US economy.\n\nThe largest economy of the world shares some major trading relationships with India, Brazil and China.\n\nLast month, Bloomberg reported that Trump and his team have been discussing ways in which allies and adversaries can be punished if they try to engage in bilateral trade in other currencies.\n\nThe measures discussed included currency manipulation charges, export controls and levies on trade, said the report.\n\nThe BRICS nations, especially member countries Russia and China, have been discussing de-dollarisation since the Russia-Ukraine war started in 2022 and planning to create their own BRICS currency. So far, India has not been part of the plan.\n\ntop videos View all Swipe Left For Next Video View all\n\nReserve Bank of India’s former governor Shaktikanta Das had said that BRICS has not taken any decision regarding creating a common currency for decreasing the usage of the dollar.\n\n“The geographical spread of the countries has also to be kept in mind, unlike the eurozone which has geographical contiguity,\" Das said last month.\n\nLocation : Washington D.C., United States of America (USA)\n\nFirst Published: January 31, 2025, 08:04 IST"
    },
    {
        "title": "Brazil's Push for Developing Nations' Voice in COP30",
        "description": "Brazil intends to strengthen the influence of developing nations in climate finance discussions at the upcoming COP30 summit. This comes amid challenges following the U.S. withdrawal from the Paris Agreement. Brazil aims to leverage its BRICS leadership to build consensus among developing countries ahead of the talks.",
        "content": "Brazil aims to amplify the voices of developing nations in the upcoming COP30 climate finance talks. The head of the summit, Andre Correa do Lago, revealed plans for increased advocacy amid complications due to the U.S. withdrawal from the Paris Acco... [702 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3236988-brazils-push-for-developing-nations-voice-in-cop30",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_16_56_48_7796591.jpg?width=920&format=jpeg",
        "publishedAt": "2025-01-23T20:22:39Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Brazil aims to amplify the voices of developing nations in the upcoming COP30 climate finance talks. The head of the summit, Andre Correa do Lago, revealed plans for increased advocacy amid complications due to the U.S. withdrawal from the Paris Accord under President Donald Trump.\n\nCommenting from Brasilia, Correa do Lago mentioned that the negotiations at COP30 are expected to face more difficulties, given the previous U.S. engagement in climate change policies. The summit, set for November in the Amazon city of Belem, will tackle discussions about financial responsibilities in transitioning economies to cleaner energy.\n\nThe previous summit ended with wealthy countries pledging $300 billion annually, much less than the developing nations' required $1.3 trillion per year. Brazil intends to leverage its leadership of the BRICS group to gain consensus and strengthen negotiating positions among developing nations.\n\n(With inputs from agencies.)"
    },
    {
        "title": "India Resilient To US' WHO Shake-Up, But Global Health Plans, Funding Face Uncertainty: Experts",
        "description": "Public health experts believe that shortfall in funding due to United States’ decision to exit the World Health Organization is likely to be compensated by China, European Union and BRICS nations, and the real impact would be visible only after one-two years",
        "content": "India Resilient To US' WHO Shake-Up, But Global Health Plans, Funding Face Uncertainty: Experts\nReported By :\nNews18.com\nEdited By: Apoorva Misra\nLast Updated: January 22, 2025, 10:07 IST\nPublic health experts believe that shortfall in funding due to... [5476 chars]",
        "url": "https://www.news18.com/india/india-resilient-to-us-who-shake-up-but-global-health-plans-funding-face-uncertainty-experts-9197327.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/01/donald-trump-executive-action-ap-photo-nominations-2025-01-8a0550f9c5d5be08575f1c6297a37318-16x9.jpg",
        "publishedAt": "2025-01-22T04:37:27Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "India Resilient To US' WHO Shake-Up, But Global Health Plans, Funding Face Uncertainty: Experts\n\nReported By :\n\nNews18.com Edited By: Apoorva Misra\n\n\n\nLast Updated: January 22, 2025, 10:07 IST\n\nPublic health experts believe that shortfall in funding due to United States’ decision to exit the World Health Organization is likely to be compensated by China, European Union and BRICS nations, and the real impact would be visible only after one-two years\n\nThe move was expected in 2020 as US President Donald Trump had already initiated steps to withdraw from WHO, citing the health agency’s biases towards China. (AP)\n\nIndia’s advanced health systems may cushion the impact of the United States’ decision to exit the World Health Organization (WHO), but it may derail crucial initiatives in vulnerable regions, multiple public health experts told News18.\n\nThe move was expected in 2020 as US President Donald Trump had already initiated steps to withdraw from WHO, citing the health agency’s biases towards China. However, it was subsequently reversed by new President Joe Biden in January 2021.\n\nRecommended Stories\n\nAccording to Dr K Srinath Reddy, the US withdrawal is extremely “unfortunate\".\n\n“In an era where multilateral cooperation is essential for collectively addressing major global health challenges that arise from pandemic threats, climate change catalysed assaults on human health and antimicrobial resistance, USA’s withdrawal from WHO is extremely unfortunate,\" he said.\n\nReddy believes that in an interconnected and interdependent world, it will have adverse consequences not only for other countries but also for the US.\n\nAnother public health expert, Rajib Dasgupta, professor and chairperson, Centre of Social Medicine and Community Health, Jawaharlal Nehru University, believes that health agenda-setting is now global, as interconnectedness through travel, trade, and technology spreads health challenges across borders.\n\nHe calls for the need for international collaboration to address shared health issues effectively. “Agenda setting in health has increasingly become global and the connectedness of people across politico-administrative boundaries cannot be overemphasised.\"\n\nHowever, the move may not impact India harshly.\n\nDr Anurag Agrawal, dean, biosciences and health research, Ashoka University, told News18 that the move does not mean much for India since “we are past the point where WHO support was essential for our health systems, but it may be a challenge elsewhere in the world where there is dependence on international support via WHO\".\n\nPossibility Of U-Turn?\n\nTrump has authorised a withdrawal from the WHO as well as a cessation of negotiations over a pandemic treaty.\n\nThese events were anticipated by the global health community and there is a one-year transition time. “It is possible that the current administration could be persuaded to reconsider and instead cut their contributions to the WHO,\" Lakshmy Ramakrishnan, associate fellow at think tank Observer Research Foundation said.\n\nRight now, Ramakrishnan believes the rest of the global community needs to understand how to navigate the path ahead and ask some “hard questions\".\n\n“For instance: What will be the impact on activities like global infectious disease surveillance networks? And is it time to go back to the drawing board over the negotiations of the pandemic treaty,\" she said.\n\nRamakrishnan believes that the decision has serious implications for global health security, but the Covid-19 pandemic showed us that transparency and responsible science communication are also essential.\n\nBad News For Weaker Countries\n\nThe US exit may not impact India majorly, but it will definitely impact smaller and underdeveloped nations.\n\nThe US contributes about 18-19 per cent of the funding to WHO. Therefore, its decision to pull out can lead to a financial crunch, which could adversely affect various health-related programmes.\n\nReading the scenario, Dr Agrawal — who is also ex-director of CSIR Institute of Genomics and Integrative Biology — believes that “unless the Trump administration creates a viable alternate path to support global health, this is effectively a decision that undercuts support for valuable programs in low income nations, at a time when we should have learnt that one cannot hide from global pandemic threats\".\n\nMeanwhile, as WHO will lose its top funder, other countries will need to step up their contributions and increase the level of scientific collaboration amongst themselves.\n\n“Both international cooperation and self-reliance will now acquire new purpose and fresh forms of functioning,\" Dr Reddy pointed out.\n\nThese could include measures to control/treat HIV-AIDS, malaria, tuberculosis, and other infectious diseases. Lack of funding could also result in halting some research projects.\n\n“The US pulling out of WHO may not be much of a negative to the US itself, however, it could have a major impact on African and Asian nations. WHO still has one year left to sort out the funding and streamline its various ongoing projects\" said neurologist Dr Sudhir Kumar from Apollo Hospitals in Hyderabad.\n\ntop videos View all Swipe Left For Next Video View all\n\n“Shortfall in funding is likely to be compensated by China, European Union, and BRICS nations. The real impact would be visible only after one to two years from now.\"\n\nHealth expert Dr Rajeev Jayadevan added that the fund cut could open the possibility of seeking funds from wealthy private donors and increased financial contributions from countries such as China, Germany, and France. The US exit would also reduce its influence on global health policies. How this shift might impact global health remains uncertain.\n\nFirst Published: January 22, 2025, 10:07 IST"
    },
    {
        "title": "Optimism Rises in India-US Trade Relations under Trump Leadership",
        "description": "Industry leaders express optimism about India-US trade under President Trump, highlighting opportunities in healthcare, pharma, and electronics. Trump's threats of tariffs on BRICS nations loom if they replace the dollar. Leaders propose steps for mutual economic benefits and anticipate strengthened bilateral ties in the coming years.",
        "content": "Industry leaders have voiced strong optimism regarding India-US trade and economic relations under the presidency of Donald Trump, specifically identifying potential growth areas in healthcare, pharmaceuticals, and electronics.\nHowever, President Tru... [385 chars]",
        "url": "https://www.devdiscourse.com/article/business/3233679-optimism-rises-in-india-us-trade-relations-under-trump-leadership",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_15_40_08_7202075.png?width=920&format=jpeg",
        "publishedAt": "2025-01-21T13:59:27Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Industry leaders have voiced strong optimism regarding India-US trade and economic relations under the presidency of Donald Trump, specifically identifying potential growth areas in healthcare, pharmaceuticals, and electronics.\n\nHowever, President Trump has issued a stern warning to the BRICS nations—including India—of imposing a 100 percent tariff if they move to replace the US dollar in global trade.\n\nLeaders like RPG Enterprises Chairman Harsh Goenka have outlined mutual steps to bolster ties, while expressing confidence that Trump's leadership would further strengthen bilateral economic relations.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Donald Trump Threatens 100% Tariffs Against India, Other BRICS Countries If...",
        "description": "'We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar,\" says US President Donald Trump.",
        "content": "Donald Trump Threatens 100% Tariffs Against India, Other BRICS Countries If...\nPublished By :\nPTI\nLast Updated: January 21, 2025, 15:37 IST\n'We require a commitment from these countries that they will neither create a new BRICS currency, nor back any... [1797 chars]",
        "url": "https://www.news18.com/business/economy/donald-trump-threatens-100-tariffs-against-india-other-brics-countries-if-9196581.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/01/donald-trump-2-2025-01-ae0660135ef1334a66dee2b39a2532e3-16x9.jpg",
        "publishedAt": "2025-01-21T10:07:27Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "Donald Trump Threatens 100% Tariffs Against India, Other BRICS Countries If...\n\nPublished By :\n\nPTI\n\nLast Updated: January 21, 2025, 15:37 IST\n\n'We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar,\" says US President Donald Trump.\n\nUS President Donald Trump. (AP Image)\n\nUS President Donald Trump has again warned that he will impose 100 per cent tariffs against countries of the BRICS bloc, of which India is a part, if they take any steps to replace the US dollar. Trump, who took oath as the 47th president of the US on Monday, said, “If the BRICS nations want to do that, that’s okay, but we’re going to put at least a 100 per cent tariff on the business they do with the United States.\"\n\nThey “have a 100 per cent tariff if they so much as even think\" about reducing the use of the dollar in global trade, he added.\n\nRecommended Stories\n\nBRICS is an intergovernmental organisation of ten countries — Russia, India, China, South Africa, Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates.\n\nIn December too, Trump warned BRICS nations against such a move.\n\n“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100 per cent tariffs and should expect to say goodbye to selling into the wonderful US economy,\" Trump had warned.\n\nExternal Affairs Minister S Jaishankar in December said India had never been for de-dollarisation and there was no proposal to have a BRICS currency.\n\nResponding to a question on immigration, Trump on Monday said he is fine with legal immigration.\n\ntop videos View all Swipe Left For Next Video View all\n\nThe nation will need more legal immigration as manufacturing is going to expand because of his tariff policies, Trump said.\n\n“I’m fine with legal immigration. I like it. We need people, and I’m absolutely fine with it. We want to have it,\" he said.\n\nFirst Published: January 21, 2025, 15:37 IST"
    },
    {
        "title": "Trump's Tariff Threat: BRICS and the Dollar Dilemma",
        "description": "President Donald Trump has warned the BRICS nations of imposing a 100% tariff if they attempt to reduce the reliance on the US dollar in global trade. BRICS countries include Russia, India, China, South Africa, and others. Trump supports legal immigration to bolster an expanding manufacturing sector.",
        "content": "In a bold statement that has caught global attention, President Donald Trump has reiterated his threat of imposing a 100% tariff on BRICS nations, such as India, if they take steps to replace the US dollar in international trade.\nTrump, after being i... [540 chars]",
        "url": "https://www.devdiscourse.com/article/business/3233205-trumps-tariff-threat-brics-and-the-dollar-dilemma",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_01_2025_14_44_59_8408741.jpg?width=920&format=jpeg",
        "publishedAt": "2025-01-21T09:42:46Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "In a bold statement that has caught global attention, President Donald Trump has reiterated his threat of imposing a 100% tariff on BRICS nations, such as India, if they take steps to replace the US dollar in international trade.\n\nTrump, after being inaugurated as the 47th President on Monday, made it clear that the US economy is prepared to hit back with harsh tariffs if the BRICS bloc, comprising nations like Russia, China, and South Africa, even entertains the idea of reducing dependence on the American currency.\n\nWhile reaffirming his stance against any BRICS-backed currency, Trump also expressed his support for legal immigration, citing the need for workforce expansion due to anticipated growth in US manufacturing influenced by his tariff policies.\n\n(With inputs from agencies.)"
    },
    {
        "title": "US President Trump warns BRICS nations",
        "description": "At his inauguration, Trump said that BRICS shouldn’t see his statement as a threat, but rather a clear stance on the issue.",
        "content": "Trump added that his statement should not be seen as a threat but rather as a clear stance on the issue.\nSpeaking to the media during his signing ceremony at the Oval Office, President Trump said, “As a BRICS nation… they’ll have a 100 per cent tarif... [2420 chars]",
        "url": "https://theprint.in/world/100-tariff-if-de-dollarisation-efforts-continue-us-president-trump-warns-brics-nations/2454808/",
        "image": "https://static.theprint.in/wp-content/uploads/2025/01/trump-signs-order-reuters.png",
        "publishedAt": "2025-01-21T03:47:01Z",
        "source": {
            "name": "ThePrint",
            "url": "https://theprint.in"
        },
        "full_content": "Trump added that his statement should not be seen as a threat but rather as a clear stance on the issue.\n\nSpeaking to the media during his signing ceremony at the Oval Office, President Trump said, “As a BRICS nation… they’ll have a 100 per cent tariff if they so much as even think about doing what they thought, and therefore they’ll give it up immediately,” referring to the reduction in the use of the dollar in global trade.\n\nWashington DC: US President Donald Trump reiterated his threat towards the BRICS nations on Monday (local time), stating that countries that are part of this organisation would face 100 per cent tariffs on trade with the US if they continue their de-dollarization efforts.\n\nThe President also referenced comments made by former US President Joe Biden, suggesting that Biden had indicated the US was in a vulnerable position on this matter, to which Trump disagreed, asserting that the US has the leverage over the BRICS nations and that they would not be able to proceed with their plans.\n\n“If the BRICS nations want to do that, that’s OK, but we’re going to put at least a 100 per cent tariff on the business they do with the United States… It’s not even a threat. In fact, since I made that statement, Biden said, they have us over a barrel. I said, No, we have them over a barrel. And there’s no way they’re going to be able to do that,” Trump added.\n\nTrump, earlier before being sworn as the 47th President of the US, had threatened BRICS countries over the imposition of 100 per cent tariffs on all imports from those countries, should they dare to launch their currency.\n\nBRICS nations were already working on reducing dollar dominance in the global financial system by replacing it with a new global currency.\n\nDuring the plenary session of the 15th BRICS Summit via videoconferencing in 2023, Russian President Vladimir Putin called for de-dollarization, stressing that BRICS countries must expand settlements in national currencies and enhance cooperation between banks.\n\nIn June 2024, Ministers of Foreign Affairs of the BRICS countries met in Russia’s Nizhny Novgorod and called for enhanced use of local currencies in bilateral and multilateral trades and financial transactions between the member countries. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content.\n\nAlso Read: Money, power & loyalty. Seating arrangement at Trump’s inauguration sets the tone for his 2nd term"
    },
    {
        "title": "Trump announces trading system ‘overhaul’; new external revenue service to collect tariffs from foreign countries",
        "description": "This announcement follows Trump’s threat last month to impose 100 per cent tariffs on Brazil, Russia, India, China, and South Africa (the BRICS nations) if they create a new BRICS currency or back any other currency to replace the US dollar as the world’s reserve currency.",
        "content": "US President Donald Trump, during his inauguration speech on Monday, announced the establishment of an external revenue service to collect tariffs from foreign countries exporting goods to America.\n“I will immediately begin the overhaul of our trade ... [2204 chars]",
        "url": "https://indianexpress.com/article/business/trump-trading-system-overhaul-new-external-revenue-service-tariffs-foreign-countries-9789784/",
        "image": "https://images.indianexpress.com/2025/01/donald-trump-13.jpg",
        "publishedAt": "2025-01-20T18:50:59Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        },
        "full_content": "US President Donald Trump, during his inauguration speech on Monday, announced the establishment of an external revenue service to collect tariffs from foreign countries exporting goods to America.\n\n“I will immediately begin the overhaul of our trade system to protect American workers and families. Instead of taxing our citizens to enrich other countries, we will tariff and tax foreign countries to enrich our citizens,” Trump said.\n\n“For this purpose, we are establishing the external revenue service to collect all tariffs, duties, and revenues. It will be massive amounts of money pouring into our treasury, coming from foreign sources. The American dream will soon be back and thriving like never before, to restore competence and effectiveness to our federal government,” he added.\n\nStory continues below this ad\n\nThis announcement follows Trump’s threat last month to impose 100 per cent tariffs on Brazil, Russia, India, China, and South Africa (the BRICS nations) if they create a new BRICS currency or back any other currency to replace the US dollar as the world’s reserve currency.\n\nTrump’s proposed tariffs may primarily target China, given the far larger trade imbalance. A fresh round of US-China trade wars could potentially benefit India by redirecting investments and manufacturing opportunities away from China. Trump has, however, also flagged high tariffs imposed by India repeatedly. At an election rally, he criticised China, Brazil, and India, calling India a “tariff king” and a “trade abuser.”\n\nThe US is India’s largest trade partner, with bilateral trade reaching almost $120 billion in FY24 — slightly higher than India’s trade with China. However, unlike China, India’s trade relationship with the US is favourable, making the US a vital source of foreign exchange.\n\nDespite attempts to diversify its exports, India’s dependence on the US has grown over the past decade. According to official 2022–23 data, the US accounts for 18% of India’s exports, compared to 10% in 2010–11. India’s export basket to the US is well-diversified, benefiting industries ranging from textiles to electronics and engineering.\n\nStory continues below this ad\n\nDuring his first term, Trump invoked national security provisions to impose a 25% tariff on steel and a 10% tariff on aluminium from India and other countries, breaking with the tradition of not targeting friendly nations. President Biden chose to negotiate with India and the European Union rather than lift these tariffs."
    },
    {
        "title": "India among a few nations that can talk to both Russia, Ukraine: Jaishankar",
        "description": "India is one of the few countries which is in a position to talk to Israel and Iran as well and Prime Minister Modi is able to do both, being a member of the Quad and BRICS, he said",
        "content": "India is one of the few countries which is in a position to talk to Israel and Iran as well and Prime Minister Modi is able to do both, being a member of the Quad and BRICS, he said read more\nExternal Affairs Minister S Jaishankar has underlined Indi... [3567 chars]",
        "url": "https://www.firstpost.com/world/india-among-a-few-nations-that-can-talk-to-both-russia-ukraine-jaishankar-13852838.html",
        "image": "https://images.firstpost.com/uploads/2024/12/Jaishankar-2024-12-4676b8e3337d23e5f88f0c6785200d89-1200x675.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-01-14T15:05:47Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "India is one of the few countries which is in a position to talk to Israel and Iran as well and Prime Minister Modi is able to do both, being a member of the Quad and BRICS, he said read more\n\nExternal Affairs Minister S Jaishankar has underlined India’s potential role in ending global conflicts, saying that it is one of the few countries that is in a position to hold talks with both Russia and Ukraine, and with Israel and Iran.\n\nJaishankar, who is on a two-day visit to Spain, made these remarks during an interaction with the Indian community here on Monday in an apparent reference to the wars in Ukraine and in West Asia, where Israel is fighting Iran-backed Hamas.\n\nAdvertisement\n\nThe minister said India is today seen as contributing to a global conversation that when the ”world is looking at many, many challenges, different issues, we also come up with ideas and initiatives”.\n\n“There are very few countries today who are in a position to talk to Russia and to Ukraine,” he said.\n\nHe said Prime Minister Narendra Modi last year visited Russia twice and also went to Kyiv in Ukraine.\n\nIndia is one of the few countries which is in a position to talk to Israel and Iran as well and Prime Minister Modi is able to do both, being a member of the Quad and BRICS, he said.\n\n“So, this is something which is actually very, very unique. And it is unique because if you look at the world, it is a very polarised world,” he added.\n\nThe Quad consists of Australia, Japan the US and India while the BRICS grouping now has Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Indonesia, Iran and the UAE as its members.\n\nJaishankar further said India was the one who brought the African Union into the G20 which should have been done years ago.\n\nAdvertisement\n\nThe minister said India has a plan to make 4,000 kilometres of new tracks every year, and every day 12 to 14 kilometres of new rail tracks are built.\n\nThe minister further said that 28 kilometres of highways are being built every day and in the last 10 years, the number of airports in the country has doubled from 75 to more than 150.\n\nJaishankar said the number of metro trains in India has grown from six in 2014 to 21 today and we plan to take it to 60 cities.\n\nThe external affairs minister also highlighted India’s achievements in sectors like space technology as it managed to land on the south side of the moon with its Chandrayaan-3 mission.\n\nAdvertisement\n\nJaishankar said India and Spain would mark 2026 as a ”dual year”, where they would be celebrating culture, tourism and artificial intelligence in both countries.\n\nJaishankar said he has been to Spain as a tourist a little more than 20 years ago and added that in 2017, he had the privilege of coming here with Prime Minister Narendra Modi in 2017.\n\nHe said President Pedro Sanchez’s visit to India last year was a very successful one and his agreement with Modi that both countries should make a special effort to take their relationship forward.\n\nJaishankar also announced that Spain will soon open a consulate in Bengaluru, calling it a “good sign” for deepening the relations between both the countries.\n\nAdvertisement\n\nHe urged the diaspora to remain in touch with India and follow the debates and conversations happening in the country.\n\n“The biggest change I have seen in the last 10 years is the importance that the Government of India, the people of India have put on the contribution of diaspora,” he said.\n\nJaishankar credited Modi for making Indians understand the invaluable contribution made by the diaspora.\n\nThis is Jaishankar’s first visit to Spain as the external affairs minister – nearly two-and-a-half months after Spanish President Pedro Sanchez visited India.\n\nOn Monday, Jaishankar met his Spanish counterpart Jose Manuel Albares and discussed regional and global issues.\n\nAdvertisement"
    },
    {
        "title": "UPSC Essentials | Daily subject-wise quiz : International Relations MCQs on Rottnest Island, BRICS grouping and more (Week 92)",
        "description": "Are you preparing for UPSC CSE Prelims 2025? Check your progress and revise your topics through this quiz on International Relations.",
        "content": "UPSC Essentials brings to you its initiative of subject-wise quizzes. These quizzes are designed to help you revise some of the most important topics from the static part of the syllabus. Attempt today’s subject quiz on the International Relations Qu... [6708 chars]",
        "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-daily-subject-wise-quiz-international-relations-mcqs-on-rottnest-island-brics-grouping-and-more-week-92-9771707/",
        "image": "https://images.indianexpress.com/2025/01/Rottnest-Island.jpg",
        "publishedAt": "2025-01-10T11:44:30Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        },
        "full_content": "UPSC Essentials brings to you its initiative of subject-wise quizzes. These quizzes are designed to help you revise some of the most important topics from the static part of the syllabus. Attempt today’s subject quiz on the International Relations Quiz to check your progress. Come back tomorrow to solve the MCQs on Weekly Current Affairs.\n\nWhich of the countries shares a border with the Gulf of Mexico?\n\n1. United States\n\n2. Guatemala\n\n3. Cuba\n\n4. Costa Rica\n\n5. Mexico\n\nSelect the correct answer using the codes given below:\n\n(a) 2, 3, 4 and 5\n\n(b) 1, 3 and 5 only\n\n(c) 1 and 5 only\n\n(d) 1, 2, 4 and 5\n\nExplanation\n\n— US President-elect Donald Trump has stated that he intends to rename the Gulf of Mexico the “Gulf of America”.\n\nStory continues below this ad\n\n— This comes after a series of antagonistic statements in which Trump threatened to take control of Greenland and the Panama Canal, as well as referring to Canada as the “51st” US state.\n\n— In response, Mexico’s President Claudia Sheinbaum told reporters that North America should be renamed “Mexican America,” which the continent called on certain 17th-century maps. Surrounded by historical maps on a screen at a briefing, Sheinbaum observed sarcastically, “Mexican America, that sounds nice.”\n\n— The Gulf of Mexico is bordered by three countries: the United States, Mexico and Cuba.\n\nTherefore, option (b) is the correct answer.\n\nQUESTION 2\n\nWith reference to the BRICS grouping, consider the following statements:\n\nStory continues below this ad\n\n1. Indonesia has officially joined the BRICS as a full member.\n\n2. Russia holds the presidency of BRICS in 2025.\n\n3. The 1st BRIC summit was held in China in 2009.\n\nHow many of the statements given above are correct?\n\n(a) Only one\n\n(b) Only two\n\n(c) All three\n\n(d) None\n\nExplanation\n\n— Indonesia has officially joined the BRICS as a full member, the Brazilian government declared. Brazil, Russia, India, China, South Africa, and Indonesia presently make up the group of big emerging economies. Hence, statement 1 is correct.\n\n— Indonesia’s foreign ministry welcomed the announcement in a statement released, calling BRICS membership as “a strategic way to increase collaboration and partnership with other developing nations.”\n\n— Indonesia, the world’s fourth most populous country, had long indicated an interest in joining BRICS to enhance emerging-nation partnerships and achieve the Global South’s aims.\n\nStory continues below this ad\n\n— Brazil, which will hold the BRICS presidency in 2025, said that member nations unanimously approved Indonesia’s entry at the 2023 BRICS summit in Johannesburg. Hence, statement 2 is not correct.\n\n— BRICS has been extending its membership in recent years. Along with Indonesia, the bloc includes Egypt, Ethiopia, Iran, and the United Arab Emirates, demonstrating its expanding influence in emerging countries.\n\n— In July 2006, the leaders of the BRIC countries (Brazil, Russia, India, and China) met for the first time in St. Petersburg, Russia, on the fringes of the G8 Outreach Summit. Following a series of high-level meetings, the first BRIC summit took place on June 16, 2009, in Yekaterinburg, Russia. Hence, statement 3 is not correct.\n\nTherefore, option (a) is the correct answer.\n\nQUESTION 3\n\nWith reference to the islands in news, consider the following pairs:\n\n1. Rottnest Island – Australia\n\n2. Ramree Island – Bangladesh\n\nWhich of the pairs given above is/are correct?\n\n(a) 1 only\n\n(b) 2 only\n\n(c) Both 1 and 2\n\n(d) Neither 1 nor 2\n\nExplanation\n\nStory continues below this ad\n\nIslands in news Region/Country Description Rottnest Island Australia A seaplane crashed off an Australian tourist island into the Indian Ocean with three people getting seriously injured and three others remain missing. Seven people were aboard the Cessna 208 Caravan and only one of them was rescued unharmed post the crash at Rottnest Island. Ramree Island Myanmar An airstrike by Myanmar’s army on a village under the control of an armed ethnic minority group killed about 40 people and injured at least 20 others . The attack occurred in Kyauk Ni Maw village on Ramree island, an area controlled by the ethnic Arakan Army in western Rakhine state.\n\nTherefore, option (a) is the correct answer.\n\nQUESTION 4\n\nRussia has halted its gas supply to Europe via Ukraine, which has majorly affected:\n\n1. Austria\n\n2. Germany\n\n3. Slovakia\n\n4. Moldova\n\nSelect the correct answer using the codes given below:\n\n(a) 1 and 3 only\n\n(b) 1, 2 and 4\n\n(c) 3 and 4 only\n\n(d) 1, 3 and 4\n\nExplanation\n\n— Russian gas deliveries to Europe via Ukraine, which had been in place for over 40 years, came to an end on Wednesday (1 January) after Kyiv declined to renegotiate a five-year-old transit arrangement amid a war with Moscow.\n\n— Eastern European countries, particularly Austria, Slovakia, and Moldova, would bear the brunt of the impact.\n\nStory continues below this ad\n\n— According to Al Jazeera, Austria received the majority of its gas from Russia via Ukraine, while Slovakia received gas that accounted for around two-thirds of its yearly needs.\n\n— According to Slovakia’s Prime Minister Robert Fico, the supply disruption would cost hundreds of millions of dollars in transit fees, as well as a higher premium for importing other gas, the article claimed. He also predicted that petrol costs would rise across Europe.\n\n— Moldova is projected to be the most severely affected. The country has already declared a state of emergency due to the imminent gas scarcity.\n\nTherefore, option (d) is the correct answer.\n\nQUESTION 5\n\nGreenland, an autonomous territory within the Kingdom of:\n\n(a) Belgium\n\n(b) Netherlands\n\n(c) Denmark\n\n(d) Sweden\n\nExplanation\n\n— The European Union will not allow any nation to challenge its territorial borders, France’s foreign minister said in response to remarks made by US President-elect Donald Trump about his plans to take over Greenland, an autonomous territory of EU member Denmark.\n\nStory continues below this ad\n\n— Greenland is an autonomous territory of the Kingdom of Denmark that obtained its home government in 1979.\n\n— Greenland, with a population of around 57,000, is the world’s largest island. Since 2009, it has had the authority to hold a referendum to determine whether to pursue independence.\n\n— “The majority of Greenlanders believe that Greenland is not for sale and will not be in the future. Greenland belongs to the Greenlanders,” Mette Frederiksen, the Danish Prime Minister, said.\n\nTherefore, option (c) is the correct answer.\n\nPrevious Daily Subject-Wise-Quiz\n\nDaily subject-wise quiz — Polity and Governance (Week 92)\n\nDaily subject-wise quiz — Science and Technology (Week 92)\n\nDaily subject-wise quiz — Environment and Geography (Week 92)\n\nDaily subject-wise quiz — Economy (Week 92)\n\nDaily subject-wise quiz – International Relations (Week 91)\n\nDaily Subject-wise quiz — History, Culture, and Social Issues (Week 91)\n\nStory continues below this ad\n\nSubscribe to our UPSC newsletter and stay updated with the news cues from the past week.\n\nStay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and X."
    },
    {
        "title": "Brazil Says Indonesia Will Join BRICS",
        "description": "Brazil is the bloc’s current president and Indonesia on several occasions expressed its desire to join the group.",
        "content": "Brazil Says Indonesia Will Join BRICS\nPublished By :\nReuters\nLast Updated: January 07, 2025, 22:18 IST\nBrazil is the bloc’s current president and Indonesia on several occasions expressed its desire to join the group.\nA view shows a banner with the lo... [1633 chars]",
        "url": "https://www.news18.com/world/brazil-says-indonesia-will-join-brics-9181313.html",
        "image": "https://images.news18.com/ibnlive/uploads/2025/01/brics-indonesia-new-member-reuters-2025-01-575a7e026185adb68f472a167535dc92-16x9.jpg",
        "publishedAt": "2025-01-07T16:48:08Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "Brazil Says Indonesia Will Join BRICS\n\nPublished By :\n\nReuters\n\nLast Updated: January 07, 2025, 23:31 IST\n\nBrazil is the bloc’s current president and Indonesia on several occasions expressed its desire to join the group.\n\nA view shows a banner with the logo of the annual BRICS summit next to the Kazan Kremlin in Kazan, Russia. (IMAGE: REUTERS)\n\nIndonesia will formally join BRICS as a full member, Brazil’s government said on Monday, further expanding the group of major emerging economies that also includes Russia, India, China and South Africa.\n\nIndonesia’s foreign ministry said in a statement on Tuesday that it welcomed the announcement and that “BRICS membership is a strategic way to increase collaboration and partnership with other developing nations.\"\n\nRecommended Stories\n\nIndonesia, the world’s fourth most populous nation, had previously expressed its desire to join the group as a means of strengthening emerging countries and furthering the interests of the so-called Global South.\n\nBrazil, which holds the bloc’s presidency in 2025, said in a statement that member states approved Indonesia’s entry by consensus as part of an expansion push initially endorsed at the 2023 BRICS summit in Johannesburg.\n\nThe South American nation noted that Jakarta’s bid got the green light from the bloc in 2023 but the Southeast Asian country asked to join following the presidential election held last year. President Prabowo Subianto took office in October.\n\ntop videos View all Swipe Left For Next Video View all\n\n“Indonesia shares with the other members of the group support for the reform of global governance institutions, and contributes positively to the deepening of cooperation in the Global South,\" the Brazilian government said.\n\nThe BRICS group also includes Egypt, Ethiopia, Iran and the United Arab Emirates.\n\nLocation : Sao Paulo, Brazil\n\nFirst Published: January 07, 2025, 22:18 IST"
    },
    {
        "title": "Indonesia Joins BRICS: A New Chapter in Global Collaboration",
        "description": "Indonesia has been formally accepted as a full member of BRICS, a coalition of major emerging economies including Brazil, Russia, India, China, and South Africa. This move aims to enhance cooperation with developing countries and support for reformation of global governance, strengthening the Global South's interests.",
        "content": "Indonesia has officially become a full member of BRICS, Brazil's government announced, expanding the group of major emerging economies that includes Brazil, Russia, India, China, and South Africa.\nThe Indonesian foreign ministry expressed its approva... [634 chars]",
        "url": "https://www.devdiscourse.com/article/law-order/3217315-indonesia-joins-brics-a-new-chapter-in-global-collaboration",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/03_06_2024_03_52_49_3557307.png?width=920&format=jpeg",
        "publishedAt": "2025-01-07T04:20:36Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Indonesia has officially become a full member of BRICS, Brazil's government announced, expanding the group of major emerging economies that includes Brazil, Russia, India, China, and South Africa.\n\nThe Indonesian foreign ministry expressed its approval, describing BRICS membership as a strategic path for increasing collaboration with other developing nations. This aligns with Indonesia's goal of reinforcing emerging economies and advancing the interests of the Global South.\n\nWith its entry approved by consensus during Brazil's current presidency, Indonesia previously signaled its membership intentions prior to the 2023 BRICS summit. The inclusion follows the presidential election that brought President Prabowo Subianto into office in October, and Indonesia now engages in advocating for reforms in global governance alongside fellow BRICS members.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Indonesia joins BRICS bloc as full member, announces Brazil",
        "description": "Indonesia has a population of 276 million people and is the world’s fourth most populous country. The Southeast Asian country also boasts a large economy with a GDP exceeding $1.3 trillion",
        "content": "Follow us on Image Source : PIXABAY Indonesia joins BRICS bloc as full member\nIndonesia has become a full member of the BRICS group, announced Brazil on Monday. It is the largest economy and most populous nation in Southeast Asia and its entry to the... [2177 chars]",
        "url": "https://www.indiatvnews.com/news/world/indonesia-joins-brics-bloc-as-full-member-announces-brazil-2025-01-07-969930",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/01/brics-1-1736215758.jpg",
        "publishedAt": "2025-01-07T02:46:44Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        },
        "full_content": "Indonesia joins BRICS bloc as full member, announces Brazil Indonesia has a population of 276 million people and is the world’s fourth most populous country. The Southeast Asian country also boasts a large economy with a GDP exceeding $1.3 trillion\n\nBrasilia (Brazil):\n\nIndonesia has become a full member of the BRICS group, announced Brazil on Monday. It is the largest economy and most populous nation in Southeast Asia and its entry to the BRICS bloc will further deepen the Global South cooperation. BRICS was formed by Brazil, Russia, India and China in 2009, and South Africa was added in 2010.\n\nIndonesia's candidacy was endorsed by BRICS leaders in August 2023. However, it opted to formally join the bloc only after the formation of its newly elected government last year.\n\nBrazil welcomes Indonesia to BRICS bloc\n\nBrazil, which holds the presidency of the BRICS in 2025, welcomes Indonesia. \"The Brazilian government welcomes Indonesia for its entry into BRICS. As the largest economy and most populous nation in Southeast Asia, Indonesia shares with other BRICS members the support for the reform of the global governance institutions and contributes significantly to the deepening of Global South cooperation, priorities that align with Brazil's theme for its presidency: \"Enhancing Global South Cooperation for a More Inclusive and Sustainable Governance,\" Brazilian Foreign Ministry said in a statement.\n\nWhat is BRICS bloc and why is it important\n\nBRICS is an intergovernmental organisation that was founded as a counterweight to the Group of Seven, comprised of developed nations, that had ceased to serve developing countries. The bloc has sought to coordinate its members’ economic and diplomatic policies, found new financial institutions, and reduce dependence on the U.S. dollar.\n\nBRICS was formed by Brazil, Russia, India and China in 2009, and South Africa was added in 2010. Last year, the alliance expanded to embrace Iran, Egypt, Ethiopia and the United Arab Emirates. Turkey, Azerbaijan and Malaysia have formally applied.\n\nBRICS term was originally coined by Goldman Sachs economist Jim O’Neill in a 2001 research paper in which he stated that the growth of what was then the “BRIC” countries (Brazil, Russia, India, and China) was poised to challenge the dominant G7 wealthy economies.\n\nThe first BRIC Summit was held in Russia's Yekaterinburg in 2009. It was agreed to expand BRIC into BRICS with the inclusion of South Africa at the BRIC Foreign Ministers' meeting in New York in 2010. The 16th BRICS Summit was being held under Russia's chairmanship in Kazan in 2024.\n\n(With inputs from agencies)"
    },
    {
        "title": "Brazil announces Indonesia's BRICS entry to strengthen Global South cooperation",
        "description": "Indonesia, the world’s fourth most-populous nation, had previously expressed its desire to join the group as a means of strengthening emerging countries and furthering the interests of the so-called Global South.",
        "content": "Indonesia, the world’s fourth most-populous nation, had previously expressed its desire to join the group as a means of strengthening emerging countries and furthering the interests of the so-called Global South. read more\nBrazil’s government said in... [1631 chars]",
        "url": "https://www.firstpost.com/world/brazil-announces-indonesias-entry-into-brics-to-boost-global-south-cooperation-13850434.html",
        "image": "https://images.firstpost.com/uploads/2024/10/BRICS1200-2024-10-8d90f2dca4648d43b4e3f727a5d43c1a.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-01-06T17:13:00Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "Indonesia, the world’s fourth most-populous nation, had previously expressed its desire to join the group as a means of strengthening emerging countries and furthering the interests of the so-called Global South. read more\n\nBRICS welcomes Indonesia as a new member under Brazil’s 2025 presidency\n\nBrazil’s government said in a statement on Monday that Indonesia is formally joining BRICS as a full member, further expanding the group of major emerging economies that also includes Russia, India, China and South Africa.\n\nAs the world’s fourth most populous nation, Indonesia had sought membership to strengthen the coalition of emerging nations and advance the interests of the Global South.\n\nBrazil set to preside over the bloc in 2025, confirmed that member states unanimously approved Indonesia’s entry, building on the expansion framework agreed upon at the 2023 Johannesburg summit.\n\nAdvertisement\n\nThe South American nation noted that Indonesia’s bid got the green light from the bloc in 2023 but the Asian country asked to join following the presidential election held last year. President Prabowo Subianto took office in October.\n\n”Indonesia shares with the other members of the group support for the reform of global governance institutions, and contributes positively to the deepening of cooperation in the Global South,” the Brazilian government said.\n\nThe BRICS group also includes Egypt, Ethiopia, Iran and the United Arab Emirates.\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia. Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe group now accounts for 45% of the world’s population and 35% of its economy, based on purchasing power parity, though China accounts for more than half of its economic might.\n\nWith inputs from agencies."
    },
    {
        "title": "Vladimir Putin orders Russian government depts, top bank to work with China to develop AI",
        "description": "Kremlin's initiative is part of a broader effort by Russia to build alliances with BRICS nations and other partners. Putin envisions creating an \"AI Alliance Network\" to pool resources and expertise",
        "content": "Kremlin’s initiative is part of a broader effort by Russia to build alliances with BRICS nations and other partners. Putin envisions creating an “AI Alliance Network” to pool resources and expertise read more\nBy teaming up with China, Russia hopes to... [2325 chars]",
        "url": "https://www.firstpost.com/tech/vladimir-putin-orders-russian-government-depts-top-bank-to-work-with-china-to-develop-ai-13849332.html",
        "image": "https://images.firstpost.com/uploads/2025/01/Vladimir-Putin-orders-Russian-government-depts-top-bank-to-work-with-China-to-develop-AI-2025-01-eefb2608dbf7780a6e11e497f9a0ecf4-1200x675.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2025-01-02T10:21:16Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "Kremlin’s initiative is part of a broader effort by Russia to build alliances with BRICS nations and other partners. Putin envisions creating an “AI Alliance Network” to pool resources and expertise read more\n\nBy teaming up with China, Russia hopes to sidestep these limitations. China’s leadership in AI and its access to advanced hardware provide a lifeline for Moscow to continue its AI development despite the restrictions. Image Credit: Reuters\n\nRussian President Vladimir Putin has issued a directive for government agencies and Sberbank, the nation’s largest bank, to collaborate with China in advancing artificial intelligence (AI). The Kremlin announced the move on Wednesday, underscoring Russia’s push to strengthen ties with China to enhance its technological capabilities in the face of growing global competition.\n\nThis initiative is part of a broader effort by Russia to build alliances with BRICS nations and other partners. Putin envisions creating an “AI Alliance Network” to pool resources and expertise, helping Russia maintain relevance in the rapidly evolving AI landscape.\n\nAdvertisement\n\nNavigating Western sanctions\n\nRussia’s AI ambitions have been significantly hampered by Western sanctions, which have blocked access to advanced microchips and other critical technologies. These restrictions have forced Russian companies to innovate with limited resources. GPUs (graphics processing units), essential for AI development, have been particularly challenging to replace, as acknowledged by Sberbank CEO German Gref.\n\nBy teaming up with China, Russia hopes to sidestep these limitations. China’s leadership in AI and its access to advanced hardware provide a lifeline for Moscow to continue its AI development despite the restrictions.\n\nPartnering with BRICS for technological growth\n\nPutin’s directive aligns with his vision of fostering cooperation within the BRICS framework. The proposed “AI Alliance Network” aims to bring together experts from member nations, including China, India, Brazil, and South Africa. This initiative is expected to help Russia share knowledge, reduce dependency on Western technologies, and drive progress in AI research.\n\nRussia’s AI position on the global stage\n\nRussia currently ranks 31st on the Global AI Index, far behind leaders like the US and China. Even fellow BRICS members, such as India and Brazil, surpass Russia in AI innovation and investment. The collaboration with China is seen as a vital step for Russia to improve its standing and challenge the dominance of Western powers in this critical technology sector."
    },
    {
        "title": "Russia and China's AI Alliance: A New Technological Frontier",
        "description": "President Vladimir Putin has directed Russia's government and Sberbank to enhance collaboration with China in artificial intelligence. This move aims to bypass Western sanctions that limit Russia's access to crucial technologies, seeking support from BRICS and non-Western countries to challenge U.S. dominance in AI.",
        "content": "President Vladimir Putin has ordered an alliance between Russia's state apparatus and its largest bank, Sberbank, to strengthen cooperation with China in artificial intelligence.\nThe Kremlin revealed these instructions on Wednesday, following a decla... [940 chars]",
        "url": "https://www.devdiscourse.com/article/headlines/3212233-russia-and-chinas-ai-alliance-a-new-technological-frontier",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/29_08_2024_10_41_13_4807203.png?width=920&format=jpeg",
        "publishedAt": "2025-01-01T12:55:18Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "President Vladimir Putin has ordered an alliance between Russia's state apparatus and its largest bank, Sberbank, to strengthen cooperation with China in artificial intelligence.\n\nThe Kremlin revealed these instructions on Wednesday, following a declaration made by Putin three weeks prior about joining forces with BRICS and other nations to advance AI initiatives. He mandated the Russian government and Sberbank to ensure expanded collaboration with China in AI research and development.\n\nWestern sanctions aimed at cutting Moscow's technological supply have hindered its AI progress by stopping major microchip exports to Russia. Former Sberbank CEO German Gref noted the difficulty in replacing graphics processing units, crucial for AI development. In response, Russia is turning to non-Western partners to counter U.S. leadership in this strategic field. Putin announced plans for an AI Alliance Network to unite experts from BRICS and other countries. Despite these efforts, Russia ranks 31st in global AI readiness according to Tortoise Media's Global AI Index, trailing behind major players like the U.S., China, as well as BRICS peers India and Brazil.\n\n(With inputs from agencies.)"
    },
    {
        "title": "BRICS Nations Under the Lens: CCI Examines Renewable Energy Competition",
        "description": "The Competition Commission of India (CCI) is conducting a market study to understand competition issues in the renewable energy sector across BRICS nations. Part of a broader initiative under the BRICS framework, the study aims to explore key market dynamics. This follows CCI's similar efforts in the AI sector.",
        "content": "The Competition Commission of India (CCI) has commenced a comprehensive market study to delve into competition issues within the renewable energy sector across BRICS nations. This initiative, under the BRICS framework, is highlighted by CCI Chairpers... [719 chars]",
        "url": "https://www.devdiscourse.com/article/headlines/3209692-brics-nations-under-the-lens-cci-examines-renewable-energy-competition",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/05_06_2024_11_29_16_0742457.png?width=920&format=jpeg",
        "publishedAt": "2024-12-29T11:59:24Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "The Competition Commission of India (CCI) has commenced a comprehensive market study to delve into competition issues within the renewable energy sector across BRICS nations. This initiative, under the BRICS framework, is highlighted by CCI Chairperson Ravneet Kaur and aims to uncover critical market dynamics affecting the sector.\n\nHistorically, BRICS comprised Brazil, Russia, India, China, with South Africa joining later, and the bloc has since expanded to include additional member countries. The CCI's focus is part of its larger mandate to study shifting market conditions in various industries.\n\nChairperson Kaur emphasized that the commission is consistently exploring new areas for market studies, driven by evolving market dynamics and the need to align with enforcement priorities. This proactive approach also aligns with CCI's current focus, which includes ongoing studies in areas like Artificial Intelligence and competition.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Manmohan Singh’s legacy in international negotiations set the stage for India’s current foreign policy",
        "description": "BRICS, India-US civil nuclear deal, Quad, Pakistan, SCO, were all part of late former PM's foreign engagements, which set India on path of 'multi-vector' diplomacy, to quote Jaishankar.",
        "content": "The “scrupulously honest” Singh, who was called as a “cautious” leader in foreign policy by former US president Barack Obama in his memoir ‘A Promised Land’, staked the future of his government in 2008 on ensuring that the civil nuclear deal with Ame... [7529 chars]",
        "url": "https://theprint.in/diplomacy/manmohan-singhs-legacy-in-international-negotiations-set-the-stage-for-indias-current-foreign-policy/2420668/",
        "image": "https://static.theprint.in/wp-content/uploads/2024/12/Untitled-design-2024-12-27T151955.099.png",
        "publishedAt": "2024-12-27T09:51:46Z",
        "source": {
            "name": "ThePrint",
            "url": "https://theprint.in"
        },
        "full_content": "The “scrupulously honest” Singh, who was called as a “cautious” leader in foreign policy by former US president Barack Obama in his memoir ‘A Promised Land’, staked the future of his government in 2008 on ensuring that the civil nuclear deal with America, also known as the 1-2-3 Agreement, would come to fruition.\n\nSingh, during his decade-long tenure at the helm of the country between 2004 and 2014, oversaw India’s growing international footprint.\n\nNew Delhi: The India-US civil nuclear deal, the G20, Quad 1.0, the Sharm El Sheikh Joint Statement, formation of BRICS, joining the Shanghai Cooperation Organisation (SCO) as an observer, and a number of Free Trade Agreements—all part of the foreign policy legacy of Prime Minister Manmohan Singh—were the building blocks of New Delhi’s current global positioning.\n\nThe deal first announced in 2005, saw New Delhi place all its civilian nuclear facilities under the safeguards of the International Atomic Energy Agency (IAEA), in exchange for a grant of exemption from the Nuclear Suppliers Group (NSG), which was formed following India’s nuclear weapon test in 1974.\n\nThe complex deal saw the US push for the NSG waiver, which allowed India access to civil nuclear technology and purchase of fuel from other countries—the only non-member of the Non-Proliferation Treaty (NPT) to be allowed to do so.\n\nThe civil nuclear agreement revamped the moribound ties between the two countries. Subsequent to the India-US civil nuclear deal, New Delhi signed a number of similar agreements with France, Russia, the UK, the Republic of Korea, Vietnam, Bangladesh, Sri Lanka, Canada, Argentina, Kazakhstan, Australia and Japan.\n\nHowever, the deal with the US in 2008, was not smooth sailing as it probably would have been if it was announced today. The Left parties led by Prakash Karat and A.B. Bardhan, with its 60 Members of Parliament withdrew its support from the United Progressive Alliance (UPA) over the nuclear deal.\n\nSingh opted for a floor test and in July 2008, the UPA managed to maintain its majority in the Lok Sabha, with the support of the Samajwadi Party. It was one of the few times that the Left and the Bharatiya Janata Party (BJP) came together in agreement.\n\nFormation of BRICS\n\nThe BRICS grouping comprising Brazil, Russia, India, China and South Africa, first came together during Singh’s tenure as Prime Minister. The first meeting of foreign ministers of the BRIC (without South Africa), happened on the margins of the United Nations General Assembly in 2006.\n\nIn 2009, the first BRIC Summit, attended by the leaders of Brazil, Russia, India and China, was held in the Russian city of Yekaterinburg, which saw the four leaders call for the reform of international financial institutions and a “more diversified” monetary system, which has slowly gained global momentum, with New Delhi consistently pushing for more trade in local currencies.\n\nIn 2010, South Africa joined the grouping and in 2023, it further expanded to include Egypt, the UAE, Iran and Ethiopia, and has gained interest from a number of developing countries from around the world. One of the major outcomes of the grouping is the formation of the New Development Bank (NDB) as an institution for global development financing.\n\nEngagement with Pakistan\n\nDuring Singh’s tenure as Prime Minister, India witnessed a number of terrorist attacks stemming from across the border, including the 2008 Mumbai attacks, which left 166 people dead and more than 300 injured.\n\nHowever, Singh during his tenure reiterated that terrorism cannot impede on the peace process between India and Pakistan, meeting with Parvez Musharaff a number of times, including in the aftermath of the 2006 Mumbai train blasts.\n\nThe most significant of meetings with his Pakistani counterparts was at the Egyptian resort town of Sharm El Sheikh in 2009, mere months after the 26/11 Mumbai attacks. The Joint Statement emanating from that meeting with Pakistani Prime Minister Yusuf Raza Gilani was widely criticised in India for its perceived delinking terrorism from the composite dialogue process, which found little support from his own party, the Congress.\n\nThe statement also brought Balochistan into the picture, with Gilani making a mention “on threats” in the province, which Islamabad has long blamed New Delhi for fermenting. There has been little progress in ties between India and Pakistan in recent years, especially as the Modi government has maintained that terror and talks cannot go together under\n\nQuad 1.0\n\nOn 26 December 2004, two decades to the day of Singh’s passing, an earthquake off the coast of Aceh in Northern Sumatra led to a massive tsunami, which left close to 2,30,000 people dead across the Indian Ocean.\n\nIn the aftermath of the tsunami, India, the US, Australia and Japan came together to form the ‘Tsunami Core Group’ to coordinate humanitarian assistance and disaster relief (HADR)—the first coordination amongst a grouping of countries which later became the Quadrilateral Security Dialogue.\n\nUnder Shinzo Abe’s premiership between 2006 and 2007, Tokyo led the efforts to institutionalise the minilateral, which eventually petered out for a decade until it was relaunched in 2017 at the level of foreign ministers before being upgraded to a leaders’ level dialogue in 2021.\n\nHADR operations remain a key component of the current-day partnership between the Quad nations in the Indo-Pacific region. However, another result of Singh’s ties with Tokyo and Abe was the “Confluence of the Two Seas”, a speech by the late Japanese prime minister to the Indian Parliament in 2007, which laid the foundation for the understanding of the ‘Indo-Pacific’ region.\n\nWTO, G20, & the SCO\n\nSingh’s ten-years saw India’s international economic engagement increase substantially. In 2008 for example, India along with China was one of the major reasons why the World Trade Organisation (WTO) Doha Round talks in Geneva Switzerland were unsuccessful.\n\nThe Indian government was willing to forgo any deal at the WTO in July 2008, if the interests of its farmers were threatened. Kamal Nath, the then commerce minister, missed the early days of the negotiations due to the confidence vote in Parliament over the India-US nuclear deal.\n\n““Do we give developed countries the unfettered right to continue subsidising & then dumping those subsidies on us, jeopardising lives of billions? The position of developed countries is utterly self-righteous: they have enjoyed their SSG [special agricultural safeguards] (and want to continue it) but our SSM [special safeguard mechanism] must be subject to all sorts of shackles and restraints. This self-righteousness will not do. If it means no deal, so be it,” Nath said in his address at the WTO.\n\nIn 2008, Singh attended the G20 Summit in Washington D.C., during the global financial crisis precipitated in the wake of the US housing crisis. The G20 has become an important economic forum for leaders of the world’s largest economies. In 2023, India held the presidency of the summit, and brought the African Union (AU), into the forum.\n\nDuring Singh’s tenure, India also joined the Shanghai Cooperation Organisation (SCO) as an observer in 2005—the forum which includes Central Asian countries along with China, Russia, Belarus, Iran and Pakistan. In 2017, India and Pakistan were made members of the grouping, which has a number of initiatives including cooperation on terrorism.\n\n(Edited by Tony Rai)\n\nAlso Read: Nuclear deal to Sharm el-Sheikh statement & FDI, Manmohan Singh’s relationship with Congress was fraught"
    },
    {
        "title": "Russia's Strategic Move: AI Collaboration to Challenge US Dominance",
        "description": "President Putin declared Russia's intent to develop AI in partnership with BRICS countries and others, aiming to challenge the US in AI technology. Despite facing Western sanctions, Russia seeks to enhance its AI capabilities, with Sberbank leading efforts through the AI Alliance Network. Global collaboration is invited.",
        "content": "On Wednesday, President Vladimir Putin announced Russia's intention to collaborate with BRICS countries in developing artificial intelligence. The initiative aims to rival the United States in this critical technology of the 21st century.\nSpeaking at... [537 chars]",
        "url": "https://www.devdiscourse.com/article/technology/3190767-russias-strategic-move-ai-collaboration-to-challenge-us-dominance",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_33_47_4854533.png?width=920&format=jpeg",
        "publishedAt": "2024-12-11T16:05:39Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "On Wednesday, President Vladimir Putin announced Russia's intention to collaborate with BRICS countries in developing artificial intelligence. The initiative aims to rival the United States in this critical technology of the 21st century.\n\nSpeaking at Russia's prominent AI conference, Putin introduced the AI Alliance Network, which will include national associations and institutions from BRICS and other interested countries. He emphasized the necessity of equal participation in the global AI race.\n\nDespite sanctions restricting Russia's technological access, its dominant lender Sberbank is advancing AI development. National AI bodies from BRICS countries and beyond have joined the network, promoting collaborative research and AI product distribution.\n\n(With inputs from agencies.)"
    },
    {
        "title": "De-dollarization debate: The US-led West should rethink its dollar diplomacy",
        "description": "Geopolitics made BIS give up on the mBridge project. Western policymakers should match the enthusiasm of Brics leaders for currency digitization and take steps to regulate digital dollars, publicly or privately issued.",
        "content": "Amid the recent maelstrom of political news was an important development for the future of technology-enabled public money. During the Brics Summit in Kazan, Russia, the Bank for International Settlements revealed that it was withdrawing from the dig... [5454 chars]",
        "url": "https://www.livemint.com/opinion/online-views/dedollarization-debate-the-us-led-west-should-rethink-its-dollar-diplomacy-brics-bis-mbridge-digital-dollar-currency-11733814014421.html",
        "image": "https://www.livemint.com/lm-img/img/2024/12/10/1600x900/g6eae02dcc4de00ec3bac6b313a2bdc3ed47cf554b8afd0f47_1733816748175_1733816748596.jpg",
        "publishedAt": "2024-12-10T18:30:00Z",
        "source": {
            "name": "Livemint",
            "url": "https://www.livemint.com"
        },
        "full_content": "Amid the recent maelstrom of political news was an important development for the future of technology-enabled public money. During the Brics Summit in Kazan, Russia, the Bank for International Settlements revealed that it was withdrawing from the digital-asset and payments initiative Project mBridge.\n\nConceived in 2022 as a clearing-house for central-bank digital currencies (CBDCs), mBridge had anchored the BIS’s own work towards a global interbank settlement system to connect CBDCs beyond the control of any single government.\n\nCapitalizing on the efficiency gains of blockchain technology, mBridge offered an answer to all who are disenchanted with sluggish and unaffordable cross-border payments. As recently as June, the BIS had doubled down on the initiative, adding Saudi Arabia’s central bank to its roster of founding central banks and advancing it out of its pilot phase.\n\nDoubtless buffeted by the geopolitical headwinds coming out Kazan, BIS General Manager Agustín Carstens told a Group of 30 meeting in late October that, “we cannot directly support any project for the Brics because we cannot operate with countries that are subject to sanctions.\"\n\nCarstens’s comments reflect a growing tension in Western capitals. While many support efforts to use new technology to make the financial system more efficient and egalitarian, they don’t want to usher in a world order that is no longer grounded in Western law and norms.\n\nUS intelligence agencies have long highlighted this trade-off when warning about rogue states that are building sanctions-proof alternative settlement mechanisms or using virtual assets to facilitate bilateral trade (such as between Russia and China).\n\nIn Kazan, Brics leaders made no secret of their efforts to create a new financial order and jettison the dollar, thereby echoing long-standing Russian calls for a single blockchain-based Brics currency to fortify trade against Western sanctions.\n\nThe uncomfortable question facing Western policymakers is whether their vision of a borderless digital economy enshrined in Western values is truly best served by a public-led model in which central banks take centre-stage and organize commerce at the supranational level. After all, a privately led, publicly refereed system has been the norm for the past 80 years.\n\nIt was intermediated private money that exported Western rules and norms, creating a financial bulwark beyond Nato members’ borders and hard-coding US sanctions and anti-money-laundering measures into global banking and trade.\n\nBanks and multinationals have carried dollars to almost every corner of the planet, simultaneously serving as envoys for the US currency and financial system. For decades, this system has stymied money launderers, state sponsors of terror, drug traffickers and other criminals, pushing them to find ever more creative methods of evasion.\n\nHowever, rogue actors’ rapid adoption of unregulated forms of digital money has invigorated discussions—among leaders of both Brics and Western countries—about overhauling the existing global financial architecture. It is no surprise that the Brics have been at the forefront of projects like mBridge, given its potential to upend the established Bretton Woods order.\n\nBut rather than shying away from mBridge and successful pilots of new global trade and payments rails, Western leaders should consider how to make the most of them.\n\nJust as the old international financial rails served Western policy objectives, so can the new digital ones. With mBridge already demonstrating that blockchain technology can connect the global economy through internet-speed transactions, the only question now is how to strike the right balance between public and private involvement.\n\nThe answer may be deceptively simple: The most promising alternative to the Brics vision is to keep the existing architecture, but modernize the rails that distribute the dollar, euro and pound.\n\nAs matters stand, roughly 90% of foreign-exchange flows are still dollarized, but the Financial Stability Board’s latest assessment of cross-border payments stresses that the fragile, slow and expensive legacy fiat-currency system needs an upgrade.\n\nWith consumer cross-border payment costs rising, America’s not-so-secret weapon to address the system’s deficiencies and counter its adversaries’ ambitions is simply to embrace regulated digital dollars and allow the private sector to keep doing what it has been doing.\n\nCan Western policymakers match the enthusiasm of Brics leaders for digitization and take steps to regulate digital dollars? If so, one of their first steps should be to create a regulatory structure for digital private money in the form of dollar stablecoins, which already has bipartisan support in the US Senate and the House of Representatives.\n\nCodifying a US standard for the safe, sound and regulated use of digital dollars—whether publicly or privately issued—would be an authoritative response to those who want to highlight a trade-off between using dollars and participating in the digital economy.\n\nBy contrast, ignoring the technological implications of mBridge and tokenization could result in a major strategic loss. The dollar is inching toward representing only a plurality, rather than a majority, of global settlements.To borrow Carstens’s own prescient words in 2022: “Let’s ensure that our financial system builds on the existing governance of money, serves the public interest and works cooperatively with the private sector.\" ©2024/Project Syndicate\n\nThe author is director of regulatory strategy at Circle and a former illicit finance and macroeconomic official at the United States Treasury Department and Central Intelligence Agency."
    },
    {
        "title": "Trump's Call for Ukraine Ceasefire: Russia Open to Negotiations",
        "description": "Donald Trump's call for an immediate Ukraine ceasefire garners Russia's positive response. Kremlin welcomes peace talks, especially from the Global South and BRICS. Russia highlights Ukraine's rejection of dialogue. Trump's Truth Social statement underscores urgent need for negotiation amid ongoing conflict.",
        "content": "Following a call from US President-elect Donald Trump for an 'immediate ceasefire' in Ukraine, the Kremlin has expressed openness to negotiations and embraced peace efforts, particularly those coming from Global South nations and BRICS partners.\nIn a... [1192 chars]",
        "url": "https://www.devdiscourse.com/article/international/3188515-trumps-call-for-ukraine-ceasefire-russia-open-to-negotiations",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_12_2024_11_43_33_43731.jpg?width=920&format=jpeg",
        "publishedAt": "2024-12-10T06:13:41Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Following a call from US President-elect Donald Trump for an 'immediate ceasefire' in Ukraine, the Kremlin has expressed openness to negotiations and embraced peace efforts, particularly those coming from Global South nations and BRICS partners.\n\nIn a Monday post on X, the Russian Ministry of Foreign Affairs quoted Kremlin spokesperson Dmitry Peskov, affirming that Russia welcomes Trump's statement after his meeting with Macron and Zelenskyy in Paris. The conditions for halting hostilities were previously detailed by President Putin.\n\nTrump's December 7 meeting with Ukrainian President Volodymyr Zelenskyy and French President Emmanuel Macron in Paris took place during the reopening of the Notre Dame Cathedral, famously damaged in the 2019 fire. Trump emphasized the urgent need for an immediate ceasefire, citing unnecessary loss of lives and family disruptions.\n\nThe Kremlin reiterated President Putin's receptiveness to Ukraine negotiations, highlighting peace initiatives from Global South and BRICS countries, including China, Brazil, and South Africa. Dmitry Peskov criticized Ukraine, accusing President Zelenskyy of obstructing talks with Moscow via a decree.\n\nRussia-Ukraine tensions, dating back to the 2014 annexation of Crimea, reached full-scale invasion in February 2022. Russia emphasized Ukraine's role in stalling dialogue, urging Zelenskyy to revoke bans on engagement for peace to prevail.\n\n(With inputs from agencies.)"
    },
    {
        "title": "India to work with rest of Brics countries to further ease trade",
        "description": "In recent months, economists in the Indian government had underscored the need for attracting FDI from China to boost India’s manufacturing sector.",
        "content": "India's trade with BRICS countries may be poised for a take-off as officials work to extend customs-related privileges to trust ed merchants from these nations, which would also fetch similar benefits to Indian exporters to those markets, two persons... [4697 chars]",
        "url": "https://www.livemint.com/industry/brics-trade-south-africa-tax-customs-china-pharmaceutical-electronics-engineering-goods-russia-summit-fdi-11733724036283.html",
        "image": "https://www.livemint.com/lm-img/img/2024/12/09/1600x900/3-0-12026478-chinatrade2-0_1679839520003_1733743984459.jpg",
        "publishedAt": "2024-12-09T18:30:00Z",
        "source": {
            "name": "Livemint",
            "url": "https://www.livemint.com"
        },
        "full_content": "India's trade with BRICS countries may be poised for a take-off as officials work to extend customs-related privileges to trust ed merchants from these nations, which would also fetch similar benefits to Indian exporters to those markets, two persons familiar with the matter said.\n\nWhile such a mutual recognition agreement (MRA) is already in place with Russia, the next one will be signed with South Africa, one of the two people said. “This is expected by the end of January 2025. Work has already started to sign a similar deal with Brazil,\" the person said on the condition of anonymity.\n\nThis may be followed by negotiations for a similar pact with China, India's immediate neighbour and biggest trading partner.\n\nOnce the agreements are signed, India would speed up customs clearances for so-called authorized economic operators (AEOs) from these countries, reduce inspection levels, allow deferred duty payments and quicker tax refunds for their partners in India who are not covered by India’s own AEO programme, and accept self-declaration on the origin of goods. The same benefits will be available to Indian merchants, customs brokers and logistics players involved in trade with the partner country.\n\nQueries emailed to the Central Board of Indirect Taxes and Customs (CBIC), Union finance ministry and the Chinese embassy in New Delhi seeking comments for the story remained unanswered.\n\nAlso read | India-China trade: An alarming $18 billion discrepancy\n\nExtending customs-related privileges is common in international trade to boost goods movement. The European Union operates an AEO scheme across all its member states. Countries including China, Singapore, South Korea, US and Canada have AEO programmes. In certain countries, the scheme is known by a different name, for example, as Customs Trade Partnership Against Terrorism (CTPAT) in the US. India's latest effort in this respect is essentially an integration of the AEO scheme with BRICS nations.\n\nEnhancing cooperation in trade and customs is the next logical step, explained Biswajit Dhar, distinguished professor at the Council for Social Development. The freeze in bilateral relations, which had spilled over to economic matters, has now been lifted at the political level, and overall, there could be a lot of cooperation between India and China, said Dhar. “It would also pave the way for the removal of uncertainties and a new beginning in economic ties between the two nations in 2025,\" said Dhar.\n\nIndia's traditionally strong petroleum, gems and jewellery exports fell steeply in the first half of this fiscal year, hurt by slow growth in developed countries, although pharmaceutical, electronics and engineering goods bucked the trend, commerce ministry data showed. India’s trade with BRICS nations expanded 8.3% annually to $215.3 billion in FY24, as per official data from the commerce ministry.\n\nA second person said the road is clear for negotiating a similar deal with China, a major trade partner and India’s largest source of imports. “However, work is yet to start. There are many factors to be taken into account,\" said the person. A deal with China could help Indian exporters as India has a huge trade deficit with the world's second-largest economy.\n\nAlso read | India ranks among top 10 globally for patents, trademarks, industrial designs\n\nIndia's expanding network of MRAs with countries like South Korea, Hong Kong, Taiwan, USA, UAE, Australia, and Russia, along with the ongoing negotiations with BRICS nations, marks a significant stride towards streamlined trade and enhanced global partnerships, said Saurabh Agarwal, tax partner, EY. This promises to reduce compliance burden, foster trust among trade partners, and solidify India's position as a trusted and interconnected trade hub within the BRICS bloc and internationally, said Agarwal.\n\nThe recent border disengagement with China and the bilateral meeting between Prime Minister Narendra Modi and Chinese President Xi Jinping in October on the sidelines of the 16th BRICS Summit in Russia are seen as major milestones in bilateral ties, with both nations committing to work on shared development goals.\n\nAn Indian statement on 23 October said the leaders underlined the need to progress bilateral relations from long-term perspective and explore cooperation to address developmental challenges, while China’s foreign ministry said, “Development is now the biggest shared goal of China and India.\" In recent months, economists in the Indian government had underscored the need for attracting FDI from China to boost India’s manufacturing sector.\n\nAnd read | L&T’s Algeria project derailed after BRICS ‘snub’\n\nMore MRAs would be a game changer for Indian businesses, said Abhishek Jain, Indirect Tax Head and Partner at KPMG. “They would help simplify trade processes, increase market access and trade partnerships with nations. It will better India’s position as a trusted global partner,\" said Jain."
    },
    {
        "title": "India has never been for de-dollarisation, says foreign minister S Jaishankar",
        "description": "Last week, United States President-elect Donald Trump threatened 100% tariffs on the BRICS bloc unless it abandoned efforts to reduce reliance on the dollar.",
        "content": "India has never been in favour of de-dollarisation and there is currently no proposal for a BRICS currency, External Affairs Minister S Jaishankar said on Saturday.\nHe made the remark a week after United States President-elect Donald Trump threatened... [2006 chars]",
        "url": "https://scroll.in/latest/1076558/india-has-never-been-for-de-dollarisation-says-foreign-minister-s-jaishankar",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/book/194472-jxdgdwnykz-1695807826.jpg",
        "publishedAt": "2024-12-08T06:54:00Z",
        "source": {
            "name": "Scroll.in",
            "url": "https://scroll.in"
        },
        "full_content": "India has never been in favour of de-dollarisation and there is currently no proposal for a BRICS currency, External Affairs Minister S Jaishankar said on Saturday.\n\nHe made the remark a week after United States President-elect Donald Trump threatened 100% tariffs on the BRICS bloc and its allies unless they abandon efforts to reduce reliance on the US dollar in international trade.\n\nThe BRICS group, initially comprising Brazil, Russia, India, China and South Africa, has expanded to include Iran, the United Arab Emirates, Egypt and Ethiopia.\n\nJaishankar, addressing the Doha Forum in the Qatari capital, said on Saturday that he was not sure what the trigger for Trump’s remark was. “But we’ve always said that India has never been for de-dollarisation,” he said.\n\nThe foreign minister said that all BRICS members do not share the same position on the matter. “But where India is concerned, the United States is our largest trade partner,” he said. “We have no interest in weakening the dollar at all.”\n\nJaishankar said that India had “a very solid relationship” with the first Trump administration from 2017 to 2021, but acknowledged that there were “some issues” that were mostly related to trade.\n\n“But there were a whole lot of issues on which Trump was very international, he was very forward-leaning,” the external affairs minister said.\n\nOn December 1, Trump posted on X: “The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER.” He demanded that members of the grouping commit that they would neither create a new BRICS currency, nor back any other currency to replace the United States dollar.\n\nRussia and China, both members of the BRICS grouping, have in recent months led calls for a new reserve currency . A BRICS currency proposal was discussed at last year’s summit in South Africa and the October summit in Russia’s Kazan, reported the Associated Press.\n\nAt the October BRICS summit, Russian President Vladimir Putin criticised Western nations for “weaponising” the dollar through sanctions, which he said “undermine trust in this currency and diminish its powers”.\n\n“It’s not us who refuse to use the dollar…We are forced to search for alternatives,” Putin added."
    },
    {
        "title": "'No proposal to have BRICS currency': Jaishankar reacts to Trump's 100 per cent tariff warning",
        "description": "US President-elect Donald Trump on November 30, warned the BRICS countries against making attempts to undermine US currency. He had threatened 100 per cent tariff on the member countries for such a step.",
        "content": "Follow us on Image Source : ANI MEA S Jaishankar\nExternal Affairs Minister Dr S Jaishankar on Saturday said that BRICS countries do not intend to weaken the US dollar and India has never been for de-dollarisation. His statement came in response to US... [1986 chars]",
        "url": "https://www.indiatvnews.com/news/world/jiashankar-doha-summit-dedollarisation-no-proposal-to-have-brics-currency-trump-2024-12-08-965193",
        "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/12/jiashankar-1733628732.jpg",
        "publishedAt": "2024-12-08T03:36:03Z",
        "source": {
            "name": "India TV News",
            "url": "https://www.indiatvnews.com"
        },
        "full_content": "'No proposal to have BRICS currency': Jaishankar reacts to Trump's 100 per cent tariff warning US President-elect Donald Trump on November 30, warned the BRICS countries against making attempts to undermine US currency. He had threatened a 100 per cent tariff on the member countries for such a step.\n\nDoha:\n\nExternal Affairs Minister Dr S Jaishankar on Saturday said that BRICS countries do not intend to weaken the US dollar and India has never been for de-dollarisation. His statement came in response to US President-elect Donald Trump's recent threats of imposing a 100 per cent tariff if BRICS countries went ahead with plans for a common currency.\n\nHe also clarified that the BRICS nations do not share a consensus on this matter. He said this while speaking at the Doha Forum in Qatar. He was speaking while on a panel with the Qatari PM and Foreign Affairs Minister Mohammed bin Abdulrahman and Norway’s Foreign Minister, Espen Barth Eide. Jaishankar said, “I am not exactly sure what was the trigger for it but we’ve always said that India has never been for de-dollarisation. Right now, there is no proposal to have a BRICS currency.\"\n\nNotably, MEA Jaishankar is in Doha to attend the Doha Forum at the invitation of the Qatari PM. Trump on November 30, warned BRICS countries against any move to replace the US dollar. He threatened the member countries of 100 per cent tariff imposition for such an attempt while seeking a commitment from the nine-member group that includes India, Russia, China, and Brazil.\n\nWhat did Trump say?\n\nTrump warned the BRICS countries through a social media platform Truth Social, which he owns. He said, “The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER.\"\n\n“We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs and should expect to say goodbye to selling into the wonderful U.S. Economy,” Trump warned.\n\nDonald Trump further said, “They can go find another 'sucker!' There is no chance that the BRICS will replace the US Dollar in International Trade, and any Country that tries should wave goodbye to America.\" It is worth mentioning here that at the 2023 summit in South Africa, BRICS countries committed to studying the feasibility of a new common currency. The proposal was made by Brazilian President Luiz Inacio Lula de Silva.\n\n(With inputs from agencies)"
    },
    {
        "title": "‘No Proposal For BRICS Currency’: EAM Jaishankar After Trump’s Tariff Threat",
        "description": "Jaishankar's comments came a week after Trump’s remarks. He stated that the BRICS nations do not share a uniform stance on this matter",
        "content": "‘No Proposal For BRICS Currency’: EAM Jaishankar After Trump’s Tariff Threat\nCurated By :\nNews18.com\nLast Updated: December 07, 2024, 23:30 IST\nJaishankar's comments came a week after Trump’s remarks. He stated that the BRICS nations do not share a u... [2589 chars]",
        "url": "https://www.news18.com/india/no-proposal-for-brics-currency-eam-jaishankar-after-trumps-tariff-threat-9148810.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/12/untitled-design-8-2024-12-5670177155462f6ffd43c974cf7af751-16x9.png?impolicy=website&width=1200&height=675",
        "publishedAt": "2024-12-07T18:00:42Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "‘No Proposal For BRICS Currency’: EAM Jaishankar After Trump’s Tariff Threat\n\nCurated By :\n\nNews18.com\n\nLast Updated: December 07, 2024, 23:30 IST\n\nJaishankar's comments came a week after Trump’s remarks. He stated that the BRICS nations do not share a uniform stance on this matter\n\nExternal Affairs Minister S Jaishankar speaks during a panel discussion on 'Conflict Resolution in a New Era', in Doha, Qatar. (PTI)\n\nExternal Affairs Minister S. Jaishankar on Saturday said that BRICS countries have no intention of weakening the US dollar, following recent threats from US President-elect Donald Trump, who warned of imposing a 100 per cent tariff if BRICS countries went ahead with plans for a common currency.\n\nJaishankar’s comments came a week after Trump’s remarks. He also stated that the BRICS nations do not share a uniform stance on this matter.\n\nRecommended Stories\n\n“I am not exactly sure what was the trigger for it but we’ve always said that India has never been for de-dollarisation. Right now, there is no proposal to have a BRICS currency,\" Jaishankar said at the Doha Forum in Qatar’s capital.\n\nJaishankar is in Doha to attend the Doha Forum at the invitation of Qatari Prime Minister and Minister of Foreign Affairs Mohammed bin Abdulrahman. He was speaking on a panel alongside the Qatari Prime Minister and Norway’s Foreign Minister, Espen Barth Eide.\n\nWhat did Trump say?\n\nLast week, Trump posted on his Truth Social platform, demanding a commitment from BRICS nations that they would not create a new currency or back any other currency to replace the US dollar.\n\nHe warned that failure to do so would result in “100 per cent Tariffs.\" The BRICS group includes Brazil, Russia, India, China, South Africa, and other nations.\n\n“We require a commitment… that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100 percent Tariffs,\" Trump wrote.\n\nTrump further warned that BRICS countries should “expect to say goodbye to selling into the wonderful US Economy\" if they continued with plans to move away from the US dollar.\n\nHe added, “They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in International Trade, and any Country that tries should wave goodbye to America.\"\n\nTrump remarks come after a BRICS summit in Kazan, Russia, last month, where member countries discussed enhancing non-dollar transactions and strengthening their local currencies.\n\ntop videos View all Swipe Left For Next Video View all\n\nThe BRICS coalition, which has expanded significantly since its inception in 2009, now includes countries such as Iran, Egypt, and the United Arab Emirates, representing a notable portion of the world’s economic output.\n\n(With inputs from agencies)\n\nLocation : Doha, Qatar\n\nFirst Published: December 07, 2024, 21:41 IST"
    },
    {
        "title": "Jaishankar Dismisses De-Dollarisation as India-US Ties Strengthen",
        "description": "India's External Affairs Minister S. Jaishankar addressed Trump's proposed tariffs on BRICS nations, asserting India's disinterest in undermining the US dollar. At the Doha Forum, he highlighted India's strong relationship with the Trump administration and emphasized ongoing efforts to enhance India-Qatar relations.",
        "content": "External Affairs Minister S. Jaishankar has refuted President-elect Donald Trump's threat of imposing 100 percent tariffs on BRICS nations, maintaining that India is not interested in weakening the US dollar. Speaking at the Doha Forum, Jaishankar un... [955 chars]",
        "url": "https://www.devdiscourse.com/article/international/3185721-jaishankar-dismisses-de-dollarisation-as-india-us-ties-strengthen",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_12_2024_20_17_49_9674264.jpg?width=920&format=jpeg",
        "publishedAt": "2024-12-07T14:47:56Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "External Affairs Minister S. Jaishankar has refuted President-elect Donald Trump's threat of imposing 100 percent tariffs on BRICS nations, maintaining that India is not interested in weakening the US dollar. Speaking at the Doha Forum, Jaishankar underscored the strong relationship India enjoyed with Trump's first administration, particularly noting the QUAD's revival under Trump.\n\nJaishankar acknowledged a solid and positive bilateral relationship with Trump's initial presidency, despite some trade-related issues. He remarked on Trump's international stance and reminded that it was during his tenure that the QUAD began its second chapter. Additionally, he highlighted Prime Minister Narendra Modi's personal rapport with Trump as a cornerstone of the nations' strong alliance.\n\nAmid discussions on BRICS, Jaishankar reiterated India's stance against de-dollarisation and clarified no current proposals for a BRICS currency exist. Emphasizing the US as India's largest trade partner, he assured that there is no intent to undermine the dollar. These remarks were part of his address at the Doha Forum, attended by Qatar's Foreign Minister and Norway's Foreign Minister.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Jaishankar responds to claims of Brics undermining US dollar amid Trump's 100% tariff threat",
        "description": "At a recent Brics summit in Kazan, Russia proposed \"BRICS Pay,\" a payment system akin to SWIFT and India's Unified Payments Interface (UPI). The system aims to facilitate seamless cross-border payments in native currencies like the ruble, yuan, rupee, real, and rand",
        "content": "At a recent Brics summit in Kazan, Russia proposed “BRICS Pay,” a payment system akin to SWIFT and India’s Unified Payments Interface (UPI). The system aims to facilitate seamless cross-border payments in native currencies like the ruble, yuan, rupee... [3271 chars]",
        "url": "https://www.firstpost.com/world/jaishankar-responds-to-claims-of-brics-undermining-us-dollar-amid-trumps-100-tariff-threat-13842550.html",
        "image": "https://images.firstpost.com/uploads/2024/10/S-Jaishankar-SCO-Summit-2024-Pakistan-Islamabad-2024-10-7e6c8be92ad3796a001cd6f461081c87-1200x675.jpg?im=FitAndFill=(1200,675)",
        "publishedAt": "2024-12-07T11:35:19Z",
        "source": {
            "name": "Firstpost",
            "url": "https://www.firstpost.com"
        },
        "full_content": "At a recent Brics summit in Kazan, Russia proposed “BRICS Pay,” a payment system akin to SWIFT and India’s Unified Payments Interface (UPI). The system aims to facilitate seamless cross-border payments in native currencies like the ruble, yuan, rupee, real, and rand read more\n\nIndian External Affairs Minister S Jaishankar said Brics bloc is not looking to create a rival to the US dollar. File image/Reuters\n\nBrics nations have no plans to weaken the US dollar, Indian External Affairs Minister S. Jaishankar said on Saturday (December 7).\n\n“The idea that Brics is aiming to undermine the dollar is misplaced. Our focus remains on strengthening financial cooperation, not competition,” Jaishankar stated, underscoring India’s position on the ongoing debate surrounding a proposed Brics payment system.\n\nJaishankar’s comments, delivered during an event in Doha, comes days after US President-elect Donald Trump threatened 100 per cent tariffs on countries attempting to challenge the dollar’s dominance.\n\nAdvertisement\n\nTrump’s threat\n\nTrump, on his Truth Social platform last week, accused the Brics bloc— which includes Brazil, Russia, India, China, and South Africa— of potentially supporting efforts to replace the US dollar.\n\n“We require a commitment… that they will neither create a new BRICS currency nor back any other currency to replace the mighty US dollar,” Trump warned, threatening tariffs if countries did not comply.\n\nAt a recent Brics summit in Kazan, Russia proposed “BRICS Pay,” a payment system akin to SWIFT and India’s Unified Payments Interface (UPI).\n\nThe system aims to facilitate seamless cross-border payments in native currencies like the ruble, yuan, rupee, real, and rand. While China and Russia have shown strong interest, other members, including India, appear cautious.\n\nRussia paints a different picture\n\nThe differences among the Brics countries over BRICS Pay is now more evident than ever.\n\nEarlier this week, Russian officials, reacting to Trump’s virtual threats, had taken a stance that appeared somehwat different from India’s view expressed on Saturday.\n\nMoscow signalled that Brics would press forward with its plans for a settlement system to facilitate non-dollar transactions. Russian Deputy Foreign Minister Alexander Pankin said on Friday (December 6) that the group is working on this setup.\n\n“Of course, it will continue,” Pankin said, pointing out that the project focuses on practical solutions rather than an outright challenge to the dollar.\n\nPrior to that, on December 2, Kremlin spokesperson Dmitry Peskov said that there is echoing a growing trend among countries seeking alternatives to the dollar in trade.\n\n“The dollar is beginning to lose its appeal as a reserve currency for a number of countries […] If the US uses force, as they say economic force, to compel countries to use the dollar it will further strengthen the trend of switching to national currencies (in international trade),” he said.\n\nAdvertisement\n\nWhat’s behind the contrasting stances?\n\nIndia’s assertion that it has no interest in undermining the dollar aligns with its strategic goal of maintaining its ties with the United States, a critical partner in countering China’s influence in the Indo-Pacific.\n\nJaishankar’s comments suggest a deliberate effort to distance India from any perceived confrontation with Washington.\n\nRussia’s stance, on the other hand, reflects its strained relationship with the US and an eagerness to promote alternatives to the dollar amid ongoing sanctions.\n\nWith inputs from agencies"
    },
    {
        "title": "BRICS Settlement System Moves Forward Amid U.S. Tariff Threats",
        "description": "Despite threats from U.S. President-elect Donald Trump to levy 100% tariffs, work on the BRICS settlement system will continue. Trump had urged BRICS countries to avoid supporting a currency to replace the U.S. dollar. Russian officials clarified that the system is about settlements, not a new currency.",
        "content": "Work on the BRICS settlement system will proceed unabated, despite the looming threat of 100% import duties by U.S. President-elect Donald Trump. According to Russian Deputy Foreign Minister Alexander Pankin, the proposed initiative is centered aroun... [499 chars]",
        "url": "https://www.devdiscourse.com/article/politics/3183670-brics-settlement-system-moves-forward-amid-us-tariff-threats",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_11_50_40_2945094.jpg?width=920&format=jpeg",
        "publishedAt": "2024-12-06T03:42:25Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Work on the BRICS settlement system will proceed unabated, despite the looming threat of 100% import duties by U.S. President-elect Donald Trump. According to Russian Deputy Foreign Minister Alexander Pankin, the proposed initiative is centered around creating a settlement framework, not establishing a new global currency.\n\nTrump issued warnings to BRICS nations last week, demanding they commit to refraining from supporting or developing an alternative currency to the U.S. dollar, threatening substantial tariffs otherwise.\n\nRussian sources made it clear that BRICS is focused on enhancing financial transactions, emphasizing settlement over currency creation, as Pankin underscored the continuation of this strategy.\n\n(With inputs from agencies.)"
    },
    {
        "title": "Malaysia Warns of Tariff Risks Amid BRICS Currency Moves",
        "description": "Malaysia cautioned against the U.S. imposing tariffs on BRICS countries, warning it could disrupt the global semiconductor supply chain. This comes as BRICS considers ditching the dollar for a new currency. Malaysia is keen to join BRICS but is yet to be accepted officially.",
        "content": "Malaysia has raised concerns over the potential repercussions of U.S. tariffs on BRICS nations, specifically regarding semiconductor supply chains. The move by the incoming Trump administration targets BRICS countries creating or using alternatives t... [746 chars]",
        "url": "https://www.devdiscourse.com/article/health/3182299-malaysia-warns-of-tariff-risks-amid-brics-currency-moves",
        "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/02_01_2024_15_20_12_980275.jpg?width=920&format=jpeg",
        "publishedAt": "2024-12-05T05:18:26Z",
        "source": {
            "name": "Devdiscourse",
            "url": "https://www.devdiscourse.com"
        },
        "full_content": "Malaysia has raised concerns over the potential repercussions of U.S. tariffs on BRICS nations, specifically regarding semiconductor supply chains. The move by the incoming Trump administration targets BRICS countries creating or using alternatives to the U.S. dollar, a decision Malaysia warns could lead to global repercussions.\n\nThe nation has applied to join the BRICS bloc, which seeks to challenge Western economic dominance. However, it is yet to be formally included. Trade Minister Tengku Zafrul Aziz emphasized Malaysia's economic ties with the U.S., its third-largest trade partner and a key investor in Malaysia's semiconductor industry.\n\nWhile discussions among BRICS members about moving away from traditional trade currencies, such as the U.S. dollar, continue, no official de-dollarisation decision has been made. Russia recently commented that forced dollar transactions by the U.S. could inadvertently bolster BRICS' shift towards national currencies.\n\n(With inputs from agencies.)"
    },
    {
        "title": "India Manages US Trade And BRICS Currency Dispute Despite Tariff Threats - News18",
        "description": "Whether BRICS succeeds in challenging the dollar’s dominance remains uncertain, but one thing is clear -- India will chart its own path, guided by pragmatism and strategic foresight",
        "content": "Opinion | India Manages US Trade And BRICS Currency Dispute Despite Tariff Threats\nWritten By :\nNews18.com\nLast Updated: December 04, 2024, 09:54 IST\nWhether BRICS succeeds in challenging the dollar’s dominance remains uncertain, but one thing is cle... [7393 chars]",
        "url": "https://www.news18.com/opinion/opinion-india-manages-us-trade-brics-currency-dispute-despite-tariff-threats-9143455.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/fotojet-34-2024-09-1856437e0a6921329697d19afbe6a71c-16x9.jpg?impolicy=website&width=1200&height=675",
        "publishedAt": "2024-12-04T04:24:54Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "Opinion | India Manages US Trade And BRICS Currency Dispute Despite Tariff Threats\n\nWritten By :\n\nNews18.com\n\nLast Updated: December 04, 2024, 09:54 IST\n\nWhether BRICS succeeds in challenging the dollar’s dominance remains uncertain, but one thing is clear -- India will chart its own path, guided by pragmatism and strategic foresight\n\nPM Modi with former US President Donald Trump. (AP File)\n\nAs Donald Trump prepares to return to the White House in January 2025, his stance on alternative and global economics is already sending shockwaves worldwide. One of his trendiest and boldest declarations is the threat of imposing 100% tariffs on BRICS nations, including India, which continues to pursue a common BRICS currency to challenge the dominance of the US dollar. The notion of de-dollarisation, long discussed within BRICS, presents a significant geopolitical shift, and Trump’s aggressive response underscores the stakes.\n\nFor India, the situation is complex. On the one hand, the USA has shown activity in reducing reliance on the US dollar in global trade. On the other, it faces a difficult reality – the United States is now India’s biggest trading partner, with bilateral trade exceeding $120 billion in FY24. This economic interdependence complicates India’s position as it weighs its preferences amid rising global tensions.\n\nRecommended Stories\n\nTrump, known for his protectionist policies during his first presidency, is doubling down on his “America First\" rhetoric. In a recent post on Truth Social, Trump warned BRICS countries against introducing a common currency, declaring they would face severe economic repercussions, including 100% tariffs on their exports to the US.\n\nTrump said, “The idea that the BRICS countries are trying to die off while we watch and use the dollar is over…They can go find another sucker. There is no chance that the BRICS will replace the US dollar in global trade.\"\n\nThis sharp warning comes after BRICS members met in Kazan, Russia, in October to explore alternatives to the dollar. While many member countries are frustrated by the US’s economic hegemony, a cohesive approach to implementing a common currency remains elusive.\n\nIndia, a key member of BRICS, has taken a cautious approach towards the bloc’s proposed currency. External Affairs Minister S Jaishankar recently emphasised the complexity of establishing a unified BRICS currency, citing the lack of fiscal, monetary, and political alignment among member states.\n\n“From time to time, people have raised that there needs to be a BRICS currency, but remember, for countries to have a common currency, you need a huge alignment of the very fundamentals of fiscal policies, economic policies, monetary policies, or even political policies,\" Jaishankar explained.\n\nIndia has legitimate reasons for hesitating. First, its economic growth trajectory and trade relationships do not necessitate a drastic pivot towards a BRICS currency. The US dollar plays an integral role in India’s trade and financial transactions, and the USA has been reluctant to jeopardise profitable trade agreements with the West by endorsing a currency viewed as a direct challenge to the dollar.\n\nSecond, India remains wary of China’s influence within BRICS. A common BRICS currency could allow Beijing to further its geopolitical and economic ambitions, potentially at the cost of other member nations. New Delhi is particularly cautious about aligning too closely with policies that could deepen Chinese dominance in the bloc.\n\nIndia’s trade relationship with the US has grown significantly, encompassing crucial sectors such as pharmaceuticals, IT services, and textiles. A 100% tariff on Indian exports, as threatened by Trump, would dramatically increase costs for Indian companies and render their products less competitive in the US market.\n\nSuch a move could disproportionately affect small and medium-sized enterprises (SMEs) that rely on exports to the US, creating ripple effects throughout India’s economy. Moreover, higher tariffs could weaken India’s position as a global trade leader and slow down its export-driven growth.\n\nIndia has also been diversifying its export portfolio to reduce overdependence on any single market. However, the sheer scale of its economic partnership with the US makes it unlikely that India would risk alienating Washington over a BRICS currency initiative.\n\nTrump’s tariff threats signal a broader challenge to the global financial order. For BRICS nations, including India, the pursuit of a common currency reflects their frustration with the US’s dominance in the global financial system. Many emerging economies have long called for alternatives to the dollar, citing its outsized influence on global affairs and the risks of being overly exposed to US policies.\n\nHowever, the implementation of a BRICS currency is fraught with challenges. Economic disparities among BRICS nations, coupled with differing political priorities and governance structures, make a unified currency unlikely in the near term.\n\nEven within BRICS, there is little consensus on how to approach de-dollarisation. While Russia and China have pushed for increased use of their currencies in bilateral trade, other members, such as India, have opted for a more measured approach. This divergence highlights the inherent difficulties of aligning monetary approaches across diverse nations.\n\nIndia’s cautious stance on the BRICS currency notion underscores its desire to maintain a balanced foreign policy. While India supports de-dollarisation in principle, it acknowledges the risks of alienating the US, its most significant trading partner.\n\nNew Delhi’s strategy reflects its broader approach to strategic autonomy. By advocating for greater use of local currencies in bilateral trade, India aims to minimise dependence on the dollar without provoking a confrontation with Washington. This pragmatic approach allows India to navigate the complex geopolitical landscape while safeguarding its economic interests.\n\nAt the same time, India is mindful of the growing anti-dollar sentiment among emerging economies. By participating in discussions on alternatives to the dollar, India can position itself as a leader in shaping the future of global affairs without committing to drastic changes that could undermine its stability.\n\nIndia stands at a crucial juncture as it navigates Trump’s tariff threats and the ongoing BRICS currency debate. While the prospect of a common BRICS currency may appeal to countries frustrated with US dominance, India’s economic priorities and strategic interests compel it to adopt a cautious approach.\n\nAs the world’s largest democracy and a rapidly developing economy, India is uniquely positioned to influence the future of international trade. However, this influence will depend on its ability to balance competing interests, from deepening ties with the US to supporting initiatives that reduce reliance on the dollar.\n\ntop videos View all Swipe Left For Next Video View all\n\nIn the face of Trump’s protectionist rhetoric, India’s measured response reflects its commitment to maintaining economic stability while pursuing its long-term vision of a multipolar world order. Whether BRICS succeeds in challenging the dollar’s dominance remains uncertain, but one thing is clear: India will chart its own path, guided by pragmatism and strategic foresight.\n\nThe writer is an Indian technocrat, political analyst, and author. His social media handle is @prosenjitnth. Views expressed in the above piece are personal and solely those of the author. They do not necessarily reflect News18’s views.\n\nFirst Published: December 03, 2024, 17:03 IST"
    },
    {
        "title": "Ready, set, tariff: Donald Trump’s bargaining chip and Delhi’s chance to reshape bilateral trade",
        "description": "India had trouble resolving trade disputes with the US during Trump’s first term. Now, with BRICS countries being at the receiving end of the President-elect's tariff threats, India must prepare for fresh challenges",
        "content": "US President-elect Donald Trump’s recent threat to impose 100 per cent tariffs on imports from BRICS nations —if they create an alternative to the US dollar — highlights a powerful new impulse in Washington: Leveraging tariffs for various economic an... [6972 chars]",
        "url": "https://indianexpress.com/article/opinion/columns/ready-set-tariff-donald-trumps-bargaining-chip-and-delhis-chance-to-reshape-bilateral-trade-9705011/",
        "image": "https://images.indianexpress.com/2024/12/Opinion3_4th-Dec.jpg",
        "publishedAt": "2024-12-03T22:50:08Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        },
        "full_content": "US President-elect Donald Trump’s recent threat to impose 100 per cent tariffs on imports from BRICS nations —if they create an alternative to the US dollar — highlights a powerful new impulse in Washington: Leveraging tariffs for various economic and political purposes. While defending the dollar’s status as the global reserve currency is one aspect, Trump and his team have broader ambitions to overhaul the global economic order using tariffs as their primary tool.\n\nDelhi must prepare for fundamental changes in the international trading and financial system in the second term of President Trump. The commerce ministry is reportedly reviewing India’s trade with the US and developing strategies to address the incoming Trump Administration’s economic policies.\n\nStory continues below this ad\n\nOn BRICS and the discussion of “de-dollarisation”, Trump is making preemptive threats against a move that is yet to materialise. His trademark aggressive stance essentially tells the BRICS countries, “Don’t even think about it.” Sceptics have long maintained that BRICS’ rhetoric about de-dollarisation exceeds its actual financial capabilities and their commitment to collective action.\n\nThe BRICS nations lack unity in their goal to reduce the dollar’s dominance in the global financial system. Although Delhi may echo Sino-Russian rhetoric about building a new global economic order, the realists in the government recognise its vital economic interests are tied to Washington. After all, the US remains India’s most important economic and technological partner.\n\nDelhi’s primary concern should not be Trump’s threats against a hypothetical BRICS currency, but rather his determination to reshape the global economic system. Despite its rhetoric, BRICS neither had nor is likely to gain the ability to restructure the global economic order. The US, however, possesses the financial clout to force major systemic changes — as demonstrated when Washington modified the nuclear nonproliferation order for India during 2005–08. Trump brings both longstanding conviction and strong political will to transform the international trading system.\n\nStory continues below this ad\n\nThough Trump entered politics only in 2016, he has consistently opposed free trade agreements that he believed undermined American economic interests while benefiting both allies and adversaries. He criticised Japan’s growing trade deficits in the 1980s, opposed NAFTA in the 1990s, and challenged China’s trade practices in the 2000s.\n\nDuring his first term (2017–21), Trump immediately withdrew from the Pacific Free Trade talks, renegotiated NAFTA, and imposed substantial tariffs on China, Canada, and the European Union. While reaching settlements with Europe and Canada, he maintained tariffs against China. President Joe Biden, after taking office in January 2021, continued these China tariffs, reflecting Washington’s new consensus on Beijing’s commercial challenges. Biden also maintained Trump’s policies that weakened the World Trade Organisation.\n\nTrump has successfully reoriented US trade policy and intends to pursue this direction vigorously in his second term. During his 2024 presidential campaign, he called tariffs the “most beautiful word” in English — after only “faith” and “love”— and pledged to impose 60 per cent tariffs on Chinese imports and 20 per cent on all others.\n\nHis post-election cabinet appointments confirm his commitment to wielding tariffs as a powerful policy instrument. Scott Bessent, his Treasury Secretary nominee, recently outlined how tariffs can achieve various objectives beyond reducing trade deficits.\n\nBessent argued, “Tariffs are also a useful tool for achieving the president’s foreign policy objectives. Whether it is getting allies to spend more on their own defence, opening foreign markets to US exports, securing cooperation on ending illegal immigration and interdicting fentanyl trafficking, or deterring military aggression, tariffs can play a central role.” According to Bessent, America’s position as the world’s largest importer — and thus the most crucial market for other countries’ exports — underlies this expansive use of tariffs. “Our size gives us market power and the ability to dictate terms. Other countries need us more than we need them. We have to but use that power.” This suggests that in Trump’s second term, the US might deploy tariffs like sanctions to influence both allies’ and adversaries’ policies.\n\nBessent dismisses concerns that higher tariffs will fuel inflation and increase consumer costs. He maintains that strategic tariff use can boost treasury revenue, strengthen domestic production, and reduce dependence on industrial products from rivals like China. Drawing on Alexander Hamilton, America’s first Treasury Secretary and architect of its industrialisation, Bessent challenges conventional wisdom against using tariffs for economic or foreign policy goals.\n\nHow might America’s trade partners respond? Europe, which maintains a substantial trade surplus with the US, and which Trump has called “more dangerous than China”, has discussed retaliatory tariffs. However, European Central Bank President Christine Lagarde has advised against retaliation, suggesting instead negotiations with Trump and increased US purchases to reduce the trade deficit.\n\nAlso Read | Donald Trump hints at tariffs on steel imports that could impact Indian exports\n\nTrump recently threatened Mexico and Canada with 25 per cent tariffs unless they curbed cross-border drug and migrant flows. Notably, America’s two largest trading partners responded with offers to negotiate rather than confront the incoming US government.\n\nIndia, which had trouble resolving the trade disputes with the US during Trump’s first term, must reassess its commercial engagement with America. This requires understanding the transformed global trade landscape while emphasising reciprocity and mutual benefit in dealings with Trump. As External Affairs Minister S Jaishankar put it in his address to a business summit in Delhi on Monday, “A lot of what lies ahead would be in fashioning terms of engagement (with the US) that are perceived as mutually beneficial. And in that regard, the more that India can bring to the table, the stronger our appeal.”\n\nDelhi is acutely conscious that Trump’s trade policies combine negotiation with pressure. Bessent describes tariffs as Trump’s “loaded gun” on the negotiating table — a threat that might remain unused. Significantly, Bessent notes that Trump seeks to create a “fair-trade block” among allies and friends sharing common security interests and reciprocal tariff approaches. This is an objective with which India has no quarrel.\n\nWith China as Trump’s primary tariff target, India must consider how to leverage this situation through creative trade policies toward America. Under Prime Minister Narendra Modi’s watch, there have been many significant advances in Indo-US relations over the last decade. Bilateral trade, despite its growing volumes, has been one exception. President Trump’s second term presents Delhi the challenge and opportunity to transform the trade relationship with the United States.\n\nThe writer is a contributing editor on international affairs for The Indian Express"
    },
    {
        "title": "What Does Trump’s Tariff Threat To BRICS, Including India, Mean And Why It Could Backfire?",
        "description": "Since all trade is done in US dollar, the US can make it difficult for countries it blacklists to do business. However, Trump’s comments on imposing 100% tariffs on BRICS could fuel inflation in the US and higher prices for consumers",
        "content": "What Does Trump’s Tariff Threat To BRICS, Including India, Mean And Why It Could Backfire?\nCurated By :\nNews18.com\nEdited By: Shilpy Bisht\nLast Updated: December 03, 2024, 11:09 IST\nSince all trade is done in US dollar, the US can make it difficult f... [6131 chars]",
        "url": "https://www.news18.com/explainers/what-does-trumps-tariff-threat-to-brics-including-india-mean-and-why-it-could-backfire-9143277.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/donald-trump-afp-ap-photo-2024-11-c32f10090563c036ce8209052805765e-16x9.jpg?impolicy=website&width=1200&height=675",
        "publishedAt": "2024-12-03T05:39:34Z",
        "source": {
            "name": "News18",
            "url": "https://www.news18.com"
        },
        "full_content": "What Does Trump’s Tariff Threat To BRICS, Including India, Mean And Why It Could Backfire?\n\nCurated By :\n\nNews18.com Edited By: Shilpy Bisht\n\n\n\nLast Updated: December 03, 2024, 11:09 IST\n\nSince all trade is done in US dollar, the US can make it difficult for countries it blacklists to do business. However, Trump’s comments on imposing 100% tariffs on BRICS could fuel inflation in the US and higher prices for consumers\n\nReports suggest that the rise of China’s Renminbi currency in global reserves may have agitated Donald Trump, who then threated BRICS with 100% tariffs. (Photo: AP)\n\nDonald Trump threatening to slap a 100% tariff on BRICS nations, including India, if they try to replace the US dollar with another currency could backfire, according to market experts.\n\nTrump had said on social media website TruthSocial, “The idea that BRICS countries are trying to move away from the dollar, while we stand by and watch is OVER. We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful US Economy\".\n\nRecommended Stories\n\nTrump had recently threatened to impose 25% tariffs on all products from Canada and Mexico entering the US, along with an additional 10% tax on goods from China. Trump said this move would keep a check on the flow of unauthorised migrants and illicit drugs into the US.\n\nWhy Do BRICS Need An Alternative Currency?\n\nThe group of five countries – Brazil, Russia, India, China and South Africa – was formed in 2009 to focus on the interest of emerging economies and to make them less dependent on US dollar.\n\nAt an April 2023 summit of BRICS countries, Brazilian President Luiz Inacio Lula da Silva asked, “Why can’t we do trade based on our own currencies?\"\n\nIn October, Russian President Vladimir Putin called for a new international payments system at a BRICS summit, saying “the dollar is being used as a weapon,\" the Associated Press reported.\n\nAfter US sanctions, India has been buying oil from Russia without using dollar. China is too doing the same, according to a report by The Times of India.\n\nHowever, The Guardian noted that the move to de-dollarise the world economy unnerves some BRICS members like Brazil and India “that do not want their rapidly expanding club to become solely pro-Chinese and anti-western.\"\n\nThe alternative currency for BRICS has not yet taken shape because of structural challenges in member countries, including a lack of robust central banks and monetary policies.\n\nReports suggest the increase of China’s Renminbi currency three times from 1% to 3% in global reserves could be a primary reason for Trump’s outburst.\n\nHow Powerful Is US Dollar\n\nDollar is the currency of choice for international trade since the end of World War II, before which UK pound was the most in use. Countries use dollars to hold foreign exchange reserves and for global trade and transactions.\n\nCommodities like oil are bought and sold using US dollar. Major economies like Saudi Arabia still peg their currencies to the dollar.\n\nThe US treasury by far remains the world’s largest and most liquid bond market. Central banks often hold currency in the form of government bonds, such as the US treasuries.\n\nSince all trade is done in US dollar, even trade among other countries, the US can make it difficult for those it blacklists to do business.\n\nIn the wake of Russian invasion of Ukraine in 2022, the US cut Russia off from the dollar, freezing $300 billion in Russian central bank assets and triggering a default on the country’s sovereign debt.\n\nThe dollar accounted for about 88% of all trades in the $7.5 trillion-a-day foreign exchange market, based on the latest triennial survey from the Bank for International Settlements published in 2022. While BRICS members control more than 40% of central-bank reserves globally, as mentioned in a report published by Bloomberg.\n\nAlthough US dollar may not be overtaken as the world’s leading reserve currency, it could share influence with other currencies in time to come.\n\nWhy Trump’s Tariff Move Could Backfire\n\nExperts say although dollar dominance set to continue for the foreseeable future, but other nations’ idea of setting up their own currency is “hot air\". Trump’s comments on tariffs may actually increase the likelihood of other countries looking for ways to avoid the US dollar.\n\n“The dollar remains dominant for several reasons: the USD is the most liquid currency in the world, trades freely, it is also the lending currency of the world,\" said Rodrigo Catril, a strategist at National Australia Bank Ltd. in Sydney, as quoted by Bloomberg. “If Trump increases the pressure on BRICS, it may well accelerate a move away from the dollar\".\n\nAccording to a trade expert, Mark Weinstock, professor of economics at Pace University, quoted by CBS News, “Economically, it’s not a major issue because the idea of the BRICS countries being able to put together an alternative as a reserve currency for the US dollar is not plausible in the short or intermediate term\".\n\nFormer Reserve Bank of India (RBI) governor D Subbarao told PTI, “Donald Trump has threatened to slap 100% tariffs on imports from countries that try to move out of the dollar. His ire was particularly directed at the BRICS bloc which has been actively talking about developing an alternative to the dollar. Trump is known to bark more than he bites… It’s not clear to what extent he will carry out his threat. What yardstick will America use to determine if a country has moved out of the dollar? And does American law permit imposing sanctions on countries merely because they are de-dollarising?\"\n\ntop videos View all Swipe Left For Next Video View all\n\nSubbarao explained that a large portion of Chinese loans under the Belt and Road Initiative (BRI) are denominated in RMB. In contrast, India’s share in global trade is low. India still needs investment in hard currencies, particularly the USD. India has a long way to go before the rupee can become international, he opined.\n\nThe US, which imports coffee from Brazil, electronics and clothes from China, minerals from South Africa, could see the cost of goods from BRICS member nations soar and potentially fuel inflation and higher prices for consumers.\n\nFirst Published: December 03, 2024, 11:02 IST"
    },
    {
        "title": "Trump's rhetoric against BRICS currency doesn't worry India. US President-elect, Modi are on same page",
        "description": "Trump's threat to impose 100% tariff on BRICS nations won't worry Indian policymakers, given that it has consistently denied any interest in replacement of US dollar as global currency.",
        "content": "External Affairs Minister S. Jaishankar, last month during his visit to the US, made it clear that New Delhi has “never actively targeted the US dollar,” emphasising that it is not a part of India’s “economic policy, political or strategic policy”.\nT... [6047 chars]",
        "url": "https://theprint.in/diplomacy/trumps-rhetoric-against-brics-currency-doesnt-worry-india-us-president-elect-modi-are-on-same-page/2384751/",
        "image": "https://static.theprint.in/wp-content/uploads/2020/04/Modi-Trump.jpg",
        "publishedAt": "2024-12-03T05:12:57Z",
        "source": {
            "name": "ThePrint",
            "url": "https://theprint.in"
        },
        "full_content": "External Affairs Minister S. Jaishankar, last month during his visit to the US, made it clear that New Delhi has “never actively targeted the US dollar,” emphasising that it is not a part of India’s “economic policy, political or strategic policy”.\n\nThe loudest support for a BRICS common currency or a move away from the US dollar as the global currency for trade has primarily been from Moscow, as a part of its efforts to circumvent the Western dominated global architecture, including the international financial system, explained Harsh V. Pant, the Vice President of Studies and Foreign Policy at the Observer Research Foundation (ORF), to ThePrint.\n\nNew Delhi: US President-elect Donald J. Trump’s broadside against the BRICS grouping over the “de-dollarisation” rhetoric, would surprisingly find purchase in New Delhi, given that India has consistently dismissed the replacement of the dollar as a global reserve currency.\n\n“We often have trade partners who do not have dollars to trade. So we now have to look at whether we forgo dealings with them or do we find some settlement which works otherwise. So there’s no, I can say, malicious intent vis-a-vis the dollar in doing this. We’re trying to do our business,” Jaishankar said at the Carnegie Endowment in October.\n\nTrump had slammed the BRICS for attempting to trade in local currencies, promising to impose 100 percent tariffs if its member nations continue to “move away from the dollar”.\n\nHis comments indicate a certain insecurity amongst American leaders as the global reserves of the US dollar held by central banks has steadily declined in the last 25 years, especially with the introduction of the Euro by the European Union and the recent push for settlements of trade in local currencies by developing countries, including India.\n\nIn 1999, around 71 percent of the assets of central banks across the world were in US dollars, which has fallen to about 58 percent in the second quarter of 2024, according to data from the International Monetary Fund (IMF). The Euro has grown to about 20 percent of all reserves held by central banks across the world in the same period.\n\n“For India, there is no rational economic, political or strategic reason to de-dollarise. We are strategic partners of the US, are comfortable with the use of the dollar, and have benefitted from it,” Pant told ThePrint.\n\nAlso Read: What Trump’s ‘100% tariff’ threat means for BRICS nations & India’s stance on de-dollarisation\n\nWhy has de-dollarisation rhetoric come into focus?\n\nA number of countries, especially Russia and China, have faced the US’ ire in recent years, that include actions including freezing Moscow’s dollar held assets and seeing the country kicked out of Society for Worldwide Interbank Financial Telecommunication (SWIFT) network due to its war with Ukraine.\n\nNearly 50 percent of Moscow’s central bank assets–roughly $300 billion–was frozen after Russian troops entered Ukraine in February 2022. Around $207 billion was held in euro assets, $67 billion in US dollar assets and $37 billion in UK pound sterling assets. Another member of BRICS, Iran, has also faced difficulties from the international financial system given the numerous sanctions it has faced over its nuclear programme.\n\nChina has slowly been insulating itself from potential economic actions by the US–as seen in the case with Moscow–by promoting the use of local currency settlements (mostly in the renminbi yuan) with certain countries, especially in the developing world, foreign policy analyst Swasti Rao explained to ThePrint.\n\n“If you look at China, it has taken steps to safeguard itself from potential sanctions by the US in the future. Countries feel safer using other currencies because of the weaponisation of the dollar in recent years,” added Rao.\n\nHowever, the usage of local currencies does not indicate a willingness for a new BRICS currency from even Beijing. The renminbi is only the seventh most held currency in the world, far below the Japanese Yen, the UK Pound Sterling, Australian dollar, and even the Canadian dollar.\n\n“The dominance of China and Russia in BRICS has led to conversations such as de-dollarisation. But the likely beneficiary of a weakening acceptance of the dollar globally would be Beijing and that is not in India’s interests,” Pant said.\n\nThe ascendance of Chinese yuan\n\nChina has not loudly backed the idea to target the US-led financial systems given that both America and the European Union remain some of its most important trading partners. There is little chance for a new BRICS currency, according to Rao, but there might be alternative architectures slowly developed if sanctions are further applied.\n\nThe recent BRICS declaration from Kazan, Russia, saw no mention of a new currency, but rather a deep concern over “unilateral coercive measures, including illegal sanctions” on the global economy. Russia has faced the brunt of economic sanctions, specifically those targeting its reserves of US dollars or dollar backed assets both in North America and the European Union.\n\n“From a political perspective there is a logical argument for trade in local currencies. Why should the US hold the purse strings over my bilateral trade? However, for India there are already cases where trade is settled in local currencies. This does not mean that India is in support of broader de-dollarisation,” explained Rao.\n\nSince the war with Ukraine, trade between India and Russia has expanded greatly, especially as New Delhi benefited from cheaper oil purchases from Moscow, which crossed $50 billion in the financial year 2023-24.\n\nThe settlement of payments for the purchase of Russian oil has primarily been in Indian rupees, but companies have also used the Chinese yuan and the UAE dirhams in some instances, as reported by ThePrint last year. All of this is due to the inaccessibility of the Russian economic system from the dollar market.\n\n“Broader de-dollarisation does not make strategic sense for India. It is based on targeting the US and the only beneficiary from such a move would be China. India is not inclined to support the ascendance of the Chinese yuan as a reserve for global trade,” said Pant.\n\n(Edited by Tony Rai)\n\nAlso Read: US President Joe Biden’s pardon ends son Hunter’s legal problems of gun and tax evasion charges"
    },
    {
        "title": "DC Edit | Trump’s Brics threat is premature",
        "description": "US President-elect Donald Trump’s threat to levy 100 per cent duty on imports from Brics+ nations, if they chose to float an alternative global reserve currency to the US dollar, is premature and...",
        "content": "US President-elect Donald Trump’s threat to levy 100 per cent duty on imports from Brics+ nations, if they chose to float an alternative global reserve currency to the US dollar, is premature and does not take into account ground realities.\nThe dolla... [1548 chars]",
        "url": "https://www.deccanchronicle.com/opinion/dc-comment/dc-edit-trumps-brics-threat-is-premature-1843489",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/29/1857361-trump.jpg",
        "publishedAt": "2024-12-02T20:25:00Z",
        "source": {
            "name": "Deccan Chronicle",
            "url": "https://www.deccanchronicle.com"
        },
        "full_content": "US President-elect Donald Trump’s threat to levy 100 per cent duty on imports from Brics+ nations, if they chose to float an alternative global reserve currency to the US dollar, is premature and does not take into account ground realities.\n\nThe dollar is still the most widely used currency in the world. Eighty eight per cent of foreign exchange transactions take place in the dollar, 58 per cent of foreign currency reserves are held in the dollar, and 54 per cent of exports are paid in dollars. The Brics+ group’s share of global merchandise exports stood at 23.3 per cent in 2023, which is still less than the G7’s share of 28.9 per cent. Nearly 65 per cent global corporate funding happens in the dollar.\n\nThough the attempt of Brics+ to launch a reserve currency as an alternative to the dollar is seen as the most serious threat to dollar hegemony after the launch of the Eurozone’s single currency in 1999, the dollar is unlikely to be dislodged from its prime position any time soon.\n\nThe internal disagreements in Brics+ bloc are also likely to pose a serious challenge to the de-dollarisation project as no one, especially India, would like to subscribe to a China-led finance order. At the most, these countries could diversify trade settlements and reserves by promoting local currency and gold to avoid a situation that Russia landed in after its war against Ukraine.\n\nEven if Brics+ does launch its common reserve currency, Mr Trump cannot impose 100 per cent duty because Brics holds 37 per cent of global GDP. If Mr Trump makes good on his threat, it will upend the American economy by shooting up its prices of most of the products that US citizens use. A higher inflation as a consequence would to lead to a fall in the US dollar value, hastening the de-dollarisation of the world."
    },
    {
        "title": "India ‘takes note’ of new payment system proposed at BRICS summit, keeps non-committal stance",
        "description": "Days after US President-elect Trump’s warning to BRICS against de-dollarisation, India’s Finance Ministry responds in Parliament",
        "content": "The Union Finance Ministry provided a cautious and non-committal response to a question in Parliament regarding India’s stance on a potential joint currency for BRICS nations. This comes amid recent threats from US President-elect Donald Trump to imp... [2720 chars]",
        "url": "https://www.theweek.in/news/india/2024/12/03/india-finance-ministry-parliament-response-new-brics-currency-payment-system.html",
        "image": "https://www.theweek.in/content/dam/week/week/news/india/images/2024/12/3/brics-leaders-2024.jpg",
        "publishedAt": "2024-12-02T18:30:00Z",
        "source": {
            "name": "THE WEEK",
            "url": "https://www.theweek.in"
        },
        "full_content": "The Union Finance Ministry provided a cautious and non-committal response to a question in Parliament regarding India’s stance on a potential joint currency for BRICS nations. This comes amid recent threats from US President-elect Donald Trump to impose 100 per cent tariffs on BRICS nations if they attempt to establish a currency to rival the US dollar.\n\n\n\n“We require a commitment from these countries that they will neither create a new BRICS currency nor back any other currency to replace the mighty US dollar, or they will face 100 per cent tariffs and should expect to say goodbye to selling into the wonderful US economy,” Trump had posted on Truth Social earlier this week.\n\nThe BRICS bloc—comprising Brazil, Russia, India, China, and later South Africa (which joined in 2010)—was initially formed in 2006 to enhance economic and political collaboration among emerging economies. Over time, additional nations like Iran, Egypt, Ethiopia, and the United Arab Emirates have also become part of BRICS.\n\nSignificantly, the 16th BRICS Summit, held at Kazan in Russia from October 22 to 24, 2024, highlighted the importance of enhancing economic cooperation among member nations to reduce reliance on the West.\n\nIndia’s answer to the BRICS Bridge\n\nRussia urged members to take concrete steps toward establishing the “BRICS Bridge,” a proposed international payments system. This initiative was proposed as an alternative to the dollar-based trading system and a sanctions-resistant payments network—leveraging central bank-issued digital currencies backed by fiat currencies.\n\nThe query about India’s position on the BRICS currency initiative was raised by Congress MP M.K. Raghavan from Kerala through an unstarred question in Parliament.\n\nIn response, Minister of State for Finance Pankaj Chaudhary referenced a report titled BRICS Chairmanship Research on the Improvement of the International Monetary and Financial System, prepared under Russia’s BRICS chairmanship. The report explores various aspects of the current monetary system and possible alternatives, including cross-border payments, investments, sovereign reserves, development mechanisms, and the Global Financial Safety Net.\n\nIt also discusses how existing technologies could be leveraged to develop an alternative currency.\n\nHowever, the minister avoided taking a definitive stance, stating only that the report had been “taken note of” by BRICS Finance Ministers, Central Bank Governors, and Leaders. The response left India’s position on the matter ambiguous.\n\nChaudhary also outlined India’s involvement with the BRICS New Development Bank (NDB). India has contributed USD 2.0 billion to the NDB, paid in seven installments from FY 2015–16 to 2021–22.\n\nThere are about 20 ongoing externally aided projects in India, lifted by a USD 4.87 billion loan from the NDB. These projects span sectors such as infrastructure, water conservation, water supply, flood area management, and rural connectivity improvement."
    }
]