[
    {
        "title": "China-India relations are changing amid Trump's return",
        "description": "HONG KONG — Weeks before he returned to the White House on Jan. 20, United States President Donald Trump issued a pointed warning to the Brics countries. 'Go find another sucker,' he wrote on his social media platform Truth Social, threatening the group's nine members with 100-percent tariffs should they attempt to challenge the dollar's global dominance.",
        "content": "HONG KONG — Weeks before he returned to the White House on Jan. 20, United States President Donald Trump issued a pointed warning to the Brics countries. \"Go find another sucker,\" he wrote on his social media platform Truth Social, threatening the gr... [565 chars]",
        "url": "https://www.manilatimes.net/2025/01/23/opinion/world/china-india-relations-are-changing-amid-trumps-return/2042812",
        "image": "https://www.manilatimes.net/manilatimes/uploads/images/2025/01/22/521372.jpg",
        "publishedAt": "2025-01-22T16:06:00Z",
        "source": {
            "name": "The Manila Times",
            "url": "https://www.manilatimes.net"
        },
        "full_content": "HONG KONG — Weeks before he returned to the White House on Jan. 20, United States President Donald Trump issued a pointed warning to the Brics countries. \"Go find another sucker,\" he wrote on his social media platform Truth Social, threatening the group's nine members with 100-percent tariffs should they attempt to challenge the dollar's global dominance.\n\nTrump's warning came on the heels of his campaign promise to impose a 25-percent tariff on imported goods from Canada and Mexico on his first day in office. China, the primary target of Trump's protectionism, is expected to face an additional 10 percent tariff. While this is hardly surprising, given the escalating trade war between China and the US, Trump has also directed his ire at India, a founding member of the Brics and one of America's key allies."
    },
    {
        "title": "FACT CHECK: Post falsely claims 159 countries adopted BRICS Pay system",
        "description": "The post is referring to 159 participants — not countries — linked to Moscow’s bank transfer system, not the alternative payment system proposed by the BRICS member countries",
        "content": "This is AI generated summarization, which may have errors. For context, always refer to the full article.\nThe post is referring to 159 participants — not countries — linked to Moscow’s bank transfer system, not the alternative payment system proposed... [3496 chars]",
        "url": "https://www.rappler.com/newsbreak/fact-check/brics-payment-system-not-adopted-159-countries/",
        "image": "https://www.rappler.com/tachyon/2025/01/fact-check-brics-pay-carousel.jpg",
        "publishedAt": "2025-01-14T04:00:00Z",
        "source": {
            "name": "Rappler",
            "url": "https://www.rappler.com"
        },
        "full_content": "This is AI generated summarization, which may have errors. For context, always refer to the full article.\n\nThe post is referring to 159 participants — not countries — linked to Moscow’s bank transfer system, not the alternative payment system proposed by the BRICS member countries\n\nClaim: 159 countries have signed up to use a payment system developed by the BRICS member countries that enables cross-border transactions using their national currencies.\n\nRating: FALSE\n\nWhy we fact-checked this: The TikTok video containing the claim has 827,800 views, 55,500 likes, 4,413 shares, and 7,423 comments as of writing.\n\nText in the video states: “BREAKING: 159 out of 193 countries have signed up to use the new BRICS settlement system. [The] US and European Union will no longer be able to use economic sanctions as [weapons].”\n\nThe video seems to be referring to BRICS Pay, a payment system proposed by the BRICS countries (Brazil, Russia, India, China and South Africa) to enable trade using their own currencies. This move is in response to what BRICS sees as unfair sanctions restricting countries like Russia and Iran from using global financial systems dominated by the US dollar.\n\nThe facts: The 159 figure refers to institutions — not countries — connected to Russia’s System for Transfer of Financial Messages (SPFS), not BRICS Pay.\n\nThe false claim originated from an incorrect report by Russia Today (RT), which misquoted a Russian official’s statement and falsely stated that 159 countries would adopt the BRICS payment system. The official said that 159 “participants” had adopted the SPFS, which Russia uses as an alternative to the SWIFT interbank payments system.\n\nDespite RT issuing an apology and removing the report in August 2024, the false information continues to circulate, with several articles still perpetuating the claim. AFP Fact Check has also published an article debunking the false claim.\n\nFinancial systems: After Russia’s 2014 annexation of Crimea triggered the threat of expulsion from SWIFT, Moscow created SPFS as an alternative system to avoid being completely cut off from global financial transactions.\n\nIn 2022, the European Union (EU) and its allies suspended several Russian banks from the SWIFT system due to Russia’s invasion of Ukraine, disrupting Russia’s ability to transfer funds across borders seamlessly.\n\nMeanwhile, the members of BRICS proposed the creation of its own payment system, BRICS Pay, which would allow members to make and receive payments in their own currencies, making cross-border payments more efficient. However, there are concerns that BRICS Pay would allow participants to “circumvent USD as a payment intermediary by replacing it with blockchain technology and an alternative to the SWIFT financial payment system,” according to an analyst from the think tank American Action Forum.\n\nBRICS Pay is currently still a proposal, with no confirmed timeline for when it will be operational.\n\nEvading sanctions: Russia and other countries are exploring alternative cross-border financial instruments to reduce reliance on Western financial systems and potentially circumvent economic sanctions by the US and EU.\n\nHowever, David Asher, a Hudson Institute senior fellow, said in a VOA report that such an alternative payment system can still be subject to sanctions. – Marjuice Destinado/Rappler.com\n\nMarjuice Destinado is a Rappler intern. She is a third-year political science student at Cebu Normal University (CNU), serving as feature editor of Ang Suga, CNU’s official student publication.\n\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
    },
    {
        "title": "Indonesia welcomes its entry into BRICS bloc",
        "description": "Jakarta, Indonesia—Indonesia welcomed on Tuesday Brazil's announcement that it had become a full member of BRICS, a bloc of developing economies",
        "content": "Jakarta, Indonesia—Indonesia welcomed on Tuesday Brazil’s announcement that it had become a full member of BRICS, a bloc of developing economies increasingly seen as a counterweight to the West.\nThe Brazilian foreign ministry said in a statement on M... [2068 chars]",
        "url": "https://manilastandard.net/news/314544113/indonesia-welcomes-its-entry-into-brics-bloc.html",
        "image": "https://cdn.manilastandard.net/wp-content/uploads/2025/01/indonesia-flag-scaled.jpg",
        "publishedAt": "2025-01-07T04:35:00Z",
        "source": {
            "name": "manilastandard.net",
            "url": "https://manilastandard.net"
        },
        "full_content": "Jakarta, Indonesia—Indonesia welcomed on Tuesday Brazil’s announcement that it had become a full member of BRICS, a bloc of developing economies increasingly seen as a counterweight to the West.\n\nThe Brazilian foreign ministry said in a statement on Monday that Southeast Asia’s most populous country “shares with the other members the will to reform the institutions of global governance and contribute positively to cooperation within the Global South.”\n\n- Advertisement -\n\nBrazil, which holds the rotating presidency of the grouping in 2025, said Indonesia’s bid to join the bloc had been approved during a summit in 2023 in Johannesburg.\n\nIndonesia in turn said it “welcomes” the announcement of its inclusion.\n\n“This achievement shows Indonesia’s increasingly active role in global issues and commitment to strengthening multilateral cooperation to create a global structure that is more inclusive and fair,” the Ministry of Foreign Affairs said in a statement on Tuesday.\n\nBRICS was created in 2009 by founding members Brazil, Russia, India and China. South Africa joined the following year.\n\nThe bloc was expanded again last year with Iran, Egypt, Ethiopia and the United Arab Emirates becoming full members.\n\nIndonesia sees its BRICS membership as “a strategic step to improve the collaborations and cooperation with other developing nations, based on the principle of equality, mutual respect, and sustainable development,” the Jakarta statement said.\n\nIt also expressed Indonesia’s “gratitude to Russia,” the 2024 BRICS chair, “for its support and leadership in facilitating Indonesia’s joining,” as well as to Brazil.\n\nDuring its presidency, Brazil aims to boost cooperation between countries of the “Global South” and reform multilateral institutions.\n\nOne of the objectives, according to the government of left-wing President Luiz Inacio Lula da Silva, is the “development of means of payment” to facilitate trade between member countries.\n\nDuring the last BRICS summit in Kazan, Russia, in November 2024, member nations discussed boosting non-dollar transactions and strengthening local currencies.\n\nThis raised the ire of US President-elect Donald Trump, who threatened the group’s members with “100 percent tariffs” if they undercut the US dollar.\n\nThis year’s BRICS summit will take place in Rio de Janeiro in July."
    },
    {
        "title": "Putin wants high-profile summit to rival West",
        "description": "MOSCOW — Two dozen world leaders will meet in Russia next week for a summit of the BRICS group, an alliance of emerging economies that the Kremlin hopes",
        "content": "MOSCOW — Two dozen world leaders will meet in Russia next week for a summit of the BRICS group, an alliance of emerging economies that the Kremlin hopes will challenge Western “hegemony”.\nThe summit will be the biggest in Russia since the Ukraine con... [2381 chars]",
        "url": "https://manilastandard.net/news/world-news/314512999/putin-wants-high-profile-summit-to-rival-west.html",
        "image": "https://cdn.manilastandard.net/wp-content/uploads/2022/05/vladimir_putin-1.jpg",
        "publishedAt": "2024-10-20T13:15:00Z",
        "source": {
            "name": "manilastandard.net",
            "url": "https://manilastandard.net"
        },
        "full_content": "MOSCOW — Two dozen world leaders will meet in Russia next week for a summit of the BRICS group, an alliance of emerging economies that the Kremlin hopes will challenge Western “hegemony”.\n\nThe summit will be the biggest in Russia since the Ukraine conflict began and comes as Russian President Vladimir Putin seeks to show Western attempts to isolate Moscow over the two-and-a-half-year offensive have failed.\n\n- Advertisement -\n\nUN Secretary General Antonio Guterres, Chinese leader Xi Jinping, Brazilian President Luis Inacio Lula da Silva and Turkish President Recep Tayyip Erdogan are scheduled to join the event in the city of Kazan from October 22 to 24.\n\nRussia has said it is expecting Indian Prime Minister Narendra Modi as well.\n\nMoscow has made expanding the BRICS group — an acronym for core members Brazil, Russia, India, China and South Africa — a pillar of its foreign policy.\n\nThe main issues on the agenda include Putin’s idea for a BRICS-led payment system to rival SWIFT, an international financial network that Russian banks were cut off from in 2022, as well as the escalating conflict in the Middle East.\n\nThe Kremlin has touted the gathering as a diplomatic triumph that will help it build an alliance able to challenge Western “hegemony”.\n\nThe United States has dismissed the idea that BRICS could become a “geopolitical rival” but has expressed concern about Moscow flexing its diplomatic muscle as the Ukraine conflict rages.\n\nMoscow has been steadily advancing on the battlefield in eastern Ukraine this year while strengthening its ties with China, Iran and North Korea — three of Washington’s adversaries.\n\nBy gathering BRICS in Kazan, the Kremlin “aims to show that not only is Russia not isolated, it has partners and allies,” Moscow-based political analyst Konstantin Kalachev told AFP.\n\nPutin was declared wanted by the International Criminal Court (ICC) in 2023 over the illegal deportation of children from Ukraine, and abandoned plans to attend the previous summit in ICC member South Africa.\n\nThis time round, the Kremlin wants to show an “alternative to Western pressure… and that the multipolar world is a reality,” Kalachev said, referring to Moscow’s efforts to shift power away from the West to other regions.\n\nPutin has repeatedly accused the West of “provoking” Russia into sending troops into Ukraine, rejecting the idea his offensive is an imperial-style land grab — despite Moscow seizing four Ukrainian regions and claiming them as its own.\n\nThe Kremlin has said it wants global affairs to be guided by international law, “not on rules that are set by individual states, namely the United States.”"
    },
    {
        "title": "Saudi Arabia, UAE and Iran among six countries invited to join BRICS group",
        "description": "Oil powers Saudi Arabia and the United Arab Emirates have been invited to become members of the BRICS group of developing nations in its first expansion in over a decade.",
        "content": "(CNN) — Oil powers Saudi Arabia and the United Arab Emirates have been invited to become members of the BRICS group of developing nations in its first expansion in over a decade.\nAlso invited are Iran, Egypt, Ethiopia and Argentina, South African Pre... [4520 chars]",
        "url": "https://www.cnnphilippines.com/business/2023/8/25/saudi-arabia-uae-iran-brics-invitation.html",
        "image": "https://www.cnnphilippines.com/.imaging/default/dam/cnn/2023/8/25/2023-BRICS-Summit_CNNPH.jpg/jcr:content.jpg?width=750&height=450&crop:1:1,smart",
        "publishedAt": "2023-08-24T16:00:00Z",
        "source": {
            "name": "CNN Philippines",
            "url": "https://www.cnnphilippines.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.cnnphilippines.com', port=443): Max retries exceeded with url: /business/2023/8/25/saudi-arabia-uae-iran-brics-invitation.html (Caused by SSLError(SSLCertVerificationError(1, \"[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: Hostname mismatch, certificate is not valid for 'www.cnnphilippines.com'. (_ssl.c:1010)\"))) on URL https://www.cnnphilippines.com/business/2023/8/25/saudi-arabia-uae-iran-brics-invitation.html"
    },
    {
        "title": "Xi Jinping tells BRICS leaders ‘we’re all in the same boat’ as he takes veiled swipe at US",
        "description": "The Chinese president calls on emerging economies to uphold multilateralism and ‘oppose unilateral sanctions and long-arm jurisdiction’. He also says the five nations should work together to fight the pandemic and to implement the Paris climate agreement.",
        "content": "Chinese President Xi Jinping called on key emerging economies to uphold multilateralism and \"oppose unilateral sanctions and long-arm jurisdiction\" at a time of unprecedented crisis, taking a veiled swipe at Washington.\nAddressing the annual summit o... [3830 chars]",
        "url": "https://news.abs-cbn.com/overseas/11/19/20/xi-jinping-tells-brics-leaders-were-all-in-the-same-boat-as-he-takes-veiled-swipe-at-us",
        "image": "https://sa.kapamilya.com/absnews/abscbnnews/media/2017/tvpatrol/07/18/071817-xi-jinping.jpg",
        "publishedAt": "2020-11-19T04:20:02Z",
        "source": {
            "name": "ABS-CBN News",
            "url": "https://news.abs-cbn.com"
        },
        "full_content": "Xi Jinping tells BRICS leaders ‘we’re all in the same boat’ as he takes veiled swipe at US\n\nXi Jinping tells BRICS leaders ‘we’re all in the same boat’ as he takes veiled swipe at US"
    },
    {
        "title": "Terrorism, coronavirus pandemic on the agenda as BRICS leaders meet",
        "description": "Five emerging economies are expected to endorse a strategy setting out how they can work together on counterterrorism. Economic recovery and cooperation in public health are also likely to be discussed at their virtual summit.",
        "content": "Leaders of five major emerging economies – Brazil, Russia, India, China and South Africa – are expected to endorse a counterterrorism strategy when they meet for their annual summit via video link on Tuesday.\nPost-pandemic economic recovery and coope... [2219 chars]",
        "url": "https://news.abs-cbn.com/overseas/11/17/20/terrorism-coronavirus-pandemic-on-the-agenda-as-brics-leaders-meet",
        "image": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/news/08/05/20200212-covid-19-generic-photos-niaid-5.jpg",
        "publishedAt": "2020-11-17T04:57:07Z",
        "source": {
            "name": "ABS-CBN News",
            "url": "https://news.abs-cbn.com"
        },
        "full_content": "ABS-CBN is the leading media and entertainment company in the Philippines, offering quality content across TV, radio, digital, and film. Committed to public service and promoting Filipino values, ABS-CBN continues to inspire and connect audiences worldwide."
    }
]