[
    {
        "title": "A new compass for the Global South",
        "description": "President Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support...",
        "content": "Chinese President Xi Jinping attends a presentation ceremony in Beijing, China September 29, 2024. — Reuters\nPresident Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries... [6944 chars]",
        "url": "https://www.thenews.com.pk/print/1260637-a-new-compass-for-the-global-south",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-12/1260637_025304_updates.jpg",
        "publishedAt": "2024-12-11T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "Chinese President Xi Jinping attends a presentation ceremony in Beijing, China September 29, 2024. — Reuters\n\nPresident Xi Jinping, during his address at the ‘BRICS Plus’ leaders’ dialogue in Kazan Russia on October 24, 2024, called upon the countries of the Global South to “support each other in taking the path to moderniaation” and announced the formation of a Global South Think Tanks Alliance to “promote people-to-people exchanges and experience-sharing”.\n\nPoliticians and policymakers of the developing countries were quick to heed the call coming from the leader of a country that has accounted for close to three-quarters of global poverty reduction since 1980. In Nanjing in China’s Jiangsu province, during a historic conclave of political leaders and representatives of think tanks from over 100 countries, the Global South Think Tanks Alliance was officially launched on Thursday, November 14, 2024.\n\nThis pool of resources from more than 200 universities and institutions from China and other developing counties will investigate, among others, the reasons behind the failures of Western theories of development and globalisation and conduct research to highlight how each developing country can forge its own unique path of modernisation, as demonstrated by the success of China.\n\nAfter World War I, the establishment of the Bretton Woods institutions and the UN system inaugurated the first-ever global security and economic order. However, the emergence of the USSR as an ideological rival prevented the US from exercising uncontested hegemony. All this changed when the curtain fell on the Soviet Union in December 1991. All international institutions were now under the political and ideological sway of the US and its European allies.\n\nFor the next quarter century, the West purveyed its values, political institutions, economic models, security organisations, and cultural norms as the inexorable destiny of all mankind. No society could find stability, develop economically, or make social progress except within the framework of liberal democracy, market economy, and Western notions of freedom and human rights.\n\nRussia, other republics of the former Soviet Union, and nations of Eastern Europe were the first to experience the transformation of their societies in the ‘new world order’. These countries were cajoled and coerced by Washington into accepting the ‘shock therapy’ of disarmament, denuclearisation, democratisation, privatisation, and wholesale deregulation and liberalisation. The results were less than salubrious.\n\nFollowing the collapse of the Soviet Union, Russia, the biggest member state of the now-defunct Warsaw Pact countries, underwent an economic contraction worse than the one faced by the US during the Great Depression. It experienced a decade of political chaos, hyper-inflation, unemployment, breakdown of internal security, and disintegration of the moral fabric of society. The Russian population has been declining ever since.\n\nCountries in Africa, Latin America, and Asia were made to follow the same set of policies through soft and hard power tactics. After nearly three decades, the results outside Eastern Europe and the Commonwealth of Independent States are even less encouraging. Economically, countries in Latin America have either regressed or remain stagnant. Politically multi-party democracy has failed to flourish on the continent.\n\nDuring the same period, Africa’s share of the poor population of the world has risen from 56 per cent to over 67 per cent despite more than $2 trillion in development assistance according to some estimates. Sub-Saharan Africa is home to more failed states than any other part of the world. Only in East and Southeast Asia have countries succeeded in achieving regional peace, domestic stability, and economic progress. This has been made possible not by copying the Western template but by deviating from it in terms of ideology, institutional arrangements, and policy framework.\n\nChina is the most notable example of this East Asian exceptionalism. Since the reform and opening up beginning in 1978, China has modernised and engaged with the outside world without succumbing to the Western model of development and global integration. China reestablished relations with the World Bank and the IMF in 1980 but has avoided falling into a debt trap or requiring financial bailouts.\n\nIn the late 1980s, despite extreme national and international pressure, China wisely resisted calls for Western-style democracy. Ignoring the policy advice of multilateral institutions for en masse privatisation, China successfully incentivised and made its state-owned enterprises (SOE) profitable. Similarly, it protected its industrial base while successfully integrating into the global economy following accession to the World Trade Organization (WTO) in 2001.\n\nMost significantly, China rejected the West’s trickle-down economic theories and employed state machinery to divert resources towards less developed regions, sectors, and population groups. As a result, while other countries faltered, China succeeded in lifting nearly 800 million people out of poverty.\n\nChina’s economic success has shattered the spell of Western ideological hegemony and opened new possibilities for developing countries to pursue policies that suit their social, political, and historic realities. These nations, a majority of whom are falling short in their goal to end extreme poverty by 2030, can draw encouragement from the example of China which has met the poverty reduction target of the UN’s 2030 Agenda for Sustainable Development ahead of schedule.\n\nChina’s continuing modernisation drive since the election of Xi Jinping to the post of general secretary of the Communist Party of China (CPC) by the 18th National Congress in 2012 has defied the West’s ‘end of history’ thesis and proved wrong its predictions that economic growth would either turn China into a mirror image of Western society or the country would face social unrest and implode economically. The Western argument that multi-party adult franchise democracy and laissez-faire economic policies provide the sole pathway to prosperity no longer appears persuasive.\n\nThe rise of China is not just characterised by strategic autonomy but also by humility, the principle of non-interference, and strategic restraint. While China has displayed leadership by initiating the Global South Think Tanks Dialogue and forming an alliance of research institutions from more than one hundred countries, it has no desire to export its political institutions and economic model. China only functions as a mirror. It is for the public intellectuals of the Global South to ponder why their societies are falling behind despite being the poster children of Western globalisation while China has succeeded in rejuvenating its civilisation by following a path forged by its people and history.\n\nThe message of President Xi Jinping to the Global South, delivered at the G20 Summit in Rio de Janeiro on November 18, can serve as a source of inspiration: “if China can make it, other developing countries can make it too”.\n\nThe writer is the chairperson of Crescent Foundation, Pakistan."
    },
    {
        "title": "Trump warns BRICS nations of 100% tariffs over plans against US dollar",
        "description": "Donald Trump has issued warning to BRICS nations, threatening 100% tariff if their proposed currency plans undermine US dollar.",
        "content": "President-elect Donald Trump has issued a warning to BRICS nations, threatening a 100% tariff if their proposed currency plans undermine the US dollar.\nOn his Truth Social platform, Trump stated, “We require a commitment… that they will neither creat... [1274 chars]",
        "url": "https://www.bolnews.com/international/2024/12/trump-warns-brics-nations-of-100-tariffs-over-plans-against-us-dollar/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/08/FotoJet-89-2.jpg",
        "publishedAt": "2024-12-01T18:43:08Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "President-elect Donald Trump has issued a warning to BRICS nations, threatening a 100% tariff if their proposed currency plans undermine the US dollar.\n\nOn his Truth Social platform, Trump stated, “We require a commitment… that they will neither create a new BRICS Currency nor support any other currency to replace the mighty US Dollar, or they will face 100 percent tariffs.” BRICS includes Brazil, Russia, India, China, South Africa, and others.\n\nThe warning follows last month’s BRICS summit in Kazan, Russia, where the group discussed reducing reliance on the US dollar in trade and strengthening local currencies.\n\nSince its creation in 2009, BRICS has grown to include countries like Iran, Egypt, and the UAE, representing a significant portion of the global economy.\n\nAt the October summit, Moscow secured a declaration to boost correspondent banking within BRICS and promote local currency settlements under the BRICS Cross-Border Payments Initiative.\n\nAdvertisement\n\nHowever, Russian President Vladimir Putin noted no progress had been made on creating an alternative to SWIFT, the global financial messaging system. He also clarified that BRICS is not currently considering a unified currency.\n\nTrump, maintaining his protectionist stance, warned BRICS nations that pursuing these plans would mean losing access to the US market. “They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in international trade, and any country that tries should wave goodbye to America,” he wrote."
    },
    {
        "title": "Trump warns BRICS nations against replacing US dollar",
        "description": "ISLAMABAD: Instead of threatening to impose 100 percent tariffs on member countries of BRICS backed by China and Russia for their bids to scale down reliance on the US dollar for international...",
        "content": "US President-elect Donald Trump attends a viewing of the launch of the sixth test flight of the SpaceX Starship rocket, in Brownsville, Texas, US, November 19, 2024. — Reuters\nISLAMABAD: Instead of threatening to impose 100 percent tariffs on member ... [6723 chars]",
        "url": "https://www.thenews.com.pk/print/1257273-trump-warns-brics-nations-against-replacing-us-dollar",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-02/l_1257273_055929_updates.jpg",
        "publishedAt": "2024-11-30T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "US President-elect Donald Trump attends a viewing of the launch of the sixth test flight of the SpaceX Starship rocket, in Brownsville, Texas, US, November 19, 2024. — Reuters\n\nISLAMABAD: Instead of threatening to impose 100 percent tariffs on member countries of BRICS backed by China and Russia for their bids to scale down reliance on the US dollar for international trade, President-elect of the USA Donald Trump needs to find out why countries are moving away from using the US dollar for trade.\n\nThe blatant use of economic sanctions in US dollars and increasing tariffs to punish the countries are the main reasons forcing the vital economies to assemble under the platform of BRICS and initiate trade in their own currencies keeping US dollars aside, Pakistan’s eminent economist Dr Ashfaque H Khan responds to the statement of Donald Trump on BRICS.\n\n“Imposing 100 percent tariff is not a child’s play as such measures will further accelerate de-dollarization,” Dr Khan said.\n\nSakib Sherani, a seasoned economist of the country, says: “Since the Bretton Woods system was put in place after the Second World War, the US has sought to insert the dollar as the go-to currency for global trade. After the move away from the gold standard, the US has actively sought to protect the reserve currency status of the greenback and the exorbitant privilege that comes with it.”\n\nMany commentators believe that some of the US conflicts in recent history, such as the military campaign to remove Col Muammar Gaddhafi in Libya, were the result of moves by countries involved to shift away from selling oil in US dollar, for example, or becoming part of an alternate global payment system.\n\nThe latest salvo fired against the BRICS nations is a continuation of the same. It is unlikely to stop the BRICS countries from exploring an alternate to the US dollar because the USA has weaponized its currency as well as the dollar-based global payments system. Threats by the US, combined with tariff measures and protectionism, will only encourage more countries towards finding an alternate system. This will accelerate the global geo-economic fragmentation already taking place.\n\n“Countries like Pakistan stand to lose from such developments because any move to reverse globalization will hurt developing countries the most,” Sherani opined.\n\n“The US has used its control over the dollar-based financial system to sanction countries like Russia (for its actions in Ukraine), Iran (over nuclear proliferation concerns) and North Korea (for its missile programs). As the US dollar is the dominant global currency for trade and finance, countries that rely on it can find their economies severely impacted by sanctions.”\n\nDr Abid Qaiyum Sulehri, head of SDPI (Sustainable Development Policy Institute), said that 100 percent hike in tariff on imports from BRICS countries will also cause an increase in sufferings of American consumers. He said that to stabilize a multipolar world and to avoid consequences of unipolar economic system, the world needs alternatives of the US dollar for trade.\n\nDr Sulehri argued that there are already more than one currencies in the IMF basket, so Trump’s attempt to discourage BRICS currency would be an absurd initiative.\n\nThe statement by Donald Trump says: “The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is over. We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US Economy.”\n\nBRICS (Brazil, Russia, India, China, and South Africa) was established to promote economic cooperation and development among emerging economies. The group aims to provide an alternative to Western-dominated financial systems, including institutions like the International Monetary Fund (IMF) and the World Bank, which have historically been seen as serving the interests of developed nations, particularly the United States and Europe.\n\nBRICS countries formed the group in 2006 (with South Africa joining in 2010), recognizing the growing influence and potential of emerging economies in the global economic landscape. The primary motivations behind its creation include: BRICS countries sought to create a platform for their economic growth and development by focusing on cooperation in trade, investment, and infrastructure development; the group aimed to challenge the dominance of the West in global institutions and advocate for reforms in global governance systems, particularly those centered around the United Nations, World Trade Organization (WTO), and international financial institutions; and BRICS also aimed to increase the political clout of its member nations in global decision-making processes, positioning themselves as a counterbalance to Western influence.\n\nChina’s move to internationalize the yuan is partly a strategic response to US economic sanctions and the dominance of Western financial systems. The US has used its control over the global financial system, including the dollar-based SWIFT network, to impose sanctions on countries like Russia, Iran, and North Korea. By promoting the yuan, China seeks to protect itself and its trading partners from potential US sanctions, ensuring that it can continue to engage in global trade without interference.\n\nChina has already taken significant steps to internationalize the yuan. In 2016, the International Monetary Fund (IMF) included the yuan in its Special Drawing Rights (SDR) basket, which consists of a basket of reserve currencies. This was a milestone in recognizing the yuan as an international reserve currency. To solidify its role in global finance, China is working to increase the yuan’s usage in trade, investment, and central bank reserves around the world.\n\nTrump’s threats against BRICS countries on the use of US dollar were likely a reaction to the perceived threat to US economic dominance, especially in global trade, finance and geopolitics. The US dollar plays a critical role in maintaining the US’s global influence — in terms of economic leverage, sanctions power and financial stability. Therefore, any efforts by countries like China, Russia, and India to move away from the dollar would have undermined US interests, prompting Trump’s response to prevent such shifts and preserve US economic power on the world stage. “We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs and should expect to say goodbye to selling into the wonderful US economy,” Trump wrote on his social media platform, Truth Social.\n\n“They can go find another ‘sucker’. There is no chance that the BRICS will replace the US dollar in International Trade, and any country that tries should wave goodbye to America.”"
    },
    {
        "title": "'100% tariff': Trump warns BRICS nations against replacing US Dollar",
        "description": "US President-elect Donald Trump on Saturday demanded that BRICS nations commit to not creating a new currency or endorsing any alternative to the US dollar, threatening severe tariffs if they do,...",
        "content": "US President-elect Donald Trump seen pointing a finger in this undated image.— Reuters/file\nUS President-elect Donald Trump on Saturday demanded that BRICS nations commit to not creating a new currency or endorsing any alternative to the US dollar, t... [1091 chars]",
        "url": "https://www.thenews.com.pk/latest/1257269-trump-issues-strong-warning-to-brics-nations-over-the-us-dollar",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-02/l_1257269_043507_updates.jpg",
        "publishedAt": "2024-11-30T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "US President-elect Donald Trump seen pointing a finger in this undated image.— Reuters/file\n\n\n\nUS President-elect Donald Trump on Saturday demanded that BRICS nations commit to not creating a new currency or endorsing any alternative to the US dollar, threatening severe tariffs if they do, Reuters reported.\n\n\n\n“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100% tariffs, and should expect to say goodbye to selling into the wonderful US economy,” Trump wrote on his Truth Social account.\n\nHe added, “They can go find another ‘sucker.’ There is no chance that the BRICS will replace the US dollar in international trade, and any country that tries should wave goodbye to America.”\n\nBrazil and Russia have led discussions about creating a new currency to reduce the US dollar’s dominance, but progress has stalled due to internal disagreements within the BRICS group.\n\nTrump’s remarks are being viewed by some of his allies as part of a negotiation strategy. Republican Senator Ted Cruz defended the use of tariffs, pointing to their effectiveness in previous negotiations. “You look at the threat of tariffs against Mexico and Canada, immediately [it] produced action,” Cruz said on CBS News’ Face the Nation on Sunday."
    },
    {
        "title": "Trump warns to ban BRICS nations in US economy over anti-dollar plans",
        "description": "President-elect Donald Trump has warned BRICS nations of a potential ban from the US economy if they proceed with plans to undermine the US dollar. We require a commitment... that they will...",
        "content": "US President-elect Donald Trump attends a press conference at Trump National Golf Club, in Rancho Palos Verdes, US, September 13, 2024. — Reuters\nPresident-elect Donald Trump has warned BRICS nations of a potential ban from the US economy if they pro... [1866 chars]",
        "url": "https://www.thenews.com.pk/latest/1256881-trump-warns-to-ban-brics-nations-in-us-economy-over-anti-dollar-plans",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-12-01/l_1256881_022723_updates.jpg",
        "publishedAt": "2024-11-29T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "US President-elect Donald Trump attends a press conference at Trump National Golf Club, in Rancho Palos Verdes, US, September 13, 2024. — Reuters\n\nPresident-elect Donald Trump has warned BRICS nations of a potential ban from the US economy if they proceed with plans to undermine the US dollar.\n\n\"We require a commitment... that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100 percent Tariffs,\" Trump wrote on his Truth Social website, referring to the grouping that includes Brazil, Russia, India, China, South Africa and others.\n\nThe statement comes after a BRICS summit held last month in Kazan, Russia, where the countries discussed boosting non-dollar transactions and strengthening local currencies.\n\nThe BRICS group has expanded significantly since its inception in 2009, and now includes countries such as Iran, Egypt and the United Arab Emirates. Altogether the BRICS coalition accounts for a significant minority of the world’s economic output.\n\nAt the Kazan summit in October, Moscow secured a joint declaration encouraging the \"strengthening of correspondent banking networks within BRICS and enabling settlements in local currencies in line with BRICS Cross-Border Payments Initiative.\"\n\nBut at the end of the summit Putin indicated that little progress had been made on launching a possible competitor to the Belgium-based SWIFT financial messaging system.\n\n\"As for SWIFT and any alternatives, we have not created and are not creating any alternatives,\" Putin told reporters at the end of the summit.\n\nHe added: \"As for a unified BRICS currency, we are not considering that question at the moment.\"\n\nTrump has vowed to pursue a protectionist agenda, threatening hefty tariffs on neighbors and rivals.\n\nIf BRICS countries continue with their plans, Trump warned, they \"should expect to say goodbye to selling into the wonderful US Economy,\" he wrote.\n\n\"They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in International Trade, and any Country that tries should wave goodbye to America.\""
    },
    {
        "title": "BRICS 2024: Putin scores a rare victory",
        "description": "Chinese President Xi Jinping and Indian Prime Minister Narendra Modi utilized the BRICS summit in Russia on Wednesday to express aspirations for a more harmonious relationship",
        "content": "KAZAN: Chinese President Xi Jinping and Indian Prime Minister Narendra Modi utilized the BRICS summit in Russia on Wednesday to express aspirations for a more harmonious relationship between the two most populous countries, following years of tension... [4431 chars]",
        "url": "https://www.bolnews.com/business/2024/10/brics-2024-putin-scores-a-rare-victory/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/10/FotoJet-75-1.jpg",
        "publishedAt": "2024-10-23T17:27:38Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "KAZAN: Chinese President Xi Jinping and Indian Prime Minister Narendra Modi utilized the BRICS summit in Russia on Wednesday to express aspirations for a more harmonious relationship between the two most populous countries, following years of tension. Their meeting, the first formal talks in five years, was a significant highlight of a summit that President Vladimir Putin aimed to use to demonstrate that the West has failed to isolate Russia amid the ongoing Ukraine conflict.\n\nThe summit’s final communique outlined several initiatives designed to enhance trade among BRICS nations, including the establishment of an alternative payment system to the dollar, though specifics and timelines were not provided. Just days after New Delhi announced a deal with Beijing to resolve a four-year military standoff over their disputed Himalayan border, Xi urged Modi to strengthen communication and cooperation while effectively managing their differences.\n\n“It is in the fundamental interests of the two countries and peoples for China and India to correctly grasp the trend of history and the direction of development of their relations,” Xi stated, according to Chinese state broadcaster CCTV. Modi responded by emphasizing the importance of maintaining peace and stability along their frontier, asserting that mutual trust, respect, and sensitivity should form the foundation of their relationship. “We welcome the agreement on the issues that had come up over the last four years,” Modi added in comments broadcast by India’s state broadcaster Doordarshan.\n\nBRICS, a concept initially proposed by Goldman Sachs two decades ago to illustrate the growing economic influence of China and other emerging markets, now represents 45% of the global population and 35% of the world economy. The summit coincides with the annual meetings of the International Monetary Fund and World Bank in Washington.\n\nFormer Goldman economist Jim O’Neill, who coined the BRIC acronym in 2001, expressed skepticism about the BRICS bloc as long as China and India remain divided. “It seems to me basically to be a symbolic annual gathering where important emerging countries, particularly noisy ones like Russia, but also China, can basically get together and highlight how good it is to be part of something that doesn’t involve the U.S. and that global governance isn’t good enough,” O’Neill stated.\n\nAdvertisement\n\nUKRAINE WAR\n\nRegarding the Ukraine war, Putin, who has dismissed Western claims of war crimes for Russia’s actions, hosted over 20 leaders at the summit, including NATO member Turkey’s President Tayyip Erdogan and Iranian President Masoud Pezeshkian. Modi publicly expressed a desire for peace in Ukraine, while Xi engaged in closed-door discussions about the conflict with Putin, along with United Arab Emirates President Sheikh Mohammed bin Zayed Al Nahyan, who has sought to mediate.\n\nThe 43-page final communique from the summit covered a range of topics, including geopolitics, narcotics, artificial intelligence, and the preservation of big cats, but only briefly mentioned Ukraine. It acknowledged “relevant proposals of mediation and good offices, aimed at a peaceful resolution of the conflict through dialogue and diplomacy.”\n\nThe strongest language was reserved for the Middle East, where the leaders called for a ceasefire in Gaza and the West Bank, condemning Israeli “attacks against humanitarian operations, facilities, personnel and distribution points.” While the BRICS leaders expressed interest in developing alternative payment systems, details were scarce, and they tasked central bankers to provide updates under the next presidency.\n\n“The trend for the BRICS’ leading role in the global economy will only strengthen,” Putin asserted, citing factors such as population growth, urbanization, capital accumulation, and productivity growth. China and India account for about 90% of Russia’s oil purchases, which is Moscow’s primary foreign currency source.\n\nThe leaders indicated a desire to further enhance BRICS’ institutional development but offered little clarity on the potential expansion of the group. Putin noted that over 30 countries had shown interest in joining but emphasized the importance of maintaining a balance in any expansion.\n\nAdvertisement\n\n“I will take the BRICS group seriously when I see signs that the two countries that really matter, China and India, actually really trying to agree on things, rather than effectively trying to confront each other all the time,” O’Neill remarked.\n\nAlso Read Birmingham Airport Evacuates and Cancels Flights Amid Security Concerns Birmingham Airport Cancels Flights and Evacuates Due to Suspicious Vehicle Report. West..."
    },
    {
        "title": "BRICS Summit: Several world leaders meet in Russia next week",
        "description": "Next week, two dozen world leaders will gather in Russia for BRICS summit, alliance of emerging economies that Kremlin hopes will counter.",
        "content": "Next week, two dozen world leaders will gather in Russia for a BRICS summit, an alliance of emerging economies that the Kremlin hopes will counter Western dominance.\nThis summit will be the largest held in Russia since the onset of the Ukraine confli... [2979 chars]",
        "url": "https://www.bolnews.com/pakistan/2024/10/brics-summit-several-world-leaders-meet-in-russia-next-week/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/10/FotoJet-16-1.jpg",
        "publishedAt": "2024-10-20T15:40:42Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "Next week, two dozen world leaders will gather in Russia for a BRICS summit, an alliance of emerging economies that the Kremlin hopes will counter Western dominance.\n\nThis summit will be the largest held in Russia since the onset of the Ukraine conflict and aims to demonstrate that Western efforts to isolate Moscow during the two-and-a-half-year offensive have been unsuccessful.\n\nAmong those expected to attend the event in Kazan from October 22 to 24 are UN Secretary General Antonio Guterres, Chinese President Xi Jinping, Brazilian President Luis Inacio Lula da Silva, and Turkish President Recep Tayyip Erdogan.\n\nRussia has announced that it is expecting Indian Prime Minister Narendra Modi to attend the upcoming BRICS summit.\n\nExpanding the BRICS group, which includes Brazil, Russia, India, China, and South Africa, has become a key focus of Russia’s foreign policy.\n\nAdvertisement\n\nThe agenda will cover important topics, including creating a BRICS-led payment system to compete with SWIFT, a financial network that Russian banks were banned from using in 2022, and addressing the ongoing conflict in the Middle East.\n\nThe Kremlin is promoting this summit as a diplomatic success, aiming to demonstrate that it can build alliances that challenge Western dominance. The United States has expressed concern about Russia’s increasing diplomatic influence while the conflict in Ukraine continues.\n\nThis year, Russia has made progress in eastern Ukraine and strengthened its ties with China, Iran, and North Korea—countries that are seen as adversaries by Washington. Political analyst Konstantin Kalachev noted that by hosting the BRICS summit in Kazan, Russia wants to show that it is not isolated and has allies.\n\nIn 2023, the International Criminal Court (ICC) issued an arrest warrant for President Putin over the illegal deportation of children from Ukraine, leading him to skip the previous summit in South Africa. This time, the Kremlin aims to present an “alternative to Western pressure” and highlight the reality of a multipolar world, which shifts power away from the West.\n\nPutin has often accused the West of provoking Russia into the Ukraine conflict and denies that the military offensive is an imperialistic land grab. The Kremlin advocates for global governance based on international law, rather than rules set by individual countries like the United States.\n\nKremlin aide Yuri Ushakov described BRICS as a model of multipolarity, bringing together nations from the Southern and Eastern hemispheres based on mutual respect and sovereignty. He added that BRICS is gradually working to create a more democratic and just global order.\n\nAdvertisement\n\nSince its founding in 2009 with four members, BRICS has expanded to include several other emerging countries, including South Africa, Egypt, and Iran. Turkey, a NATO member with complicated relations with both Russia and the West, expressed its desire to join BRICS in September.\n\nUshakov confirmed that all BRICS countries will be represented by their leaders at the Kazan summit, except for Saudi Arabia, which will send its foreign minister instead. Kalachev noted that while the Kremlin hoped to see the Saudi Crown Prince, overall, things are going well for Russia."
    },
    {
        "title": "BRICS Moscow Seminar: Mushahid welcomes ‘winds of Change in South Asia’",
        "description": "Moscow, 23 September: Senator Mushahid Hussain Sayed was specially invited to give Keynote address at BRICS Seminar, where he said ‘Pakistan looks forward to joining BRICS’",
        "content": "Moscow, 23 September: Senator Mushahid Hussain Sayed was specially invited to give Keynote address at BRICS Seminar, where he said ‘Pakistan looks forward to joining BRICS’ & welcomed ‘winds of change blowing all across South Asia which reject hegemo... [1889 chars]",
        "url": "https://www.bolnews.com/business/2024/09/brics-moscow-seminar-mushahid-welcomes-winds-of-change-in-south-asia/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/09/WhatsApp-Image-2024-09-23-at-6.29.49-PM.jpeg",
        "publishedAt": "2024-09-23T14:00:31Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "Moscow, 23 September: Senator Mushahid Hussain Sayed was specially invited to give Keynote address at BRICS Seminar, where he said ‘Pakistan looks forward to joining BRICS’ & welcomed ‘winds of change blowing all across South Asia which reject hegemony, status quo & seek change’, referring to recent radical changes in the Maldives, Nepal, Bangladesh and Sri Lanka.\n\nAs a consequence, he said the so-called ‘Indo-Pacific Strategy is now drowning in the waters of the Indian Ocean’. He criticised the recent US sanctions against Pakistan and China, terming these ‘immoral, unjust, unacceptable and illegal’ as sanctions under International Law can only be imposed by the UN Security Council. He Alsó condemned ‘Western hypocrisy and double standards on Palestine’.\n\nSenator Mushahid Hussain said the Global Order was marked by turbulence and transformation, with two contrasting narratives. China and Global South are focused on connectivity and trade and economic cooperation, conversely, the US is busy with pushing a New Cold War with a militaristic mindset, evident in yesterday’s QUAD meeting hosted by President Biden, where he again showed his China-obsession.\n\nSenator Mushahid Hussain urged the BRICS Seminar to define a new narrative based on emerging ground realities to counter propaganda, fake news and disinformation.\n\nFor the future, Mushahid put forward a 3-D Strategy for BRICS: Democratisation of the world order based on multipolarity, multilateralism, UN Charter and International Law, Demilitarisation of international relations, rejecting any new military alliances like ‘Asian NATO’, QUAD or AUKUS, Dedollarisation of the world economy and greater trade in non-dollar currencies as dollar was being weaponised.\n\nAdvertisement\n\nSenator Mushahid Hussain was warmly welcomed by the host, Mikhail Shvydkoy, Special Envoy of President Putin, as well China’s Minister for International Communication, Wang Gang. Apart from Russia and China, other countries represented at BRICS Seminar included India, Brazil, South Africa, Egypt, Iran and UAE. Senator Mushahid Hussain was the only representative from a non-BRICS member state."
    },
    {
        "title": "Day after Putin's visit, Azerbaijan applies to join Russia and China in the BRICS alliance",
        "description": "Azerbaijan formally applied Tuesday to join the BRICS bloc of developing economies, a day after Russian leader Vladimir Putin's visit to the oil-rich South Caucasus country to shore up regional ties and secure Moscow’s under-pressure trade routes. The announcement from the foreign ministry in Azerbaijan's capital, Baku, comes as the BRICS alliance has seen a major expansion.",
        "content": "BAKU, Azerbaijan (AP) — Azerbaijan formally applied Tuesday to join the BRICS bloc of developing economies, a day after Russian leader Vladimir Putin's visit to the oil-rich South Caucasus country to shore up regional ties and secure Moscow’s under-p... [1726 chars]",
        "url": "https://finance.yahoo.com/news/day-putins-visit-azerbaijan-applies-170126480.html",
        "image": "https://s.yimg.com/ny/api/res/1.2/zrRoBo53klqnwksnCV6lLA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/ap_finance_articles_694/941fc2116fef28c684a872297e4147c8",
        "publishedAt": "2024-08-20T17:01:26Z",
        "source": {
            "name": "Yahoo Finance",
            "url": "https://finance.yahoo.com"
        },
        "full_content": "BAKU, Azerbaijan (AP) — Azerbaijan formally applied Tuesday to join the BRICS bloc of developing economies, a day after Russian leader Vladimir Putin's visit to the oil-rich South Caucasus country to shore up regional ties and secure Moscow’s under-pressure trade routes.\n\nThe announcement from the foreign ministry in Azerbaijan's capital, Baku, comes as the BRICS alliance has seen a major expansion. For over a decade, the bloc included just five nations: Brazil, Russia, India, China and South Africa.\n\nIran, Egypt, Ethiopia and the United Arab Emirates joined in January, and Saudi Arabia has said it's considering doing so as well.\n\nThe club already includes some of the world’s biggest oil producers, and accounts for well over a quarter of the world’s GDP. Its members Russia and Iran have had their relations with the West stretched to breaking point over Moscow’s war on Ukraine and Iran's regional policies.\n\nBusiness ties were high on the agenda during the meeting between Putin and Azerbaijani President Ilham Aliyev on Monday, with Aliyev announcing that $120 million had been earmarked to boost cargo transport between the two countries.\n\nPutin increasingly depends on countries such as Azerbaijan to access global markets because of sanctions imposed on Moscow over its actions in Ukraine, according to political scientist Zardusht Alizade.\n\nFor Azerbaijan, retaining Moscow’s good-will is important for national security over tensions with neighboring Armenia, said Alizade.\n\nRussia has been Armenia’s longtime sponsor and ally since the fall of the Soviet Union. But relations between them became increasingly strained since Sept. 2023, when Azerbaijan's military took control of the Karabakh region, ending three decades of ethnic Armenian separatist rule.\n\nArmenia accused Russian peacekeepers deployed to the region of failing to stop Azerbaijan’s onslaught. Moscow, which has a military base in Armenia, argued that its troops didn’t have a mandate to intervene."
    },
    {
        "title": "BRICS: India, Nigeria ditch US dollar, will trade in local currency",
        "description": "In a bid to counter the United States dollar's supremacy, BRICS member countries India and Nigeria have agreed to trade in their local currencies and not the greenback anymore, Watcher Guru...",
        "content": "Doubts in US dollar begin to seep in as new currency comes to the rescue. — Business Forward/File\nIn a bid to counter the United States dollar's supremacy, BRICS member countries India and Nigeria have agreed to trade in their local currencies and no... [1145 chars]",
        "url": "https://www.thenews.com.pk/latest/1188930-brics-india-nigeria-ditch-us-dollar-will-trade-in-local-currency",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2024-05-14/l_1188930_123113_updates.jpg",
        "publishedAt": "2024-05-13T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "Doubts in US dollar begin to seep in as new currency comes to the rescue. — Business Forward/File\n\nIn a bid to counter the United States dollar's supremacy, BRICS member countries India and Nigeria have agreed to trade in their local currencies and not the greenback anymore, Watcher Guru reported.\n\nThe two countries have officially signed a trade agreement where it is stated that the majority of the payments will be made in local currency.\n\nThe BRICS, comprising Brazil, Russia, India, China, and South Africa, is an intergovernmental organisation that was made to establish deeper ties between member nations and cooperate on economic expansions, such as trade. It was set to counterbalance Western alliances.\n\nThe alliance will meet in October for its annual summit, where it is being reported that the developing countries may announce setting up a new currency.\n\nNigeria has applied to join BRICS and expressed interest in being a part of the organisation.\n\nThe trade between India and Nigeria comprise collaboration on energy, pharmaceuticals, and transport sectors.\n\nIn FY 2022–2023, trade between both nations amounted to $11.8 billion. In FY 2023–2024, the trade has reached $7.89 billion so far.\n\nIf BRICS countries continue to sign deals to not trade in dollars, the US economy, which is already in turmoil due to inflation and high debts, will further inch towards the risk of plummeting."
    },
    {
        "title": "Mushahid hopes Pakistan can join BRICS with Russian support",
        "description": "Chairman Senate Standing Committee on Defence, Senator Mushahid Hussain has hoped that Pakistan could join the BRICS",
        "content": "MOSCOW: An intergovernmental organisation being evolved into a cohesive geopolitical bloc, and welcomed ‘Russian goodwill for Pakistan’.\nThe Senator is visiting Russia on the invitation of the ruling ‘United Russia’ party, during which he met Former ... [3334 chars]",
        "url": "https://www.bolnews.com/pakistan/2024/02/mushahid-in-moscow-hopes-pakistan-can-join-brics-with-russian-support/",
        "image": "https://www.bolnews.com/wp-content/uploads/2024/02/Mushahid-Feb-18.jpg",
        "publishedAt": "2024-02-18T15:36:37Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "MOSCOW: An intergovernmental organisation being evolved into a cohesive geopolitical bloc, and welcomed ‘Russian goodwill for Pakistan’.\n\nThe Senator is visiting Russia on the invitation of the ruling ‘United Russia’ party, during which he met Former President Dmitri Medvedev (who’s number two to President Putin) and Foreign Minister Sergey Lavrov, a news release here received said.\n\nHe also attended the newly-formed International Forum for ‘Freedom of Nations’ where he was elected as a Member of the Forum’s 20-member Standing Committee. The Forum was organized by the United Russia party. Senator Hussain Co-Chaired the Forum’s plenary session where Foreign Minister Lavrov spoke and Senator Hussain had a comprehensive exchange with former President Dmitri Medvedev, now Deputy Chairman of the Security Council of Russia.\n\nSenator Hussain and Dmitri Medvedev discussed Pakistan-Russia relations, the situation in Afghanistan, the war in Gaza, and the ‘unlimited possibilities for Pakistan-Russian collaboration in the region, particularly on energy & economic connectivity’, adding ‘Pakistan core interests are linked to this region, where Russia is a key factor’.\n\nSenator Hussain told Mr Medvedev that the probable election of President Trump in the US Presidential elections in November 2024 would qualitatively change the region’s geopolitics. Senator Hussain said he found ‘tremendous goodwill’ for Pakistan in all official and popular circles in Moscow.\n\nAdvertisement\n\nDuring the visit, Senator Mushahid Hussain also delivered a lecture at the Russian Diplomatic Academy, the first prominent Pakistani to be invited to address the Diplomatic Academy in 50 years. The topic of the talk was ‘Pakistan and the changing regional scenario’. Senator Hussain during his talk also highlighted the fact that there’s ‘no fundamental conflict of interest’ between Pakistan and Russia‘, therefore, ‘Pakistan has remained neutral on Ukraine, abstaining on voting in the United Nations on this issue’.\n\nHe welcomed growing relations between Pakistan and Russia especially in the field of energy, connectivity, education, regional security including Afghanistan and cooperation at multilateral fora including SCO and UN. He also expressed optimism on Pakistan joining BRICS with Russian cooperation, as Russia is Chair of BRICS in 2024. He said in the future four Muslim Middle Powers-Pakistan, Iran, Saudi Arabia & Turkey, would play a decisive role in regional affairs.He also appreciated President Putin’s stance on Islamophobia.\n\nThe lecture was followed by a question and answer session from the students of the diplomatic academy. Senator Mushahid Hussain also met Senator Chizhov, President of the Russia-Pakistan Parliamentary Friendship Group.\n\nSenator Mushahid Hussain also met leading members of the small Pakistani community in Moscow plus had several interviews with the Russian media.\n\nGiving his impressions of his visit to Russia, Senator Mushahid Hussain met three fundamental points: a) both countries have ‘Strategic Space’ after ending of foreign intervention in Afghanistan, to build relations anew in various fields; b) Pakistan needs ‘Regional Reset’ in its foreign relations to take substantial initiatives for regional connectivity with Russia and other neighbouring countries; c) China is a common factor of unity & connectivity for Pakistan and Russia given both countries have close strategic ties with Beijing.\n\nSenator Mushahid Hussain was also invited to be part of International Observers who will visit to observe Presidential Elections during March 15-17, 2024."
    },
    {
        "title": "International fashion had its star moment at the BRICS+ Fashion Summit in Moscow",
        "description": "With 10 shows held over the course of the summit, there was something for everyone — including collaborations.",
        "content": "Fashion was in the air — and on the runway — at the BRICS+ Fashion Summit in Moscow at the start of December. With 10 fashion shows featuring 13 designers during the five-day event, the summit was bursting with style — and you know how we love fashio... [7809 chars]",
        "url": "https://images.dawn.com/news/1192127/international-fashion-had-its-star-moment-at-the-brics-fashion-summit-in-moscow",
        "image": "https://i.dawn.com/thumbnail/2024/01/0217014415af469.png?r=105444",
        "publishedAt": "2024-01-03T10:53:58Z",
        "source": {
            "name": "DAWN.com",
            "url": "https://images.dawn.com"
        },
        "full_content": "Fashion was in the air — and on the runway — at the BRICS+ Fashion Summit in Moscow at the start of December. With 10 fashion shows featuring 13 designers during the five-day event, the summit was bursting with style — and you know how we love fashion.\n\nFrom Hany El Behairy’s glamorous gowns to Shruti Sancheti’s handwoven masterpieces, the pieces on display were quite diverse and, in my opinion, for a variety of audiences. There was no set audience to which these clothes were being marketed.\n\nView this post on Instagram\n\nFrom over-the-top glam to muted elegance, there was something for everyone. Check out this list of my favourite designers (and their designs) from the summit.\n\nHany El Behairy\n\nThe top spot absolutely had to go to Hany El Behairy of Egypt. His stunning designs oozed glamour and elegance as well as the kind of bling we’re used to seeing in Faraz Manan or Elan designs in Pakistan.\n\nWith the kind of intricate bead and thread work in his designs, is it any wonder that he created what was then the most expensive dress in the world — worth a whopping $15 million? According to the designer, he used real jewels in the dress — which were later returned to the jeweller, of course.\n\n@dawn_images We caught up with Egyptian designer Hany El-Behairy at rhe #bricsfashionsummit in #moscow and he told us why he’d come to show his collection! #hanyelbehairy ♬ original sound - Dawn IMAGES\n\nHe told Images that he came to the BRICS+ Fashion Summit to present his new collection because he was looking for collaborations — be it through the purchase of new materials, inspiration from the culture or deals. “Designers from all over the world are excited to come to Moscow. I know Moscow and Russia [have a really good background] in dresses, fabric and fashion, so for me, it was perfect.”\n\nHis inspiration, he said, comes from museums — specifically the Louvre in Paris. Ever since he was young, Behairy has been interested in embroidery — an interest encouraged by his mother and grandmother, who taught him how to embroider.\n\nThat love continues today, especially in his designs which are bold, loud and beautiful. People, he said, have told him to make clothes that are a bit more simple, perhaps to attract more customers, but that isn’t his style.\n\n@dawn_images The fashion was fashioning at the #bricsfashionsummit in #moscow — especially the uber glam collection by Egyptian designer #hanyelbehairy ✨ ♬ Imagination - Lize Mynhardt\n\nArzu Caprol\n\nTurkish designer Arzu Caprol’s designs were all about sleek glamour and shimmery elegance.\n\nUnlike Behairy’s, most of her designs seemed more appropriate for clubs or parties as opposed to weddings or balls but her designs had the same wow factor Behairy’s did.\n\nThe use of beadwork and different materials made Caprol’s designs quite eye-catching.\n\nThis dress was one of my favourites simply due to how over the top yet understated it is. There’s no beadwork or embroidery — it stands out solely based on the colour and the design.\n\nShruti Sancheti\n\nThere’s something to be said for avant garde fashion but, in my opinion, there’s even more to be said for fashion that makes it off the runway and into people’s closets. Some clothes look nice to look at but most people can’t actually see themselves wearing those clothes.\n\nThat’s why I liked Shruti Sancheti’s collection so much — hers were clothes I could see myself or other people wearing. Mixing traditional materials and designs with streetwear elements, I enjoyed both her show and checking out her clothes in person at the B2B showroom at the summit.\n\nSancheti told Images that the fabric used in her line, Hut to High Streets, was entirely handcrafted.\n\n@dawn_images One of our favourite designers at the #bricsfashionsummit Shruti Sancheti spoke to us about her collection and the ethos behind her designs. #moscow #indianfashion ♬ original sound - Dawn IMAGES\n\n“In parts of South East Asia, we still have hand-weaving as a tradition and all my fabrics are handmade and handcrafted. And what we’ve done is add a very contemporary touch to the garments because though these textiles are beautiful and our country has this unsurpassed legacy of textiles and crafts we realise that what was relevant years ago is not relevant now,” she explained.\n\n“The whole idea is to take India to a global arena and so [my clothes] are a merger of international styling with Indian craftsmanship and the result is easy separates that anyone in the world can wear.”\n\nAnd a merger they are indeed — long baggy dresses, flowing pants and comfortable shirts paired with long coats lined with traditional tassels and prints, her clothes were a mix of traditional and contemporary.\n\nRitesh Kumar\n\nComfort seemed to be an overarching theme with the Indian designers who showcased their work at the BRICS+ Fashion Summit.\n\nRitesh Kumar, another designer from across the border, showcased far more contemporary fits, playing with materials and jacket silhouettes to create more casual outfits that I could see on any high street in the world. I especially liked the materials used in his designs, which like Sancheti’s, looked incredibly wearable.\n\nNaushad Ali\n\nIf Kumar’s designs were ultra modern, then designer Naushad Ali was a mix of modern and traditional, incorporating traditional embroideries and patterns to create more feminine, flowing silhouettes that wouldn’t be out of place anywhere.\n\nI may be belabouring the point, but all of the Indian designers had clothes that looked like they were meant to be worn. These were no collections made for magazines and runways alone — these were made for people to wear and I loved that so much.\n\n@dawn_images Indian designer Naushad Ali was pretty happy to be in Moscow for the #bricsfashionsummit ☺️ #naushadali #moscow ♬ original sound - Dawn IMAGES\n\nHe described the experience of being at the summit in Moscow as “amazing”. “It’s been an amazing experience to be alongside fellow designers from India. We showcased something incredible from different parts of India with craftsmen and each of us did a very unique collection in its own way and what better way to talk about India on an international platform?” he told Images.\n\nKhanijo\n\nPerhaps one of my favourite designers at the summit was Gaurav Khanijo, who seamlessly blended modernity with eclectic designs, showcasing a range of menswear that we need to see men wearing.\n\nThere was colour, there was playing with embroidery and patterns and there was gorgeous mehndi.\n\nThough some of the clothes may seem too outré for everyday wear, I think they could be the statement pieces so many men need in their closets. Get rid of the boring black coats and pants and get yourself something that makes people do a double take.\n\nThe additional details of the mehndi on the models’ hands and feet and the anklets around their ankles was amazing — giving his show a touch of personalisation and colour.\n\n@dawn_images There was a lot to take in at the faahion shows at the #bricsfashionsummit in #moscow There were designers from all over the world showcasing their designs including #turkish and #indian designers ♬ Neon Bass - Tangelene Bolton\n\nAldrè\n\nIndonesian designer Aldrè wowed with his designs that combined asymmetrical cuts, black and white accents and — rather perplexingly — dragon scales and horns.\n\nThe designer was able to use these interesting elements to create eye-catching pieces that were as at home on the runway as they would be on the streets. Like the true Pakistani I am, I had to go get a feel for the clothes — literally — and the dragons were made of what seemed to be a hard, heavy plastic.\n\nAldrè’s designs are also wearable, at least in my eyes. His would be statement pieces, lighting up your wardrobe and giving your basics the upgrade they truly need.\n\nThe most interesting thing to me was how each designer I spoke to wanted to reach new audiences with their clothes. None of them were making clothes just for their own country-people — they wanted their clothes to reach new people and they all believed coming all the way to Russia was the way to do it."
    },
    {
        "title": "Pakistan eyes BRICS membership, seeks Russia’s help",
        "description": "Pakistan has applied for BRICS membership and sought Russia’s support, the country’s envoy to Moscow Muhammad Khalid Jamali has said",
        "content": "Russia's President Vladimir Putin arrives for a welcome ceremony in Ufa on 9 July 2015 at the start of the 7th BRICS summit. Leaders of the BRICS. — AFP\nISLAMABAD: Pakistan has applied for BRICS membership and sought Russia’s support, the country’s e... [860 chars]",
        "url": "https://www.thenews.com.pk/print/1131693-pakistan-eyes-brics-membership-seeks-russia-s-help",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2023-11-23/l_1131693_053324_updates.jpg",
        "publishedAt": "2023-11-22T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "Russia's President Vladimir Putin arrives for a welcome ceremony in Ufa on 9 July 2015 at the start of the 7th BRICS summit. Leaders of the BRICS. — AFP\n\nISLAMABAD: Pakistan has applied for BRICS membership and sought Russia’s support, the country’s envoy to Moscow Muhammad Khalid Jamali has said.\n\nThere has been no comment from the Foreign Office without whose approval Jamali (who is yet to present his credentials) would not have made this revelation.\n\nAccording to media reports, Jamali was talking to the Russian news agency TASS in which he revealed that Pakistan had filed an application to join the BRICS and was counting on Russia’s assistance.\n\nJamali said Pakistan had already applied for membership of the BRICS, which was set to expand next year with the admission of six new members.\n\nJamali said Islamabad planned to join the group under Russia’s presidency next year.\n\nPakistan would like to be a part of this important organisation and we are in the process of contacting member countries for extending support to Pakistan’s membership in general and the Russian Federation in particular, he said."
    },
    {
        "title": "The rise of BRICS",
        "description": "The G7 summit in Elmau, Germany, June 26-28, and the NATO summit in Madrid, Spain, two days later, were practically useless in terms of providing actual solutions to ongoing global crises –...",
        "content": "The G7 summit in Elmau, Germany, June 26-28, and the NATO summit in Madrid, Spain, two days later, were practically useless in terms of providing actual solutions to ongoing global crises – the war in Ukraine, the looming famines, climate change and ... [6065 chars]",
        "url": "https://www.thenews.com.pk/print/975620-the-rise-of-brics",
        "image": "https://www.thenews.com.pk/assets/front/img/no-img-fb.jpg",
        "publishedAt": "2022-07-21T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "The G7 summit in Elmau, Germany, June 26-28, and the NATO summit in Madrid, Spain, two days later, were practically useless in terms of providing actual solutions to ongoing global crises – the war in Ukraine, the looming famines, climate change and more. But the two events were important, nonetheless, as they provide a stark example of the impotence of the West, amid the rapidly changing global dynamics.\n\nAs was the case since the start of the Russia-Ukraine war, the West attempted to display unity, though it has become repeatedly obvious that no such unity exists. While France, Germany and Italy are paying a heavy price for the energy crisis resulting from the war, Britain’s Boris Johnson is adding fuel to the fire in the hope of making his country relevant on the global stage following the humiliation of Brexit. Meanwhile, the Biden Administration is exploiting the war to restore Washington’s credibility and leadership over Nato – especially following the disastrous term of Donald Trump, which nearly broke up the historic alliance.\n\nEven the fact that several African countries are becoming vulnerable to famines – as a result of the disruption of food supplies originating from the Black Sea and the subsequent rising prices – did not seem to perturb the leaders of some of the richest countries in the world. They still insist on not interfering in the global food market, though the skyrocketing prices have already pushed tens of millions of people below the poverty line.\n\nThough the West had little reserve of credibility to begin with, Western leaders’ current obsession with maintaining thousands of sanctions on Russia, further NATO expansion, dumping yet more ‘lethal weapons’ in Ukraine and sustaining their global hegemony at any cost, have all pushed their credibility standing to a new low.\n\nFrom the start of the Ukraine war, the West championed the same ‘moral’ dilemma as that raised by George W Bush at the start of his so-called ‘war on terror’. “You are either with us or with the terrorist,” he declared in October 2009. But the ongoing Russia-Nato conflict cannot be reduced to simple and self-serving cliches. One can, indeed, want an end to the war, and still oppose US-western unilateralism. The reason that American diktats worked in the past, however, is that, unlike the current geopolitical atmosphere, a few dared oppose Washington’s policies.\n\nTimes have changed. Russia, China, India, along with many other countries in Asia, the Middle East, Africa and South America are navigating all available spaces to counter the suffocating western dominance. These countries have made it clear that they will not take part in isolating Russia in the service of Nato’s expansionist agenda. To the contrary, they have taken many steps to develop alternatives to the west-dominated global economy, and particularly to the US dollar which, for five decades, has served the role of a commodity, not a currency, per se. The latter has been Washington’s most effective weapon, associated with many US-orchestrated crises, sanctions and, as in the case of Iraq and Venezuela, among others, mass hunger.\n\nChina and others understand that the current conflict is not about Ukraine vs Russia, but about something far more consequential. If Washington and Europe emerge victorious, and if Moscow is pushed back behind the proverbial ‘iron curtain’, Beijing would have no other options but to make painful concessions to the re-emerging west. This, in turn, would place a cap on China’s global economic growth, and would weaken its case regarding the One China policy.\n\nChina is not wrong. Almost immediately following Nato’s limitless military support of Ukraine and the subsequent economic war on Russia, Washington and its allies began threatening China over Taiwan. Many provocative statements, along with military maneuvers and high-level visits by US politicians to Taipei, were meant to underscore US dominance in the Pacific.\n\nTwo main reasons drove the West to further invest in the current confrontational approach against China, at a time where, arguably, it would have been more beneficial to exercise a degree of diplomacy and compromise. First, the West’s fear that Beijing could misinterpret its action as weakness and a form of appeasement; and, second, because the West’s historic relationship with China has always been predicated on intimidation, if not outright humiliation. From the Portuguese occupation of Macau in the 16th century, to the British Opium Wars of the mid-19th century, to Trump’s trade war on China, the West has always viewed China as a subject, not a partner.\n\nThis is precisely why Beijing did not join the chorus of western condemnations of Russia. Though the actual war in Ukraine is of no direct benefit to China, the geopolitical outcomes of the war could be critical to the future of China as a global power.\n\nWhile Nato remains insistent on expansion so as to illustrate its durability and unity, it is the alternative world order led by Russia and China that is worthy of serious attention. According to the German Frankfurter Allgemeine Zeitung, Beijing and Moscow are working to further develop the BRICS club of major emerging economies to serve as a counterweight to the G7. The German paper is correct. BRICS’ latest summit on June 23 was designed as a message to the G7 that the West is no longer in the driving seat, and that Russia, China and the Global South are preparing for a long fight against Western dominance.\n\nIn his speech at the BRICS summit, Russian President Vladimir Putin proposed the creation of an “international reserve currency based on the basket of currencies of our countries”. The fact that the ruble alone has managed to survive, in fact flourish, under recent Western sanctions, gives hope that BRICS currencies combined can manage to eventually sideline the US dollar as the world dominant currency.\n\nReportedly, it was Chinese President Xi Jinping who requested that the date of the BRICS summit be changed from July 4 to June 23, so that it would not appear to be a response to the G7 summit in Germany. This further underscores how the BRICS are beginning to see themselves as a direct competitor to the G7.\n\nExcerpted: ‘The Rise of BRICS: The Economic Giant that is Taking on the West’. Courtesy: Counterpunch.org"
    },
    {
        "title": "BRICS and Iran",
        "description": "Latest News Breaking Russia Ukraine Pakistan the nation Nusrat",
        "content": "Tectonic shifts are on the rise in international politics. Recently, Iran applied to join BRICS, a group consisting of Brazil, Russia, India, China and South Africa. On a global level, BRICS represents 40 percent of the world population and 26 percen... [3890 chars]",
        "url": "https://nation.com.pk/2022/07/21/brics-and-iran/",
        "image": "https://nation.com.pk/storage/2022/07/logo-320.png",
        "publishedAt": "2022-07-21T01:45:53Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "Tectonic shifts are on the rise in international politics. Recently, Iran applied to join BRICS, a group consisting of Brazil, Russia, India, China and South Africa. On a global level, BRICS represents 40 percent of the world population and 26 percent of the world economy. According to IMF data, China has the largest economy in this group and accounts for more than 70 percent of the BRICS total worth of around $27.5 trillion, while India comes in second at 13 percent and Russia and Brazil comprise the remaining 7 percent.With Iran’s entry, more value could be added to BRICS, as it holds around a quarter of the Middle East’s oil reserves and the second-largest global gas reserves. Since joining the Shanghai Cooperation Organisation (SCO) last year, this participation in BRICS is Iran’s second step toward the East. Feng Xingke, secretary-general of the World Financial Forum and director of the Center for BRICS and Global Governance, told the Global Times that including Iran in BRICS will mean closer and more effective channels between resources and markets, which will benefit all members. Now here we must give credit to Iran’s foreign policy. The Rouhani administration was trying to pursue a balanced foreign policy and believed that having normal relations with the West is the key to expanding relations with the East and vice versa. But since President Raisi took over last year, Iranian foreign policy has increasingly become anti-Western in the traditional sense of the word. Iran’s moves to join different non-Western groupings, from SCO to BRICS, are presented as the inevitable path the country needs to take in a world in which—as the narrative goes—the West is experiencing a political, economic and moral decline. In that sense, even the JCPOA if revived is a tactical solution, while Eastward policy is strategic.However, even though it was the 20th anniversary of BRICS last year, its achievements have remained debatable. In 2017, a BRICS plus concept was also introduced to link more emerging economies and build consensus on global development, but the group seems to be hampered by these basic factors.To start with, China has become the world’s second-largest economic power, while Brazil, Russia and South Africa have remained far behind. Only Beijing has moved forward in the group while other member countries may be large in size but are not equal in wealth. Though there are annual meetings, intra-BRICS economic cooperation has remained very limited. Next, most member countries have divergent political interests. While Russia and China may view it as a forum for “building a more balanced global order,” India is part of the Quadrilateral Security Dialogue, also known as the Quad, and is reluctant to be labelled anti-West. And now, New Delhi and Beijing also have an ongoing military standoff at their mutual border—a temporary line called the Line of Actual Control. Discussing why India had joined BRICS, Ashok Swain, professor of peace and conflict research at Uppsala University in Sweden, told Al-Monitor, “India decided to join BRICS in 2006 when its economy was booming and is expected to catch up with China in economic development.Russian diplomacy was behind creating this bloc at that time, but not precisely to make it an anti-American grouping. Russia wanted India in it to balance China, for India it was a platform to maintain a cooperative structure with China and Russia while developing its strategic relationship with the West.” Considering Iran’s chemistry with Beijing and Moscow, Swain observed, “Iran will benefit considerably by joining BRICS, as it does not intend to be an ally of the West and its relations with China and Russia are more as a junior ally, not as a competitor. As part of BRICS, there is a lot for Iran to gain, economically and diplomatically.” Ultimately, BRICS could become a club of the world’s largest energy producers and consumers outside the United States. For a while, the forum has been working on a mutual payment system, credit rating agency, currency bank and reserve mechanism. In this way, member countries might escape US sanctions."
    },
    {
        "title": "India’s diplomatic success",
        "description": "India has established mutually beneficial bilateral and multilateral relations with various countries; it is a member of pertinent alliance systems like BRICS , Quadrilateral Security Dialogue ,...",
        "content": "India has established mutually beneficial bilateral and multilateral relations with various countries; it is a member of pertinent alliance systems like BRICS (Brazil, Russia, India, China and South Africa), Quadrilateral Security Dialogue (QUAD), wh... [5805 chars]",
        "url": "https://www.thenews.com.pk/print/973188-india-s-diplomatic-success",
        "image": "https://www.thenews.com.pk/assets/front/img/no-img-fb.jpg",
        "publishedAt": "2022-07-12T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "India has established mutually beneficial bilateral and multilateral relations with various countries; it is a member of pertinent alliance systems like BRICS (Brazil, Russia, India, China and South Africa), Quadrilateral Security Dialogue (QUAD), which includes Australia, Japan, and the US, and the Association of SouthEast Asian Nations (ASEAN).\n\nIndia’s tactful handling of international relations has transitioned the country from a ‘non-allied’ country to an ‘ally’ of all. India is going to be part of a new alliance in the making, the I2U2, which includes Israel, the US and the UAE.\n\nInclusion in alliance systems has benefitted India in three ways. First, the perception of India as a non-allied country has been changed; second, its trade relations with ally countries have improved, leading to foreign investments; third, India’s ‘say’ in international politics has become meaningful.\n\nOther than becoming part of alliances, India has adroitly developed bilateral relations with various countries. India has free trade agreements (FTAs) with 13 countries, including economic giants like the US and Australia. It is also in the process of negotiating an FTA with Israel. India has preferential market access and economic cooperation agreements with over 50 countries.\n\nIndia’s ‘Act Asia’ policy opened up India with countries in the Far East. In 2021, Singapore was the top investor in India with investments worth $15. 7 billion. In pursuance of the ‘Act Asia’ policy, India concluded FTAs with ASEAN countries, Japan and Korea. Indian exports to Korea alone stands at $8 billion.\n\nMost interestingly, despite targeting the Muslim minority within, India is vigorously improving its relations with Muslim countries, including Afghanistan; it is the first country to conclude a strategic partnership agreement with Afghanistan in 2011. In the post-US-withdrawal scenario, India is keenly looking at developments in Afghanistan and is fervent to establish relations with the country. It facilitated a regional dialogue on Afghanistan in 2021 to bring all stakeholders to the table. China and subsequently Pakistan did not take part in the moot.\n\nOther than Afghanistan, India is successfully engaged in terms of trade with various other Muslim countries. Indian exports to Saudi Arabia are nearly $8 billion. Its exports to Iraq are $2 billion; UAE, $28 billion; Bangladesh, $16 billion; Qatar, $1 billion; Nigeria $4 billion; Malaysia, $6 billion; and Indonesia, $8 billion.\n\nIndia is maintaining ‘strategic autonomy’ in its relations with all countries. Notwithstanding the pressure from the US, it is astutely maintaining its relations with Iran. In early June this year, Iran’s Foreign Minister Hossein Amir-Abdollahian visited India. Also, the country is all set to attend the maiden I2U2 summit along with the UAE, Israel and the US. On the one hand, it is engaging with Israel, Saudi Arabia and the US, and on the other, it is solidifying its relations with Iran. India is the only country to get a waiver from sanctions on Iran to buy crude oil.\n\nThis shows India’s success in diversifying its relations and keeping the ability to proceed internationally on its terms. India also has good relations with Russia. Its exports to Russia are around $3 billion. And, according to ‘Reuters’, Russia remained a top supplier of crude oil to India in April 2022. Despite the fact that the EU and the US are vehemently opposing Russia on the Ukraine situation, India has adamantly refrained from doing so.\n\nIndia abstained from the UN vote to remove Russia from the Human Rights Council and various other procedural votes against it. Surprisingly, the West, including the US, has accepted India’s stringent behaviour regarding its relations with Russia and Iran. In a recent press conference, Spokesperson of the US Department of State Ned Price said, “[The] US has sought a partnership with India, has sought to be a partner of choice for India, including when it comes to the reality realm”. And he added that the US had made it clear to “our Indian partners that we are there for them, we are ready and able and willing to partner with them, and we’ve done just that.”\n\nEven China is keen to have working relations with India. China has been the largest trading partner of India, other than the US. The two countries’ bilateral trade reached $31 billion in the first quarter of 2022, indicating an increase of about 15 per cent from the previous year. This again is a success of Indian diplomacy; that despite being used as a ‘counterweight’ of China by Western nations, India is actively engaged in economic relations with China.\n\nIndia has transitioned from a protectionist country to a global trading partner. It has improved the procedures of doing business in the country. In a report prepared by the World Bank, ‘Ease of Doing Business’, India stands at 63rd position. Pakistan is at 108th position, out of 188 countries. This improvement in the ranking is partly due to the fact that India had attracted foreign direct investment of around $572 billion between April 2000 and December 2021.\n\nThe question is: why are countries eager to establish security and economic relations with India? The two-pronged answer to this question is: first, India appears to be an eligible country that can be ‘prepared’ against the Chinese economic expansion which threatens the Western order. Therefore, the US and other Western countries are more than willing to establish security and economic relations with India. Second, countries that are investing in India, irrespective of the global competition, are doing so because of the country’s investment-friendly procedures and political stability.\n\nFor investment to take root, stability is the first prerequisite. In order to generate economic activity, internal capacity constituting stability and investment-friendly mechanisms need to be built. With stability within, India is now on the road to become the third biggest economy.\n\nThe writer is a research analyst at the Institute of Regional Studies, Islamabad."
    },
    {
        "title": "BRICS at the crossroads",
        "description": "Latest News Breaking Russia Ukraine Pakistan the nation Nusrat",
        "content": "The 2022 BRICS Summit’s theme focused on high-quality partnerships to usher in a new era for global development. The leaders of China, Russia, India, Brazil and South Africa reiterated the need to resolve the Iranian nuclear issue in accordance with ... [6153 chars]",
        "url": "https://nation.com.pk/2022/07/04/brics-at-the-crossroads/",
        "image": "https://nation.com.pk/storage/2022/07/Najm-us-Saqib.jpg",
        "publishedAt": "2022-07-04T01:09:34Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "The 2022 BRICS Summit’s theme focused on high-quality partnerships to usher in a new era for global development. The leaders of China, Russia, India, Brazil and South Africa reiterated the need to resolve the Iranian nuclear issue in accordance with international law while committing to respect the sovereignty and territorial integrity of all States. They also expressed commitment to the peaceful resolution of dissimilitude and expostulations between countries through dialogue. As before, the thirteen-year old BRICS, just like the UN, used familiar language to support a peaceful, secure and stable Afghanistan with a broad-based, inclusive and representative political structure; complete denuclearization of the Korean Peninsula; strengthening the system of arms control and a peaceful and prosperous Middle East and North Africa. The Group also reaffirmed its commitment to nuclear disarmament and a world free of nuclear weapons.With the ongoing war in Ukraine, it was inevitable that the Summit emphasized the need to respect the ‘territorial integrity’ of all States. Similarly, by focusing on having a peaceful resolution of disputes, the Summit indirectly pointed toward all international and regional disputes including Palestine and Kashmir that needed a final settlement. The Group’s resolve to have reforms of the UN’s principal organs once again indicated the apparent loopholes in collectively addressing global issues. The Summit also revealed its intent to reduce the IMF’s reliance on temporary resources and addressed the under-representation of emerging markets and developing countries for their meaningful engagement in the Fund’s governance. Understandably, the adverse effects of the COVID-19 pandemic that ‘weakened the economic prospects’ also came under discussion.Many would argue that mentioning the issues is one thing, but abiding by the corresponding resolve is a totally different ballgame. Hence, the Summit Declaration was silent on the steps taken collectively or individually in addressing the Afghan issue or Iran’s nuclear programme or the denuclearization of the Korean Peninsula or BRICS’ intentions to practically address such and other global security issues. Nonetheless, with the presence of three nuclear States in the Summit, the desire to see a nuclear-free world must be seen and appreciated as a strong message to the world. Similarly, with the presence of four of the top ten industrial countries, the Summit rightly emphasized the need to adhere to the UN Framework Convention on Climate Change (UNFCCC) and the Paris Agreement.As peaceful countries like Pakistan would desire, the Summit emphasized that Afghan territory should not be used to threaten or attack any country or shelter or train terrorists, or plan to finance terrorist acts. ‘We are committed to combating terrorism in all its forms and manifestations, including the cross-border movement of terrorists, and terrorism financing networks and safe-havens. We also look forward to further deepening counter-terrorism cooperation.’ Just like any other UN document, the Summit Declaration was silent on exactly how ‘we’ are going to go about this extremely dangerous animal.The Summit’s message on Ukraine was loud and clear. Well, with Russia and China present, BRICS’ response on a European country being Ukrained was but expected. China, India and South Africa had already made their position on the war in Ukraine clear by abstaining on the UN vote against Russia. However, Brazil’s position on Ukraine was different. In February, Brazil figured among those eleven countries that voted in favour of the Resolution against Russia. China and Russia being its most important trading partners, particularly in the agriculture sector, a pro-US Brazil, however, might have felt a little uncomfortable in finalizing paragraph twenty-two of the Declaration that ‘supports’ talks between Russia and Ukraine besides supporting the efforts of the UN Secretary-General and other Agencies to provide humanitarian assistance to the deserving people of Ukraine. Would the Western countries led by the US be concerned about the Summit’s expressed view on having ‘talks’ being the only way to stop the war in Ukraine? All of us know the answer…As one of the non-Member-States, Pakistan was due to participate in the ‘Dialogue on Global Development’ on the sidelines of the Summit. Pakistan could not attend the Dialogue as according to the Foreign Office, an unnamed country ‘blocked’ its participation even in this otherwise harmless discussion. The question is: What was the logic or diplomatic wisdom behind creating a mystery by not naming the country that blocked Pakistan’s participation? The situation becomes even more contentious if the blocking country or the ‘instigator’ was not India. And by all calculations, if it was India, which factors restricted Islamabad from keeping the ‘culprit’ behind the curtain? The more serious question is: With China being the Summit’s host and an admirer of Pakistan’s ‘important role’ in advancing the UN-2030 Agenda for Sustainable Development, how is it that Islamabad’s diplomacy in Beijing, Pretoria, Moscow and Brasilia proved so ineffective?Since the inaugural BRIC meeting in the Russian city of Yekaterinburg in 2009—before South Africa was made a Member— the Group remains unhindered in its endeavours of countering the West, particularly in the economic and political domains. With a combined GDP (PPP) of around $40 trillion and producer of one-thirds of the world’s food, BRICS was once sounded as the future of the world’s economy, capable of creating a parallel global financial institution. As the five-Member-States have grown unequally and in the presence of multiple political, territorial and economic disputes amongst themselves, the Group has been counter-intuitive to its diplomatic and economic objectives. China is becoming a superpower while the remaining quartet keeps treading along modestly. It is then no surprise that the Group has a fair share of naysayers, particularly in view of its comparative ineffectiveness in making an impact on issues of global interest. Although BRICS finds itself at the crossroads, it remains the most important Alliance for all its five Members. Let us hope the 2023 BRICS Summit in South Africa, produce some concrete results at least for its Members if not for the world at large."
    },
    {
        "title": "BRICS member blocked invite to China dialogue: FO",
        "description": "ISLAMABAD: The Foreign Office disclosed on Monday that a member of the five-nation summit BRICS blocked Pakistan's participation in the High-Level Dialogue on Global Development hosted by China on...",
        "content": "The Foreign Office building in Islamabad. Photo: The News/File\nISLAMABAD: The Foreign Office disclosed on Monday that a member of the five-nation summit BRICS (Brazil-Russia-India-China-South Africa) blocked Pakistan's participation in the High-Level... [2114 chars]",
        "url": "https://www.thenews.com.pk/print/969816-brics-member-blocked-invite-to-china-dialogue-fo",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2022-06-28/969816_070844_updates.jpg",
        "publishedAt": "2022-06-27T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "The Foreign Office building in Islamabad. Photo: The News/File\n\nISLAMABAD: The Foreign Office disclosed on Monday that a member of the five-nation summit BRICS (Brazil-Russia-India-China-South Africa) blocked Pakistan's participation in the High-Level Dialogue on Global Development (HLDGD) hosted by China on June 24.\n\nThe clarification came three days after the dialogue and it stated that the event had taken place on the sidelines of BRICS summit. Incidentally, a Chinese spokesman had also offered a clarification on account of Pakistan’s absence where the reference of it being blocked by a country and the forum’s holding on the sidelines of the BRICS were evidently missing.\n\nMeanwhile, in response to media queries about the High-level Dialogue on Global Development held virtually on the sidelines of the BRICS meetings, a Foreign Office spokesperson said that Pakistan — with the cooperation of China — is fully committed to taking bilateral and multilateral cooperation to new heights.\n\nAccording to the foreign ministry spokesperson, a number of developing and emerging economies were invited to the high-level dialogue on global development. As the host country, China was engaged with Pakistan prior to the BRICS meetings, where decisions are made after consultations with all BRICS members, including invitations to non-members, the statement read. “Regrettably, one member blocked Pakistan from participating,” it added.\n\nAccording to sources, India blocked Pakistan from participating in the BRICS summit. “We hope that the organisation’s future engagement will be based on principles of inclusivity, with the overall interests of the developing world in mind, and free of narrow geopolitical considerations,” the spokesperson's statement read.\n\nIt said Pakistan values China's role in advancing the interests of developing countries, adding that Pakistan, along with China, has been a strong advocate for global peace, shared prosperity and inclusive development.\n\nPakistan is the current chair of the G77+China and a member of the Global Development Initiative's (GDI) group of friends. \"Pakistan and China are all-weather strategic partners and our iron brotherhood is unbreakable,\" the statement read. \"Pakistan stands ready to work with all developing countries, including BRICS members, to address the global community's challenges,\" it concluded."
    },
    {
        "title": "BRICS member blocked Pakistan’s invitation to development dialogue: FO",
        "description": "Latest News Breaking Russia Ukraine Pakistan the nation Nusrat",
        "content": "Foreign Office Spokesperson Asim Iftikhar on Monday while congratulating China on successful hosting BRICS Summit said that a country blocked its participation in a high-level dialogue on global development held virtually on the sidelines of the BRIC... [1619 chars]",
        "url": "https://nation.com.pk/2022/06/27/brics-member-blocked-pakistans-invitation-to-development-dialogue-fo/",
        "image": "https://nation.com.pk/storage/2022/06/MOFA.jpg",
        "publishedAt": "2022-06-27T13:31:23Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "Foreign Office Spokesperson Asim Iftikhar on Monday while congratulating China on successful hosting BRICS Summit said that a country blocked its participation in a high-level dialogue on global development held virtually on the sidelines of the BRICS meetings last week.Responding to media queries about a ‘High-level Dialogue on Global Development’ held virtually on sidelines of the BRICS meetings, the FO spokesperson said Pakistan stands ready to work with all developing countries, including the BRICS members for addressing the challenges faced by the global community.Asim Iftikhar said, “We have noted that this year a “High-level Dialogue on Global Development” was held as a BRICS side event in which a number of developing and emerging economies were invited.”He said China being the host country engaged with Pakistan prior to the BRICS meetings, where decisions are taken after consultations with all BRICS members, including extending invitation to non-members.Regrettably one member blocked Pakistan’s participation, he said. “However, we do hope that future engagement of the organization would be based on the principles of inclusivity keeping in view the overall interests of the developing world and in a manner that is devoid of narrow geo-political considerations,” he said.He said, “We appreciate China’s role in promoting the interests ofthe developing countries”, adding that together with China, Pakistan has been a strong voice for global peace, shared prosperity and inclusive development.Pakistan is the current chair of G77+China and also part of group of friends of the Global Development Initiative (GDI).Pakistan and China are all-weather strategic partners and our iron brotherhood remains rock solid. The two countries are fully committed to take our all-round cooperation to higher levels both bilaterally and multilaterally."
    },
    {
        "title": "BRICS member blocked Pakistan’s invitation to event in China: FO",
        "description": "The Foreign Office has confirmed that Pakistan’s invitation to a development dialogue held in China on June 24 was blocked by a BRICS member.",
        "content": "China hosted High-level Dialogue on Global Development\nPakistan was not invited to the event.\nPakistan’s invitation was reportedly blocked by India.\nISLAMABAD: The Foreign Office has confirmed that Pakistan’s invitation to a development dialogue held... [2247 chars]",
        "url": "https://www.bolnews.com/latest/2022/06/brics-member-blocked-pakistans-invitation-to-event-in-china-fo/",
        "image": "https://bolnews.s3.amazonaws.com/wp-content/uploads/2022/06/china-1.jpg",
        "publishedAt": "2022-06-27T08:43:52Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "China hosted High-level Dialogue on Global Development\n\nPakistan was not invited to the event.\n\nPakistan’s invitation was reportedly blocked by India.\n\nAdvertisement\n\nISLAMABAD: The Foreign Office has confirmed that Pakistan’s invitation to a development dialogue held in China on June 24 was blocked by a BRICS member.\n\nBRICS is the acronym coined to associate five major emerging economies – Brazil, Russia, India, China, and South Africa. This year, China hosted a BRICS event and invited 13 other countries. The absence of Pakistan from the event had raised eyebrows amid Beijing’s push to expand the bloc.\n\nResponding to media queries about a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS meetings, the Foreign Office spokesperson confirmed that “regrettably” one member blocked Pakistan’s participation.\n\nThe spokesperson said Pakistan congratulates China on the successful hosting of the BRICS meetings. He noted that a “High-level Dialogue on Global Development” was held as a BRICS side event in which a number of developing/emerging economies were invited.\n\n“China being the host country engaged with Pakistan prior to the BRICS meetings, where decisions are taken after consultations with all BRICS members, including extending invitation to non-members,” the spokesperson added.\n\nREAD MORE: Russia urges BRICS countries to integrate payment systems and cards\n\nAdvertisement\n\nWithout naming any country, the spokesperson said one BRICS member blocked Pakistan’s participation in the event.\n\n“We hope that future engagement would be based on the principles of inclusivity keeping in view the overall interests of the developing world and in a manner that is devoid of narrow geo-political considerations,” the statement added.\n\nThe Foreign Office appreciated China’s role in promoting the interests of the developing countries. it added that together with China, Pakistan has been a strong voice for global peace, shared prosperity and inclusive development.\n\nPakistan is the current chair of G77+China and also part of group of friends of the Global Development Initiative (GDI).\n\n“Pakistan and China are all-weather strategic partners and our iron brotherhood remains rock solid. The two countries are fully committed to take our all-round cooperation to higher levels both bilaterally and multilaterally.”\n\n“Pakistan stands ready to work with all developing countries, including the BRICS members for addressing the challenges faced by the global community,” it concluded."
    },
    {
        "title": "FO confirms Pakistan’s participation in BRICS summit was blocked by a member",
        "description": "ISLAMABAD: The Foreign Office on Monday confirmed that Pakistan’s participation in a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS...",
        "content": "FO Spokesperson Asim Iftikhar. -Picture FO website\nISLAMABAD: The Foreign Office (FO) on Monday confirmed that Pakistan’s participation in a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS meetings was blocked... [1734 chars]",
        "url": "https://www.thenews.com.pk/latest/969587-fo-confirms-pakistans-participation-in-brics-summit-was-blocked-by-a-member",
        "image": "https://www.thenews.com.pk/assets/uploads/updates/2022-06-27/969587_010748_updates.jpg",
        "publishedAt": "2022-06-26T19:00:00Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "full_content": "FO Spokesperson Asim Iftikhar. -Picture FO website\n\nISLAMABAD: The Foreign Office (FO) on Monday confirmed that Pakistan’s participation in a ‘High-level Dialogue on Global Development’ held virtually on the sidelines of the BRICS meetings was blocked by a member.\n\n\n\nIn response to media queries about why Pakistan was not invited to the summit, the FO spokesperson said, “China being the host country engaged with Pakistan prior to the BRICS meetings, where decisions are taken after consultations with all BRICS members, including extending invitations to non-members.”\n\n“Regrettably one member blocked Pakistan’s participation,” it added.\n\nBRICS has five member namely Brazil, Russia, India, China and South Africa and considering the rift between Pakistan and India, it is believed that New Dehli might have blocked Islamabad's participation in the conference.\n\nRelated Stories Pakistan not invited to dialogue held in China\n\nCongratulating China on the successful hosting of the BRICS meetings, the FO hoped that future engagement of the organisation would be based on the principles of inclusivity keeping in view the overall interests of the developing world and in a manner that is devoid of narrow geo-political considerations.\n\n\n\n“We appreciate China’s role in promoting the interests of the developing countries. Together with China, Pakistan has been a strong voice for global peace, shared prosperity and inclusive development. Pakistan is the current chair of G77+China and also part of the group of friends of the Global Development Initiative(GDI).”\n\nThe spokesperson added that Pakistan and China are all-weather strategic partners and their iron brotherhood remains rock solid.\n\n“The two countries are fully committed to take our all-round cooperation to higher levels both bilaterally and multilaterally.\n\nThe FO reiterated that Pakistan stands ready to work with all developing countries, including the BRICS members for addressing the challenges faced by the global community."
    },
    {
        "title": "BRICS countries determine to make pie of cooperation bigger and force for progress stronger",
        "description": "Latest News Breaking Russia Ukraine Pakistan the nation Nusrat",
        "content": "By Guo Jiping, People’s Daily\nAfter five years, the BRICS cooperation has once again ushered in the “China Year”. As the BRICS chair for 2022, China will host the 14th BRICS Summit under the theme of “forming a high-quality partnership to jointly cre... [5295 chars]",
        "url": "https://nation.com.pk/2022/06/20/brics-countries-determine-to-make-pie-of-cooperation-bigger-and-force-for-progress-stronger/",
        "image": "https://nation.com.pk/storage/2021/10/cropped-cropped-logo-nation.png",
        "publishedAt": "2022-06-19T22:55:52Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "ByAfter five years, the BRICS cooperation has once again ushered in the “China Year”. As the BRICS chair for 2022, China will host the 14th BRICS Summit under the theme of “forming a high-quality partnership to jointly create a new era of global development”, attempting to make a new blueprint for high-quality development with BRICS partners and send a strong message to the international community of solidarity and cooperation.BRICS has evolved from an investment concept in a research report into the world’s first group with non-Western countries as the main body and an important force in the international stage that can’t be ignored.The extraordinary 16-year journey of the BRICS cooperation represents a new chapter of development and cooperation.Since the beginning of the 21st century, emerging markets and developing countries have generally exhibited stronger momentum and greater potential for development, playing an increasingly important role in the global economic landscape.Statistics indicate that the average annual gross domestic product (GDP) growth rate of emerging markets and developing countries was about 3.65 percentage points higher than that of developed countries from 2000 to 2019, and the proportion of their GDP in the world’s total rose to over 40 percent.The five BRICS countries, as representatives of emerging markets and developing countries, have 26.46 percent of the world’s land area and about 42 percent of the global population. Their contribution to world economic growth has grown to 50 percent in recent years. In 2020, the combined trade of the BRICS countries accounted for 16.98 percent of the world’s total. The solidarity and cooperation among the BRICS countries, which conform to the trend of human society progress and international landscape evolution, may seem like an accident, but is in fact historically inevitable.From the perspective of world development and international landscape advancement, the BRICS countries are in similar stages of development, shoulder similar historical missions, and share common development goals.The establishment of the BRICS mechanism embodies a trend of historic progress and the direction of human development.The BRICS mechanism brings a brand new option to the world, which is dialogue and cooperation, said a professor at the Durban University of Technology in South Africa.It can be seen from the respective and common development of the BRICS countries that they have established a three-wheel-driven comprehensive and multi-level cooperation architecture covering economy, political security and people-to-people exchanges guided by the BRICS leaders’ meetings.Throughout their journey, the BRICS countries have made active efforts to forge a new partnership of friendship rather than alliance, embarked on a new path featuring mutual respect and common development, and practiced a new concept of mutual benefits, common interests and cooperation for common development, becoming a vivid interpretation of building a new type of international relations.Jim O’Neill, who coined the term BRICs, pointed out that the development of the BRICS countries has greatly exceeded his expectations, which is mainly because of the strong driving force of China’s economic development.Since 2013, Chinese President Xi Jinping has delivered a series of important speeches at the BRICS summits and other occasions, contributing Chinese wisdom to, providing Chinese solutions for, and announcing pragmatic measures on “Where is the BRICS going?”, and injecting strong confidence into promoting the BRICS cooperation and global development.The status and role of the BRICS countries in multilateral mechanisms, including the United Nations (UN), the Group of 20 (G20), the World Bank and the International Monetary Fund, have been continuously strengthened, which has effectively enhanced the voice of emerging markets and developing countries in international discourse.“As a positive, inspiring and constructive force in the international community, the BRICS countries need to firm up belief, brave the storms and waves, and take real action to promote peace and development, uphold fairness and justice, and advocate democracy and freedom, so as to inject stability and positive energy into international relations in a period of turbulence and transformation,” said Xi when delivering a video address at the opening session of the BRICS Foreign Ministers’ Meeting lately.Xi’s remarks once again showed the world the composure and sense of responsibility of a major country and helped the world feel the value of the BRICS cooperation and its broad prospects.Countries need to move forward by following the logic of historical progress, and develop by riding the tide of development of our times, as Xi once said.In the face of the various risks and challenges of the day as well as the historical trend toward multipolarity and democratization of international relations, it is more than ever important for emerging markets and developing countries to strengthen solidarity and cooperation.Driven by the BRICS spirit of openness, inclusiveness and win-win cooperation, the BRICS countries have been engaged in drawing “concentric circles” for common development and getting more countries involved in the cause of solidarity and progress, so as to make the pie of cooperation bigger and the force for progress stronger, and contribute still more to the lofty vision of building a community with a shared future for mankind."
    },
    {
        "title": "Russia urges BRICS countries to integrate payment systems and cards",
        "description": "The Russian government has asked the BRICS group of developing economies, which includes Brazil, China, India, Russia,",
        "content": "The Russian government has asked the BRICS group of developing economies, which includes Brazil, China, India, Russia, and South Africa, to use national currencies for import-export transactions and to integrate payment systems.\nRussia has been slamm... [1460 chars]",
        "url": "https://www.bolnews.com/latest/2022/04/russia-urges-brics-countries-to-integrate-payment-systems-and-cards/",
        "image": "https://cdn.bolnews.com/wp-content/uploads/2022/04/FotoJet-6-26.jpg",
        "publishedAt": "2022-04-09T17:25:39Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "The Russian government has asked the BRICS group of developing economies, which includes Brazil, China, India, Russia, and South Africa, to use national currencies for import-export transactions and to integrate payment systems.\n\nRussia has been slammed by unprecedented Western sanctions since its invasion of Ukraine on February 24, cutting it off from the global financial system and nearly half of its gold and foreign exchange reserves, which stood at $606.5 billion in early April.\n\nMeanwhile, Visa and MasterCard, two major international payment cards, ceased operations in Russia in early March, and Russia’s largest banks lost access to the SWIFT global banking messaging system.\n\nAccording to a statement from his ministry, Russian Finance Minister Anton Siluanov told a ministerial meeting with BRICS on Friday that the global economic situation has deteriorated significantly as a result of the sanctions.\n\nAccording to Siluanov, the punitive measures also destroy the foundation of the present international monetary and financial system based on the US dollar.\n\nAdvertisement\n\n“This pushes us to the need to speed up work in the following areas: the use of national currencies for export-import operations, the integration of payment systems and cards, our own financial messaging system and the creation of an independent BRICS rating agency,” Siluanov said.\n\nAs an alternative to SWIFT, Russia developed its own banking messaging system, known as SPFS. MIR, the company’s own card payment system, went live in 2015.\n\nThey were part of Moscow’s efforts to establish homegrown financial tools that were similar to Western ones in order to safeguard the country in the event that sanctions against Moscow were expanded."
    },
    {
        "title": "African experts call for BRICS to expand scope after COVID-19",
        "description": "JOHANNESBURG, Feb. 23 (Xinhua) -- After COVID-19 exposed some challenges bedeviling the BRICS countries, there is a need to",
        "content": "JOHANNESBURG, Feb. 23 (Xinhua) — After COVID-19 exposed some challenges bedeviling the BRICS countries, there is a need to re-examine its strategies and integrate and expand its scope, said South African experts on Wednesday at the webinar “South Afr... [1719 chars]",
        "url": "https://www.bolnews.com/health/2022/02/african-experts-call-for-brics-to-expand-scope-after-covid-19/",
        "image": "https://cdn.bolnews.com/wp-content/uploads/2022/02/FotoJet-2022-02-24T004244.952.jpg",
        "publishedAt": "2022-02-23T19:43:24Z",
        "source": {
            "name": "BOL News",
            "url": "https://www.bolnews.com"
        },
        "full_content": "JOHANNESBURG, Feb. 23 (Xinhua) — After COVID-19 exposed some challenges bedeviling the BRICS countries, there is a need to re-examine its strategies and integrate and expand its scope, said South African experts on Wednesday at the webinar “South Africa and the BRICS: Revisiting developmental priorities”.\n\nThe Witwatersrand University School of Governance lecturer Lihle Ngcobozi said COVID-19 showed the problems of patents and vaccine nationalism that BRICS should address.\n\n“BRICS should lead and be trend or policy setters. They should lead in vaccine democratization,” she said.\n\nShe pointed out that BRICS countries have a potential influence on global decisions such as climate change and COVID-19. It should have a blueprint on infrastructure development, economic reforms, fiscal prudence, and post-economic recovery while respecting the sovereignty of the countries.\n\nKrish Chetty, the chief researcher at one of the country’s think tanks, the Human Science Research Council, said COVID-19 created new areas of cooperation.\n\nAdvertisement\n\nShe said while China quickly managed to adjust to online learning at a large scale, countries like South Africa, India and Brazil faced challenges.\n\n“We should continue with knowledge sharing on BRICS as think-tank and universities. There is a space to work together in renewable energy platforms and new technology. We must promote mass digital skills training for students and lecturers,” she said.\n\nSanusha Naidu, senior researcher at Institute for Global Dialogue concurred with other experts.\n\nShe pointed out that while BRICS made progress in building institutions like Contingent Reserve Arrangement, New Development Bank, there have been calls for the establishment of the digital payment system.\n\nNaidu called on members to address tariff and non-tariff measures which are barriers to trade within BRICS countries.\n\nThe webinar was organized by the South African Institute of International Affairs and South African BRICS Think Tank.\n\nAdvertisement\n\nAlso Read Oil rises, stocks struggle as Russia-Ukraine tensions mount LONDON, Feb 23, 2022 (AFP) - Oil prices pushed higher while stocks struggled..."
    },
    {
        "title": "India makes canny attempts to misuse BRICS to fulfill anti-Pakistan designs",
        "description": "ISLAMABAD - Deviating from BRICS’ sole objective of limited purpose partnership, India is making cunning attempts to use the forum to undermine Pakistan’s",
        "content": "Share:\nISLAMABAD - Deviating from BRICS’ sole objective of limited purpose partnership, India is making cunning attempts to use the forum to undermine Pakistan’s anti-terror achievements and sabotage the indigenous freedom movement of Kashmir through... [3347 chars]",
        "url": "https://nation.com.pk/29-Aug-2021/india-makes-canny-attempts-to-misuse-brics-to-fulfill-anti-pakistan-designs",
        "image": "https://nation.com.pk/print_images/large/2021-08-29/india-makes-canny-attempts-to-misuse-brics-to-fulfill-anti-pakistan-designs-1630180694-6963.jpg",
        "publishedAt": "2021-08-28T19:00:00Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "ISLAMABAD - Deviating from BRICS’ sole objective of limited purpose partnership, India is making cunning attempts to use the forum to undermine Pakistan’s anti-terror achievements and sabotage the indigenous freedom movement of Kashmir through agenda-setting. Constituting Brazil, Russia, India, China and South Africa, the BRICS brings together four continents with five major emerging economies accounting for 42% of the world’s population.\n\nIt is a “limited purpose partnership” as it was meant for interstate cooperation among group to rebalance global economy. With India holding its current chair, the BRICS summit is scheduled to be held on September 9 this year. Prelude to the summit, meeting of BRICS Counter Terrorism Working Group (CTWG) was also held in July and discussed the Foreign Terrorist Fighters (FTF).\n\nThough the NSAs’ meeting discussed the current situation in Afghanistan, India as usual tried its best to drag Pakistan into discussion without directly mentioning its name. India also remarked that Lashkar-e-Taiba (LeT) and Jaish-e-Mohammad (JeM) are enjoying a “state support”. In fact, in order to hide its internal vulnerabilities and embarrassment faced after takeover of Afghanistan by Taliban, India is once again using the “mantra” of “cross border terrorism” hinting Pakistan at BRICS forum which is not even meant to discuss such issues between two states. The forum is supposed to focus on economic gains instead of being exploited as a tool for political gains. National agendas of one particular member country should have no place in the forum. Historically, India has been using BRICS to target Pakistan and setting of terrorism as agenda for the meet by India is a canny attempt to undermine Pakistan’s extensive and successful efforts against terrorism.\n\nIndia is attempting to overshadow Pakistan’s counter terrorism achievements especially proscription of LeT and JeM and collaboration with global and regional countries amid US withdrawal to bring peace to Afghanistan. Besides, India is also likely to use this forum to sabotage the indigenous Kashmir freedom movement by labeling the freedom fighter as “Pakistan sponsored Foreign Terrorist Fighters (FTFs) during the upcoming BRICS Summit.\n\nThe Narendra Modi regime would try to convince the member states to tighten the monitoring and removal of material uploaded by Kashmiris on social media in the name of cyber security as “use of social media by terrorists is already on the BRICS meeting agenda.\n\nIndia is also likely to link the terror financing issue with the FATF and would try its utmost through “fake facts” to orchestrate a case to continue to keep Pakistan on the grey list.\n\nThe misuse of BRICS by India is nothing new as the country always misled forum members. While the rest of the BRICS members would never openly endorse either side in the Indo-Pakistan tension, India in a way tried to secure its stance vis-à-vis Pakistan by taking advantages of its agenda-setting powers for the summits. As a matter of fact, India is involved in financing and supporting terrorism in Pakistan but plays innocent at international forums including BRICS.\n\nIndia is totally flabbergasted and confused over the takeover of Afghanistan by the Taliban as all its mischievous notions carried out with the support of previous Afghan govt have failed and billions of dollars flooded in Afghanistan by India have gone for a six.\n\nTwo of the BRICS members, China and Russia have already welcomed Taliban and have shown their strong willingness to work with future Afghanistan leaving India in a great fix."
    },
    {
        "title": "BRICS seeks to prepare legally binding tool to prevent Arms Race in space",
        "description": "During Tuesday’s meeting, the heads of the BRICS member states – Brazil, Russia, China and South Africa – touched on issues of global importance,",
        "content": "Share:\nDuring Tuesday’s meeting, the heads of the BRICS member states – Brazil, Russia, China and South Africa – touched on issues of global importance, including the war in Syria, the fight against international terrorism, and the production and dis... [1657 chars]",
        "url": "https://nation.com.pk/17-Nov-2020/brics-seeks-to-prepare-legally-binding-tool-to-prevent-arms-race-in-space",
        "image": "https://nation.com.pk/digital_images/large/2020-11-17/brics-seeks-to-prepare-legally-binding-tool-to-prevent-arms-race-in-space-1605633737-3608.jpg",
        "publishedAt": "2020-11-16T19:00:00Z",
        "source": {
            "name": "The Nation",
            "url": "https://nation.com.pk"
        },
        "full_content": "During Tuesday’s meeting, the heads of the BRICS member states – Brazil, Russia, China and South Africa – touched on issues of global importance, including the war in Syria, the fight against international terrorism, and the production and distribution of a coronavirus vaccine.\n\nBRICS countries want to prepare a legally binding tool to prevent an in space, reads a declaration adopted at the group's 12th summit, which is being held on 17 November in Moscow.\n\n\"We emphasise the urgent need to agree on a multilateral legally binding accord that can fill the gap in the international framework regarding space, including an agreement that will prevent countries from deploying weapons, threatening, or using force against objects in outer space\", the BRICS group said in a statement.\n\nLast year, the United States created a sixth branch of the military called the Space Force, a decision that was criticised both domestically and abroad. Opponents of the move say it may result in an in space, which may threaten the world.\n\nMoscow has repeatedly stressed that it opposes the deployment of any types of weapons in space and has urged Washington to work together to prevent a new .\n\nDuring the 12th summit of the BRICS group, which was held earlier today, the leaders of the member states discussed issues of global importance. In the declaration adopted at Tuesday’s meeting, BRICS also spoke about: the need to adopt a UN convention on the fight against international terrorism; a renewal of talks on the Biological Weapons Convention. The group stressed that it is necessary to adopt a legally bindingprotocol that would create a verification mechanism to monitor how signatories honour their obligations; the importance of the New Strategic Arms Reduction Treaty and called on the parties to agree on an extension of the accord; a diplomatic resolution of the Korea issue;"
    }
]