[
    {
        "title": "Malaysia preparing for possible US tariffs by building trade relations with others: Anwar",
        "description": "US President Trump has warned Brics member countries of 100 per cent tariffs should the bloc create its own currency. Read more at straitstimes.com.",
        "content": "Malaysia's Prime Minister Anwar Ibrahim said his Cabinet is on the lookout for other trade partners, in the light of US' plan on imposing tariffs. PHOTO: REUTERS\nMalaysia preparing for possible US tariffs by building trade relations with others: Anwa... [5080 chars]",
        "url": "https://www.straitstimes.com/asia/se-asia/malaysia-preparing-for-possible-us-tariffs-by-building-trade-relations-with-others-anwar",
        "image": "https://cassette.sphdigital.com.sg/image/straitstimes/47f35c4d431922f4251f381ce952b9d08128abda4323dff4649f3fe0f3d4f1fb",
        "publishedAt": "2025-02-04T09:10:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "Malaysia's Prime Minister Anwar Ibrahim said his Cabinet is on the lookout for other trade partners, in the light of US' plan on imposing tariffs. PHOTO: REUTERS\n\nMalaysia preparing for possible US tariffs by building trade relations with others: Anwar\n\n– Malaysia is still uncertain if its partnership with Brics – an alliance of emerging economies – will have any adverse impact on its trade relationship with the US, following President Donald Trump’s warning that any attempt by Brics member countries to replace the US dollar as a reserve currency will be met with 100 per cent tariffs.\n\nPrime Minister Anwar Ibrahim told Parliament on Feb 4 that the Cabinet is preparing for all eventualities when it comes to any decision made by the Trump administration, due to geopolitical uncertainties.\n\n“We cannot make any hasty decisions. We are still unsure of its impact on the country. Therefore, we must prepare at the Cabinet level and at a few special committees for any eventuality.\n\n“Our involvement with Brics is still at an early stage,” said Datuk Seri Anwar.\n\nBrics, which originally consisted of Brazil, Russia, India, China and South Africa, has had discussions about establishing a new reserve currency. The group has expanded to include Indonesia, Egypt, Ethiopia, Iran and the United Arab Emirates.\n\nMalaysia is one of Brics’ nine partner countries, but is not a full-fledged member.\n\nDuring the 2024 Brics summit held in Russia in October which was also attended by the partner nations, the 10-member bloc had discussed the possibility of establishing a gold-backed currency as an alternative to the US dollar.\n\nOn Jan 31, Mr Trump repeated his threat to Brics members of 100 per cent tariffs should they go down the de-dollarisation route.\n\n“We are going to require a commitment from these seemingly hostile Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100 per cent Tariffs,” Mr Trump said on his Truth Social social media platform in a statement similar to one he posted in November 2024.\n\nBut the Kremlin brushed off the threat, saying there was no such plan. Kremlin spokesman Dmitry Peskov said Brics was not talking about setting up its own currency, but creating joint investment platforms for third countries.\n\nResponding to a question by Bagan MP Lim Guan Eng on the possibility of US tariffs affecting Malaysia, Mr Anwar said the government is still negotiating with the US , but Malaysia cannot adopt a wait-and-see approach .\n\nInstead of waiting for the impact of potential US trade tariffs, Prime Minister Anwar said Malaysia needs to continue diversifying its exports and not rely on a few trading partners. Malaysia will thus actively build trade relations with other countries, such as China, Russia and Brazil.\n\n“On our part, we must take proactive steps... to aggressively open a wider network of trading partners,” he said.\n\nMr Anwar noted that the US market accounts for around 11 per cent of Malaysia’s exports. According to the World Bank, as at 2022 , Malaysia’s exports to China made up nearly 14 per cent of its total exports.\n\nChina is Malaysia’s second-largest trading partner after Singapore, followed by the US in third place , while Russia and Brazil are not major trading partners .\n\nSpeaking to The Straits Times, senior economist Yeah Kim Leng said a 100 per cent tariff would substantially diminish the value and amount of Malaysia’s exports to the US, because the resulting higher prices of Malaysian goods would make them less competitive in the US market.\n\nAmong the major Malaysian products bound for US shores are semiconductors, integrated circuit boards, machinery and mechanical appliances.\n\n“There is a risk that if we cannot find an alternative market, our semiconductor sector will be severely affected,” said Professor Yeah, who is a director of the Economic Studies Programme at Sunway University’s Jeffrey Cheah Institute on South-east Asia.\n\n“A critical strategy is for Malaysia to harness American manufacturing firms operating in the country and see if they can lobby or directly appeal to the Trump administration, as these chips are used for their own domestic consumption,” he told ST.\n\nIt would be self-defeating for the US to impose tariffs on products made by American firms overseas for their own home market, the academic said.\n\nIt would not be economical or practical for US tech giants such as Intel, Advanced Micro Devices, Hewlett-Packard and National Semiconductor Corp – which have been operating in Penang since the 1970s – to pack up and find a new base to operate from, he added.\n\nIn any event, Prof Yeah said, Mr Trump’s warning to Brics could simply be a negotiating tool, seeing as how he recently agreed to hold off imposing 25 per cent tariffs on Canada and Mexico for 30 days.\n\n“We will likely see Malaysia negotiating to avert the US from imposing such a drastic measure. More importantly, Malaysia is still not a full-fledged Brics member.\n\n“There could be room for Malaysia to perhaps delay entry to be a full member until there is greater clarity on Trump’s strategy in dealing with Brics nations,” he said.\n\nAzril Annuar is Malaysia correspondent at The Straits Times.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "Indonesia joins BRICS as full member",
        "description": "Indonesia has officially joined BRICS, the bloc of developing economies, following its endorsement at the 2023 Johannesburg summit.",
        "content": "INDONESIA: Indonesia has officially joined the BRICS bloc of developing economies, Brazil announced on Monday (6 Jan).\nIndonesia’s candidacy was endorsed by BRICS leaders during the August 2023 summit in Johannesburg, according to Brazil, which holds... [2353 chars]",
        "url": "https://www.theonlinecitizen.com/2025/01/07/indonesia-joins-brics-as-full-member/",
        "image": "https://cdn.theonlinecitizen.com/uploads/2025/01/07104952/brics.jpg",
        "publishedAt": "2025-01-06T16:00:00Z",
        "source": {
            "name": "The Online Citizen",
            "url": "https://www.theonlinecitizen.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.theonlinecitizen.com/2025/01/07/indonesia-joins-brics-as-full-member/ on URL https://www.theonlinecitizen.com/2025/01/07/indonesia-joins-brics-as-full-member/"
    },
    {
        "title": "Trump threatens 100% tariff on Brics countries if they undercut US dollar",
        "description": "At a Brics summit in October, countries discussed boosting non-dollar transactions and strengthening local currencies. Read more at straitstimes.com.",
        "content": "WASHINGTON - President-elect Donald Trump on Nov 30 threatened to impose a 100 per cent tariff on the Brics group of nations if they undercut the US dollar.\n“We require a commitment... that they will neither create a new BRICS Currency, nor back any ... [1766 chars]",
        "url": "https://www.straitstimes.com/world/united-states/trump-threatens-100-tariff-on-brics-countries-if-they-undercut-us-dollar",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/12/01/2024-10-24T085207Z736366032RC2WQAAN1LEORTRMADP3RUSSIA-BRICS-SUMMIT.JPG?VersionId=_0gjsqFg1AP06WqAvwJmoIzWQJYEOF0y",
        "publishedAt": "2024-11-30T19:57:09Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "Brics leaders in Kazan, Russia, in October 2024, including Chinese President Xi Jinping (centre left) and Russian President Vladimir Putin (centre, right). PHOTO: REUTERS\n\nTrump threatens 100% tariff on Brics countries if they undercut US dollar\n\nWASHINGTON - President-elect Donald Trump on Nov 30 threatened to impose a 100 per cent tariff on the Brics group of nations if they undercut the US dollar.\n\n“We require a commitment... that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty US Dollar or, they will face 100 percent Tariffs,” Trump wrote on his Truth Social website, referring to the grouping that includes Brazil, Russia, India, China, South Africa and others.\n\nThe statement comes after a Brics summit held in October in Kazan, Russia, where the countries discussed boosting non-dollar transactions and strengthening local currencies.\n\nThe Brics group has expanded significantly since its inception in 2009, and now includes countries such as Iran, Egypt and the United Arab Emirates. Altogether, the Brics coalition accounts for a significant minority of the world’s economic output.\n\nAt the Kazan summit in October, Moscow secured a joint declaration encouraging the “strengthening of correspondent banking networks within Brics and enabling settlements in local currencies in line with Brics Cross-Border Payments Initiative.”\n\nBut at the end of the summit, Russian President Vladimir Putin indicated that little progress had been made on launching a possible competitor to the Belgium-based Swift financial messaging system.\n\n“As for Swift and any alternatives, we have not created and are not creating any alternatives,” Mr Putin told reporters at the end of the summit.\n\nHe added: “As for a unified Brics currency, we are not considering that question at the moment.”\n\nTrump has vowed to pursue a protectionist agenda, threatening hefty tariffs on neighbours and rivals.\n\nIf Brics countries continue with their plans, Trump warned, they “should expect to say goodbye to selling into the wonderful US Economy,” he wrote.\n\n“They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US Dollar in International Trade, and any Country that tries should wave goodbye to America.” AFP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "As Brics expands, China-India rivalry could shape its future trajectory",
        "description": "This rivalry could undermine an expanded Brics' cohesiveness and complicate consensus-building. Read more at straitstimes.com.",
        "content": "BEIJING/NEW DELHI – The 15-year-old Brics grouping, a coalition of major developing countries, has made history with its first expansion in more than a decade, welcoming Egypt, Ethiopia, Iran and the United Arab Emirates to the club.\nFrom five world ... [288 chars]",
        "url": "https://www.straitstimes.com/asia/as-brics-expands-china-india-rivalry-could-shape-its-future-trajectory",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/11/04/2024-10-23T085056Z781622946RC28QAAWHCMQRTRMADP3RUSSIA-BRICS-SUMMIT.JPG?VersionId=2Ljkas076EL_MT_Y9lmbNRIDgeXkPuRC&h=11a67198",
        "publishedAt": "2024-11-04T13:55:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "(From left) Chinese President Xi Jinping, Russian President Vladimir Putin and Indian Prime Minister Narendra Modi at the Brics summit in Kazan, Russia, on Oct 23. PHOTO: REUTERS\n\n– The 15-year-old Brics grouping, a coalition of major developing countries, has made history with its first expansion in more than a decade, welcoming Egypt, Ethiopia, Iran and the United Arab Emirates to the club.\n\nFrom five world leaders traditionally standing side by side for the requisite photo op at the grouping’s annual meeting, the stage got more crowded in host city Kazan, Russia, in late October with nine men representing nearly half the world’s population and more than a quarter of global economic output.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "Why the West should not dismiss the building of a Brics wall",
        "description": "The instrument of choice of Russia and China to chip away at US global influence is growing. Read more at straitstimes.com.",
        "content": "Back in February 2022, when Russia launched a full-scale military invasion of Ukraine, it was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah.\nYet... [313 chars]",
        "url": "https://www.straitstimes.com/opinion/why-the-west-should-not-dismiss-the-building-of-a-brics-wall",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/22/11670783.jpg?VersionId=A6mlcsXCyBp7GvpwkO9R3XTwf.z66eYP&h=5fbca9ae",
        "publishedAt": "2024-10-21T21:00:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "Although Brics remains largely a talking shop, it is rapidly becoming the instrument of choice for Russia and China to chip away at US global influence. PHOTO: EPA-EFE\n\nBack in February 2022, when Russia launched a full-scale military invasion of Ukraine, it was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah.\n\nYet for much of this week, Mr Putin will act as gracious host to dozens of heads of state and government from around the world attending a summit of the so-called Brics, an intergovernmental association initially founded by Brazil, Russia, India and China, and then – after a brief interval – joined by South Africa.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "Malaysia says Brics chair Russia backs its bid to join bloc",
        "description": "PM Anwar Ibrahim says the country has already submitted an application to join the bloc. Read more at straitstimes.com.",
        "content": "KUALA LUMPUR – Malaysia’s Foreign Ministry said Russia will back the South-east Asian country’s application to join the Brics economic bloc as Moscow looks to expand its influence into the Global South.\nRussian Foreign Minister Sergei Lavrov made the... [1975 chars]",
        "url": "https://www.straitstimes.com/asia/se-asia/malaysia-says-brics-chair-russia-backs-its-bid-to-join-bloc",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/x.jpg?VersionId=h6PXPQ4.m7gkh7DG9anE1Q8U3zV7PlP8",
        "publishedAt": "2024-07-29T02:35:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "Russian Foreign Minister Sergei Lavrov (left) met PM Anwar Ibrahim during his two-day visit to Malaysia that ended on July 27. PHOTO: ANWAR IBRAHIM/FACEBOOK\n\n– Malaysia’s Foreign Ministry said Russia will back the South-east Asian country’s application to join the Brics economic bloc as Moscow looks to expand its influence into the Global South.\n\nRussian Foreign Minister Sergei Lavrov made the assurance to Prime Minister Anwar Ibrahim during his two-day visit to Malaysia that ended on July 27, the Malaysian Foreign Ministry said in a statement.\n\nDatuk Seri Anwar separately said the country has already submitted an application to join Brics – a group of emerging economies led by Brazil, Russia, India, China and South Africa – of which Moscow is the current chair.\n\n“This potential membership holds substantial promise for both nations and underscores our commitment to fostering robust international collaboration,” said Mr Anwar in a Facebook post on July 28.\n\nHe first disclosed his interest in joining Brics in June, ahead of a visit by China Premier Li Qiang to Malaysia.\n\nA Brics membership offers nations access to financing while also providing a political venue independent of Washington’s influence.\n\nMr Anwar, who has been critical of the US stance in the Israel-Hamas war, said Malaysia and Russia are on the same page in calling for a permanent ceasefire in the Middle East, immediate humanitarian relief and the recognition of Palestine as a full member of the United Nations.\n\nThailand – a US treaty ally – in May announced its own bid to join Brics.\n\nFor Russia and China, the interest in the bloc shows their success at pushing back at attempts by the US and its allies to isolate them more broadly over the war in Ukraine and military threats to Taiwan, the Philippines, South Korea and Japan.\n\nRussia ranked as Malaysia’s eighth-largest trading partner among European countries in 2023.\n\nTotal bilateral trade increased by 15.6 per cent to US$3.1 billion (S$4.17 billion), compared with US$2.79 billion in 2022, according to Malaysia’s Foreign Ministry.\n\n“We also explored avenues to enhance bilateral cooperation, with a particular focus on strengthening ties in key areas such as investment and trade, science and technology, agriculture, defence and military, education, and tourism and culture,” Mr Anwar said of his meeting with Mr Lavrov. BLOOMBERG\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "No substitute for Asean even as South-east Asian countries express interest in joining Brics: Vivian",
        "description": "Dr Balakrishnan was in Thailand on an official visit from June 25 to 26. Read more at straitstimes.com.",
        "content": "SINGAPORE – Even though several South-east Asian countries have expressed interest in joining the Brics economic bloc, there is no substitute for Asean, said Foreign Minister Vivian Balakrishnan.\n“I think there is no question the key game in town in ... [2250 chars]",
        "url": "https://www.straitstimes.com/asia/se-asia/no-substitute-for-asean-even-as-south-east-asian-countries-express-interest-in-joining-brics-vivian",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/aivivian260624.JPG?VersionId=dVZetHQIDJYP1mzE4B0dvXKukxucvgJw&h=4d6c89ec",
        "publishedAt": "2024-06-26T13:26:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "Foreign Minister Vivian Balakrishnan (left) was hosted to lunch by Thai DPM and Interior Minister Anutin Charnvirakul. PHOTO: SINGAPORE MINISTRY OF FOREIGN AFFAIRS\n\nNo substitute for Asean even as South-east Asian countries express interest in joining Brics: Vivian\n\nSINGAPORE – Even though several South-east Asian countries have expressed interest in joining the Brics economic bloc, there is no substitute for Asean, said Foreign Minister Vivian Balakrishnan.\n\n“I think there is no question the key game in town in our part of the world is Asean,” he said in a media interview on June 26 as he wrapped up a two-day visit to Thailand.\n\nThere is no substitute for Asean as an organising unit, a production, investment or competitive zone, he said, noting the region has 680 million people, with a combined gross domestic product of around US$3.5 trillion (S$4.75 trillion) that can potentially double and quadruple in the next two to three decades.\n\nEarlier in June, Thailand and Malaysia revealed that they plan to join Brics, a group of emerging economies led by Brazil, Russia, India, China and South Africa that is seen to be challenging the Western-led global order. Myanmar and Laos had previously declared interest in joining the bloc.\n\nDr Balakrishnan highlighted that Asean has signed trade pacts with countries such as China, South Korea and Japan.\n\nAsean countries, too, have tie-ups such as the Digital Economy Partnership Agreement founded by Singapore, Chile and New Zealand, which South Korea has joined and Thailand has expressed interest in joining.\n\nThe attempts of Asean countries to broaden markets and reach a wider audience do not hinder the overall growth of the bloc and bilateral economic relations, he said.\n\n“As long as these measures lead to greater openness, inclusiveness, a level playing field and make member states more attractive for investments and promote trade, we’re in support of all these exploratory moves,” he added.\n\nWithin Asean, countries need to double down on integration and connectivity and boost investments in infrastructure to enhance competitiveness, he said.\n\nDr Balakrishnan was in Thailand on an official visit from June 25 to 26 at the invitation of his Thai counterpart Maris Sangiampongsa.\n\nOn June 26, he delivered the opening remarks at the coordinating meeting of the Thailand-Singapore Civil Service Exchange Programme.\n\nThe programme, established in 1997 and now in its 14th edition, gathers civil servants from both countries to share ideas and experiences in areas such as health, leadership development and education.\n\nIn his speech, Dr Balakrishnan said the global economic paradigm is under pressure in a fractured world with wars in Ukraine and Gaza, and maritime tensions in the Pacific and South China Sea.\n\n(From left) Albert Chua, Permanent Secretary, Ministry of Foreign Affairs of the Republic of Singapore, Foreign Minister Vivian Balakrishnan, Thai Minister for Foreign Affairs Maris Sangiampongsa and Mrs Eksiri Pintaruchi, Permanent Secretary, Ministry of Foreign Affairs of the Kingdom of Thailand. PHOTO: SINGAPORE MINISTRY OF FOREIGN AFFAIRS\n\nGiven the current global situation, the old formulas for economic growth and collaboration will not be sufficient, he said.\n\nOn the bilateral front, Singapore and Thailand will need to make common cause in the new world that is emerging, finding opportunities in areas like the digital space and sustainable economy, he said.\n\nThe two countries will celebrate the 60th anniversary of the establishment of bilateral diplomatic relations in 2025.\n\nReferring to the SQ321 turbulence incident in May, where the Singapore Airlines flight made an emergency landing in Bangkok, Dr Balakrishnan said the way the Thais rendered assistance is yet another reflection of the depth of the two countries’ longstanding relationship and their ability to rely on each other.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "Modi, Xi signal wish for resolution to border row, but India-China trust still shaky, say analysts",
        "description": "The two leaders met on the sidelines of the Brics leadership summit in South Africa on Thursday. Read more at straitstimes.com.",
        "content": "NEW DELHI – Indian Prime Minister Narendra Modi and Chinese President Xi Jinping have given the strongest signal yet of political will to resolve ongoing border troubles that have laid low bilateral ties over the past three years.\nIn a meeting in the... [352 chars]",
        "url": "https://www.straitstimes.com/asia/south-asia/modi-xi-signal-wish-for-resolution-to-border-row-but-india-china-trust-still-shaky-say-analysts",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/25/TOPSHOTS-TOPSHOT-SAFRICA-DIPLOMACY-POLITICS-BRICS-100900.jpg",
        "publishedAt": "2023-08-25T14:05:00Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "(From left) Chinese President Xi Jinping, Brazilian President Luiz Inacio Lula da Silva, South African President Cyril Ramaphosa and Indian Prime Minister Narendra Modi at the Brics leadership summit in Johannesburg on Aug 24. PHOTO: AFP\n\n– Indian Prime Minister Narendra Modi and Chinese President Xi Jinping have given the strongest signal yet of political will to resolve ongoing border troubles that have laid low bilateral ties over the past three years.\n\nIn a meeting in the leaders’ lounge at the Brics leadership summit in South Africa on Thursday, the two leaders agreed to direct their officials to double down on efforts to quickly pull back troops from remaining flashpoints in the eastern Ladakh region, which borders China’s Tibet Autonomous Region. The two countries have overlapping territorial claims in the region.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "Putin pushes for stronger ties with Brics nations amid unprecedented sanctions",
        "description": "Russia ‘actively redirecting trade flows to reliable partners’, he says.\nRead more at straitstimes.com.",
        "content": "MOSCOW (AFP) - Russian President Vladimir Putin on Wednesday (June 22) called for a strengthening of ties with the influential club of Brics emerging economies, amid unprecedented Western sanctions imposed over Ukraine.\n\"Businessmen of our countries ... [1324 chars]",
        "url": "https://www.straitstimes.com/world/putin-pushes-for-stronger-ties-with-brics-nations-amid-unprecedented-sanctions",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/ads-vladimirputin-220622.jpg?VersionId=TAs.C8oCgemc0_vBPuTMWgxqey2KN6Aj",
        "publishedAt": "2022-06-22T14:31:30Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "The sanctions have pushed Russian President Vladimir Putin to seek new markets and strengthen ties with Africa and Asia. PHOTO: REUTERS\n\nMOSCOW (AFP) - Russian President Vladimir Putin on Wednesday (June 22) called for a strengthening of ties with the influential club of Brics emerging economies, amid unprecedented Western sanctions imposed over Ukraine.\n\n\"Businessmen of our countries are forced to develop their business under difficult conditions where Western partners neglect the basic principles of market economy, free trade, as well as the inviolability of private property,\" Mr Putin told a Brics business forum via video link.\n\nOn the eve of a Brics (Brazil, Russia, India, China, South Africa) virtual summit, the Russian leader denounced \"the permanent implementation of new politically motivated sanctions\" that contradict \"common sense and basic economic logic\".\n\nHe said Russia is \"actively redirecting its trade flows and external economic contacts towards reliable international partners, above all the Brics countries\".\n\nThe barrage of Western sanctions against Moscow has pushed Mr Putin to seek new markets and strengthen ties with countries in Africa and Asia.\n\nMr Putin said discussions were ongoing on the \"opening of Indian chain stores in Russia, increasing the share of Chinese automobiles\" in the Russian market.\n\n\"Russian oil deliveries to China and India are increasing. Agricultural cooperation is developing dynamically\", as is the export of Russian fertiliser to Brics countries, he said.\n\nRussia is also developing \"alternative international transfer mechanisms\" with Brics partners and an \"international reserve currency\" to reduce dependence on the dollar and euro, Mr Putin added.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    },
    {
        "title": "China’s Xi warns about ‘expanding military alliances’ at Brics summit",
        "description": "Mr Xi said the “Ukraine crisis is a wake-up call\".\nRead more at straitstimes.com.",
        "content": "BEIJING (AFP) – Chinese President Xi Jinping warned against “expanding” military ties on Wednesday (June 22) in a speech ahead of a virtual summit with top leaders from Russia, India, Brazil and South Africa.\nMr Xi told the Brics business forum that ... [1173 chars]",
        "url": "https://www.straitstimes.com/asia/east-asia/chinas-xi-urges-solidarity-to-back-global-recovery-slams-economic-sanctions",
        "image": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/nf-xi-220622.jpg?VersionId=YFN0nXfa5xskHfabQ3ZjfI8zEGeFrP9Y",
        "publishedAt": "2022-06-22T12:04:54Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "full_content": "China's President Xi Jinping told the Brics business forum that the “Ukraine crisis is... a wake-up call”. PHOTO: REUTERS\n\nBEIJING (AFP) – Chinese President Xi Jinping warned against “expanding” military ties on Wednesday (June 22) in a speech ahead of a virtual summit with top leaders from Russia, India, Brazil and South Africa.\n\nMr Xi told the Brics business forum that the “Ukraine crisis is... a wake-up call” and warned against “expanding military alliances and seeking one’s own security at the expense of other countries’ security”.\n\nThe influential club of Brics emerging economies accounts for more than 40 per cent of the global population and nearly a quarter of the world’s gross domestic product.\n\nThree of its members – China, India and South Africa – have abstained from voting on a UN resolution condemning Russia’s invasion of Ukraine.\n\nChina and India have strong military links with Russia and buy large amounts of its oil and gas.\n\nIn a call last week, Mr Xi assured his Russian counterpart Vladimir Putin that China would support Moscow’s core interests in “sovereignty and security” – leading Washington to warn Beijing it risked ending up “on the wrong side of history”.\n\nSouth Africa, one of the few African countries wielding diplomatic influence outside the continent, has also refused to condemn the Russian military action, to safeguard important economic ties.\n\nMr Xi also took a swipe at the United States and European Union sanctions on Russia in the speech on Wednesday, saying “sanctions are a boomerang and a double-edged sword”.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you."
    }
]