[
    {
        "title": "Trump tariffs on Canada, Mexico to begin over weekend",
        "description": "Live updates as Trump threatens tariffs on China, Mexico, Canada and BRICS countries. Follow the latest news on Cabinet picks Tulsi Gabbard, Robert Kennedy Jr. and Kash Patel.",
        "content": "During RFK Jr.’s two-day confirmation hearings for health secretary, he repeatedly compared the health of Americans in 2025 to the 1960s, specifically the years during his uncle John F. Kennedy’s presidency, from 1960 to 1963.\n“When my uncle was pres... [2548 chars]",
        "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-administration-tariff-canada-mexico-dei-plane-crash-live-updates-rcna190078",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250130-donald-trump-vl-407p-6890f2.jpg",
        "publishedAt": "2025-01-31T17:09:35Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "full_content": "As arrests of immigrants increase, the administration is scrambling to make sure it has the room to house its detainees and keep Trump’s promise to deport them.\n\nTrump’s “border czar,” Tom Homan, told NBC News that Immigration and Customs Enforcement needs 100,000 beds total, more than double what it has currently. Trump alluded to the need for more room when he ordered the Pentagon and the Department of Homeland Security on Wednesday to prepare 30,000 beds at Guantánamo Bay for who he said would be detainees posing the greatest threat to Americans’ safety.\n\nAn immigration detention room is used to hold people until they are deported, and it “is really kind of a backbone of the mass deportation plan,” said Jesse Franzblau, a senior policy analyst with the National Immigrant Justice Center.\n\nRead the full story here."
    },
    {
        "title": "Donald Trump Warns BRICS Over Dollar Move: 'Go Find Another Sucker Nation'",
        "description": "President Donald Trump has said he does not want BRICS member nations to move away from the dollar.",
        "content": "President Donald Trump has threatened BRICS countries, warning them against replacing the U.S. dollar as a reserve currency and telling them, \"Go find another sucker nation.\"\nNewsweek has contacted the White House and the foreign ministries of major ... [5777 chars]",
        "url": "https://www.newsweek.com/brics-dollar-donald-trump-tariffs-2024004",
        "image": "https://d.newsweek.com/en/full/2577953/donald-trump.jpg",
        "publishedAt": "2025-01-31T09:52:35Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /brics-dollar-donald-trump-tariffs-2024004 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/brics-dollar-donald-trump-tariffs-2024004"
    },
    {
        "title": "Trump mistakes Spain for a member of the BRICS bloc and repeats the threat of massive tariffs",
        "description": "U.S. president Donald Trump has apparently confused Spain for a member of the BRICS bloc of developing economies, causing some head-scratching and jitters over possible tariffs in Madrid.",
        "content": "President Donald Trump talks to reporters as he signs executive orders in the Oval Office of the White House, Monday, Jan. 20, 2025, in Washington. (AP Photo/Evan Vucci)\nBARCELONA – U.S. President Donald Trump has apparently confused Spain for a memb... [1744 chars]",
        "url": "https://www.clickondetroit.com/news/world/2025/01/21/trump-mistakes-spain-for-a-member-of-the-brics-bloc-and-repeats-the-threat-of-massive-tariffs/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/33LECQ2KFBH5JE26OLJRWEGPXA.jpg?_a=DATAdtfiZAA0",
        "publishedAt": "2025-01-21T14:05:49Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "President Donald Trump talks to reporters as he signs executive orders in the Oval Office of the White House, Monday, Jan. 20, 2025, in Washington. (AP Photo/Evan Vucci)\n\nBARCELONA – U.S. President Donald Trump has apparently confused Spain for a member of the BRICS bloc of developing economies, causing some head-scratching and jitters over possible tariffs in Madrid.\n\nSpain is not in BRICS, whose initials stand for Brazil, Russia, India, China and South Africa. Spain is a member of NATO, along with the U.S., and of the European Union.\n\nRecommended Videos\n\nTrump erroneously said Spain was in BRICS when a journalist asked him about NATO countries like Spain which don’t meet the NATO minimum of spending 2% of economic output on defense. Spain ranked last in the 32-nation military alliance, estimated to spend 1.28% on defense last year.\n\nTrump started his answer by saying “Spain is very low,” referring to its defense expenditures, but quickly veered into speaking about the BRICS.\n\n“They’re a BRICS nation, Spain. Do you know what a BRICS nation is? You’ll figure it out,” he told the reporter from the presidential desk in the Oval Office.\n\nTrump repeated his threat to put costly tariffs on BRICS, saying “we are going to put at least a 100% tariff on the business they do with the United States,\" part of his economic plans that would overturn decades of free trade consensus.\n\nSpanish Education Minister Pilar Alegría, who acts as a spokeswoman for the government, said she wasn't sure why Trump made the comment.\n\n“I don’t know if the affirmation made by President Trump was the result of a mix-up or not, but I can confirm that Spain is not in BRICS,” Alegría told reporters Tuesday.\n\nSpain has been a committed member of NATO for the past four decades, she added, and the Spanish government considers the U.S. “a natural ally.\"\n\nSpain is one of eight countries that failed to meet NATO's 2% spending target last year. Trump has said he wants NATO members to reach 5% spending on defense."
    },
    {
        "title": "Nigeria Joins BRICS Bloc as a Partner Country",
        "description": "Nigeria has been recognized as a \"partner country\" of the BRICS bloc, marking a significant step for the African nation's economy. BRICS, initially founded by Brazil,...",
        "content": "Nigeria has been recognized as a \"partner country\" of the BRICS bloc, marking a significant step for the African nation's economy. BRICS, initially founded by Brazil, Russia, India, and China in 2009, expanded to include South Africa in 2010, was for... [1081 chars]",
        "url": "https://www.newser.com/story/362729/nigeria-joins-brics-bloc-as-a-partner-country.html",
        "image": "https://img1-azrcdn.newser.com/favicon.ico",
        "publishedAt": "2025-01-19T21:54:47Z",
        "source": {
            "name": "Newser",
            "url": "https://www.newser.com"
        },
        "full_content": "Nigeria has been recognized as a \"partner country\" of the BRICS bloc, marking a significant step for the African nation's economy. BRICS, initially founded by Brazil, Russia, India, and China in 2009, expanded to include South Africa in 2010, was formed as a counterbalance to the Group of Seven industrialized countries. Recently, BRICS expanded by adding Iran, Egypt, Ethiopia, and the United Arab Emirates and extending an invitation to Saudi Arabia, with Turkey, Azerbaijan, and Malaysia applying for membership.\n\nNigeria is now among nine partner countries in BRICS, alongside Belarus, Bolivia, Cuba, Kazakhstan, Malaysia, Thailand, Uganda, and Uzbekistan. Brazil's government emphasized Nigeria's importance, noting it has Africa's largest population (it's sixth in the world) and is a key player in the continent's economy. As quoted in Brazil's statement on the addition, Nigeria \"plays an active role in strengthening South-South cooperation and in reforming global governance.\"\n\nPresident-elect Trump has previously threatened to impose substantial tariffs on BRICS if the bloc moved to challenge the dominance of the US dollar. Despite this, BRICS leaders remain committed to creating an alternative payment system that would lessen reliance on the dollar. (This story was generated by Newser's AI chatbot. Source: the AP)"
    },
    {
        "title": "The BRICS bloc is growing - and Trump's tariff threat isn't expected to put off aspiring members",
        "description": "Despite the threat of a trade war with the U.S., economists and analysts tell CNBC that this will not stop BRICS from expanding.",
        "content": "Family photo of leaders taken at the 16th BRICS Summit in Kazan, Russia on Oct. 24, 2024. Anadolu | Anadolu | Getty Images\nPresident-elect Donald Trump has pledged a 100% tariff against BRICS nations if they continue to undermine the U.S. dollar — bu... [3880 chars]",
        "url": "https://www.cnbc.com/2025/01/17/the-brics-bloc-is-growing-and-trumps-tariff-threat-isnt-expected-to-put-off-aspiring-members.html",
        "image": "https://image.cnbcfm.com/api/v1/image/108087644-1737033990337-gettyimages-2179804474-AA_24102024_1913709.jpeg?v=1737034020&w=1920&h=1080",
        "publishedAt": "2025-01-17T06:11:39Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "full_content": "Family photo of leaders taken at the 16th BRICS Summit in Kazan, Russia on Oct. 24, 2024. Anadolu | Anadolu | Getty Images\n\nPresident-elect Donald Trump has pledged a 100% tariff against BRICS nations if they continue to undermine the U.S. dollar — but the threat won't rein in the group's expansion, analysts tell CNBC. Most recently, Brazil announced Indonesia's admittance into the bloc as a member last Monday. Under outgoing President Joe Biden's administration, Washington has been relatively dismissive of the 10-member coalition, with White House National Security Communications Advisor John Kirby saying during a press briefing last October that the U.S. does not view BRICS — an economic coalition of emerging markets — as a \"threat.\" Sentiment could change once Trump enters the White House later this month, following early indications that he may impose tariffs on alliance members if they subvert the U.S. dollar. \"A key policy shift with the incoming Trump administration is its explicit treatment of BRICS as an entity,\" Mihaela Papa, director of research at the MIT Center for International Studies, told CNBC by email.\n\nChina will ease the tariff pain\n\nOriginally established by Brazil, Russia, India, and China in 2009, then joined by South Africa in 2010, the Beijing-led BRICS was set up as a force to rival Western dominance on the international stage. The alliance's 16th annual summit in Kazan saw Egypt, Ethiopia, Iran and the United Arab Emirates officially admitted into the group. According to Russian officials and official paper of the Chinese Communist Party's Central Committee, more than 30 countries have expressed interest in joining the coalition in 2024. CNBC could not independently verify this estimate. The size of the bloc makes it increasingly unlikely that the U.S. will apply punitive 100% tariffs on BRICS countries, according to Duncan Wrigley, chief China+ economist at Pantheon Macroeconomics. Doing so would risk steering nations neutral in the U.S.-China rivalry toward Beijing and interfere with U.S. interests, Wrigley told CNBC by email. The world's second-largest economy could even step in to ease the pain of any potential U.S. trade measures against BRICS members, according to David Lubin, senior research fellow at Chatham House. \"From Beijing's point of view, establishing China as an alternative pillar of global order is a critically important objective and it can't be met without the support of the developing world,\" Lubin said in emailed comments. \"And since some 120 countries count China as their main trading partner, this shouldn't be too difficult.\" China is already starting to do this, putting forward a zero-tariff policy for least developed countries with diplomatic ties with Beijing, which came into effect from December last year and builds on similar measures extended to the least developed African countries.\n\nDollar is king\n\nTrump's tariff threat is conditional on BRICS dethroning the U.S. dollar as the world's most widely used trade currency — which could prove to be a tall order for the alliance. Russia has been pushing for de-dollarization in a bid to sidestep the SWIFT network, a globally recognized standard for bank transactions, and to curtail the impact of U.S sanctions against Moscow. In the Kazan talks, Vladimir Putin reiterated the use of the dollar as a \"weapon\" and a \"big mistake,\" The Guardian reports. One of the group's options to topple the dollar was to create a unified BRICS currency — a proposal spearheaded by Brazil, which has yet to gain traction. Another possibility was setting up multi-currency trade, which is already taking place among several members: some Chinese and Russian trade is being done through the yuan and ruble. Nations have also agreed to continue to strengthen trading through local currencies and expressed support for the idea of an independent cross-border settlement infrastructure for payments. Chatham House's Lubin notes that the Chinese currency is \"much less useable internationally than dollars,\" given that financial markets are largely denominated in the greenback.\n\nJust a 'talking shop'"
    },
    {
        "title": "BRICS aims to 'build' global ties as Trump takes office: Brazil",
        "description": "Brazil will seek to build relationships and not worsen an already tense global mood, while holding the rotating presidency of the BRICS bloc of developing economies, a top official told AFP.Diplomat Eduardo Saboia, head of the BRICS summit to be held in Rio de Janeiro in July, brushed off recent thr...",
        "content": "Brazil will seek to build relationships and not worsen an already tense global mood, while holding the rotating presidency of the BRICS bloc of developing economies, a top official told AFP.\nDiplomat Eduardo Saboia, head of the BRICS summit to be hel... [1927 chars]",
        "url": "https://www.rawstory.com/brics-aims-to-build-global-ties-as-trump-takes-office-brazil/",
        "image": "https://www.rawstory.com/media-library/brazilian-ambassador-eduardo-saboia-head-of-the-brics-summit-in-july-2025-says-the-bloc-of-developing-economies-has-no-plans-t.jpg?id=55545911&width=1200&height=600&coordinates=0%2C68%2C0%2C68",
        "publishedAt": "2025-01-10T17:12:30Z",
        "source": {
            "name": "Raw Story",
            "url": "https://www.rawstory.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.rawstory.com/brics-aims-to-build-global-ties-as-trump-takes-office-brazil/ on URL https://www.rawstory.com/brics-aims-to-build-global-ties-as-trump-takes-office-brazil/"
    },
    {
        "title": "Ukraine's Drones Wreak Havoc in Russia's BRICS Summit Host City",
        "description": "Video shows drones hitting Kazan, the capital of Russia's Tatarstan republic on Saturday.",
        "content": "What's New\nOfficials in Russia say drones launched by Kyiv have hit Kazan, a city more than 600 miles from Ukraine which hosted an international economic summit two months earlier.\nVideo on social media shared Saturday showed the drones striking apar... [4804 chars]",
        "url": "https://www.newsweek.com/russia-ukraine-drones-kazan-2004571",
        "image": "https://d.newsweek.com/en/full/2549591/ukrainian-drones.jpg",
        "publishedAt": "2024-12-21T10:17:17Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /russia-ukraine-drones-kazan-2004571 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/russia-ukraine-drones-kazan-2004571"
    },
    {
        "title": "‘De-Dollarization Is Certainly Not Our Objective’-India Says After Trump’s 100% Tariff Threat Over BRICS Currency",
        "description": "Reserve Bank of India Governor Shaktikanta Das governor said no decision has been taken on the BRICS currency, which recently drew President-elect Donald Trump’s ire.",
        "content": "Topline\nThe head of India’s central bank on Friday said the country was not pursuing a policy of de-dollarization and no decisions have been made so far on the BRICS currency, a week after President-elect Donald Trump threatened to slap 100% tariffs ... [2862 chars]",
        "url": "https://www.forbes.com/sites/siladityaray/2024/12/06/de-dollarization-is-certainly-not-our-objective-india-says-after-trumps-100-tariff-threat-over-brics-currency/",
        "image": "https://imageio.forbes.com/specials-images/imageserve/6752dc227e6ef86c7b4d7f75/0x0.jpg?format=jpg&crop=2221,1250,x0,y43,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2024-12-06T05:00:00Z",
        "source": {
            "name": "Forbes",
            "url": "https://www.forbes.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Max restarts limit reached for url: https://www.forbes.com/sites/siladityaray/2024/12/06/de-dollarization-is-certainly-not-our-objective-india-says-after-trumps-100-tariff-threat-over-brics-currency/ on URL https://www.forbes.com/sites/siladityaray/2024/12/06/de-dollarization-is-certainly-not-our-objective-india-says-after-trumps-100-tariff-threat-over-brics-currency/"
    },
    {
        "title": "Trump vows to defend U.S. dollar hegemony, but is it under threat?",
        "description": "U.S. President-elect Donald Trump has threatened retaliation against governments that challenge the US dollar, vowing \"100 percent tariffs\" on countries that undercut the US currency.The Republican vowed the action on states that \"create a new BRICS Currency\" or otherwise \"replace the mighty US doll...",
        "content": "U.S. President-elect Donald Trump has threatened retaliation against governments that challenge the US dollar, vowing \"100 percent tariffs\" on countries that undercut the US currency.\nThe Republican vowed the action on states that \"create a new BRICS... [4269 chars]",
        "url": "https://www.rawstory.com/trump-vows-to-defend-us-dollar-hegemony-but-is-it-under-threat/",
        "image": "https://www.rawstory.com/media-library/u-s-president-elect-donald-trump-threatened-tough-tariffs-on-countries-that-challenge-the-us-dollar-allison-robbert-afp.png?id=55127990&width=1200&height=600&coordinates=0%2C66%2C0%2C66",
        "publishedAt": "2024-12-03T11:40:07Z",
        "source": {
            "name": "Raw Story",
            "url": "https://www.rawstory.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.rawstory.com/trump-vows-to-defend-us-dollar-hegemony-but-is-it-under-threat/ on URL https://www.rawstory.com/trump-vows-to-defend-us-dollar-hegemony-but-is-it-under-threat/"
    },
    {
        "title": "Why is Trump threatening a 100% tariff on the BRICS nations?",
        "description": "Donald Trump said the U.S. would hit Brazil, Russia and six other countries with a crushing tariff if they sought to challenge the dollar.",
        "content": "President-elect Donald Trump on Nov. 30 threatened to slap a 100% tariff on a group of nine nations — the so-called BRICS — if they try to replace the U.S. dollar with another currency.\nThe BRICS countries include Brazil, Russia, India, China, South ... [5309 chars]",
        "url": "https://www.cbsnews.com/news/trump-tariffs-brics-nations-china-russia-brazil/",
        "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/12/02/05179650-8859-4852-85b1-14896b79250d/thumbnail/1200x630/7beb82adcbd34caee36da3f159b61e21/gettyimages-2179624432.jpg?v=0c07a24f1ac5eb64b06f31185829f707",
        "publishedAt": "2024-12-02T20:41:51Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "President-elect Donald Trump on Nov. 30 threatened to slap a 100% tariff on a group of nine nations — the so-called BRICS — if they try to replace the U.S. dollar with another currency.\n\nThe BRICS countries include Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Iran and the United Arab Emirates. Trump said he'll enact the tariffs if the countries either move to create a new rival currency to the dollar or back an alternative currency to replace the greenback as the world's reserve medium of exchange.\n\n\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,\" Trump said on Truth Social.\n\nTrump's move comes after he recently threatened to impose 25% tariffs on all products from Canada and Mexico entering the U.S., along with an additional 10% tax on goods from China, in what he says would force the countries to do more to halt the flow of unauthorized migrants and illicit drugs into the U.S.\n\nWhy do BRICS countries want an alternative currency?\n\nThe BRICS — named after the original five members (Brazil, Russia, India, China and South Africa) — was formed in 2009 to advance the interests of emerging economies and to make them less dependent on the U.S. dollar, which is by far the most commonly used currency in global commerce.\n\nThe primacy of the dollar in international trade gives the U.S. a number of advantages, including lower borrowing costs for the federal government and enormous geopolitical influence around the world.\n\nIn October, Russian President Vladimir Putin called for a new international payments system at a BRICS summit, saying \"the dollar is being used as a weapon,\" the Associated Press reported. In 2023, meanwhile, Brazilian President Luiz Inácio Lula da Silva proposed creating a new, common currency in South America to reduce its reliance on the dollar in international trade.\n\nWould a BRICS currency threaten the dollar?\n\nCreating a competing new currency would be difficult given how widely used the dollar is to conduct business around the world. Despite the existence of the euro and growing importance of China's renminbi, the dollar remains the world's main reserve currency, representing roughly 58% of the world's foreign exchange reserves, according to the IMF. Also, critical commodities like oil and gold are still mostly bought and sold using dollars.\n\n\"Economically, it's not a major issue because the idea of the BRICS countries being able to put together an alternative as a reserve currency for the U.S. dollar is not plausible in the short or intermediate term,\" said Mark Weinstock, a global trade expert and professor of economics at Pace University.\n\nIn other words, BRICS nations would struggle to create a viable currency given the relative strength and stability of the U.S. economy and the faith that global investors and trading partners have in U.S. government debt. And while the group's members have some interests in common, unifying behind a single currency would be politically fraught and technically complex.\n\n\"Fundamentally, if you are going to create your own form of money, that desirability is commensurate with the economic strength and integrity of the issuer. BRICS countries don't have the type of institutions that inspire global confidence to convince people that it is a satisfactory alternative to the dollar,\" Weinstock said.\n\nSome BRICS members are already downplaying the push to get a new currency off the ground. After Trump's tariff threat last weekend, South Africa's government on Monday issued a statement on social media saying there are no plans to create a BRICS currency.\n\n\"Recent misreporting has led to the incorrect narrative that BRICS is planning to create a new currency,\" South Africa's Department of International Relations and Cooperation said. \"This is not the case. The discussions within BRICS focus on trading among member countries using their own national currencies.\"\n\nWhat would stiff tariffs on BRICS goods mean for U.S. consumers?\n\nWhile economists largely agree that a 100% tariff on goods imported to the U.S. from BRICS nations is a long shot, if it came to pass the move would not benefit U.S. consumers, they say. Such levies would drive up the cost of goods from BRICS member nations, potentially fueling inflation and leading to higher prices for consumers.\n\n\"Like any tariffs, this would mean higher prices for consumers,\" Weinstock said. \"That's always the impact of the tariff.\"\n\nAmong the leading products the U.S. gets from BRICS countries are coffee from Brazil, electronics and clothes from China, and minerals from South Africa, according to trade data.\n\nWhy are some economists criticizing Trump for threatening the BRICS?\n\nSome experts criticized Trump's threat to punish the BRICS, saying it makes the U.S. look weak.\n\n\"It isn't a good look, as it indirectly elevates the stature of a non-threat and suggests a lack of confidence in the dollar,\" Brad Setser, a senior fellow at the Council on Foreign Relations and former Treasury Department economist, wrote on X.\n\nTrump's threat could actually accelerate a move away from the dollar by other countries, according to Setser, who said that an effort to effectively coerce countries to use the dollar \"is actually a long-run threat to the dollar's global role.\"\n\n\"It makes the use of the dollar appear to be a favor to the U.S.,\" he added.\n\ncontributed to this report."
    },
    {
        "title": "China Reacts to Trump's BRICS Threat",
        "description": "President-elect Donald Trump on Saturday warned members of the bloc against any attempt to supplant the dollar.",
        "content": "China has rebuked the United States for destabilizing global finance and leveraging the dollar's dominance as a geopolitical weapon, following President-elect Donald Trump's threat to impose tariffs on BRICS nations pursuing de-dollarization efforts.... [3226 chars]",
        "url": "https://www.newsweek.com/china-reacts-donald-trump-brics-threat-1993886",
        "image": "https://d.newsweek.com/en/full/2533613/trump-addresses-house-republicans-hyatt-regency.jpg",
        "publishedAt": "2024-12-02T14:11:40Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /china-reacts-donald-trump-brics-threat-1993886 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/china-reacts-donald-trump-brics-threat-1993886"
    },
    {
        "title": "Trump threatens 100% tariffs on China and Russia if BRICS issues new currency",
        "description": "US President-elect Donald Trump threatened to levy 100% tariffs on BRICS -- a China- and Russia-led group of nations with emerging economies -- if the countries decide to issue their own currency.",
        "content": "US President-elect Donald Trump has threatened to levy 100% tariffs on BRICS — a China- and Russia-led group of nations with emerging economies — if the countries decide to issue their own currency.\nTrump said Saturday that his incoming administratio... [2853 chars]",
        "url": "https://nypost.com/2024/12/01/us-news/trump-threatens-100-tariffs-on-china-and-russia-if-brics-issues-new-currency/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/12/2024-washington-dc-tradition-incoming-94597014.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2024-12-01T22:48:29Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "full_content": "US President-elect Donald Trump has threatened to levy 100% tariffs on BRICS — a China- and Russia-led group of nations with emerging economies — if the countries decide to issue their own currency.\n\nTrump said Saturday that his incoming administration will not allow the nine-nation group, which has 34 other countries interested in joining, to undermine the US dollar.\n\n“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” Trump wrote on Truth Social — referring to the group whose acronym stands for founding members Brazil, Russia, India, China and South Africa.\n\n4 President-elect Donald Trump is threatening to place 100% tariffs on BRICS countries if they decide to issue their own currency. Getty Images\n\n4 Trump said he would oppose an effort by BRICs to replace the US dollar on the world stage. Donald Trump/Truthsocial\n\n“We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful US Economy,” he added.\n\nBRICS was founded by the five original countries in 2011. Iran, the United Arab Emirates, Ethiopia and Egypt have since joined, with Saudi Arabia accepting an invitation but yet to officially become a member. More than two other countries have expressed interest in joining the economic alliance, too.\n\nLast year, Brazilian President Luiz Inacio Lula de Silva proposed that BRIC create its own common currency, similar to the European Union’s euro, to reduce its members’ reliance on the US dollar.\n\nUnder a united BRICS currency system, member nations such as Russia, China, and Iran could circumvent Western sanctions placed on them over their military aggression.\n\n4 BRICS is a nine-nation block comprised of Brazil, Russia, India, China, South Africa, Iran, Egypt, Ethiopia and the United Arab Emirates. Getty Images\n\nIt would also mitigate the West’s efforts to isolate Russia and Iran, and it gives China the opportunity to strengthen its foreign partnerships and challenge America’s role as a global leader.\n\nStill, the likelihood of the BRICS nations coming together to form their own currency remains slim, given each nation’s vast economic and political differences.\n\nThe US’s threat of tariffs to discourage the move has remained Trump’s key tool for socio-economic issues as he prepares to return to the White House next month.\n\n4 Chinese President Xi Jinping and Russian President Vladimir Putin attend a BRICS summit in October. via REUTERS\n\nLast week, Trump vowed to issue an executive order imposing 25% tariffs on all US imports from Mexico, Canada and China on his first day in office.\n\nThe president-elect wrote on social media that the tariff would “remain in effect until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!”\n\nTrump further pledged that he would slap China with an additional 10% tariff — on top of existing ones — for failing to curb illicit fentanyl exports."
    },
    {
        "title": "Trump threatens 100% tariff on BRICS countries if they pursue creating new currency",
        "description": "President-elect Donald Trump said he would require countries that are part of BRICS — a China- and Russia-backed group of emerging economies — to commit to not creating new currency or face 100% tariffs during his administration.",
        "content": "CNN —\nPresident-elect Donald Trump said he would require countries that are part of BRICS — a China- and Russia-backed group of emerging economies — to commit to not creating new currency or face 100% tariffs during his administration.\n“The idea that... [3464 chars]",
        "url": "https://edition.cnn.com/2024/11/30/politics/trump-brics-currency-tariff/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap24309752020097-20241122032803901.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-12-01T01:57:15Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "CNN —\n\nPresident-elect Donald Trump said he would require countries that are part of BRICS — a China- and Russia-backed group of emerging economies — to commit to not creating new currency or face 100% tariffs during his administration.\n\n“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER. We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,” Trump posted on Truth Social on Saturday afternoon.\n\nBRICS had been made up of Brazil, Russia, India, China and South Africa since 2011. Earlier this year, Iran, the United Arab Emirates, Ethiopia and Egypt formally joined — the first expansion in over a decade. Thirty-four countries have submitted an expression of interest in joining the bloc of major emerging economies, South African Foreign Minister Naledi Pandor said in February.\n\nThe leader of one member country, Brazil’s Luiz Inácio Lula da Silva, in 2023 proposed creating a common currency in South America to reduce reliance on the US dollar.\n\nUsing BRICS currencies and banking networks outside the US dollar-denominated system could allow member countries such as Russia, China and Iran to circumnavigate Western sanctions. But the chances of a new currency are probably slim due to the alliance’s economic and geopolitical differences.\n\nSpeaking to reporters ahead of a summit of BRICS countries in Russia in October, President Vladimir Putin said the group was “not considering this issue.”\n\n“Its time has not come yet. We need to be very careful and act gradually, without any rush,” Putin said when asked about any steps toward developing a common currency. He added the group was studying “the possibilities to make wider use of national currencies” and enhancing coordination between their central banks to support trade.\n\nThe expanding group is valuable to China as it looks to forge closer partnerships with key players to challenge the United States’ global leadership. And it’s also a boon to Russia, which has been shunned economically and diplomatically by the West following its 2022 invasion of Ukraine. This year, Russia assumed rotating chairmanship of the group.\n\nDuring the BRICS summit in October, Putin and Chinese leader Xi Jinping sought to project the message that the West stands isolated in the world, while a “global majority” of countries support their bid to challenge American global leadership.\n\nTrump’s latest economic threat comes days after he pledged massive hikes in tariffs on goods coming from Mexico, Canada and China starting on the first day of his administration. The move, Trump said, will be in retaliation for illegal immigration and “crime and drugs” coming across the border.\n\nSince that announcement, Trump spoke with Mexican President Claudia Sheinbaum for the first time following the tariff announcement, but they have offered conflicting statements about the call. Canadian Prime Minister Justin Trudeau, meanwhile, traveled to Trump’s Mar-a-Lago estate in Florida to meet with the president. Trudeau said the Friday dinner with Trump “was an excellent conversation,” and the president-elect called it a “very productive meeting.”\n\nCNN’s Simone McCarthy, Robert Ilich and Kit Maher contributed to this report.\n\nCorrection: An earlier version of this article stated that Saudi Arabia had joined BRICS earlier this year. Saudi Arabia was invited to join the group but does not appear to have formally joined. It was represented by its foreign minister at the BRICS summit in Kazan in October."
    },
    {
        "title": "Trump threatens a 100% tariff on BRICS countries if they abandon U.S. dollar",
        "description": "In a post on Truth Social Saturday, President-elect Donald Trump said he would impose a 100% tariff on the BRICS geopolitical coalition of non-Western countries if the group moves away from trading using the U.S. dollar.",
        "content": "In a post on Truth Social Saturday, President-elect Donald Trump said he would impose a 100% tariff on the BRICS geopolitical coalition of non-Western countries if the group moves away from trading using the U.S. dollar.\n“The idea that the BRICS Coun... [4248 chars]",
        "url": "https://www.nbcnews.com/politics/white-house/trump-threatens-100-tariff-brics-countries-abandon-us-dollar-rcna182300",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241130-brics-ch-1505-98e9fb.jpg",
        "publishedAt": "2024-11-30T22:04:47Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "full_content": "In a post on Truth Social Saturday, President-elect Donald Trump said he would impose a 100% tariff on the BRICS geopolitical coalition of non-Western countries if the group moves away from trading using the U.S. dollar.\n\n“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” Trump wrote. “We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy.”\n\n“They can go find another ‘sucker!’ There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America,” the president-elect added.\n\nThe BRICS alliance is a coalition of non-Western countries that convened for the first official BRIC summit in 2009, with Brazil, Russia, India and China joining the informal group. South Africa joined a year later, cementing the BRICS name.\n\nAt a 2023 summit, the group expanded for the first time in over a decade, inviting Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates.\n\nAt the same summit, the issue of “de-dollarization,” or reducing the influence of the U.S. dollar in global trade, gained steam, though it’s not a new idea for the group.\n\nIndian Prime Minister Narendra Modi and Donald Trump in New Delhi in 2020. Pradeep Gaur / Mint via Getty Images file\n\nExperts are skeptical that BRICS would succeed in creating its own currency for global trade, pointing to infighting between the member nations and major differences in the way the countries run their economies and financial institutions.\n\nStill, some members of BRICS are among the U.S.’ largest trading partners, including India and China.\n\nAccording to the Office of the U.S. Trade Representative, the U.S.’ goods-and-services trade with China totaled an estimated $758.4 billion in 2022 and the goods-and-services trade between the U.S. and India totaled an estimated $191.8 billion in 2022.\n\nRepresentatives for the BRICS countries’ embassies in the U.S. did not immediately respond to requests for comment.\n\nThis is Trump’s second time this week threatening to raise tariffs on outside nations.\n\nOn Monday, the president-elect wrote in a post on Truth Social that he planned to impose a 25% tariff on products imported from Mexico and Canada. He argued that the purpose of the tariff would be to curb the fentanyl crisis.\n\nIn the same post, he threatened to slap a 10% tariff on China, writing, “I have had many talks with China about the massive amounts of drugs, in particular Fentanyl, being sent into the United States — But to no avail. Until such time as they stop, we will be charging China an additional 10% Tariff, above any additional Tariffs, on all of their many products coming into the United States of America.”\n\nOn Friday, Canadian Prime Minister Justin Trudeau traveled to West Palm Beach to meet with Trump at his Mar-a-Lago resort.\n\nOn Saturday, in a separate social media post, Trump called their conversation “very productive.”\n\nTrump added, “I made it very clear that the United States will no longer sit idly by as our Citizens become victims to the scourge of this Drug Epidemic, caused mainly by the Drug Cartels, and Fentanyl pouring in from China. Too much death and hardship! Prime Minister Trudeau has made a commitment to work with us to end this terrible devastation of U.S. Families.”\n\nIn a letter sent to Trump Tuesday, Mexican President Claudia Sheinbaum wrote that “migration and drug consumption in the United States cannot be addressed through threats or tariffs.”\n\n“What is needed is cooperation and mutual understanding to tackle these significant challenges. For every tariff, there will be a response in kind, until we put at risk our shared enterprises,” she added.\n\nSheinbaum and Trump spoke over the phone on Wednesday, but the conversation spurred a “he said, she said” controversy over whether Sheinbaum had agreed to stop immigration from Mexico into the U.S., something Trump alleged she did.\n\nIn her own recollection of the conversation, Sheinbaum wrote on X that “I explained to him the comprehensive strategy that Mexico has followed to address the migration phenomenon, respecting human rights. We reiterate that Mexico’s position is not to close borders but instead build bridges between government and people.”"
    },
    {
        "title": "Trump promises 100% tariffs on BRICS nations if they create rival currency",
        "description": "President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar.",
        "content": "1 of 2 | U.S. President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar. Photo by John G. Mabanglo/EPA-EFE\nNo... [2887 chars]",
        "url": "https://www.upi.com/Top_News/US/2024/11/30/Trump-promises-100-tariffs-BRICS-nations-create-rival-currency/5881732999940/",
        "image": "https://cdnph.upi.com/sv/ph/og/upi_com/5881732999940/2024/1/781c29fb11f97c63b15b66f130fd3069/v1.5/Trump-promises-100-tariffs-on-BRICS-nations-if-they-create-rival-currency.jpg",
        "publishedAt": "2024-11-30T21:58:00Z",
        "source": {
            "name": "UPI News",
            "url": "https://www.upi.com"
        },
        "full_content": "1 of 2 | U.S. President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar. Photo by John G. Mabanglo/EPA-EFE\n\nNov. 30 (UPI) -- President-elect Donald Trump on Saturday warned the BRICS nations they will face a 100% tariff in U.S. domestic markets if they proceed with plans to create a new currency to compete with the dollar.\n\nWriting on his Truth Social social media platform, Trump said the so-called BRICS nations -- which include Brazil, Russia, India, China and South Africa -- could \"wave goodbye to America\" if they advance plans to develop a common currency.\n\nRussian President Vladimir Putin said during the 2023 BRICS summit in Johannesburg that the member countries should work closely to overcome problems standing in the way of creating a common currency to challenge to the U.S. dollar and the Euro.\n\nAny country participating in such a \"de-dollarization\" effort would be met by a 100% tariff, the president-elect warned.\n\n\"The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,\" he wrote.\n\n\"We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy,\" he added.\n\nThe comments continued a string of tariff threats made by the incoming president in recent days. Late Friday, he met with Canadian Prime Minister Justin Trudeau at his Mar-a-Lago estate in Palm Beach, Fla., who traveled there for an unscheduled meeting amid Trump's promise to impose blanket 25% tariffs on all products from Canada and Mexico unless they do more to stop the flow of illegal drugs such as fentanyl and undocumented migrants into the United States.\n\nTrump also threatened this week that China will face tariff hikes of 10% above any existing tariffs until it stops the flow of precursor chemicals used in the manufacture of fentanyl.\n\nAt the 2024 BRICS nations summit in Russia last month, new bloc members Saudi Arabia, the United Arab Emirates, Egypt, Iran and Ethiopia were in attendance but participants did not explicitly discuss the creation of a new currency.\n\nRussian Deputy Foreign Minister Sergei Ryabkov on Oct. 3 said the talk of a new currency was \"premature,\" telling reporters in Moscow, \"It would be too early to speak about any common currency in the strict sense of this term. The reason is the significant differences in the approaches of our states to regulation of the payment balance, national financial markets, and inflation targets.\"\n\nDuring this year's presidential campaign, Trump often spoke of the need to keep the U.S. dollar as world's reserve currency.\n\n\"I would not allow countries to go off the dollar because when we lose that standard, that will be like losing a revolutionary war,\" Trump told CNBC in March, adding that he \"hates\" when countries abandon the U.S. currency."
    },
    {
        "title": "Donald Trump Sends New Warning to China-Led Bloc Over US Dollar",
        "description": "Trump issued a stern warning to China over its BRICS bloc ambitions in a Truth Social post on Saturday afternoon.",
        "content": "President-elect Donald Trump in a Truth Social post on Saturday issued a stern warning to China and its trade allies about their plans to try and displace the United States dollar as the global currency.\n\"The idea that the BRICS Countries are trying ... [4960 chars]",
        "url": "https://www.newsweek.com/donald-trump-sends-warning-china-bloc-dollar-1993716",
        "image": "https://d.newsweek.com/en/full/2533371/donald-trump-xi-jinping-summit.jpg",
        "publishedAt": "2024-11-30T21:35:48Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /donald-trump-sends-warning-china-bloc-dollar-1993716 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/donald-trump-sends-warning-china-bloc-dollar-1993716"
    },
    {
        "title": "BBC Journalist's Question Prompts Intense Response From Vladimir Putin",
        "description": "A BBC journalist has provoked an intense response from Russian President Vladimir Putin at the BRICS summit for emerging economies.",
        "content": "A BBC journalist has provoked an intense response from Russian President Vladimir Putin at the BRICS summit for emerging economies.\nBBC Russia Editor Steve Rosenberg was granted the opportunity to quiz Putin during a press conference, and chose to as... [1560 chars]",
        "url": "https://deadline.com/2024/10/bbc-journalist-question-vladimir-putin-response-1236158338/",
        "image": "https://deadline.com/wp-content/uploads/2024/10/Vladmir-Putin.jpg?w=1024",
        "publishedAt": "2024-10-25T14:28:37Z",
        "source": {
            "name": "Deadline",
            "url": "https://deadline.com"
        },
        "full_content": "A BBC journalist has provoked an intense response from Russian President Vladimir Putin at the BRICS summit for emerging economies.\n\nBBC Russia Editor Steve Rosenberg was granted the opportunity to quiz Putin during a press conference, and chose to ask about how Russia’s actions over the past two years matched a declaration made by the BRICS countries for global security, stability and justice.\n\nIt was the first time a journalist from the British organization has been allowed to directly question the Russian leader since Putin’s troops invaded Ukraine in February 2022.\n\nPutin flipped the question on its head and accused Western countries of aggressively expanding the North American-European alliance NATO east towards Russia.\n\nWatch on Deadline\n\n“In terms of security, is it fair that for years our constant appeal to partners not to expand Nato to the east have been ignored,” he asked. “Is it fair to lie to our face, promising that there will be no such expansion and violating their obligations and their promises to do that? Is it fair to get into our underbelly, like into Ukraine, and start building, not just preparing but building, military bases?\n\nHe accused NATO of “disregarding international law” and “financing a coup” in Ukraine, while “pushing the situation for it to develop into a hot phase.”\n\nHe finished his criticism, which lasted several minutes, by saying: “There is no justice here. We want to change this situation, and we’ll achieve it,” and then addressed a second part of Rosenberg’s question, which regarded MI5, the British intelligence service, claiming Russia was deliberately attempting to create “sustained mayhem on British and European streets.”\n\n“Well, this is utter rubbish,” said the Russian leader.\n\nYou can watch part of the exchange here via the BBC’s YouTube channel."
    },
    {
        "title": "Putin hosts growing BRICS alliance in Russia, touting it as an alternative to the West's \"perverse methods\"",
        "description": "Hosting a summit of the BRICS alliance, Putin touted the growing club as an alternative to the West's \"relentless foreign influence ostensibly promoting democracy.\"",
        "content": "What to know about the BRICS Summit being hosted by Putin\nWhat to know about the BRICS Summit in Russia\nWhat to know about the BRICS Summit in Russia\nKazan, Russia — Russian President Vladimir Putin on Thursday presided at the closing session of a su... [5716 chars]",
        "url": "https://www.cbsnews.com/news/russia-putin-brics-summit-china-ukraine-war-us-nato-sanctions-perverse-methods/",
        "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/24/494e1690-f78e-43ff-9e28-5fe56cf1df4f/thumbnail/1200x630/047032b5a425cde90166e7eea3e77ead/putin-xi-brics.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
        "publishedAt": "2024-10-24T15:02:16Z",
        "source": {
            "name": "CBS News",
            "url": "https://www.cbsnews.com"
        },
        "full_content": "What to know about the BRICS Summit being hosted by Putin\n\nWhat to know about the BRICS Summit in Russia\n\nWhat to know about the BRICS Summit in Russia\n\nKazan, Russia — Russian President Vladimir Putin on Thursday presided at the closing session of a summit of the BRICS bloc of developing economies, praising its role as a counterbalance to what he called the West's \"perverse methods.\" The three-day summit in the city of Kazan covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, efforts to settle regional conflicts and expansion of the BRICS group of nations.\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa when it was founded in 2009 has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia. Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe summit was attended by leaders or representatives of 36 countries, highlighting the failure of U.S.-led efforts to isolate Russia over its war in Ukraine. The Kremlin touted the summit as \"the largest foreign policy event ever held\" by Russia.\n\nSpeaking at what was dubbed the \"BRICS Plus\" session, which included countries that are considering joining the bloc, Putin accused the West of trying to stem the growing power of the Global South with \"illegal unilateral sanctions, blatant protectionism, manipulation of currency and stock markets, and relentless foreign influence ostensibly promoting democracy, human rights, and the climate change agenda.\"\n\n\"Such perverse methods and approaches — to put it bluntly — lead to the emergence of new conflicts and the aggravation of old disagreements,\" Putin said. \"One example of this is Ukraine, which is being used to create critical threats to Russia's security, while ignoring our vital interests, our just concerns, and the infringement of the rights of Russian-speaking people.\"\n\nPutin ordered the full-scale invasion of neighboring Ukraine more than two years ago, and Russian forces now occupy an estimated 20% of the country. Tens of thousands of people have been killed in the war, which Putin has claimed at various stages was either a response to NATO's eastward expansion, or a defense of pro-Russian populations in eastern Ukraine.\n\nSupport from the U.S. and its NATO allies has helped Ukraine prevent Russia's complete takeover, but many in the region fear the November U.S. presidential election could bring a second term for former President Donald Trump, who's seen as more sympathetic to Putin and less likely to maintain current levels of support for Kyiv.\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT, which would enable Moscow to dodge Western sanctions and trade with its partners — some of which are also heavily sanctioned by the U.S. and its allies — more easily.\n\nIn a joint declaration Wednesday, participants voiced concern about \"the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions,\" and reiterated their commitment to enhancing financial cooperation within BRICS. They noted the benefits of \"faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.\"\n\nRussian President Vladimir Putin stands with Chinese President Xi Jinping as other participants in the outreach/BRICS Plus format meeting pose for a family photo during the BRICS summit in Kazan, Russia, Oct. 24, 2024. MAXIM SHIPENKOV/Pool via REUTERS\n\nChina's President Xi Jinping has emphasized the bloc's role in ensuring global security. Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\n\"We should promote the de-escalation of the situation as soon as possible and pave the way for a political settlement,\" Xi said Thursday.\n\nPutin and Xi had announced a \"no-limits\" partnership weeks before Russia sent troops into Ukraine in 2022. Moscow declared its intention at the time to forge a new \"democratic world order\" with China. Putin and Xi met again twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.\n\nRussia's cooperation with India also has flourished as New Delhi sees Moscow as a time-tested partner since the Cold War despite Russia's close ties with India's rival, China. While Western allies want New Delhi to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasizing a peaceful settlement.\n\nPutin, who held a series of bilateral meetings on the summit's sidelines, was set to meet Thursday with U.N. Secretary-General Antonio Guterres, who is making his first visit to Russia in more than two years. Guterres's trip to Kazan drew an angry reaction from Kyiv.\n\nAddressing the BRICS Plus session, Guterres urged an immediate end to the fighting in Gaza, Lebanon, Ukraine and Sudan. \"We need peace in Ukraine, a just peace in line with the U.N. Charter, international law and General Assembly resolutions,\" he said.\n\nRussia's Kremlin-controlled media touted the summit as a massive policy coup that left the West fearing the loss of its global clout. State TV shows and news bulletins underscored that BRICS countries account for about half the world's population comprising the \"global majority\" and challenging Western \"hegemony.\"\n\nTV hosts elaborately quoted Western media reports saying that the summit highlighted the failure to isolate Moscow. \"The West, the U.S., Washington, Brussels, London ended up isolating themselves,\" said Yevgeny Popov, host of a popular political talk show on state channel Rossiya 1."
    },
    {
        "title": "Putin presides over BRICS summit seeking to expand Russia's clout",
        "description": "Russian President Vladimir Putin has presided over a closing session of a summit of the BRICS bloc of developing economies, hailing its role as a counterbalance to the West.",
        "content": "Russian President Vladimir Putin, right, and other participants pose for a family photo prior to Outreach/BRICS Plus format session at BRICS Summit in Kazan, Russia, Thursday, Oct. 24, 2024. (Alexander Nemenov, Pool Photo via AP)\nKAZAN – Russian Pres... [3028 chars]",
        "url": "https://www.clickondetroit.com/news/world/2024/10/24/putin-presides-over-brics-summit-seeking-to-expand-russias-clout/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/7NQLH6OA2JGIHCKIJLDFZEARAA.jpg?_a=DATAdtfiZAA0",
        "publishedAt": "2024-10-24T09:20:26Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "KAZAN – Russian President Vladimir Putin closed a summit of the BRICS bloc of developing economies on Thursday, praising its role as a counterbalance to what he called the West's “perverse methods.\"\n\nThe three-day summit in the city of Kazan was attended by leaders or representatives of 36 countries, highlighting the failure of United States-led efforts to isolate Russia over its actions in Ukraine.\n\nRecommended Videos\n\nThe conflict came up repeatedly at the meeting, which saw the first visit to Russia from United Nations Secretary-General Antonio Guterres in more than two years and drew an angry reaction from Kyiv. Guterres called for “a just peace” in Ukraine, in line with the U.N. Charter, international law and General Assembly resolutions. He also urged an immediate end to the fighting in Gaza, Lebanon and Sudan.\n\nAt a news conference Thursday night, Putin was asked about former U.S. President Donald Trump's promise to end the fighting in Ukraine.\n\n“What Mr. Trump said recently, what I heard, (is) he spoke about the desire to do everything to end the conflict in Ukraine,\" Putin said. \"It seems to me that he said it sincerely. We certainly welcome statements of this kind, no matter who makes them.”\n\nPutin also was asked about whether any North Korean troops were in Russia, which he neither confirmed nor denied. The U.S. said Wednesday that 3,000 North Korean troops have been deployed to Russia and are training at several locations.\n\n“Images are a serious thing, if there are images, then they reflect something,\" he said when asked about satellite photos of troops.\n\nPutin noted that lawmakers in Moscow earlier in the day ratified a pact with North Korea on mutual military assistance as part of a “strategic partnership” with Pyongyang.\n\n“We have never doubted that the North Korean leadership takes our agreements seriously. What and how we will do within the framework of this article (of the agreement) is our business,” he said.\n\nThe summit covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, efforts to settle regional conflicts and expansion of the BRICS group of nations.\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa when it was founded in 2009 has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia. Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\nSpeaking at what was dubbed the “BRICS Plus” session, which included countries that are considering joining the bloc, Putin accused the West of trying to stem the growing power of the Global South with “illegal unilateral sanctions, blatant protectionism, manipulation of currency and stock markets, and relentless foreign influence ostensibly promoting democracy, human rights, and the climate change agenda.”\n\n“Such perverse methods and approaches — to put it bluntly — lead to the emergence of new conflicts and the aggravation of old disagreements,” Putin said. “One example of this is Ukraine, which is being used to create critical threats to Russia’s security, while ignoring our vital interests, our just concerns, and the infringement of the rights of Russian-speaking people.”\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.\n\nIn a joint declaration Wednesday, participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS. They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.”\n\nChina's President Xi Jinping has emphasized the bloc’s role in ensuring global security. Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\n“We should promote the de-escalation of the situation as soon as possible and pave the way for a political settlement,” Xi said.\n\nPutin and Xi had announced a “no-limits” partnership weeks before Russia sent troops into Ukraine in 2022. They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.\n\nRussia’s cooperation with India also has flourished as New Delhi sees Moscow as a time-tested partner since the Cold War despite Russia’s close ties with India’s rival, China. While Western allies want New Delhi to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasizing a peaceful settlement.\n\nAddressing the BRICS Plus session, Guterres urged an immediate end to the fighting in Gaza, Lebanon, Ukraine and Sudan. “We need peace in Ukraine, a just peace in line with the U.N. Charter, international law and General Assembly resolutions,” he said.\n\nRussia's Kremlin-controlled media touted the summit as a massive policy coup that left the West fearing the loss of its global clout. State TV shows and news bulletins underscored that BRICS countries account for about half the world's population comprising the “global majority” and challenging Western “hegemony.”\n\nTV hosts elaborately quoted Western media reports saying that the summit highlighted the failure to isolate Moscow. “The West, the U.S., Washington, Brussels, London ended up isolating themselves,” said Yevgeny Popov, host of a popular political talk show on state channel Rossiya 1."
    },
    {
        "title": "Financial cooperation and BRICS expansion are on the table as Putin hosts Global South leaders",
        "description": "Russia’s President Vladimir Putin is hosting China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the BRICS bloc of developing economies, part of Kremlin efforts to challenge Western global clout.",
        "content": "KAZAN, Russia (AP) — Russia’s President Vladimir Putin on Wednesday hosted China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the BRICS bloc of developing economies, part of the Kremlin’s efforts to challenge Western glo... [5353 chars]",
        "url": "https://apnews.com/article/russia-putin-brics-summit-china-india-d672be9b1ec2ffd0fba608e8a6aca790",
        "image": "https://dims.apnews.com/dims4/default/dc92173/2147483647/strip/true/crop/5325x2995+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F59%2F3f929f3d0438e77d924bf9568f60%2Ff9a3e19d5ecc45b5b103a53804aab269",
        "publishedAt": "2024-10-23T13:10:15Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "full_content": "KAZAN, Russia (AP) — Russia’s President Vladimir Putin on Wednesday hosted China’s Xi Jinping, India’s Narendra Modi and other world leaders at a summit of the BRICS bloc of developing economies, part of the Kremlin’s efforts to challenge Western global clout.\n\nPutin said the agenda covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, as well as settling regional conflicts and moving to expand the BRICS group of countries.\n\n“The BRICS strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Putin said at the start of Wednesday’s meeting. “This approach is especially relevant in the current conditions when truly radical changes are underway across the globe, including the shaping of a multipolar world.”\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia. Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe three-day summit in the city of Kazan that began Tuesday is attended by 36 countries, highlighting the failure of U.S.-led efforts to isolate Russia over its actions in Ukraine. The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\nThe Kremlin has cast BRICS as a counterbalance to the Western-dominated global order and redoubled its efforts to court the countries of the Global South after sending troops into Ukraine in February 2022.\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.\n\nSpeaking at the summit, Putin accused the U.S. of “weaponizing” the dollar and described it as a “big mistake.”\n\n“It’s not us who refuse to use the dollar,” he said. “But if they don’t let us work, what can we do? We are forced to search for alternatives.”\n\nHe also proposed creating a new BRICS investment platform, saying that it could “become a powerful tool for supporting our economies, and would also provide financial resources to countries of the Global South and East.”\n\nIn a joint declaration, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS. They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.”\n\nPutin and Xi had announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022. They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.\n\nOn Wednesday, Xi emphasized the bloc’s role in ensuring global security. “We must work together to build BRICS into a primary channel for strengthening solidarity and cooperation among Global South nations and a vanguard for advancing global governance reform,” he said.\n\nXi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\n“We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift deescalation of the situation,” Xi said of the Ukrainian conflict.\n\nRussia’s cooperation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China. Western allies want India to be more active in persuading Moscow to end the fighting in Ukraine, but Modi has avoided condemning Russia while emphasizing a peaceful settlement.\n\n“We support dialogue and diplomacy, not war,” Modi said during Wednesday’s BRICS meeting in remarks carried by the Indian foreign ministry. Modi’s visit to the summit marked his second trip to Russia in three months.\n\n“As a diverse and inclusive platform, BRICS can play a positive role in all areas,” Modi said.\n\nPutin on Wednesday met on the sidelines of the summit with Iranian President Masoud Pezeshkian, hailing “truly friendly” ties between Moscow and Tehran and noting that they should be further cemented by a “comprehensive strategic partnership treaty” to be signed during Pezehskian’s planned trip to Moscow. The date for that visit hasn’t been set yet, but Kremlin foreign affairs adviser Yuri Ushakov said it could happen soon.\n\nOn Thursday, Putin was set to meet Thursday with U.N. Secretary-General Antonio Guterres, who has repeatedly criticized Moscow’s actions in Ukraine and is making his first visit to Russia in more than two years. Guterres’s trip to Kazan has drawn an angry reaction from Kyiv.\n\n“This is a wrong choice that does not advance the cause of peace,” Ukraine’s Foreign Ministry said on X, adding that “it only damages the U.N.’s reputation.”\n\nFarhan Haq, deputy spokesman for Guterres, responded to the Ukrainian criticism by saying that the visit is “a standard practice in attending meetings of organizations with large numbers of important member states, such as the G7 and the G20.”\n\n“There’s a meeting with great importance for the work of the United Nations, with the BRICS countries representing about half the world’s population,” Haq said.\n\nIn the meeting with Putin, Guterres “will reaffirm his well-known positions on the war in Ukraine and the conditions for a just peace based on the UN Charter, international law, and the resolutions of the United Nations. He will continue to pursue his efforts to re-establish safe navigation in the Black Sea, which is critically important for global food and energy security, especially for the most vulnerable countries around the world,” Haq said"
    },
    {
        "title": "Putin touts 'multipolar world order' at flagship BRICS summit",
        "description": "Russian President Vladimir Putin on Wednesday touted the creation of a new \"multipolar world order\" at the BRICS summit, a gathering of world leaders he hopes will show that Western attempts to isolate Moscow over its Ukraine offensive have failed.The meeting in the city of Kazan is the largest dipl...",
        "content": "Russian President Vladimir Putin on Wednesday touted the creation of a new \"multipolar world order\" at the BRICS summit, a gathering of world leaders he hopes will show that Western attempts to isolate Moscow over its Ukraine offensive have failed.\nT... [4172 chars]",
        "url": "https://www.rawstory.com/putin-touts-multipolar-world-order-at-flagship-brics-summit/",
        "image": "https://www.rawstory.com/media-library/image.png?id=53849564&width=1200&height=600&coordinates=0%2C56%2C0%2C57",
        "publishedAt": "2024-10-23T11:20:38Z",
        "source": {
            "name": "Raw Story",
            "url": "https://www.rawstory.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.rawstory.com/putin-touts-multipolar-world-order-at-flagship-brics-summit/ on URL https://www.rawstory.com/putin-touts-multipolar-world-order-at-flagship-brics-summit/"
    },
    {
        "title": "Putin welcomes China's Xi Jinping to Russia for start of BRICS summit",
        "description": "President Vladimir Putin welcomed his Chinese counterpart, Xi Jinping, to Russia on Tuesday, as the Kremlin head prepares to host several leaders of developing nations at an intergovernmental summit this week.",
        "content": "Chinese leader Xi Jinping and President Vladimir Putin of Russia hold a joint press conference Tuesday October 22, 2024, in Kazan, Russia, at the start of the BRICS summit. Photo courtesy of Host Photo Agency/Kremlin/ Website\nOct. 22 (UPI) -- Preside... [3446 chars]",
        "url": "https://www.upi.com/Top_News/World-News/2024/10/23/Putin-hosts-Xi-Jinping-BRICS/4911729651804/",
        "image": "https://cdnph.upi.com/sv/ph/og/i/4911729651804/2024/1/17296551249450/v1.5/Putin-welcomes-Chinas-Xi-Jinping-to-Russia-for-start-of-BRICS-summit.jpg",
        "publishedAt": "2024-10-23T04:01:00Z",
        "source": {
            "name": "UPI News",
            "url": "https://www.upi.com"
        },
        "full_content": "Chinese leader Xi Jinping and President Vladimir Putin of Russia hold a joint press conference Tuesday October 22, 2024, in Kazan, Russia, at the start of the BRICS summit. Photo courtesy of Host Photo Agency/Kremlin/ Website\n\nOct. 22 (UPI) -- President Vladimir Putin welcomed his Chinese counterpart, Xi Jinping, to Russia on Tuesday, as the Kremlin head prepares to host several leaders of developing nations at an intergovernmental summit this week.\n\nThis year's summit of the intergovernmental organization BRICS -- named after the first initial of each of its founding nations Brazil, Russia, India, China and South Africa -- is being held in Russia's southwestern city of Kazan from Tuesday through Thursday under the motto \"Strengthening multilateralism for equitable global development and security.\"\n\nPutin failed to attend last year's summit held in South Africa over fears of arrest. The International Criminal Court has issued a warrant for the Russian leader over his war in Ukraine, which has greatly limited his ability to visit foreign nations. This week's summit provides an opportunity for Putin to be seen hosting his international counterparts, shaking hands and making deals as a powerful international leader despite the weight of sanctions and global isolation over his invasion and ongoing war in Ukraine.\n\nThe summit also marks the third time this year that Putin has met in-person with Xi, as their two countries have grown closer amid their increasing isolation from democratic nations.\n\nThe pair met on the sidelines of the summit on Tuesday, and Putin called Xi a \"dear friend\" during a joint press conference. He also described their countries' relations as an example of what others should strive to achieve.\n\n\"We can assert with complete confidence that these relations have become a paradigm of how inter-state relations should be constructed in the modern world,\" Putin said. \"Our multifaceted cooperation is characterized by equality, mutual benefit and an absolutely non-conformist nature.\"\n\nPutin boasted that their cooperation on global issues \"is one of the main stabilizing factors in the international arena\" and that they intend to further expand coordination \"to ensure global security and promote a fairer world order.\"\n\nXi added that China-Russia relations have \"withstood the test of a changing international situation.\" He also complimented himself and Putin for doing so.\n\n\"We have taken the right path of building relations between great powers on the principles of non-alignment, non-confrontation, and non-direction against third parties,\" he said.\n\n\"Mr. president, in this new era, you and I always pay greater attention to bilateral relations and monitor them personally.\"\n\nNeither the United States nor the democratic pressure being applied to the two authoritarian nations to adhere to international norms was mentioned by either Putin or Xi, but the Chinese leader acknowledged that they were facing an unprecedented \"tectonic transformation\" of the international situation.\n\n\"However, this cannot shake my conviction that the strategic choice of the two countries in favor of firm mutual support, the deep centuries-old friendship between our countries, and China and Russia's sense of duty as great powers are inviolable,\" he said.\n\nXi also celebrated BRICS as being \"one of the most important platforms to consolidate the broad developing world and emerging market countries.\"\n\nThe meeting is the third by the two leaders, but the first since July when they met on the sidelines of an Eurasian intergovernmental security summit. Their first meeting this year was in May when Xi hosted Putin to a state visit."
    },
    {
        "title": "Financial cooperation and BRICS expansion are on the table as Putin hosts Global South leaders",
        "description": "Russian President Vladimir Putin is hosting China’s Xi Jinping, India’s Narendra Modi, and other world leaders at a summit of the BRICS bloc of developing economies, part of Kremlin efforts to challenge Western global clout",
        "content": "“The BRICS strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Putin said at the start of Wednesday’s meeting. “This approach is especially relevant in the current conditi... [5837 chars]",
        "url": "https://www.bostonglobe.com/2024/10/23/wires/financial-cooperation-brics-expansion-are-table-putin-hosts-global-south-leaders/",
        "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/YPUBQ5URULIUKXHU3E5G7LA7DY.jpg?auth=f61bc996cf6030bee1be5737f2ece01dfaa1bb045dcd5ef9d0f29dd2cb450a6c&width=1440",
        "publishedAt": "2024-10-23T04:00:00Z",
        "source": {
            "name": "The Boston Globe",
            "url": "https://www.bostonglobe.com"
        },
        "full_content": "“The BRICS strategy in the global arena conforms with the strivings of the main part of the global community, the so-called global majority,” Putin said at the start of Wednesday’s meeting. “This approach is especially relevant in the current conditions when truly radical changes are underway across the globe, including the shaping of a multipolar world.”\n\nPutin said the agenda included deepening financial cooperation, including the development of alternatives to Western-dominated payment systems, as well as settling regional conflicts and moving to expand the BRICS group of countries.\n\nKAZAN, Russia — Russian President Vladimir Putin on Wednesday hosted China’s Xi Jinping, India’s Narendra Modi, and other world leaders at a summit of the BRICS bloc of developing economies, part of the Kremlin’s efforts to challenge Western global clout.\n\nThe alliance that initially included Brazil, Russia, India, China, and South Africa has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates, and Saudi Arabia. Turkey, Azerbaijan, and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe three-day summit in the city of Kazan that began Tuesday is attended by 36 countries, highlighting the failure of US-led efforts to isolate Russia over its actions in Ukraine. The Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\nAdvertisement\n\nThe Kremlin has cast BRICS as a counterbalance to the Western-dominated global order and redoubled its efforts to court the countries of the Global South after sending troops into Ukraine in February 2022.\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.\n\nAdvertisement\n\nSpeaking at the summit, Putin accused the US of “weaponizing” the dollar and described it as a “big mistake.”\n\n“It’s not us who refuse to use the dollar,” he said. “But if they don’t let us work, what can we do? We are forced to search for alternatives.”\n\nHe also proposed creating a new BRICS investment platform, saying that it could “become a powerful tool for supporting our economies, and would also provide financial resources to countries of the Global South and East.”\n\nIn a joint declaration, the summit participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS. They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.”\n\nPutin and Xi had announced a “no-limits” partnership weeks before Russia invaded Ukraine in 2022. They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.\n\nOn Wednesday, Xi emphasized the bloc’s role in ensuring global security. “We must work together to build BRICS into a primary channel for strengthening solidarity and cooperation among Global South nations and a vanguard for advancing global governance reform,” he said.\n\nXi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\n“We must uphold the three key principles: no expansion of the battlefields, no escalation of hostilities, and no fanning flames and strive for swift deescalation of the situation,” Xi said of the Ukrainian conflict.\n\nAdvertisement\n\nRussia’s cooperation with India has also flourished as New Delhi sees Moscow as a time-tested partner since Cold War times despite Russia’s close ties with India’s main rival, China. Western allies want India to be more active in persuading Moscow to end the fighting in Ukraine, but Modi has avoided condemning Russia while emphasizing a peaceful settlement.\n\n“We support dialogue and diplomacy, not war,” Modi said during Wednesday’s BRICS meeting in remarks carried by the Indian foreign ministry. Modi’s visit to the summit marked his second trip to Russia in three months.\n\n“As a diverse and inclusive platform, BRICS can play a positive role in all areas,” Modi said.\n\nPutin on Wednesday met on the sidelines of the summit with Iranian President Masoud Pezeshkian, hailing “truly friendly” ties between Moscow and Tehran and noting that they should be further cemented by a “comprehensive strategic partnership treaty” to be signed during Pezehskian’s planned trip to Moscow. The date for that visit hasn’t been set yet, but Kremlin foreign affairs adviser Yuri Ushakov said it could happen soon.\n\nOn Thursday, Putin was set to meet with UN Secretary-General Antonio Guterres, who has repeatedly criticized Moscow’s actions in Ukraine and is making his first visit to Russia in more than two years. Guterres’s trip to Kazan has drawn an angry reaction from Kyiv.\n\n“This is a wrong choice that does not advance the cause of peace,” Ukraine’s Foreign Ministry said on X, adding that “it only damages the U.N.’s reputation.”\n\nFarhan Haq, deputy spokesman for Guterres, responded to the Ukrainian criticism by saying that the visit is “a standard practice in attending meetings of organizations with large numbers of important member states, such as the G7 and the G20.”\n\nAdvertisement\n\n“There’s a meeting with great importance for the work of the United Nations, with the BRICS countries representing about half the world’s population,” Haq said.\n\nIn the meeting with Putin, Guterres “will reaffirm his well-known positions on the war in Ukraine and the conditions for a just peace based on the UN Charter, international law, and the resolutions of the United Nations. He will continue to pursue his efforts to re-establish safe navigation in the Black Sea, which is critically important for global food and energy security, especially for the most vulnerable countries around the world,” Haq said"
    },
    {
        "title": "BRICS Coalition Terrifies Joe Rogan as Shawn Ryan Makes Unexpected Claim on United States of America",
        "description": "UFC commentator and podcaster Joe Rogan gets stunned as former Navy Seal Shawn Ryan drops major claim about America.",
        "content": "What happens when two major podcasters meet for an episode together? You get a stunning show that truly leaves the fans on the edge of their seats. That’s what happened in the latest edition of The Joe Rogan Experience. Former Navy Seal and podcaster... [3215 chars]",
        "url": "https://www.essentiallysports.com/ufc-mma-news-brics-coalition-terrifies-joe-rogan-as-shawn-ryan-makes-unexpected-claim-on-united-states-of-america/",
        "image": "https://image-cdn.essentiallysports.com/wp-content/uploads/Your-paragraph-text-2-102.jpg",
        "publishedAt": "2024-09-30T08:38:57Z",
        "source": {
            "name": "Essentially Sports",
            "url": "https://www.essentiallysports.com"
        },
        "full_content": "What happens when two major podcasters meet for an episode together? You get a stunning show that truly leaves the fans on the edge of their seats. That’s what happened in the latest edition of The Joe Rogan Experience. Former Navy Seal and podcaster Shawn Ryan joined the UFC commentator as they shared their views on their country and its policies.\n\nThe host of The Shawn Ryan Show has garnered a reputation for uncovering the brutal truths hidden by the government. Ryan initiated a conversation on the same in this edition as well. During the episode, Ryan revealed that, according to him, America is no longer the good guy as the citizens believe. In fact, he even made a stunning revelation that stunned Joe Rogan. So what did he say?\n\nThe former navy seal made the massive claim that other nations are forming their own coalition to go against the countries that are a part of the North Atlantic Treaty Organization, or NATO. Why? Because they are tired of the ‘weaponization’ of the US dollar. As a result, BRICS, a coalition of the countries Brazil, Russia, India, China, and South Africa, was formed.\n\nADVERTISEMENT Article continues below this ad\n\n“Brazil, Russia, India, China, and South Africa—BRICS—have formed a coalition… and I think they have around 22 countries now. It’s kind of like a counter to NATO. All these countries are tired of the US, tired of the tariffs, and tired of the weaponization of the US dollar.” This was major news for Rogan, who was unaware of the coalition. A clearly stunned Rogan simply stated, “I didn’t even know about it until just now.”\n\nView this post on Instagram A post shared by Shawn Ryan (@shawnryan762) Expand Post\n\nADVERTISEMENT Article continues below this ad\n\nThe idea of BRICS is to find alternatives to the U.S. dollar for international trade. One of the proposed ideas is to use a basket of their own currencies or commodities instead of the USD. This will reduce their dependency on the dollar and the policies set by the U.S. government on it. It will also lead to much easier trade between the countries. Ryan also had more in the basket for the audience, though. He further emphasized why other countries are turning their backs on the USA.\n\nThe Navy Seal drops truth bombs\n\nBeing in the military, while exciting, can also expose you to some truly horrific events. As a result, it is not uncommon for veterans to get PTSD or question their own beliefs and their government. The host of The Shawn Ryan Show experienced a similar experience while he was in the military, as he revealed on JRE. According to him, he did not believe in a lot of tasks that the government made him perform. In fact, they even turned other countries against them.\n\nADVERTISEMENT Article continues below this ad\n\nWhile he did not dive deep into the details, Ryan admitted that he firmly disagreed with the men in power. “That’s what I want to do—I want to start going in and talking to all these foreign dignitaries and getting a different perspective on what we’re doing. I don’t think we’re the good guys anymore. I don’t agree with a lot of the stuff I was involved in, you know, as a SEAL or CIA contractor.”\n\nShawn Ryan also claimed that some policies did not make sense at the time. Moreover, the army shouldn’t have been deployed to some places where they ended up according to him. This has made him distrust his own government and led him to start his podcast. But what do you think? Do you believe his claims? Let us know in the comments."
    },
    {
        "title": "Turkey's bid for BRICS both strategic and symbolic step, analysts say",
        "description": "BRICS is seen by some as a symbolic counterweight to Western-led organizations like the EU, the G7 and even NATO.",
        "content": "Turkish Foreign Minister Hakan Fidan attends the BRICS+ session on a two-day BRICS foreign ministers summit held in Nizhny Novgorod, Russia on June 11, 2024. Sefa Karacan | Anadolu | Getty Images\nTurkey's request to join the BRICS alliance is a move ... [4347 chars]",
        "url": "https://www.cnbc.com/2024/09/10/turkeys-bid-for-brics-both-strategic-and-symbolic-step-analysts-say.html",
        "image": "https://image.cnbcfm.com/api/v1/image/107399289-1712761556416-gettyimages-1645160385-RUS_Putin_Meets_Erdogan_In_Russia_Amid_Black_Sea_Tensions.jpeg?v=1712761612&w=1920&h=1080",
        "publishedAt": "2024-09-10T05:14:38Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "full_content": "Turkish Foreign Minister Hakan Fidan attends the BRICS+ session on a two-day BRICS foreign ministers summit held in Nizhny Novgorod, Russia on June 11, 2024. Sefa Karacan | Anadolu | Getty Images\n\nTurkey's request to join the BRICS alliance is a move seen as both strategic and symbolic as the Eurasian country of 85 million makes increasing strides in its influence and leverage on the global stage. \"Our president has already expressed multiple times that we wish to become a member of BRICS,\" a spokesperson for Turkey's leading AK Party told journalists earlier in September. \"Our request in this matter is clear, and the process is proceeding within this framework.\" BRICS, which stands for Brazil, Russia, India, China and South Africa, is a group of emerging market countries that seek to deepen their economic ties. This year, it gained four new members: Iran, Egypt, Ethiopia, and the UAE. It's also seen as a counterweight to Western-led organizations like the EU, the G7 and even NATO, although it lacks formal structure, enforcement mechanisms, and uniform rules and standards.\n\nwatch now\n\nFor Turkey, a longtime Western ally and NATO member since 1952, the move to join BRICS is \"in line with its broader geopolitical journey: positioning itself as an independent actor in a multi-polar world and even becoming a pole of power in its own right,\" George Dyson, a senior analyst at Control Risks, told CNBC. \"This is not to say that Turkey is turning away from the West entirely,\" Dyson added, \"but Turkey wants to foster as many trading ties as possible and pursue opportunities unilaterally without being constrained by Western alignment. It is definitely symbolic in that Turkey is demonstrating exactly this — that it is not constrained by its good ties with the West.\"\n\nDiversifying alliances\n\nDespite decades of being aligned with Europe and the U.S., Turkey has faced consistent rejection from joining the EU, which has long been a sore spot for Ankara. Ambassador Matthew Bryza, a former White House and Senior State Department official currently based in Istanbul, said that Turkish President Recep Tayyip Erdogan and his government \"seem to be motivated mostly by two factors: A strategic tradition of securing national interests... and a desire to spook the West a bit, both out of emotional spite and as a negotiating tactic to extract concessions.\" CNBC has contacted the Turkish presidency's office for comment. Turkey has in the last few years expanded its role in global diplomacy, brokering prisoner swap deals and leading other negotiations between Ukraine and Russia, for instance, while also mending previously strained relations with regional powers like Saudi Arabia, the United Arab Emirates and most recently, Egypt.\n\nRussian President Vladimir Putin shakes hands with Turkish President Recep Tayyip Erdogan during their joint press conference on September 4, 2023, in Sochi, Russia. Getty Images News | Getty Images\n\nAnkara also refuses to partake in sanctions against Russia — a stance that irks its Western allies but helps it maintain an independent position as a so-called \"middle power,\" which it sees as beneficial to its relationships with China and the Global South. To that end, \"any new BRICS member is obviously eager to take advantage of stronger 'togetherness' of emerging economies in order to reduce dependency on developed economies, mainly the United States,\" said Arda Tunca, an independent economist and consultant based in Turkey.\n\nStanding up to the West?\n\nTunca noted, however, that Turkey's unique position in the world is a \"delicate discussion point\" as the country has \"serious political problems with the EU and the United States\" despite its western alliances. Turkey's governing party, which has run the country for 22 years, is \"ideologically closer to the East than the West,\" Tunca said. \"Turkey wanted to hop on the BRICS train before it was late. It is too early to mention that the BRICS can become an alternative to the West, but the intention is clearly to stand up against the West under the leadership of China.\" Importantly, being part of BRICS allows its members to trade in currencies other than dollars. This aims to reduce dependency on the U.S.-led system and usher in a more multi-polar world. The fact that it's led by China makes some in the West wary, who see this as a potential win for Beijing.\n\nTurkish President Recep Tayyip Erdogan (not seen) is welcomed by Chinese President Xi Jinping as part of the 11th G20 Leaders' Summit in Hangzhou, China, on September 3, 2016. Mehmet Ali Ozcan | Anadolu Agency | Getty Images"
    },
    {
        "title": "Turkey's Role in NATO Comes Under Scrutiny",
        "description": "Ankara has become the first alliance member to request to join the Russian and China-led BRICS bloc.",
        "content": "Turkey's request to join two international organizations headed by Russia and China has added to questions about its role in NATO with which it has clashed in recent years.\nAnkara asked this week to join the BRICS economic bloc named after Brazil, Ru... [7513 chars]",
        "url": "https://www.newsweek.com/turkey-nato-scrutiny-erdogan-1949120",
        "image": "https://d.newsweek.com/en/full/2464739/turkeys-president-recep-tayyip-erdogan.jpg",
        "publishedAt": "2024-09-05T11:02:28Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /turkey-nato-scrutiny-erdogan-1949120 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/turkey-nato-scrutiny-erdogan-1949120"
    },
    {
        "title": "Turkey seeks to join the BRICS bloc of emerging economies, a Kremlin official says",
        "description": "A top Kremlin official says Turkey has formally applied for a membership in the BRICS bloc of developing economies as Russia and China seek to counter the West's global influence.",
        "content": "FILE - Turkish President Recep Tayyip Erdogan speaks during a joint statement to the media in Baghdad, Iraq, April 22, 2024. (Ahmad Al-Rubaye /Pool Photo via AP, File)\nMOSCOW – NATO member Turkey has applied for membership in the BRICS bloc of develo... [2345 chars]",
        "url": "https://www.clickondetroit.com/business/2024/09/04/turkey-seeks-to-join-the-brics-bloc-of-emerging-economies-a-kremlin-official-says/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/V5WJLBEFYNASREBNZPCTOADR2I.jpg?_a=DATAfRfiZAA0",
        "publishedAt": "2024-09-04T13:39:37Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "FILE - Turkish President Recep Tayyip Erdogan speaks during a joint statement to the media in Baghdad, Iraq, April 22, 2024. (Ahmad Al-Rubaye /Pool Photo via AP, File)\n\nMOSCOW – NATO member Turkey has applied for membership in the BRICS bloc of developing economies, a senior Kremlin official said Wednesday, as Russia and China seek to counter the West's global influence.\n\nYuri Ushakov, President Vladimir Putin's foreign affairs aide, told reporters that Turkey has submitted an application “for full membership” in the bloc that Russia this year chairs, and it will be considered.\n\nRecommended Videos\n\nTurkish President Recep Tayyip Erdogan has stated several times that his country aspires to become a member of the BRICS alliance, according to Omer Celik, a spokesman for Erdogan's ruling party. But Celik stopped short this week of confirming that Turkey has applied formally.\n\nThe BRICS alliance was founded in 2006 by Brazil, Russia, India and China, with South Africa joining in 2010. It recently has undergone an expansion, and now includes Iran, Egypt, Ethiopia and the United Arab Emirates. Saudi Arabia has said it’s considering joining, and Azerbaijan and Malaysia have formally applied.\n\nBRICS has a stated aim to amplify the voice of major emerging economies to counterbalance the Western-led global order. Its founding members have called for a fairer world order and the reform of international institutions like the United Nations, the International Monetary Fund and the World Bank.\n\nErdogan, who has been in power for more than two decades, has sought to carve a more independent foreign policy for Turkey and to enhance its global influence. The country is also frustrated by the lack of progress in its membership talks with the European Union.\n\nLast week, Erdogan said Turkey should “simultaneously” develop relations with both the East and the West.\n\nTurkey, which straddles Europe and Asia, joined the NATO military alliance in 1952. It began talks to join the European Union in 2005 but the negotiations have stalled due to concerns over democratic regression under Erdogan’s administration, and ongoing disputes with Cyprus, an EU member, among other challenges.\n\nBRICS is expected to discuss taking in new members in a meeting in Russia next month.\n\nPutin earlier this year welcomed Turkey's interest in the bloc and promised that Moscow “will support this aspiration and desire to be together with the countries of this alliance, to be together, closer, to solve common problems.”\n\nOn Monday, Putin spokesman Dmitry Peskov also said Turkey expressed interest in joining BRICS."
    },
    {
        "title": "Turkey wants to join the BRICS bloc of developing economies, official confirms",
        "description": "A senior official has confirmed a report that Turkey wants to join the BRICS bloc of developing economies but fell short of confirming that the NATO country had formally applied for membership.",
        "content": "ANKARA – A senior official on Tuesday confirmed a report that Turkey wants to join the BRICS bloc of developing economies but stopped short of declaring that the NATO country had formally applied for membership.\nThe Bloomberg news agency reported Mon... [2440 chars]",
        "url": "https://www.clickondetroit.com/business/2024/09/03/turkey-wants-to-join-the-brics-bloc-of-developing-economies-official-confirms/",
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/WDRZSLHKTJCSXMRO5LWC3YSAGQ.jpg?_a=DATAfRfiZAA0",
        "publishedAt": "2024-09-03T15:40:11Z",
        "source": {
            "name": "WDIV ClickOnDetroit",
            "url": "https://www.clickondetroit.com"
        },
        "full_content": "ANKARA – A senior official on Tuesday confirmed a report that Turkey wants to join the BRICS bloc of developing economies but stopped short of declaring that the NATO country had formally applied for membership.\n\nThe Bloomberg news agency reported Monday that Turkey had officially applied to join BRICS several months ago. Asked about the report, Omer Celik, spokesman for Turkish President Recep Tayyip Erdogan’s ruling party, said Erdogan has stated “several times” that Turkey aspires to become a member.\n\nRecommended Videos\n\n“Our request on this issue is clear. This process is ongoing. But there is no concrete development regarding this,” Celik told reporters. \"Our president has clearly stated that Turkey wants to take part in all important platforms, including BRICS.”\n\nThe BRICS alliance was founded in 2006 by Brazil, Russia, India and China, with South Africa joining in 2010, but has recently undergone a major expansion, and now includes Iran, Egypt, Ethiopia and the United Arab Emirates. Saudi Arabia has said it's considering joining and Azerbaijan has formally applied.\n\nBRICS has a stated aim to amplify the voice of the Global South. Its founding members have called for a fairer world order and the reform of international institutions like the United Nations, the IMF and the World Bank.\n\nErdogan, who has been in power for more than two decades, has sought to carve a more independent foreign policy for Turkey and to enhance its global influence. The country is also frustrated by the lack of progress in its membership talks with the European Union.\n\nLast week, Erdogan said Turkey should “simultaneously” develop relations with both the East and the West.\n\n“We don’t have to choose between the European Union and the Shanghai Cooperation Organization,” Erdogan said in reference to the regional cooperation organization established by China and Russia. “On the contrary we have to develop our relations with both these and other organizations on a win-win basis.”\n\nBRICS is expected to discuss taking in new members in a meeting in Russia next month.\n\nTurkey, which straddles Europe and Asia, joined the NATO military alliance in 1952. It began talks to join the European Union in 2005 but the negotiations have stalled due to concerns over democratic regression under Erdogan’s administration, and ongoing disputes with Cyprus, an EU member, among other challenges.\n\nEarlier this year, Foreign Minister Hakan Fidan said Turkey was “exploring new opportunities for cooperation with several partners in different platforms, such as BRICS.”\n\nOn Monday, Dmitry Peskov, spokesman for Russian President Vladimir Putin, also said Turkey has expressed its interest in joining BRICS."
    },
    {
        "title": "Wall Street Breakfast: BRICS+",
        "description": "Read more about Turkey's bid to join BRICS, Volkswagen weighing plant closures, Kamala Harris on U.S. Steel, and Brazil's warning for Starlink.",
        "content": "BRICS+\nTurkey has put in an application to join the BRICS group of emerging market nations, according to Bloomberg, ahead of the bloc's next summit due to take place in Russia on Oct. 22-24. It follows the recent expansion that added four new members... [3806 chars]",
        "url": "https://seekingalpha.com/article/4718623-wall-street-breakfast-brics",
        "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153960723/image_2153960723.jpg?io=getty-c-w1536",
        "publishedAt": "2024-09-03T10:43:41Z",
        "source": {
            "name": "Seeking Alpha",
            "url": "https://seekingalpha.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://seekingalpha.com/article/4718623-wall-street-breakfast-brics on URL https://seekingalpha.com/article/4718623-wall-street-breakfast-brics"
    },
    {
        "title": "Beyond the West? Turkey said to be looking to join the BRICS",
        "description": "Turkey has put in an application to join the BRICS group of emerging market nations. Read more details here.",
        "content": "Turkey has put in an application to join the BRICS group of emerging market nations, according to Bloomberg, ahead of the bloc's next summit due to take place in Russia on Oct. 22-24. It follows the recent expansion that added four new members to the... [2007 chars]",
        "url": "https://seekingalpha.com/news/4146003-beyond-the-west-turkey-said-to-be-looking-to-join-the-brics",
        "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153960723/image_2153960723.jpg?io=getty-c-w750",
        "publishedAt": "2024-09-03T09:07:28Z",
        "source": {
            "name": "Seeking Alpha",
            "url": "https://seekingalpha.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://seekingalpha.com/news/4146003-beyond-the-west-turkey-said-to-be-looking-to-join-the-brics on URL https://seekingalpha.com/news/4146003-beyond-the-west-turkey-said-to-be-looking-to-join-the-brics"
    },
    {
        "title": "Turkey, NATO member, submits formal application to join BRICS",
        "description": "Turkey’s bid to join the bloc is welcome news to both Russia and China.",
        "content": "ANKARA — Turkey’s ruling Justice and Development Party confirmed Tuesday that Ankara formally applied to the China-led BRICS group.\n“Our president has already expressed multiple times that we wish to become a member of BRICS,” party spokesperson Omer... [2168 chars]",
        "url": "https://www.al-monitor.com/originals/2024/09/turkey-nato-member-submits-formal-application-join-brics",
        "image": "https://www.al-monitor.com/sites/default/files/styles/social_media_share/public/2024-09/GettyImages-1645160147.jpg?h=97f32819&itok=foN6z2Nu",
        "publishedAt": "2024-09-03T04:00:00Z",
        "source": {
            "name": "Al-Monitor",
            "url": "https://www.al-monitor.com"
        },
        "full_content": "ANKARA — Turkey’s ruling Justice and Development Party on Tuesday confirmed that Ankara has taken further steps to join the China-led BRICS group.\n\n“Our president has already expressed multiple times that we wish to become a member of BRICS,” party spokesperson Omer Celik told journalists during a press conference. “Our request in this matter is clear, and the process is proceeding within this framework.”\n\nThe remarks came in response to an earlier report by Bloomberg that NATO member Turkey formally applied to the bloc several months ago.\n\nCelik said that the application has yet to see any concrete outcome. “We will share with you if there is any assessment or decision by BRICS regarding the membership,” he said.\n\nDiscussions over Turkey’s potential membership in the bloc have ramped up following Turkish Foreign Minister Hakan Fidan’s visit to China in June. After China, Fidan also attended the BRICS+ summit in Russia in June.\n\nWhile neither Fidan nor the ministry has officially confirmed Turkey’s formal bid to join BRICS, Russian President Vladimir Putin said he “welcomed” Turkey's interest in the bloc during a June 11 meeting with the top Turkish diplomat on the sidelines of the summit.\n\nOutgoing US Ambassador to Ankara Jeff Flake at the time expressed his hope that Turkey would not join the group, but said that Turkey's potential membership would not derail its alignment with NATO and the West.\n\nTurkish President Recep Tayyip Erdogan had expressed his country’s desire to join BRICS for the first time in 2018 while he was attending the China-led bloc’s summit in South Africa, but the issue was put on a back burner.\n\nTurkey’s formal application comes amid Ankara’s growing frustration with the European Union and as it seeks to diversify its trade and examine options outside the European bloc. Ankara’s dismay has been building with the EU, its largest trade partner, over the pending resumption of the modernization of the Customs Union Treaty between the group and Ankara.\n\nThe bloc, which was founded by Brazil, Russia, India and China in 2006, added South Africa a year after and Egypt, Ethiopia, Iran and the United Arab Emirates in January, doubling its membership and including Middle Eastern countries for the first time.\n\nMore than 30 countries have applied to join the alliance, according to the Russian Foreign Minister Sergey Lavrov. Algeria, Bahrain, Kuwait and Tunisia are also reportedly interested.\n\nCorrection: Sept. 6, 2024. This article has been updated to clarify that Turkey had taken steps toward joining BRICS, but there is no firm confirmation of a formal application yet."
    },
    {
        "title": "Turkey Seeks to Join Putin-Xi's BRICS Union",
        "description": "Turkey has officially asked to become a member of the bloc of emerging economies, according to Bloomberg.",
        "content": "Turkey will be the first NATO member to request membership of the BRICS economic bloc spearheaded by the leaders of Russia and China, Vladimir Putin and Xi Jinping, it has been reported.\nBloomberg said Monday that Ankara had formally asked to join th... [4030 chars]",
        "url": "https://www.newsweek.com/turkey-brics-nato-erdogan-putin-xi-1947517",
        "image": "https://d.newsweek.com/en/full/2462395/turkeys-president-recep-tayyip-erdogan.jpg",
        "publishedAt": "2024-09-02T16:15:13Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /turkey-brics-nato-erdogan-putin-xi-1947517 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/turkey-brics-nato-erdogan-putin-xi-1947517"
    },
    {
        "title": "Palestinians Will Apply to Join Russia-China Group: Ambassador",
        "description": "Palestinian Ambassador to Russia Abdel Hafiz Nofal has indicated an application to join BRICS would be submitted some time after October.",
        "content": "Palestinian Ambassador to Russia Abdel Hafiz Nofal has said his state will apply to join the BRICS intergovernmental organization – a group which also includes Russia and China.\nRussian state news outlet TASS reported that the ambassador made the ann... [3376 chars]",
        "url": "https://www.newsweek.com/palestinian-ambassador-brics-application-1944916",
        "image": "https://d.newsweek.com/en/full/2458832/palestinian-ambassador-russia.jpg",
        "publishedAt": "2024-08-27T16:30:53Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /palestinian-ambassador-brics-application-1944916 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/palestinian-ambassador-brics-application-1944916"
    },
    {
        "title": "The Venezuelan Perspective",
        "description": "Ryan Grim speaks with Venezuelan Foreign Minister Yván Gil Pinto about the impacts of U.S. sanctions, the BRICS alliance, and the battle over Citgo.",
        "content": "At the end of July, Venezuelans head to the polls to elect a new president, with Nicolás Maduro seeking another six-year term. This week on Deconstructed, Ryan Grim speaks with Venezuelan Foreign Minister Yván Gil Pinto, who was in New York for a U.N... [510 chars]",
        "url": "https://theintercept.com/2024/06/21/deconstructed-venezuela-maduro-brics-sanctions-citgo/",
        "image": "https://theintercept.com/wp-content/uploads/2024/06/Decon_Venezuela.jpg?fit=2000%2C1000&w=1200&h=800",
        "publishedAt": "2024-06-21T10:00:00Z",
        "source": {
            "name": "The Intercept",
            "url": "https://theintercept.com"
        },
        "full_content": "At the end of July, Venezuelans head to the polls to elect a new president, with Nicolás Maduro seeking another six-year term. This week on Deconstructed, Ryan Grim speaks with Venezuelan Foreign Minister Yván Gil Pinto, who was in New York for a U.N. debate on unilateral sanctions. Fresh from visits to China and Russia, where he engaged with BRICS alliance leaders, Pinto discusses Venezuela’s bid to join this coalition aimed at countering Western economic dominance. They delve into the impacts of sanctions from the Trump and Biden administrations on Venezuela’s economy and migration crisis, and the battle over Citgo, a U.S.-based oil company acquired by the country in 1990. Grim also questions Venezuela’s human rights record.\n\nTranscript\n\nRyan Grim: Welcome to Deconstructed, I’m Ryan Grim.\n\nAt the end of July, Venezuelans will go to the polls to elect a new president, with Nicolás Maduro hoping for another six-year term. Venezuelan migration to the United States, meanwhile, has become a major issue in our own presidential campaign, as the Biden administration continues to slap sanctions on Venezuela and wreak havoc on its economy.\n\nToday, we’re joined by Venezuelan Foreign Minister Yván Gil Pinto, who was in New York for a debate at the United Nations on unilateral sanctions. He had just returned from a visit to China and Russia, where he met with leaders of what is known as the BRICS Alliance.\n\nBRICS, which is an intergovernmental coalition of more than 20 countries, stands for Brazil, Russia, India, China, South Africa. It’s an effort by Global South countries to build an economic power base strong enough to balance the West.\n\nWith the U.S. showing little interest in cooperating with Venezuela, we talked at length about Venezuela’s bid to join BRICS, and his recent trip to China. All of this is happening while the U.S. is using its court system to seize the U.S. subsidiary of Venezuela’s energy company, Citgo. It’s quite an incredible story.\n\nThe U.S. recognizes a Venezuelan government in exile, and is allowing that government — which isn’t really a government in any serious way — to basically give away a huge piece of Citgo. The irony is that the brazen move is shocking to the Venezuelan public, and even hawkish figures like Elliott Abrams — a Reagan and Trump official who previously tried to overthrow the Venezuelan government — said the timing of the attempted seizure is terrible, as it’s only helping Maduro in the polls.\n\nFor the upcoming election, Venezuela is so far not allowing Western monitors to come in, and has kicked employees of the U.N. Human Rights Office out of the country, accusing them of facilitating coups. At the same time, it has invited BRICS countries to observe the elections. The result of all this aggressive U.S. policy is more migration at the southern border, higher gas prices for Americans, and economic misery for the Venezuelans who stay behind.\n\nWe also discussed the nominal pretext for American sanctions, Venezuela’s human rights record which, you’ll notice, the minister was reluctant to discuss much in detail.\n\nHere’s our conversation, which was recorded inside the Venezuelan mission in New York.\n\nFirst of all, thank you so much for doing this interview. I very much appreciate it. Welcome to New York.\n\nYván Gil Pinto: Thank you.\n\nRG: So, I want to start with your recent trip, both to China and the meeting regarding BRICS. First of all, at BRICS, how was Venezuela received there? What was the goal of that trip?\n\nYGP [via Interpreter]: So, prior to arriving to the U.N., we had visits, also, in Russia, China and Vietnam. In Russia, we were able to participate in the ministerial meeting of the BRICS.\n\nBRICS, for Venezuela, is very important, because it’s an emerging bloc that is about building a new world. In a world where we see that imperialism, neocolonialism, fascism’s attempts to destabilize the world, we see BRICS as an alternative against that aggression.\n\nThat relationship, the new world is based on relationships of complementarity, of solidarity. Not in relationships of domination. So, we understand that BRICS is not a regional organization, or a bloc, as such, because of distance between the countries. But we see it as a unifying system that is based on common principles relating to commerce or to finance, and how relationships among countries should take.\n\nRG: Did you apply for membership?\n\nYGP [via Interpreter]: Yes, we applied for full membership to the BRICS. We have spoken to the 10 member countries. Because Venezuela has a role and a lot to contribute to that formation that is coming out of the BRICS. Not only because we have an important contribution in terms of resources — we have oil, minerals, gas — because that’s important, we are the first oil reserve in the world. I think it would be a very important contribution to the BRICS.\n\nAbout 40 percent of the world’s GDP is in BRICS, so having the largest oil reserve in the world is important for BRICS. But this alone wouldn’t make any sense if there was not a commitment of Venezuela to the principles of the BRICS. Venezuela’s contribution, then it would be more [in] the political area, that’s already an important contribution.\n\nVenezuela has been known for its contribution to international organizations such as Unazul, ALBA, CELAC. Venezuela is highly responsible, and a partner that is very reliable for BRICS. So, we will bring the resources that are very valuable, we have the commitment to the principles held by BRICS. We have experience in international organizations, and I think we could bring the in integration of different regional blocs, too, as a contribution to BRICS.\n\nRight now, only Brazil represents Latin America in BRICS. We hope that, soon, Venezuela can integrate. During this meeting in Russia, we met with the 10 member countries of BRICS, and we’ve talked about all these aspects in detail with them. And, at the level of ministers, I could say, we all share this vision in a very harmonic and coordinated way.\n\nSo, Venezuela feels as [if it’s] part of the BRICS, now.\n\nRG: Does Brazil support Venezuela’s entry into BRICS? And do you expect that BRICS will allow Venezuela to join? When will you know?\n\nYGP [via Interpreter]: President Lula has said it publicly. The Brazilian support is unanimous [for] Venezuela [to] enter BRICS. We understand that in the recent visit that President Lula [made] to Colombia, there was also an invitation extended to Colombia to become part of BRICS. Venezuela has expressed its desire to participate in BRICS since 2000. We are working on this alternative with strength.\n\nIt’s part of our government platform, our plan for the homeland. So, we have a lot of expectations on that.\n\nRG: And you visited China. Did you get any indication from China, whether China would support your bid to join BRICS?\n\nYGP [via Interpreter]: So, during our visit to China, not only were we able to discuss bilateral cooperation, which is very important, but we also received China’s support for Venezuela’s entry into BRICS. In September of 2023, president Maduro visited China and we signed an alliance, in what’s called an all-weather alliance with China; that is a comprehensive alliance in all aspects. And, in that alliance, Venezuela’s contribution to BRICS is also contemplated.\n\nSo, China’s support is very strong for Venezuela.\n\nRG: Boris Johnson visited Venezuela in February, he brought a message from the United Kingdom. What was his message to Venezuela? What was the Venezuelan response? And how does that play into this conversation?\n\nYGP [via Interpreter]: I don’t really know about the contents of conversations that he held in Venezuela; at least not us, as the foreign ministry. We can say that, as foreign ministry, we had no contact with any former government official of the U.K.\n\nIt was a non-official visit, so we have no information of the aspects that took place there.\n\nRG: When it comes to China and your visit there, was there anything you took away from the Chinese model that you think could be applied to Venezuela? China’s growth, obviously, has been explosive over the last couple of decades, whereas Venezuela’s has been the opposite.\n\nWhat elements of the Chinese model do you think are useful to Venezuela?\n\nYGP [via Interpreter]: With China, we have a relationship, it’s been important. This year will be the 50th anniversary of the China-Venezuela relations. So, we can say the first 25 years of our relationship with China, they were candid relations, but with not [many] advances.\n\nBut then, the second 25 years after President Chávez came in into office have been a very intense cooperation of financing projects in Venezuela, and a lot of strong relations. The Chinese model is an admirable model. It’s a model that we can say has lifted about 800 million people out of poverty, and it’s a model that we respect. [It] has adapted to its own ideas, its own particularities, and it’s directed by the Chinese Communist Party, which has a lot of strength, and it has a robust leadership.\n\nThe Venezuelan model is a model that we’ve also called “Venezuela’s socialism for the 21st century.” We’re building our own model, and we learned from different models. And, of course, from the Chinese model, we’ve also taken some ideas that are central. We are studying the model and the philosophy and the doctrine of the Chinese model but, in order to build our own model, with our own characteristics.\n\nIt’s a model that has precedent which has defined it. It’s a model that also is also based on different doctrines around the world: the Chinese doctrine, the socialist doctrine, the Bolivarian Doctrine, all adapted to our conditions as a Latin American country, under our constitution that was approved by the majority of the people. So, that is to say, Venezuela has a very well-defined model.\n\nWe have taken some items from the Chinese economic development model. For example, we’ve launched special economic interest zones, which China has a very deep experience in, and which are an example to the world. Those are ideas that we’re coordinating and learning from them.\n\nAnd other aspects, such as development of science, technology, agriculture. Those are aspects that we are starting, and trying to see how we can reach a level like theirs.\n\nRG: In the upcoming election, the Venezuelan economy has, the last three or four years, been growing at a pretty steady pace. But if you compare the standard of living to ten or fifteen years ago, Venezuelans are worse off today than they were then.\n\nWhy is the government confident at all that Maduro will be returned to another term, given the collapse we’ve seen over the last decade?\n\nYGP [via Interpreter]: So, we’re going to an electoral process on July 28 where we are sure that the popular mandate of President Maduro will be legitimized. Today, all major polls clearly show the advantage that President Maduro has, and show the tendency to his victory.\n\nRG: Well, not all polls.\n\nYGP [via Interpreter]: The serious ones, yes.\n\nThere’s an intent to build a public narrative that is different from reality. There’s no really serious poll that says something different. Reality is just one. There’s a wide condemnation in Venezuela to those people that asked for and requested sanctions against their own country. That doesn’t mean there’s not an opposition, there is an opposition to the government. That’s one thing. But that opposition is a majority, that’s completely false.\n\nThe majority continues to be on the side of the Bolivarian revolution. There’s no doubt about that. That we can consult at any level. And we’re sure that that majority is what’s going to be reflected on that election on July 28. And that is mainly due to the rejection to those people in the opposition that have asked for sanctions and measures against Venezuela. But it’s also a sign of support for the successful policies of President Maduro during the last years.\n\nSince the year 2014, we have been victims of unilateral coerce of measures, or illegal sanctions. And this implied serious economic affectation to the country. We lost 99 percent of our income. From one year to the other, we passed from having $56 billion as income to $700 million. What country can withstand this aggression?\n\nWe were able to withstand it because of the high revolutionary consciousness of the people. In the year 2013, Venezuela had the highest minimum wage in Latin America: around $400 per month, with an extraordinary level of standard of living created by the revolution. The sanctions made it possible that the salary, the minimum wage, would fall from $400 to a dollar a month.\n\nThis implied that we had to do huge transformations of and in the economy and the economic model, and how we had to shape the economy for the rest of the country. And, after a few very difficult years, we started on a process of recovery.\n\nToday, the minimum income of a worker is about $130 a month. So, we went from $400 to $1, and now we’re back up to $130. And this, we’re doing it with all sanctions still in place. Which means this is a success, even within sanctions. This resistance shows that we’re going through the right path, and people are starting to feel that.\n\nBeyond that, I think the Venezuelan population understands very well who their enemy is. This ultra-right opposition in Venezuela is the same ultra-right opposition that caused all these damages to the country. Not only when they were in power before the 1998 revolution, but then, during the revolutionary times, they are the ones who have been asking for sanctions and aggressions against their country, and the population knows this very well. We’re taking part in the struggle because there’s always this intent of manipulating the political atmosphere.\n\nToday, the use of social media is very important as part of the electoral campaign. They create doubts, fake news, manipulated news. And they make believe that there are polls that favor them electorally, because the opposition is playing a game where they’re trying to make people believe that they are the majority; this particular opposition, the ultra-right opposition I’m talking about, because there are different types of opposition in Venezuela. I’m talking about the opposition that is backed by Washington.\n\nAnd their intent is to denounce a fraud, whether it happens or not. Venezuela’s electoral system is very strong, very robust. It’s impossible to have fraud. But the opposition has never recognized any electoral results, and they’re probably not going to do so, either, in this election, and they’re preparing the road for this. And we’re also prepared to defend the victory of President Maduro, with invitations to international alternatives, different political parties, different personalities, so they can come to Venezuela and observe what’s going on.\n\nBut we are very confident of our victory, because of our successful policies implemented, a successful economic program, and the strength of our people.\n\nRG: So, Venezuela has joined South Africa’s case at the ICJ [International Court of Justice] against Israel for its attack on Gaza. But, at the same time, Venezuela’s recently kicked out the United Nations Human Rights Office. If you ask the United States, they say, we relieved some sanctions in 2023. And then, in April, we brought them back, because there were human rights abuses, and so on and so forth.\n\nSo, why kick out the United Nations Human Rights [Office]? There were some other crackdowns on dissidents, both within Venezuela and outside of Venezuela; [like] Rocío San Miguel, a very high-profile human rights attorney.\n\nDoes the United States have a case that there was backsliding on human rights? And why kick out the U.N. Human Rights agency?\n\nYGP [via Interpreter]: Unfortunately, Human Rights has been instrumentalized against the Bolivarian government, the Venezuelan government, in order to attack and revert the Bolivarian government. Venezuela has unbreakable commitment to human rights.\n\nOur generation was a victim of human rights violations. The Bolivarian revolution was actually born precisely after huge human rights violations. In the 1989 Caracazo Revolts, over 5,000 Venezuelans were assassinated or disappeared. All of our generation has either friends or relatives that were murdered or disappeared during those events. There’s no other case in Latin America of a relationship with human rights as Venezuela has. That means we have a very strong and high commitment to human rights.\n\nDespite them having been used against Venezuela, we have high cooperation with the U.N. High Commissioner’s office, because there has been an intent to create human rights violation cases where they don’t correspond. So, in order to counter that initiative, we talked to the High Commissioner’s office, and we set up an office of personnel of the High Commissioner’s office, in order to have activity in Caracas, so they could observe the process. They could go to the trials, to the courts, to visit the jails. And they had free access to all judicial and police institutions in Venezuela. They were there for five years.\n\nRG: With San Miguel, for instance, when she was arrested, her entire family was arrested as well. I think, when people in the United States hear that, they say, you arrest her, also her brothers, her relatives, her location is not disclosed for some time. It doesn’t feel like human rights are being respected, and it doesn’t feel like they’re being instrumentalized in that moment.\n\nTGP [via Interpreter]: I’ll say it again. The narrative that has been attempted to implement about Venezuela has been a false narrative. Our cooperation is absolute. We have [far fewer] problems in human rights than any country in the region. We know that, to advance human rights, we have to better train our judges, better train our police, to have a better system, so these things don’t occur.\n\nAll cases of abuse or that denounce these abuses are attended to in Venezuela. As in any other place around the world, except for the United States. Here, human rights cases are not attended to. We tend to them, and when we’ve condemned cases as well. And, precisely, the collaboration with the office was destined to help in these cases.\n\nThe problem is that the office was closed in Venezuela, due to the fact that they were doing political campaigning. We didn’t close cooperation with the office. We continue to work, continue to subscribe to the human rights agreements, and we have a constant daily interaction with the human rights offices. There are no countries that have offices of the high commissioner in their own territories. This was done in Venezuela precisely to show that human rights issues were being instrumentalized against Venezuela.\n\nBut if you have human rights workers participating or taking part in other interests, that’s something that we cannot allow, because that’s precisely going against the protection of human rights. And any case of abuse in Venezuela is attended to under the law, and is sanctioned. In all exams, Venezuela has proven that there is no policy of human rights violation. Any other version is politicized.\n\nWe have asked all observers of human rights to come to Venezuela at different times, but we are a country with dignity, we’re a sovereign country. The justice of Venezuela cannot be under tutelage. Venezuela is a signer of human rights treaties, it’s very well explained in our constitution. Venezuela respects human rights. And, like I said, any case of human rights abuses in Venezuela, they’re treated according to the law, as this should be.\n\nRG: Just one follow-up, real quickly. The case of San Miguel, does she have access to attorneys? What can we expect to hear from that?\n\nYGP [via Interpreter]: In the case of Rocío San Miguel, she has access to her lawyers. She has access to her family. They’ve tried to build a false narrative around this case. Rocío San Miguel is accused of terrorism actions, and she’ll have the opportunity to present her defense. That’s an issue for the justice [department].\n\nBut the public prosecutor’s office has strong evidence. The prosecutor’s office is accusing her of having been involved in an attempt against the life of the president. But some of the participants have themselves admitted this publicly and, in the investigations by the prosecution, they found materials at her home that she was informed about the assassination attempt. So, from there, there’s a legal process to judge the case and have her sentenced, as anywhere else around the world.\n\nI mean, I would like to know what would happen anywhere else around the world — or here in the United States — if there was a journalist that was somehow informed about an attempted assassination attempt against the president? I’m sure their human rights here, they wouldn’t exist, like the human rights of the people that are detained at Guantanamo. And, in the case of this lady, she has a right to her trial, and to her defense. I’m not a judge or a prosecutor, but I can see that the evidence that exists is very strong.\n\nRG: Let me ask you about the case regarding Citgo. From your perspective, what is the latest on Citgo? What is Venezuela going to try to do to hold on to its assets?\n\nYGP [via Interpreter]: The Citgo case is a robbery. The government of the United States aligned with a group of Venezuelans who claimed to be the government of Venezuela. They basically began a process to steal the company. And, since then, there’s been a whole series of legal actions, that it’s amazing that these actions have been validated.\n\nBecause they stem from a very illegal issue, that the government of Venezuela is not really the government of Venezuela. This doesn’t make any sense. So, anything that takes place after that is illegal. That government — the so-called government of Guaidó — they took advantage of actions and directives within Citgo, and now all of these actions are illegal. But also, they created the basis so that a trial against Citgo will take place.\n\nThey basically did everything so that they would justify the courts taking illegal actions against the company. We should see how irrational this is.\n\nRG: The decision to steal, to take, to seize Citgo’s United States subsidiary is coming very soon. I’m sure you’ve seen Elliott Abrams — who himself has been involved in many coups throughout his career in South and Central America — recently said that it was stupid of the Biden administration to go forward at this moment, because it would inflame the Venezuelan public, and could help you in the elections.\n\nA backlash against the opposition — Which I found interesting, because it implied that there would be some actual voting and some real democracy, that public opinion could shift and be expressed at the ballot box, which is not typically what the United States says about Venezuelan elections. But I also found it rather interesting that he said, don’t do this now, do this immediately after the election.\n\nAnd so, does Venezuela have anything that it can do in this situation? Or are you just watching from the sidelines?\n\nYGP [via Interpreter]: Well, first of all, those statements made by those main actors that stole Citgo is a confession on their part. What else does public opinion need to know for it to see that it’s a robbery, and that it’s a robbery destined to hurt the Venezuelan people?\n\nThe truth is, that opposition is extremely corrupt. And the truth is that that corrupt opposition was supported by Washington. They have been supported and they continue to be supported by Washington. That’s true, and we’ve seen it with this statement. Unfortunately, we have no access to the U.S. justice system, because we’re not allowed to.\n\nI mean, we’re not going to stop fighting for reestablishing the legality of what’s in Citgo, because there’s an administrative continuity in Venezuela.\n\nRG: And you have no access to the system, because you’re not recognized as the actual government of Venezuela.\n\nYGP [via Interpreter]: Exactly. For that same reason. We are being denied our right to defense. Because, again, everything around Citgo is built upon a false case, and that will be proven, sooner or later, in front of justice. Anything that happens to Citgo is illegal, and it’s important for all of those who today aspire to take the company away from us, that they must know that all this is illegal.\n\nEverything that is going on is illegal, and everything will have its consequences. It won’t die there.\n\nRG: What would you lose? A refinery in Texas? What else, what assets would be stolen if this goes through? And what would Venezuela retain?\n\nYGP [via Interpreter]: Well, right now, our struggle continues to be denouncing it in the first place. We have no other option. Beyond whatever our lawyers can do, the limited actions they can take within the U.S. system, we rely on international solidarity. And the first thing we have to do is to convince and prove around the world that the legitimate government of Venezuela is the government of President Maduro. And we also need to make the creditors understand that the best solution is to have a direct negotiation with the government of Venezuela.\n\nThe path of selling off Citgo’s assets is jumping into the unknown, for the creditors. And what we are trying to do now is to denounce, and to tell the truth, and to alert, that any other creditors that think that selling off Citgo assets will be a solution, that that is the worst path.\n\nRG: If United States sanctions were lifted and if relations were normalized, what effect would that have on the outward migration from Venezuela?\n\nA huge number of people who are being encountered by U.S. Border Patrol at the southern border are Venezuelan. You recently stopped taking flights, in response to the reimplementation of sanctions. How much of that outflow do you think would stop, in the event of normal relations?\n\nYGP [via Interpreter]: So, the origin of the migration outflow in Venezuela, which is something that we didn’t really know until the sanctions policies were implemented, is precisely that. It began with the sanctions.\n\nFrom 1999 to 2017, we didn’t know the phenomenon of migration; if anything, we knew about a phenomenon of migration towards Venezuela. But it was when sanctions were taken against our economy that there began an outward flow of migrants, because it was a comprehensive attack against our economy and against our nation. Not only did it hurt our economy, but there were special conditions created to attract that migration.\n\nMigration was promoted from Washington during the years of 2017, ’18 and ’19.\n\nRG: Under the Trump administration? How so?\n\nYGP [via Interpreter]: Yes, under the Trump administration.\n\nRG: How did they attract? How did they incentivize?\n\nYGP [via Interpreter]: They created a special condition for those people to come into the United States, special protections for those migrants, different from conditions that existed for other migrants, like Colombians. Venezuelan migrants were treated in a special way. That was created from here, and that created a pole of attraction while, at the same time hurting our economy that stimulates people to come here.\n\nThose who created those conditions, they must assume their responsibility. A responsibility of hurting our economy, and of creating a migrant attraction towards the United States. That continues under the Biden era as well. And, today, that mistaken policy by the United States is what has generated the migrant problem here. And, in the way that the economic situation of Venezuela is improving, then that migration attraction is also decreasing.\n\nToday, the migration flux is actually negative. Right now we have more migrants coming back to Venezuela than leaving Venezuela. So, for every two migrants leaving Venezuela, three are coming back. So, the influx is now towards Venezuela. If all sanctions were lifted today, we would have an influx of migrants moving back to Venezuela.\n\nBecause the majority of the Venezuelan population wants to live in Venezuela. They have conditions, they have a system that tends to them, they have social safety in Venezuela. They don’t have that here.\n\nSurely, there will be a part of immigration that will stay in the United States, because they already built their life in the United States. That generates another type of internal action, because the bipartisanship in the United States wants to benefit from the creation of an opinion group of Venezuelans inside the country, as happened with the Cubans. And there’s an interest in both parties to favor that type of migration, and to obtain a political profit from that migration.\n\nBut the treatment of the migration issue by both Democrats and Republicans is highly hypocritical. They stimulated it, they live off it, and they use it to attack each other. So, that’s why we have created a social program that is called Return to the Homeland that President Maduro has created, so that people would come back to Venezuela. And I think we’re the only country in the world that has created a program to go and get the migrants, and voluntarily bring them back to the country.\n\nAll those Venezuelans that want to voluntarily return to the country, we’re going to facilitate them to return.\n\nRG: What conversations are ongoing, if any, between Venezuelan officials and U.S. officials toward normalizing relations? Has there been any reaction to you traveling to the BRICS conference, to applying for membership? Does that bother the United States, have they been silent about that? And what’s the path forward here?\n\nYGP [via Interpreter]: So, negotiations with the United States are handled by the president of our National Assembly, Jorge Rodriguez. Conversations have always taken place, even during the worst moments. They’ve always been taking place. These are conversations, like you said, to normalize relations. Unfortunately, the United States has never complied with any of the agreements it has signed.\n\nBut, despite that, we continue to talk. The foreign ministry is not part of the conversations. We haven’t received any contributions with regards to policies, because there’s no need to.\n\nRG: Well, thank you for your time. I appreciate you joining me.\n\nYGP [via Interpreter]: Thank you.\n\nRG: Deconstructed is a production of The Intercept. This episode was produced by Laura Flynn. It was recorded and mixed by William Stanton. Legal review by David Bralow, Shawn Musgrave, and Elizabeth Sanchez. Our theme music was composed by Bart Warshaw. And I’m Ryan Grim, D.C. Bureau Chief of The Intercept.\n\nIf you’d like to support our work, go to theintercept.com/give. If you haven’t already, please subscribe to the show so you can hear it every week, and please go and leave us a rating or a review. It helps people find the show. Also, check out our other podcast, Intercepted.\n\nIf you want to give us additional feedback, email us at podcasts@theintercept.com. Put “Deconstructed” in the subject line. Otherwise, we might miss your message.\n\nThanks for listening, and we’ll see you soon."
    },
    {
        "title": "Barrick Gold: More Emerging Risks",
        "description": "The introduction of a BRICS currency backed by gold could negatively impact gold miners such as Barrick. Read more to see our analysis on GOLD stock.",
        "content": "TomasSereda\nPreamble\nMy first article describing the emerging risks being faced by Barrick Gold Corporation (NYSE:GOLD) was published by SA on the 17 March 2023. At the time, the spot price of gold was $1,941.21 an oz and the stock price of Barrick w... [8061 chars]",
        "url": "https://seekingalpha.com/article/4676611-barrick-gold-more-emerging-risks",
        "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/470592238/image_470592238.jpg?io=getty-c-w1536",
        "publishedAt": "2024-03-07T15:51:03Z",
        "source": {
            "name": "Seeking Alpha",
            "url": "https://seekingalpha.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://seekingalpha.com/article/4676611-barrick-gold-more-emerging-risks on URL https://seekingalpha.com/article/4676611-barrick-gold-more-emerging-risks"
    },
    {
        "title": "BRICS: South Africa says countries are clamoring to join the China and Russia-backed group",
        "description": "Nearly three dozen countries are seeking entry into the China and Russia-backed BRICS economic group, member state South Africa said Wednesday, weeks after the body expanded its membership for the first time in more than a decade.",
        "content": "Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter which explores what you need to know about the country’s rise and how it impacts the world.\nHong Kong CNN —\nNearly three dozen countries are seeking entry into the China and Russia-backed... [3499 chars]",
        "url": "https://edition.cnn.com/2024/02/01/china/brics-membership-applications-china-russia-intl-hnk/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/2019-11-14t000000z-2035972092-rc20bd9u6cfr-rtrmadp-3-brics-summit-leaders.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-02-01T05:00:00Z",
        "source": {
            "name": "Cable News Network",
            "url": "https://edition.cnn.com"
        },
        "full_content": "Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter which explores what you need to know about the country’s rise and how it impacts the world.\n\nHong Kong CNN —\n\nNearly three dozen countries are seeking entry into the China and Russia-backed BRICS economic group, member state South Africa said Wednesday, weeks after the body expanded its membership for the first time in more than a decade.\n\nThirty-four countries have submitted an expression of interest in joining the bloc of major emerging economies, South African Foreign Minister Naledi Pandor told reporters, without naming the nations.\n\nRussia was accepting those applications after assuming rotating chairmanship of the group this year – and will be the first member to oversee the body since it significantly expanded its global footprint at the start of the year, when Iran, Saudi Arabia, the United Arab Emirates (UAE), Ethiopia, and Egypt formally joined.\n\nThe growing membership is widely viewed as a win for China and Russia, which have sought to reshape an international system they see as unfairly dominated by the United States amid growing frictions with Washington and the West.\n\nBRICS, which since 2011 had been made up of Brazil, Russia, India, China and South Africa, roughly positions itself as the Global South’s answer to the Group of Seven (G7) major developed economies.\n\nChina has been a key driver of its expansion as leader Xi Jinping pushes an alternative world order, forging closer partnerships with key global players from Russia to the Middle East and strengthening international bodies where Beijing holds sway.\n\nThe expansion and continued interest from dozens more countries are also a boon for Russia, which has been shunned economically and diplomatically by the West following its invasion of Ukraine.\n\nMoscow’s position as chair will be a key opportunity for Russian President Vladimir Putin to push back against that isolation and portray himself as a key player on a broad diplomatic stage, as world leaders typically travel to the host nation for an annual summit.\n\nLast year, all member state leaders besides Putin gathered in person in Johannesburg. The Russian president, who has an International Criminal Court warrant out for his arrest linked to alleged war crimes in Ukraine, participated virtually.\n\nThis year’s event is expected to take place in October in the southwestern Russian city of Kazan.\n\nEarlier this year, Putin encouraged representatives “of all countries interested in cooperating with our organization” to take part in events and said Russia looked forward to “working productively with all countries in the BRICS orbit,” according to state-run news agency Tass.\n\nThe group took shape as a summit-level gathering between Brazil, Russia, India and China in 2009 and expanded to include South Africa two years later.\n\nSix new BRICS countries were invited during the 2023 summit last August. Among those invited only Argentina declined to join, following the election of a new far-right administration.\n\nThe expansion adds the muscle of major oil-producing Gulf economies to the body and comes as both Russia and China have bolstered their relationships with sanctions-hit Iran. Last year, Beijing played a part brokering the restoration of ties between longtime rivals Saudi Arabia and Iran.\n\nThe new cohort of countries join as BRICS pushes toward more diplomatic and financial coordination, including reform of the United Nations Security Council and a move away from a US dollar-dominated trade system.\n\nFinance ministers were working to develop the use of local currencies for payments between member states and international payment platforms to “redress what we regard as a rather unfair and costly payment system,” South Africa’s Pandor said Wednesday."
    },
    {
        "title": "The rich keep getting richer in China and Russia",
        "description": "The BRICS countries now represent a bigger share of global GDP than the G7",
        "content": "The bloc of non-G7 nations known as the BRICS now has a total investable wealth of $45 trillion, and its population of millionaires will skyrocket in the coming years. This alliance’s economic power has been bolstered by the addition of new oil-rich ... [1652 chars]",
        "url": "https://qz.com/china-russia-millionaires-private-wealth-brics-1851209299",
        "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/61a53d1da38160afa0d05821184ff09a.jpg",
        "publishedAt": "2024-01-30T20:48:00Z",
        "source": {
            "name": "Quartz India",
            "url": "https://qz.com"
        },
        "full_content": "The bloc of non-G7 nations known as the BRICS now has a total investable wealth of $45 trillion, and its population of millionaires will skyrocket in the coming years. This alliance’s economic power has been bolstered by the addition of new oil-rich members: Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates (UAE).\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\nThe group’s name derives from an acronym of its founding members, Brazil, Russia, India, China, and South Africa.\n\nAdvertisement\n\nCollectively, the BRICS now represent nearly 36% of global GDP when adjusted for purchasing power parity, versus the G7’s 30%. That’s according to a new report by Henley & Partners, a firm that specializes in helping clients gain residence and citizenship through investment.\n\nAdvertisement\n\nThese 10 countries also share a total of 1.69 million millionaires, some 4,000 centi-millionaires, and 549 billionaires, according to the report. By comparison, the US is the nation with the highest number of millionaires, at 22 million.\n\nAdvertisement\n\nHenley & Partners forecasts that the BRICS’ millionaire population could grow by 85% over the next decade.\n\nChina leads the way\n\nAmong those nations, China is home to the most millionaires, at 862,400, including 2,352 centi-millionaires and 305 billionaires. During the past 10 years, the country’s private wealth grew 92%. Henley & Partners estimates that China’s per capita wealth could swell by 85% in the next decade.\n\n\n\nAdvertisement\n\nIndia takes second place, with 326,400 millionaires. The UAE finishes third, with 116,500.\n\nBy contrast, Russia has seen private wealth decline 24% since 2013, but the report projects that its per capita wealth will make up that loss in the next decade. Supporting this forecast, the International Monetary Fund recently updated its outlook for Russian GDP growth in 2024 to 2.6%, from 1.1% in October, partly thanks to high military spending on its war with Ukraine."
    },
    {
        "title": "BRICS is becoming an increasingly attractive choice in the Global South",
        "description": "Based on recent events, the chances of the group transforming into a formal association short of an alliance are significantly higher than when the BRICS was conceived.",
        "content": "The turn of the year is a time of reflections, resolutions and transformations. These apply not just to individuals but to nations and their foreign affairs.\nThe expansion of BRICS — Brazil, Russia, India, China and South Africa’s economic coalition ... [5254 chars]",
        "url": "https://thehill.com/opinion/international/4413965-brics-is-becoming-an-increasingly-attractive-choice-in-the-global-south/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2024/01/brics_south_africa_08232023_AP_AP23247277820148.jpg?w=1280",
        "publishedAt": "2024-01-18T20:30:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 429 Client Error: Unknown Error for url: https://thehill.com/opinion/international/4413965-brics-is-becoming-an-increasingly-attractive-choice-in-the-global-south/ on URL https://thehill.com/opinion/international/4413965-brics-is-becoming-an-increasingly-attractive-choice-in-the-global-south/"
    },
    {
        "title": "Ignoring BRICS Expansion Threatens America's Economic Security | Opinion",
        "description": "On New Year's Day, BRICS added Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates to its ranks.",
        "content": "January 1, 2024, saw the significant expansion of a major threat to America's financial security. Curiously, the event passed largely without comment from the Biden administration. The trigger for this potential economic time bomb is the BRICS+, an a... [4517 chars]",
        "url": "https://www.newsweek.com/ignoring-brics-expansion-threatens-americas-economic-security-opinion-1859634",
        "image": "https://d.newsweek.com/en/full/2334736/vladimir-putin-addresses-brics-summit.jpg",
        "publishedAt": "2024-01-12T11:00:01Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with HTTPSConnectionPool(host='www.newsweek.com', port=443): Max retries exceeded with url: /ignoring-brics-expansion-threatens-americas-economic-security-opinion-1859634 (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate (_ssl.c:1010)'))) on URL https://www.newsweek.com/ignoring-brics-expansion-threatens-americas-economic-security-opinion-1859634"
    },
    {
        "title": "Saudi Arabia Stumbles Over BRICS",
        "description": "Why would the Kingdom join a bloc of nations hostile to the U.S.?",
        "content": "Journal Editorial Report: Best guesses of what's to come from Kim Strassel, Bill McGurn and Dan Henninger. Images: AP/AFP/Getty Images Composite: Mark Kelly\nSaudi Arabia and Israel have quietly been negotiating a peace deal that would be greased with... [402 chars]",
        "url": "https://www.wsj.com/articles/saudi-arabia-brics-crown-prince-mohammed-bin-salman-israel-china-russia-25b511d7",
        "image": "https://images.wsj.net/im-907575/social",
        "publishedAt": "2024-01-02T23:39:00Z",
        "source": {
            "name": "The Wall Street Journal",
            "url": "https://www.wsj.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.wsj.com/articles/saudi-arabia-brics-crown-prince-mohammed-bin-salman-israel-china-russia-25b511d7 on URL https://www.wsj.com/articles/saudi-arabia-brics-crown-prince-mohammed-bin-salman-israel-china-russia-25b511d7"
    },
    {
        "title": "BRICS-Led Effort Against Greenback Should Alarm the US",
        "description": "\"It is clear that traditional US allies, such as Egypt, Saudi Arabia, and the UAE, are already exploring ways to dedollarize.\"",
        "content": "US policymakers should be concerned about a BRICS-led dedollarization, Thomas Hill wrote for the Atlantic Council.\nNew members can provide BRICS with new trade affiliations to promote dedollarization.\n\"Collectively, the expanded BRICS network via the... [3313 chars]",
        "url": "https://markets.businessinsider.com/news/currencies/dedollarization-dollar-dominance-new-brics-china-yuan-currency-sanctions-debt-2023-12",
        "image": "https://i.insider.com/657b4e627a3c8094d5dd1d27?width=1200&format=jpeg",
        "publishedAt": "2023-12-17T05:00:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://markets.businessinsider.com"
        },
        "full_content": "Share Facebook Email X Copy link Save Saved Read in app\n\nUS policymakers should be concerned about a BRICS-led dedollarization, Thomas Hill wrote for the Atlantic Council.\n\nNew members can provide BRICS with new trade affiliations to promote dedollarization.\n\n\"Collectively, the expanded BRICS network via these trade organization connections now eclipses 90 countries.\"\n\nThe recent expansion of BRICS should be a key cause of concern for the US, as new members along with countries who want to join could amplify dedollarization, according to a former State Department official.\n\nWriting for the Atlantic Council, Thomas Hill noted that Egypt, among others, was added to the BRICS club while Algeria and Tunisia were turned down.\n\nAnd it foreshadows how North African countries may become some of the \"most aggressive advocates\" for de-dollarization, he warned.\n\n\"The BRICS-led dedollarization effort should alarm US policymakers, especially in light of the recent BRICS membership expansion,\" wrote Hill, who is currently the director for the North Africa Program at the US Institute of Peace. \"It is clear that traditional US allies, such as Egypt, Saudi Arabia, and the UAE, are already exploring ways to dedollarize, and that Beijing is helping that process move forward.\"\n\nThis year, the economic bloc — originally composed of Brazil, Russia, India, China, and South Africa — has touted plans to take on the greenback's dominance in the global financial system.\n\nWhile BRICS' attempts to replace the dollar's hegemony have had limited impact so far, the coalition also elected to admit six new states in August, creating an opportunity for greater global coordination, Hill explained.\n\nHe added that they will provide BRICS with access to fresh trade affiliations that can promote alternative currencies.\n\n\"By including Egypt, BRICS can influence Algerian and Tunisian de-dollarization through Egyptian leadership inside existing trade regimes. Through Egypt, the UAE, and Saudi Arabia, BRICS will have expanded access to the Greater Arab Free Trade Area (GAFTA) and the Common Market for Eastern and Southern Africa,\" Hill wrote. \"Collectively, the expanded BRICS network via these trade organization connections now eclipses 90 countries.\"\n\nSigns of change are showing. In October, Egypt issued yuan-denominated panda bonds to help pay its debt, while the Bank of Russia now includes the Egyptian pound among currencies used to set ruble exchange rates.\n\nElsewhere, a joint effort between China, Hong Kong, Thailand, and the UAE looks to develop a digital currency platform that will create a digital yuan for cross-border payments, Hill said.\n\nEven a partial weaning off the greenback will likely weaken incentives to stick to the SWIFT finance mechanism, an international banking network that has been used by the US to apply sanctions.\n\nGlobal coordination against the dollar would also impact US fiscal health, limiting the country's ability to run large federal deficits and keep debt costs grounded, Hill said.\n\n\"For US policymakers, the BRICS de-dollarization effort should cause concern,\" he said, adding that the federal government needs an interagency process with backing from lawmakers."
    },
    {
        "title": "Argentina's incoming foreign minister says country will not join BRICS bloc",
        "description": "Argentina's incoming Foreign Minister Diana Mondino says the country will not join the BRICS grouping of developing nations in a post on social media X on Thursday.",
        "content": "BUENOS AIRES, Nov 30 (Reuters) - Argentina's incoming Foreign Minister Diana Mondino says the country will not join the BRICS grouping of developing nations in a post on social media X on Thursday.\nArgentina was among six countries invited to become ... [269 chars]",
        "url": "https://www.reuters.com/world/americas/argentinas-incoming-foreign-minister-says-country-will-not-join-brics-bloc-2023-11-30/",
        "image": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.webp?d=165",
        "publishedAt": "2023-11-30T23:26:56Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/world/americas/argentinas-incoming-foreign-minister-says-country-will-not-join-brics-bloc-2023-11-30/ on URL https://www.reuters.com/world/americas/argentinas-incoming-foreign-minister-says-country-will-not-join-brics-bloc-2023-11-30/"
    },
    {
        "title": "BRICS countries discuss Gaza conflict but don't agree joint declaration",
        "description": "Leaders of the BRICS bloc of developing nations and other countries they have invited to join from next year discussed the Israeli-Palestinian conflict on Tuesday, but failed to agree a joint declaration.",
        "content": "JOHANNESBURG, Nov 21 (Reuters) - Leaders of the BRICS bloc of developing nations and other countries they have invited to join from next year discussed the Israeli-Palestinian conflict on Tuesday, but failed to agree a joint declaration.\nThe virtual ... [2163 chars]",
        "url": "https://www.reuters.com/world/brics-countries-discuss-gaza-conflict-dont-agree-joint-declaration-2023-11-21/",
        "image": "https://www.reuters.com/resizer/AohFMhy2GvhYEqyfxljp5LNmiwU=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/L5ZMG66HWFLI7INP2CQ2OFEZUU.jpg",
        "publishedAt": "2023-11-21T23:50:49Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/world/brics-countries-discuss-gaza-conflict-dont-agree-joint-declaration-2023-11-21/ on URL https://www.reuters.com/world/brics-countries-discuss-gaza-conflict-dont-agree-joint-declaration-2023-11-21/"
    },
    {
        "title": "Putin says BRICS could help reach political settlement in Gaza conflict",
        "description": "Russian President Vladimir Putin called on Tuesday for a political solution to the Israeli-Palestinian conflict and said regional states and members of the BRICS group of countries could be involved in efforts to reach such a settlement.",
        "content": "Russian President Vladimir Putin takes part in a press conference during the 15th BRICS Summit, via video link in Moscow, Russia, August 24, 2023. Sputnik/Mikhail Klimentyev/Kremlin via REUTERS/File Photo Acquire Licensing Rights\nMOSCOW, Nov 21 (Reut... [2255 chars]",
        "url": "https://www.reuters.com/world/putin-says-brics-could-help-reach-political-settlement-gaza-conflict-2023-11-21/",
        "image": "https://www.reuters.com/resizer/-OZs8GEhtZ8csm86-dTGw1kRXig=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WWPPTLMY7NPZVK4LLPOEWQJZLQ.jpg",
        "publishedAt": "2023-11-21T13:44:31Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/world/putin-says-brics-could-help-reach-political-settlement-gaza-conflict-2023-11-21/ on URL https://www.reuters.com/world/putin-says-brics-could-help-reach-political-settlement-gaza-conflict-2023-11-21/"
    },
    {
        "title": "China reaffirms support for new nations joining BRICS as Argentina signals rejection",
        "description": "China reaffirmed its support on Monday for new countries joining the BRICS grouping of developing nations, even as Argentina's likely next foreign minister was quoted as saying that her country would no longer do so.",
        "content": "[1/2] South African delegates sit behind a glass with BRICS logo as the BRICS summit is held in Johannesburg, South Africa August 23, 2023. REUTERS/Alet Pretorius/File Photo Acquire Licensing Rights\nBEIJING, Nov 20 (Reuters) - China reaffirmed its su... [1929 chars]",
        "url": "https://www.reuters.com/world/china-reaffirms-support-new-nations-joining-brics-argentina-signals-rejection-2023-11-20/",
        "image": "https://www.reuters.com/resizer/g1RIF83PMBzPS84j3cvAvFionNM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/KM7NSM67PFPGVIRZQ4E7YTBR4A.jpg",
        "publishedAt": "2023-11-20T18:37:16Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/world/china-reaffirms-support-new-nations-joining-brics-argentina-signals-rejection-2023-11-20/ on URL https://www.reuters.com/world/china-reaffirms-support-new-nations-joining-brics-argentina-signals-rejection-2023-11-20/"
    },
    {
        "title": "Russia and China big participants at Dubai Airshow",
        "description": "At this year's event, the UAE is balancing friendly relations with the United States as well as with China and Russia, including via the BRICS alliance.",
        "content": "November 16, 2023\nCompanies from China, Russia the United States are taking part in the Dubai Airshow, demonstrating the UAE’s geopolitical significance amid a rise in conflict in the region.\nThe week-long airshow began on Monday and concludes on Fri... [3888 chars]",
        "url": "https://www.al-monitor.com/originals/2023/11/russia-and-china-big-participants-dubai-airshow",
        "image": "https://www.al-monitor.com/sites/default/files/styles/social_media_share/public/2023-11/GettyImages-1781935243.jpg?h=130af06a&itok=E4hFmOW4",
        "publishedAt": "2023-11-16T15:58:45Z",
        "source": {
            "name": "Al-Monitor",
            "url": "https://www.al-monitor.com"
        },
        "full_content": "Live news & notifications\n\nFollow over 100 expert journalists based across the region and get notified in real time of breaking stories and exclusives. *Expanded coverage on Energy & Defense sectors."
    },
    {
        "title": "BRICS Could Swing 'Economic Wrecking Ball' at the Dollar",
        "description": "The US dollar could soon be in the same position as the British pound in the 1800s, a former White House economist warned.",
        "content": "BRICS countries could swing an \"economic wrecking ball\" at the dollar, a former White House economist says.\nThe bloc has growing power and influence in global trade as it adds new members.\nThe US dollar could soon be in the same position as the Briti... [3405 chars]",
        "url": "https://markets.businessinsider.com/news/currencies/dedollarization-brics-currency-wars-dollar-international-trade-central-bank-reserves-2023-11",
        "image": "https://i.insider.com/64a821938ed31300199e1192?width=1200&format=jpeg",
        "publishedAt": "2023-11-03T04:00:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://markets.businessinsider.com"
        },
        "full_content": "Share Facebook Email X Copy link Save Saved Read in app\n\nBRICS countries could swing an \"economic wrecking ball\" at the dollar, a former White House economist says.\n\nThe bloc has growing power and influence in global trade as it adds new members.\n\nThe US dollar could soon be in the same position as the British pound in the 1800s, he said.\n\nThe dollar could face a growing challenge from BRICS countries, thanks to the bloc's growing size and influence over global trade, according to former White House economist Joe Sullivan.\n\nIn a recent op-ed for Foreign Policy, Sullivan pointed to mounting fears that BRICS nations could create a currency to rival the US dollar in international trade. Such a currency could potentially topple the dollar from its perch atop global trade markets and as the dominant reserve currency.\n\nThough BRICS officials have said there is no such rival currency in the works, the bloc of emerging market countries— which recently extended invites to Argentina, Egypt,Ethiopia, Iran, Saudi Arabia, and United Arab Emirates—could pose a threat to the greenback based on its growing influence, Sullivan warned.\n\nThe addition of Egypt, Ethiopia, and Saudi Arabia could give BRICS influence over 12% of all global trade. That's because those three countries surround the Suez Canal, a key passage for goods to flow into international markets.\n\nSullivan noted the bloc also has major sway in commodities markets. Saudi Arabia, Iran, and the United Arab Emirates are among the world's top exporters of fossil fuels. Brazil, China, and Russia, meanwhile, are major exporters of precious metals.\n\nThe addition of Saudi Arabia in particular could give BRICS+ a major advantage. The Middle Eastern nation owns over $100 billion in US Treasury bonds, which has helped bring BRICS' total holdings in US Treasurys over $1 trillion, Sullivan said.\n\n\"The BRICS+ nations do not need to wait until a shared trade currency meets the technical conditions typical of global reserve currency before they swing their newly enlarged economic wrecking ball at the dollar,\" he added.\n\nSullivan pointed to China's yuan, which is edging out other global currencies in trade as Beijing's trading partners ramp up their use of the renminbi.\n\nEventually, those trends could help put the greenback in a similar position as the British pound, Sullivan warned, which slipped from international dominance in the 1800s.\n\n\"The BRICS+ states do not even necessarily need to have a shared trade currency to chip away at King Dollar's domain. If BRICS+ demanded that you pay each member in its own national currency in order to trade with any of them, the dollar's role in the world economy would go down. There would not be a clear replacement for the dollar as a global reserve. A variety of currencies would gain in importance,\" he said.\n\nOther economists argue though that the dollar's role as the world's top trading and reserve currency will likely continue for a long time. The greenback still beats rival currencies in international trade and central bank reserves by a wide margin, data from the Bank of International Settlements and International Monetary Fund show, with the yuan only making small gains recently in central banks' coffers.\n\nThis story was originally published in November 2023."
    },
    {
        "title": "What 6 New Potential BRICS Members Have Said",
        "description": "Brazil, Russia, India, China, and South Africa have invited Saudi Arabia, Argentina, Egypt, Ethiopia, Iran, and the UAE to join the grouping.",
        "content": "The BRICS bloc of emerging nations has invited six new countries to join the group.\nIran has been the most vocal about de-dollarizing. The positions of other potential members vary.\nIncluding major oil exporters Saudi Arabia, Iran, and the UAE intens... [5262 chars]",
        "url": "https://markets.businessinsider.com/news/currencies/dollarization-brics-saudi-arabia-argentina-egypt-ethiopia-iran-uae-2023-9",
        "image": "https://i.insider.com/650aa0f212dc4f001a16fcc0?width=1200&format=jpeg",
        "publishedAt": "2023-09-24T04:00:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://markets.businessinsider.com"
        },
        "full_content": "Share Facebook Email X Copy link Save Saved Read in app\n\nThe BRICS bloc of emerging nations has invited six new countries to join the group.\n\nIran has been the most vocal about de-dollarizing. The positions of other potential members vary.\n\nIncluding major oil exporters Saudi Arabia, Iran, and the UAE intensifies the de-dollarization debate.\n\nThe BRICS group of emerging nations may have wrapped up its annual summit with no common currency last month and members issuing contradictory commentary about the greenback — but it doesn't mean its drive to de-dollarize is over.\n\nThe bloc is anchored by Brazil, Russia, India, China, and South Africa. It has invited six countries to join the alliance, which hopes to upset the dollar's dominance and become an alternative to the dominant Western world order.\n\nBRICS's newly invited members are Iran, the United Arab Emirates, Egypt, Argentina, Saudi Arabia, and Ethiopia. Iran, which has been heavily sanctioned by the US, has been the most vocal about transacting in non-dollar currencies, while the others have taken various positions about alternatives to the greenback.\n\nThe inclusion of major energy exporters such as Saudi Arabia, Iran, and the UAE on the list of potential BRICS members is a big deal because energy commodities — which are typically denominated in US dollars — are heavily traded and a key component of the global economy.\n\nTherefore, any move by these energy exporters to trade in non-dollar currencies could gain momentum in the broader economy.\n\n\"Together with fellow oil and gas exporters Iran and the UAE, the admission of Saudi Arabia to the BRICS grouping will inevitably focus the debate on the use of non-dollar currencies in trade,\" wrote analysts at the Dutch bank ING in an August 24 note, referring to the ongoing debate over de-dollarization.\n\nHere's what the six new potential members have signaled about the move away from the dollar.\n\nHeavily sanctioned Iran has long been trying to de-dollarize\n\nArgentina has started using the Chinese yuan, but one prominent politician is still backing the dollar\n\nArgentina appears to be of two minds about de-dollarizing its economy.\n\nThe South American country has already started moving away from the US dollar for some transactions — mainly because the country's economy has run very short on the greenback.\n\nThe option it has turned to recently is the Chinese yuan.\n\nIn April, Sergio Massa, the Argentinian economy minister, said the country would start to pay for imports from China in the yuan instead of US dollars. Two months later, in June, Argentina's central bank said it was allowing commercial banks to open deposit accounts in the Chinese yuan.\n\nHowever, Argentinians have been hoarding the dollar for years to hedge against the volatile peso, so it's hard to envision the country completely de-dollarizing.\n\nJavier Milei, the front-runner in Argentina's presidential election, has proposed replacing the peso with the dollar amid a massive slide in the local currency against the greenback. The peso has halved against the dollar so far this year.\n\nSaudi Arabia is open to trading oil in non-dollar currencies\n\nThe most high-profile of the newly invited BRICS members is Saudi Arabia, an oil-exporting giant and the de facto leader of the Organization of the Petroleum Exporting Countries cartel.\n\nThe kingdom's potential entry into the BRICS bloc is a surprise since it's in a strategic partnership with the US and has an agreement to price oil exclusively in the greenback.\n\nBut the energy kingpin has signaled earlier this year it is open to trading in other currencies.\n\n\"There are no issues with discussing how we settle our trade arrangements, whether it is in the US dollar, whether it is the euro, whether it is the Saudi riyal,\" Mohammed Al-Jadaan, the kingdom's finance minister, told Bloomberg TV in January.\n\n\"I don't think we are waving away or ruling out any discussion that will help improve the trade around the world,\" Al-Jadaan told the news outlet.\n\nHowever, Saudi Arabia hasn't started pricing its prized oil exports in non-dollar currencies yet and hasn't accepted BRICS's invitation to join the bloc so far.\n\nEthiopia is dealing with a foreign-currency crunch\n\nA civil war broke out in Ethiopia in late 2020, further destabilizing the African country's economy, which was already reeling from COVID-19-wrecked supply chains and a drought.\n\nEthiopia's civil war ended in 2022, but like Argentina and Egypt, it continues to face economic uncertainties and is experiencing a foreign-currency shortage.\n\nEthiopia doesn't appear to have publicly said anything about moving away from US dollar-dominated trade. The country's bid for membership seemed to have stemmed from a desire for an alternative world order.\n\nThe Ethiopian prime minister, Abiy Ahmed, tweeted on August 24 that BRICS endorsement of the country's membership was a \"great moment\" for the country.\n\n\"Ethiopia stands ready to cooperate with all for an inclusive and prosperous global order,\" he tweeted."
    },
    {
        "title": "Never Mind the BRICS. What About the VIPS?",
        "description": "The U.S. economy and military are poised for a 21st century of conflict. But Washington can’t go it alone, writes Edward Price.",
        "content": "Text size\nAbout the author: Edward Price is principal at Ergo, a global intelligence, consulting, and forecasting firm. A former British trade official, he also teaches at New York University’s Center for Global Affairs.\nAs Pax Americana disintegrate... [4835 chars]",
        "url": "https://www.barrons.com/articles/brics-china-russia-india-us-foreign-policy-86185ff8",
        "image": "https://images.barrons.com/im-96603353/social",
        "publishedAt": "2023-09-22T20:32:00Z",
        "source": {
            "name": "Barron's",
            "url": "https://www.barrons.com"
        },
        "full_content": "[ERROR] Could not extract full text: Article `download()` failed with 403 Client Error: Forbidden for url: https://www.barrons.com/articles/brics-china-russia-india-us-foreign-policy-86185ff8 on URL https://www.barrons.com/articles/brics-china-russia-india-us-foreign-policy-86185ff8"
    },
    {
        "title": "Gold-Backed BRICS Currency 'Makes No Sense': Market Guru",
        "description": "David Woo, previously a top strategist at Bank of America, questioned what would be achieved by creating essentially \"just another gold derivative.\"",
        "content": "Creating a BRICS currency backed by gold makes no sense, says a former top Bank of America strategist.\nDavid Woo questioned what would be achieved by creating \"just another gold derivative.\"\nThe group of emerging economies are stepping up efforts to ... [2655 chars]",
        "url": "https://markets.businessinsider.com/news/currencies/dedollarization-gold-backed-brics-currency-makes-no-sense-david-woo-2023-9",
        "image": "https://i.insider.com/60ae4cdaa412370019d31fb3?width=1200&format=jpeg",
        "publishedAt": "2023-09-13T04:00:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://markets.businessinsider.com"
        },
        "full_content": "Share Facebook Email X Copy link Save Saved Read in app\n\nCreating a BRICS currency backed by gold makes no sense, says a former top Bank of America strategist.\n\nDavid Woo questioned what would be achieved by creating \"just another gold derivative.\"\n\nThe group of emerging economies are stepping up efforts to reduce their reliance on the US dollar.\n\nThe idea of a common currency for the BRICS nations that's backed by gold \"makes no sense whatsoever,\" said strategist David Woo.\n\nThe group of major emerging economies have called for ways to end the dollar's dominance as the world's premier reserve currency, and some think gold reserves could be used to back a new note.\n\nHowever, that approach would mean the new currency tracks the price of gold rather than the BRICS' individual currencies, according to the former head of global interest rates, foreign exchange, and emerging market fixed income strategy and economic research at Bank of America.\n\n\"In any event, we have to ask what exactly the BRICS would accomplish by creating what would be essentially just another gold derivative?\" Woo said in a video on his Youtube channel.\n\nHe pointed out that gold reserves were finite, and the more gold China used to prop up the new exchange, the less it would have to back its own currency – the renminbi.\n\n\"If you think having more gold backing a currency makes it stronger, then the more gold China allocates to the BRICS currency means there is less gold backing the RMB which, if we follow this logic, means a weaker RMB,\" he added.\n\n\"The bottom line: the BRICS can create a currency backed by gold, but its purpose would be purely symbolic.\"\n\nIn recent months, China and several other countries have stepped up efforts to reduce their reliance on the greenback in international trade and investments – especially with the US leveraging the dollar's global supremacy to impose economic and financial sanctions on countries including Russia and Iran.\n\nThe BRICS group – Brazil, Russia, India, China, and South Africa — has been accelerating efforts to dedollarize, and Brazilian President Luiz Inácio Lula da Silva has called for a common trading note.\n\nEven the idea of a BRICS currency was labelled \"just ridiculous\" by Jim O'Neill, the economist who first coined the BRICS acronym, last month.\n\nThe broader dedollarization movement is struggling to gain momentum. SWIFT payments involving the US dollar rose to a record 46% in July, Bloomberg reported."
    }
]